{" through which additional context can be provided.":"可以通过其中提供其他上下文。","A collection containing ":"包含的集合"," or a standard set of valid values. The default implementation always returns ":"或一组标准的有效值。 默认实现始终返回","A formatter context. Use this object to extract additional information about the environment from which this converter is being invoked. Always check whether this value is ":"格式化上下文。 使用此对象提取有关调用此转换器的环境的其他信息。 始终检查此值是否为",". Also, properties on the context object may return ":"。 另外，上下文对象上的属性可能会返回","A formatter context. This object can be used to get additional information about the environment this converter is being called from. This may be ":"格式化上下文。 该对象可用于获取有关此转换器的其他信息的其他信息。 这可能是",", so you should always check. Also, properties on the context object may also return ":"，所以您应该始终检查。 另外，上下文对象上的属性也可以返回"," must be called to find a common set of values the object supports; otherwise, ":"必须调用以找到对象支持的共同值； 否则，"," object that provides a format context.":"提供格式上下文的对象。","The type you want to convert from.":"您要转换的类型。"," object that represents the type you want to convert to.":"代表您要转换为的类型的对象。","An object that contains culture specific information, such as the language, calendar, and cultural conventions associated with a specific culture. It is based on the RFC 1766 standard.":"包含文化特定信息的对象，例如与特定文化相关的语言，日历和文化惯例。 它基于RFC 1766标准。","A dictionary of new property values. The dictionary contains a series of name-value pairs, one for each property returned from ":"新属性值的字典。 字典包含一系列名称对，每个属性都从","A type descriptor through which additional context can be provided.":"可以提供其他上下文的类型描述符。","The newly created object, or ":"新创建的对象或","This method returns ":"此方法返回","The set of properties that are exposed for this data type. If no properties are exposed, this method might return ":"该数据类型暴露的属性集。 如果没有暴露属性，此方法可能会返回","The value of the object to get the properties for.":"对象获得属性的值。"," if the object could not be created. The default implementation returns ":"如果无法创建对象。 默认实现返回"," object that provides a format context. This can be ":"提供格式上下文的对象。 这可以",", so you should always check. Also, properties on the context object can also return ":"，所以您应该始终检查。 另外，上下文对象上的属性也可以返回",". The default implementation always returns ":"。 默认实现始终返回"," objects that describe the properties.":"描述属性的对象。"," that contains culture specific information, such as the language, calendar, and cultural conventions associated with a specific culture. It is based on the RFC 1766 standard.":"其中包含文化特定信息，例如与特定文化相关的语言，日历和文化惯例。 它基于RFC 1766标准。"," method should be called when a change is made to one or more properties of this object; otherwise, ":"当对该对象的一个或多个属性进行更改时，应调用方法； 否则，"," that can be used to get additional information about the environment this converter is being called from. This may be ":"可以用来获取有关该转换器的其他信息的其他信息。 这可能是"," if this object can perform the conversion.":"如果此对象可以执行转换。"," should be called when a change is made to one or more properties of this object; otherwise, ":"当对该对象的一个或多个属性进行更改时，应调用； 否则，"," that can be used to get additional information about the environment this converter is being called from. This can be ":"可以用来获取有关该转换器的其他信息的其他信息。 这可以","A dictionary of new property values. The dictionary contains a series of name-value pairs, one for each property returned from the ":"新属性值的字典。 字典包含一系列名称对，每个属性都从",", so always check. Also, properties on the context object can return ":"，所以请务必检查。 另外，上下文对象上的属性可以返回","A dictionary of new property values. The dictionary contains a series of name-value pairs, one for each property returned from a call to the ":"新属性值的字典。 字典包含一系列名称对，每个属性都从呼叫返回到该属性","The set of properties that should be exposed for this data type. If no properties should be exposed, this may return ":"该数据类型应公开的一组属性。 如果不应该暴露财产，则可以返回"," object should be called when a change is made to one or more properties of this object.":"当对该对象的一个或多个属性进行更改时，应调用对象。"," the represents the type you wish to convert from.":"表示您希望转换的类型。"," if this converter can perform the conversion otherwise, ":"如果此转换器可以否则可以执行转换，"," containing property names and values.":"包含属性名称和值。"," method should be called to find the properties of this object.":"应调用方法以查找此对象的属性。"," object that contains culture specific information, such as the language, calendar, and cultural conventions associated with a specific culture. It is based on the RFC 1766 standard.":"包含文化特定信息的对象，例如与特定文化相关的语言，日历和文化惯例。 它基于RFC 1766标准。"," if the object cannot be created.":"如果无法创建对象。"," to indicate the conversion can be performed; otherwise, ":"表示可以执行转换； 否则，"," representing the new ":"代表新的"," through which additional context can be supplied.":"通过其中可以提供其他上下文。",". If null is passed, the current culture is assumed.":"。 如果通过无效，则假定当前的文化。"," to return properties for.":"返回属性。"," that provides a format context. This may be ":"这提供了格式上下文。 这可能是"," containing the properties.":"包含属性。"," to convert. This should be a ":"转换。 这应该是","The time, in milliseconds, between events. The value must be greater than zero and less than or equal to ":"事件之间的时间为毫秒。 该值必须大于零，小于或等于或等于"," event only once, after the first time the interval elapses. The default is ":"事件仅在第一次间隔之后一次。 默认值为",". The default is 100 milliseconds.":"。 默认值为100毫秒。"," if this converter can perform the conversion; otherwise ":"如果此转换器可以执行转换； 否则"," should raise the ":"应该提高"," interface representing the site that binds the ":"表示绑定的站点的接口","The time the ":"时间"," object. If ":"目的。 如果"," event; otherwise, ":"事件; 否则，"," object to its container.":"对象到其容器。"," event each time the interval elapses; ":"每次间隔播放时事件；"," event was raised.":"举起了活动。","The description to use.":"使用的描述。"," object that contains the event data.":"包含事件数据的对象。"," representing the object used to marshal the event-handler calls that are issued when an interval has elapsed. The default is ":"代表用于围绕间隔经过时发出的事件处理程序调用的对象。 默认值为"," if it should raise the ":"如果应该提高","The time, in milliseconds, between ":"时间，以毫秒为里"," type can be assigned from ":"可以从","The description for the event, extender, or property.":"事件，扩展器或属性的描述。","A service object of type ":"类型的服务对象"," events. The value must be greater than zero, and less than or equal to ":"事件。 该值必须大于零，小于或等于"," to cancel the event; otherwise, ":"取消活动； 否则，"," that represents the type that you want to convert to.":"这代表了您要转换为的类型。",".  \n  \n -or-  \n  \n ":"。 \n  \n  -或者-"," that represents the type that you want to convert from.":"这表示您要转换的类型。","The duration of the beep measured in milliseconds.":"哔哔声的持续时间以毫秒为单位。"," if there is no service object of type ":"如果没有类型的服务对象"," if the event should be canceled; otherwise, ":"如果应该取消活动； 否则，"," from which a ":"从中"," type or a ":"类型或A。","The column and row position of the cursor.":"光标的列和行位置。","The frequency of the beep, ranging from 37 to 32767 hertz.":"哔哔声的频率从37至32767赫兹不等。"," if the object's content has changed since the last call to ":"如果对象的内容自上次呼叫以来已更改","The number of columns in the source area.":"源区域中的列数。","The leftmost column of the source area.":"源区域的最左列。"," can be created; otherwise, ":"可以创建； 否则，","The character used to fill the source area.":"用于填充源区域的角色。","This parameter has no effect, but its value must be greater than or equal to zero.":"该参数没有效果，但其值必须大于或等于零。","The number of rows in the source area.":"源区域中的行数。","An object that specifies the type of service object to get.":"指定要获取的服务对象类型的对象。","The topmost row of the source area.":"源区域的最高行。","The foreground color used to fill the source area.":"前景颜色用于填充源区域。","The standard input stream.":"标准输入流。","An object that describes the ":"描述的对象","The leftmost column of the destination area.":"目标区域的最左列。","Determines whether to display the pressed key in the console window. ":"确定是否在控制台窗口中显示按压键。","The background color used to fill the source area.":"用于填充源区域的背景颜色。","The standard output stream.":"标准输出流。"," constant and Unicode character, if any, that correspond to the pressed console key. The ":"常数和Unicode字符（如果有）对应于按压控制台键。 这","The standard error stream.":"标准错误流。","The topmost row of the destination area.":"目的地区域的最高排。"," to not display the pressed key; otherwise, ":"不显示按压键； 否则，"," object also describes, in a bitwise combination of ":"对象还描述了以上的组合","The next character from the input stream, or negative one (-1) if there are currently no more characters to be read.":"输入流的下一个字符，或负一个（-1），如果当前没有更多字符要读取。","The width of the buffer area measured in columns.":"缓冲区区域的宽度以列测量。","The row position of the upper left corner of the console window.":"控制台窗口左上角的行位置。","The next line of characters from the input stream, or ":"输入流中的下一行字符，或","The value to write, or ":"写的价值，或","The height of the buffer area measured in rows.":"缓冲区的高度以行测量。"," values, whether one or more Shift, Alt, or Ctrl modifier keys was pressed simultaneously with the console key.":"与控制台键同时按下一个或多个移动，ALT或CTRL修饰符键的值。","The width of the console window measured in columns.":"控制台窗口的宽度在列中测量。"," if no more lines are available.":"如果没有更多的行可用。","A composite format string.":"复合格式字符串。","The current height, in rows, of the buffer area.":"缓冲区区域的当前高度。","The column position of the cursor. Columns are numbered from left to right starting at 0.":"光标的列位置。 从0开始，列是从左到右编号。","An object to write using ":"使用的对象使用"," that represents the standard error output stream.":"这代表标准错误输出流。","The height of the console window measured in rows.":"控制台窗口的高度以行测量。","The row position of the cursor. Rows are numbered from top to bottom starting at 0.":"光标的行位置。 从0开始，排从上到下编号。","The current width, in columns, of the buffer area.":"缓冲区区域的当前宽度。"," that specifies the foreground color of the console; that is, the color of each character that is displayed. The default is gray.":"这指定了控制台的前景颜色； 也就是说，显示的每个字符的颜色。 默认值为灰色。","A stream that is the new standard error output.":"是新的标准错误输出的流。","The first object to write using ":"第一个使用使用的对象","The value to write.":"要写的价值。"," that represents the standard input stream.":"这代表标准输入流。"," if CAPS LOCK is turned on; ":"如果盖子锁定;","A stream that is the new standard input.":"这是新标准输入的流。","The second object to write using ":"使用的第二个对象使用","A Unicode character array.":"一个Unicode字符数组。","The encoding used to read console input.":"用于读取控制台输入的编码。"," if CAPS LOCK is turned off.":"如果关闭盖子锁定。","An array of Unicode characters.":"一系列Unicode字符。","A text writer to be used as the new standard output.":"将用作新标准输出的文本作者。","The third object to write using ":"使用的第三个对象使用","The starting position in ":"首发位置"," if error output is redirected; otherwise, ":"如果错误输出重定向； 否则，","The current position, in columns, of the cursor.":"光标的当前位置。","The column position of the upper left  corner of the console window.":"控制台窗口左上角的列位置。","An array of objects to write using ":"使用一系列对象使用","The number of characters to write.":"要写的字符数。"," if input is redirected; otherwise, ":"如果输入是重定向的； 否则，","The height of the largest possible console window measured in rows.":"最大可能的控制台窗口的高度以行测量。","The size of the cursor expressed as a percentage of the height of a character cell. The property value ranges from 1 to 100.":"光标的大小表示为字符单元高度的百分比。 属性值范围从1到100。","The leftmost console window position measured in columns.":"最左的控制台窗口位置以列测量。","A value that specifies the background color of the console; that is, the color that appears behind each character. The default is black.":"指定控制台的背景颜色的值； 也就是说，每个字符背后出现的颜色。 默认值为黑色。"," if output is redirected; otherwise, ":"如果输出重定向； 否则，","The width of the largest possible console window measured in columns.":"最大可能的控制台窗口的宽度以列测量。","The uppermost console window position measured in rows.":"最高的控制台窗口位置以行测量。","The current position, in rows, of the cursor.":"当前位置，排在光标。","The console key that corresponds to the ":"对应于"," if a key press is available; otherwise, ":"如果有钥匙按下； 否则，"," if the current process should resume when the event handler concludes; ":"如果事件处理程序结束时，当前的过程应恢复；"," if NUM LOCK is turned on; ":"如果打开数字锁；"," if the cursor is visible; otherwise, ":"如果光标可见； 否则，"," to indicate that a SHIFT key was pressed; otherwise, ":"指示按下换档键； 否则，","An object that corresponds to the console key represented by the current ":"与当前表示的控制台键相对应的对象"," if NUM LOCK is turned off.":"如果关闭了NUM锁。"," if the current process should terminate. The default value is ":"如果当前的过程应终止。 默认值是"," to indicate that an ALT key was pressed; otherwise, ":"指示按下ALT键； 否则，"," to fill with records.":"填写记录。"," that represents the standard output stream.":"这代表标准输出流。","A bitwise combination of the enumeration values. There is no default value.":"枚举值的比重组合。 没有默认值。"," to indicate that a CTRL key was pressed; otherwise, ":"指示按下CTRL键； 否则，","; the current process terminates when the event handler returns. If ":"; 当当前的过程终止事件处理程序返回时。 如果","A string indicating the name of the source table.":"指示源表名称的字符串。","The encoding used to write console output.":"用于编写控制台输出的编码。"," object used to create the new ":"用于创建新的对象",", the current process continues.":"，当前的过程仍在继续。","An object to compare to the current ":"与电流相比的对象","The zero-based index of the starting record.":"起始记录的基于零的索引。","The string to be displayed in the title bar of the console. The maximum length of the title string is 24500 characters.":"将显示在控制台标题栏中的字符串。 标题字符串的最大长度为24500个字符。","The cloned instance of ":"克隆的实例"," object and is equal to the current ":"对象，等于电流"," if Ctrl+C is treated as ordinary input; otherwise, ":"如果将Ctrl+C视为普通输入； 否则，","One of the enumeration values that specifies the key combination that interrupted the current process. There is no default value.":"指定中断当前过程的密钥组合的枚举值之一。 没有默认值。","An integer indicating the maximum number of records.":"一个表示最大记录数的整数。","A new table mapping collection.":"一个新的表映射集合。"," is equal to ":"等于","The name of the source table to use for table mapping.":"用于表映射的源表的名称。","The Unicode character that corresponds to the ":"对应于"," objects to fill with records.":"用记录填充的对象。"," to fill with records and, if necessary, schema.":"填写记录，并在必要时进行架构。"," to be used as the data source when filling the ":"填充时用作数据源"," objects exist; otherwise ":"存在对象； 否则"," to be filled with the schema from the data source.":"从数据源中填充模式。","A value that identifies the console key that was pressed.":"标识按下的控制台键的值。","A reference to a collection of ":"提及集合的","The number of rows successfully added to or refreshed in the ":"在该行中成功添加或刷新的行数"," used to update the data source.":"用于更新数据源。"," to return common CLS-compliant values.":"返回通用CLS兼容值。"," object that contains schema information returned from the data source.":"包含从数据源返回的模式信息的对象。"," objects that were added to the ":"添加到",". This does not include rows affected by statements that do not return rows.":"。 这不包括受不返回行的语句影响的行。","The number of rows successfully updated from the ":"从"," to be filled from the ":"从","A collection that provides the master mapping between the returned records and the ":"提供返回记录和返回记录之间的主映射的集合","A data column.":"数据列。"," is called on the ":"被称为"," objects that contains the parameters set by the user.":"包含用户设置的参数的对象。","The case-sensitive name of the column in the data source.":"数据源中的列的案例敏感名称。","; otherwise ":"; 否则",". The default value is an empty collection.":"。 默认值是一个空集合。"," has been created; otherwise ":"已经被创造了; 否则","The data type for the column being mapped.":"列映射的列的数据类型。"," is called during an ":"在一个期间被称为","The case-sensitive column name from a data source.":"来自数据源的病例敏感列名。"," object to add to the collection.":"对象添加到集合中。"," property is persisted; otherwise ":"财产持续存在； 否则","Determines the action to take when existing ":"确定存在时要采取的措施"," object that was added to the collection.":"添加到集合中的对象。","The column name, which is not case sensitive, from a ":"列名，不敏感的列名，来自"," to continue the update without generating an exception; otherwise ":"继续更新而不会产生例外； 否则"," schema does not match incoming data.":"模式不匹配传入的数据。"," if one or more ":"如果一个或多个","The case-sensitive name of the source column to map to.":"要映射到的源列的病例敏感名称。"," method should return provider-specific values; otherwise ":"方法应返回特定于提供商的值； 否则"," to map to.":"映射到。","The case-sensitive source column name of the ":"案例敏感的源列名称","A copy of the current object.":"当前对象的副本。","The zero-based location of the ":"基于零的位置"," to get the column from.":"从中获取专栏。"," name as a string.":"名称为字符串。","The name, which is not case-sensitive, of the ":"这个名称，不是对案例敏感的"," if collection contains a ":"如果收集包含一个"," with the specified case-sensitive source column name.":"带有指定的案例敏感源列名称。"," of the data column.":"数据列。","The name, which is not case-sensitive, of the data set column to find.":"要查找的数据集列的名称，不是大小写的。"," object with the specified source column name; otherwise, ":"具有指定源列名称的对象； 否则，"," column to map to.":"列映射到。","The name of the column within the ":"列的名称"," to map to. The name is not case sensitive.":"映射到。 该名称不敏感。"," name.":"姓名。"," to which to copy ":"要复制"," with the given ":"与给定"," that is the ":"那就是"," column name, or -1 if the ":"列名，或-1如果"," if the collection contains the specified ":"如果该集合包含指定的","The case-sensitive source table name from a data source.":"来自数据源的情况敏感源表名称。"," object with this source table name; otherwise ":"具有此源表名称的对象； 否则","The starting index of the array.":"数组的起始索引。"," object does not exist in the collection.":"集合中不存在对象。","The table name from a ":"来自一个的表名","The TableMapping object with the specified ":"带有指定的桌面对象"," to which to copy the ":"要复制"," array to which to copy the ":"来复制的数组","The number of ":"的数量"," object to insert.":"插入的对象。","The zero-based index in the ":"基于零的索引"," table to find.":"查找表。","The data type for ":"数据类型"," object to remove.":"对象要删除。"," object to return.":"对象要返回。"," table name.":"表名。"," column to find.":"查找列。"," from which to get the ":"从中获得"," name of the ":"的名字","The case-sensitive source column name.":"案例敏感的源列名称。"," object with the specified ":"指定的对象"," collection to search.":"收集要搜索。","A data table.":"数据表。"," column.":"柱子。","The instance of ":"实例"," column name.":"列名。","The case-sensitive name of the mapped source table.":"映射源表的案例敏感名称。","The ColumnMapping object that was added to the collection.":"添加到集合中的列图对象。","A new object that is a copy of the current instance.":"新对象是当前实例的副本。"," object that  has the specified ":"指定的对象"," values are allowed in this column; otherwise, ":"在此列中允许值； 否则，"," name, as a string.":"名称，作为字符串。","The case-sensitive source column name to find.":"要查找的情况敏感源列名。","The name, which is not case-sensitive, of the mapped ":"映射的名称，不是案例敏感的"," object to find.":"要查找的对象。","A data column mapping collection.":"数据列映射集合。","Determines the action to take when the existing ":"确定现有的行动",". If no value is set, returns a null reference (":"。 如果未设置值，请返回null引用（"," object at the specified index.":"在指定索引处的对象。"," object added to the collection.":"对象添加到集合中。"," table.":" 表。","The case-sensitive name of the source table to map from.":"要映射的源表的案例敏感名称。","The catalog name associated with the data source; otherwise, a null reference (":"与数据源关联的目录名称；否则为空引用（"," object within the collection.":"集合中的对象。"," table to map to.":"映射到的表。"," in Visual Basic) if no value is set.":"在Visual Basic中）如果未设置值。","The case-sensitive name of the source table.":"源表的案例敏感名称。"," of values to add to the collection.":"值添加到集合中的值。","The base column name; otherwise, a null reference (":"基本列名称； 否则，null引用（"," if this collection contains the specified ":"如果此集合包含指定的"," object with the specified source table name.":"具有指定源表名称的对象。","The schema name associated with the data source; otherwise, a null reference (":"与数据源关联的模式名称； 否则，null引用（","The case-sensitive source table name containing the ":"案例敏感的源表名称包含"," object with the given ":"给定的对象","The server name associated with the column; otherwise, a null reference (":"与列关联的服务器名称； 否则，null引用（"," if the collection contains a ":"如果该集合包含一个"," table name, or -1 if the ":"表名称，或-1如果","The table name in the schema; otherwise, a null reference (":"模式中的表名； 否则，null引用（"," object that represents the type of data the column contains.":"代表列包含的数据类型的对象。","The case-sensitive source table name to find.":"要查找的情况敏感源表名称。","The name of the column.":"列的名称。","The name of the data type; otherwise, a null reference (":"数据类型的名称； 否则，null引用（"," value for column ordinal; otherwise, a null reference (":"列序的值； 否则，null引用（","A reference to the newly-mapped ":"对新映射的引用"," if this column is aliased; otherwise, ":" 如果此列是别名；否则, "," value for column size; otherwise, a null reference (":"列大小的值； 否则，null引用（"," table within the collection.":"集合中的表格。"," value that specifies the scale of the column data, if the data is numeric.":"如果数据为数字，则指定列数据比例的值。"," if values in this column are automatically incremented; otherwise, ":"如果此列中的值自动增加； 否则，","The connection to the data source.":"与数据源的连接。"," if this column is an expression; otherwise, ":"如果此列是一个表达式； 否则，","The assembly-qualified name of the ":"大会合格的名称"," object that represents the type of data in the column; otherwise, a null reference (":"代表列中数据类型的对象； 否则，null引用（","The parameters of the SQL statement or stored procedure.":"SQL语句或存储过程的参数。"," if this column is hidden; otherwise, ":" 如果此列是隐藏的；否则, "," representing the asynchronous operation.":"代表异步操作。","The transaction within which a command object of a .NET data provider executes. The default value is a null reference (":".NET数据提供商执行的命令对象的交易。 默认值是null引用（"," if this column is an identity; otherwise, ":"如果此列是一个身份； 否则，","A task representing the operation.":"代表操作的任务。",", if the command object should be visible in a control; otherwise ":"，如果在控件中应看到命令对象； 否则"," if this column is a key; otherwise, ":"如果此列是键； 否则，","Options for statement execution and data retrieval.":"语句执行和数据检索的选项。","The transaction within which a ":"交易中"," if this column contains long data; otherwise, ":"如果此列包含长数据； 否则，"," if this column is read-only; otherwise, ":"如果此列仅阅读； 否则，"," object of a .NET Framework data provider executes. The default value is a null reference (":".NET框架数据提供商的对象执行。 默认值是null引用（","A token to cancel the asynchronous operation.":"一个令牌以取消异步操作。"," if a unique constraint applies to this column; otherwise, ":"如果唯一的约束适用于本列； 否则，","One of the enumeration values that indicates how command results are applied. The default is ":"指示如何应用命令结果的枚举值之一。 默认值为","A task representing the asynchronous operation.":"代表异步操作的任务。"," unless the command is automatically generated. Then the default is ":"除非自动生成命令。 那么默认值为","The column property name.":"列属性名称。","The number of rows affected.":"影响行的数量。","The object based on the column property name.":"基于列属性名称的对象。"," to which the additional modifications are applied.":" 对其应用所述另外的修改。","One of the enumeration values that specifies the command behavior.":"指定命令行为的枚举值之一。"," value that specifies the precision of the column data, if the data is numeric; otherwise, a null reference (":"如果数据为数字，则指定列数据精度的值； 否则，null引用（","A null reference (":"null引用（"," from the schema table provided by ":"从架构表提供的","One of the enumeration values that specified the command behavior.":"指定命令行为的枚举值之一。"," in Visual Basic) if no value is set; otherwise, a ":"在Visual Basic中）如果未设置值； 否则，","The first column of the first row in the result set.":"结果集中第一行的第一列。","The type of command being generated; INSERT, UPDATE or DELETE.":"生成的命令类型； 插入，更新或删除。","An optional token to cancel the asynchronous operation. The default value is ":"可选令牌以取消异步操作。 默认值是",", generate ":"， 产生"," if the parameter is part of the update or delete WHERE clause, ":"如果参数是更新或删除的一部分，则",", and so on.":"， 等等。"," if it is part of the insert or update values.":"如果是插入值或更新值的一部分。","The text command to execute. The default value is an empty string (\"\").":"执行的文本命令。 默认值是一个空字符串（“”）。"," object required to perform insertions.":"执行插入所需的对象。","The automatically generated ":"自动生成","The time in seconds to wait for the command to execute.":"几秒钟内等待命令执行的时间。","The number to be included as part of the parameter's name.":"该数字作为参数名称的一部分。","The name of the parameter with the specified number appended as part of the parameter name.":"参数名称，指定的数字作为参数名称的一部分。","One of the enumeration values that specifies how a command string is interpreted. The default is ":"指定命令字符串如何解释的枚举值之一。 默认值为"," object required to perform deletions.":"执行删除所需的对象。","The quoted version of the identifier. Embedded quotes within the identifier are properly escaped.":"标识符的引用版本。 标识符中的嵌入式引号被正确逃脱了。","The partial name of the parameter.":"参数的部分名称。",", generate parameter names matching column names, if possible. If ":"，如果可能的话，生成匹配列名的参数名称。 如果","The full parameter name corresponding to the partial parameter name requested.":"与所请求的部分参数名称相对应的完整参数名称。"," instance containing information about the event.":"实例包含有关事件的信息。","A task whose ":"一个任务","The name of the parameter with the specified number appended.":"附加指定号码的参数名称。"," to be used for the update.":"用于更新。"," property is an object representing the new transaction.":"属性是代表新事务的对象。"," for which to retrieve the corresponding schema table.":"为此检索相应的架构表。","The identifier that will have its embedded quotes removed.":"将删除其嵌入式引号的标识符。","The name of the database for the connection to use.":"用于使用连接的数据库的名称。"," that represents the schema for the specific ":"代表特定的模式","The unquoted identifier, with embedded quotes properly un-escaped.":"未引用的标识符，带有嵌入式引号，适当地未排出。"," object required to perform updates.":"执行更新所需的对象。","A reference to an existing ":"对现有的引用","A string indicating the catalog separator for use with an instance of the ":"一个指示目录分离器的字符串，用于与","Returns one of the ":"返回其中之一"," in which to enlist.":"在其中应征。"," to be used by the command builder for the corresponding insert, update, or delete command.":"命令构建器用于相应的插入，更新或删除命令。"," that contains schema information.":"其中包含模式信息。"," values describing the behavior of this ":"描述此行为的价值观"," instance to use for each insert, update, or delete operation. Passing a null value allows the ":"实例用于每个插入，更新或删除操作。 传递零值允许"," method to create a ":"创建一个方法","The beginning character or characters to use. The default is an empty string.":"开始使用的开始字符。 默认值是一个空字符串。","Specifies the name of the schema to return.":"指定要返回的模式的名称。","The ending character or characters to use. The default is an empty string.":"要使用的结尾或字符。 默认值是一个空字符串。"," object based on the Select command associated with the ":"基于与之关联的select命令的对象","The character to be used as the schema separator.":"用作模式分离器的字符。","Specifies a set of restriction values for the requested schema.":"为请求的架构指定一组限制值。","The original unquoted identifier.":"原始未引用的标识符。","The cancellation instruction.":"取消指令。"," if the UPDATE statement generated by the ":"如果更新语句由","The version of the database. The format of the string returned depends on the specific type of connection you are using.":"数据库的版本。 返回的字符串格式取决于您正在使用的连接的特定类型。","An object that represents the new transaction.":"代表新事务的对象。"," includes all columns; ":"包括所有列；","The state of the connection. The format of the string returned depends on the specific type of connection you are using.":"连接状态。 返回的字符串格式取决于您正在使用的连接的特定类型。"," object that is associated with the connection.":"与连接关联的对象。"," if it includes only changed columns.":"如果仅包含更改的列。","The connection string used to establish the initial connection. The exact contents of the connection string depend on the specific data source for this connection. The default value is an empty string.":"用于建立初始连接的连接字符串。 连接字符串的确切内容取决于此连接的特定数据源。 默认值是一个空字符串。"," to use {} to delimit fields; ":"使用{}到定界字段；","One of the enumeration values that specifies the isolation level for the transaction to use.":"指定用于使用交易的隔离级别的枚举值之一。","The time (in seconds) to wait for a connection to open. The default value is determined by the specific type of connection that you are using.":"时间（以秒为单位）等待连接打开。 默认值由您使用的特定连接类型确定。"," to use quotation marks.":"使用引号。","The name of the current database or the name of the database to be used after a connection is opened. The default value is an empty string.":"打开连接后要使用的当前数据库的名称或要使用的数据库的名称。 默认值是一个空字符串。","An object representing the new transaction.":"代表新事务的对象。","The key to add to the ":"添加到","The name of the database server to which to connect. The default value is an empty string.":"要连接的数据库服务器的名称。 默认值是一个空字符串。","The value for the specified key.":"指定密钥的值。",". Assigning a null value removes the key/value pair.":"。 分配null值删除键/值对。"," that contains the keys in the ":"其中包含钥匙","A set of methods for creating instances of a provider's implementation of the data source classes.":"一组用于创建提供商实现数据源类实例的方法。"," to which to add the key/value pair.":"添加密钥/值对。","A new object that is a copy of this instance.":"一个新对象，是此实例的副本。"," that contains the values in the ":"其中包含值"," objects used to update the data source.":"用于更新数据源的对象。","The key to be added.":"要添加的钥匙。"," to add to the batch.":"添加到批处理。"," collection to use.":"用于使用的集合。","The value for the supplied key.":"提供的密钥的值。","The number of commands in the batch before adding the ":"在添加之前，批处理中的命令数","The number of rows successfully updated from the array of ":"从数组成功更新的行数"," to use {} to delimit fields, ":"要使用{}到定界字段，"," executed during the ":"在"," contains an entry with the specified key; otherwise ":"包含带有指定键的条目； 否则"," to use to update the data source.":"用于更新数据源。","Whether the command is an UPDATE, INSERT, DELETE, or SELECT statement.":"命令是更新，插入，删除还是选择语句。"," that updates the data source.":"这样可以更新数据源。"," used during ":"在期间使用"," to be compared with this ":"与此相比"," to execute during the ":"在"," if the connection information in both of the ":"如果两个中的连接信息"," to delete records in the data source for deleted rows in the data set.":"在数据集中删除行的数据源中删除记录。"," objects causes an equivalent connection string; otherwise ":"对象导致等效连接字符串； 否则","The return value from the last command in the batch.":"批处理中最后一个命令的返回值。"," of the command used to fill the data adapter.":"用于填充数据适配器的命令的命令。"," to be filled with information about this ":"充满有关此的信息","The zero-based record number to start with.":"零基于零的记录号。"," to insert records in the data source for new rows in the data set.":"在数据集中的新行数据源中插入记录。","The key of the key/value pair to be removed from the connection string in this ":"在此中将要从连接字符串中删除的密钥/值对的键"," that is used during ":"在","The maximum number of records to retrieve. Specify 0 to retrieve all records after the start record.":"要检索的最大记录数。 指定0在开始记录后检索所有记录。"," if the key existed within the connection string and was removed; ":"如果键存在在连接字符串中并已删除；"," to select records from data source for placement in the data set.":"从数据源中选择记录以放置在数据集中。","The SQL SELECT statement used to retrieve rows from the data source.":"SQL选择语句用于从数据源检索行。"," if the key did not exist.":"如果密钥不存在。"," to update records in the data source for modified rows in the data set.":"更新数据集中的数据源中的记录。"," to use for table mapping.":"用于表映射。","The number of rows to process per batch.  \n  \n ":"每批次处理的行数。","The key of the item to retrieve.":"要检索的项目的关键。"," objects to fill from the data source.":"从数据源填充的对象。"," executed to fill the ":"执行以填补","  \n\n When setting this to a value other than 1, all the commands associated with the ":"将其设置为1以外的值时，所有与之关联的命令","The value corresponding to the ":"对应于"," was found within the connection string, ":"在连接字符串中发现","The number of rows added to or refreshed in the data tables.":"数据表中添加或刷新的行数。"," must have their ":"必须有他们的"," if the connection string is visible within designers; ":"如果连接字符串在设计人员中可见；","The zero-based location of the specified ":"指定的基于零的位置"," objects. This value does not include rows affected by statements that do not return rows.":"对象。 此值不包括受不返回行的语句影响的行。"," otherwise. The default is ":"否则。 默认值为","Index of the element.":"元素的索引。"," property set to None or OutputParameters. An exception will be thrown otherwise.":"属性设置为无或输出参数。 否则将抛出一个例外。"," that is a ":"这是一个"," to insert the schema in.":"插入模式。"," into which to copy the attribute columns.":"在其中复制属性列。","The current connection string, created from the key/value pairs that are contained within the ":"当前连接字符串，由键/值对创建","The case-sensitive name of the source column.":"源列的病例敏感名称。"," to release managed and unmanaged resources; ":"释放管理和不受管理的资源；"," values that specify how to insert the schema.":"指定如何插入模式的值。","The number of instances of elements in the array.":"数组中元素的实例数。",". The default value is an empty string.":"。 默认值是一个空字符串。"," if there are more rows; otherwise, ":"如果有更多的行； 否则，"," objects that contain schema information returned from the data source.":"包含从数据源返回的模式信息的对象。","The number of keys that are contained within the connection string maintained by the ":"连接字符串中包含的键数","The zero-based column ordinal.":"基于零的列序。"," that describes the column metadata.":"描述了列元数据。"," that contains schema information returned from the data source.":"其中包含从数据源返回的模式信息。"," has a fixed size; otherwise ":"具有固定尺寸； 否则"," if there are more rows or ":"如果有更多的行或"," is read-only; otherwise ":"是只读的； 否则","The value of the specified column.":"指定列的值。","A of ":"一个","A stream.":"流。"," to be used when the field points to more remote structured data.":"当字段指向更遥远的结构化数据时，要使用。","The key of the item to get or set.":"要获取或设置的项目的关键。","The index of the command to retrieve the parameter from.":"从命令中检索参数的索引。","The index within the row from which to begin the read operation.":"从那里开始读取操作的行中的索引。","A text reader.":"文字读取器。","The depth of nesting for the current row.":"当前行的嵌套深度。","The value associated with the specified key. If the specified key is not found, trying to get it returns a null reference (":"与指定密钥关联的值。 如果找不到指定的密钥，试图使其返回null引用（","The index of the parameter within the command.":"命令中参数的索引。","The buffer into which to copy the data.":"复制数据的缓冲区。","The number of instances of ":"实例的数量","The number of columns in the current row.":"当前行中的列数。"," in Visual Basic), and trying to set it creates a new element using the specified key.\n\n Passing a null (":"在Visual Basic中），并尝试使用指定的密钥创建一个新元素。 \n\n  通过null（"," specified.":"指定的。"," in the array.":"在数组中。","The index with the buffer to which the data will be copied.":"带有数据将复制到的缓冲区的索引。"," contains one or more rows; otherwise, ":"包含一个或多个行； 否则，"," if the specified column is equivalent to ":"如果指定的列等于","The zero-based column ordinal of the individual command within the batch.":"批处理中单个命令的基于零的列序。"," in Visual Basic) key throws an ":"在Visual Basic中）键抛出","The actual number of bytes read.":"实际的字节数读取。","The zero-based column to be retrieved.":"要检索的基于零的列。"," is closed; otherwise, ":"已经关了; 否则，","The number of rows affected in the data store by the specified command within the batch.":"批处理中指定命令在数据存储中影响的行数。","The index within the field from which to start the read operation.":"启动读取操作的字段中的索引。","The maximum number of characters to read.":"最多要读的字符数。","The number of rows changed, inserted, or deleted. -1 for SELECT statements; 0 if no rows were affected or the statement failed.":"行更改，插入或删除的行数。 -1用于选择语句； 0如果没有影响行或该陈述失败。","The buffer into which to read the stream of bytes.":"读取字节流的缓冲区。"," whose ":"谁的","The actual number of characters read.":"字符的实际数量读取。"," thrown during execution of the specified command. Returns ":"在执行指定命令期间投掷。 返回","The number of fields that are not hidden.":"没有隐藏的字段数。"," (":"（（"," property is ":"属性是","The index for ":"索引","A data reader.":"数据读取器。"," to be checked for column schema support.":"检查列模式支持。"," if the specified column value is equivalent to ":"如果指定的列值等效于"," to start the read operation.":"开始读取操作。"," in Visual Basic) if no exception is thrown.":"在Visual Basic中）如果没有例外。","The name of the data type.":"数据类型的名称。"," can get a column schema; otherwise, ":"可以获取列模式； 否则，","The number of bytes to read.":"要读取的字节数。","An enumerator that can be used to iterate through the rows in the data reader.":"可以用来通过数据读取器中的行进行迭代的枚举器。"," if it is not.":"如果不是。","Information about an individual update attempt within a larger batched update.":"在较大的批处理更新中有关单个更新尝试的信息。","Column ordinal.":"列序。","The data type of the specified column.":"指定列的数据类型。"," to return the column schema.":"返回列模式。"," if there are more result sets; otherwise, ":"如果有更多结果集； 否则，"," For database providers which support it, contains a standard SQL 5-character return code indicating the success or failure of the database operation. The first 2 characters represent the ":"对于支持它的数据库提供商，包含标准SQL 5字符返回代码，指示数据库操作的成功或失败。 前两个字符表示","Buffer to copy data into.":"缓冲区将数据复制到。"," contains the value of the specified column.":"包含指定列的值。","The column schema (":"列模式（"," if there are more result sets or ":"如果有更多结果集或","Maximum length to copy into the buffer.":"最大长度复制到缓冲区中。"," of the return code (e.g. error, success), while the last 3 characters represent the ":"返回代码的（例如错误，成功），而最后3个字符表示","The name of the specified column.":"指定列的名称。"," collection) for a ":"收集）"," if there aren't.":"如果没有。","A provider-specific .NET type.":"提供者特定的.NET类型。",", allowing detection of error scenarios in a database-portable way.":"，允许以数据库 - 可容纳方式检测错误方案。","Point to start from within the buffer.":"指向从缓冲区内开始。","The column ordinal.":"列序。"," if the collection is a fixed size; otherwise ":"如果收集是固定的尺寸； 否则","The invariant provider names for all registered instances of ":"所有注册实例的不变的提供商名称"," if the collection is read-only; otherwise ":"如果收藏是只读的； 否则","Point to start from within the source data.":"指向从源数据内开始。","A standard SQL 5-character return code, or ":"标准SQL 5字符返回代码，或"," if the Boolean is ":"如果布尔人是"," if the collection is synchronized; otherwise ":"如果该集合已同步； 否则","The invariant provider name under which to register the provider.":"注册提供商的不变提供者名称。"," if null values are accepted; otherwise ":"如果接受零值； 否则","Not currently supported.":"目前不支持。"," to copy into.":"复制。","The zero-based index of the parameter.":"参数的零索引。","The instance of the provider factory to be registered.":"提供商工厂的实例要注册。","The name of the back-end data type.":"后端数据类型的名称。","The index in the array to start copying into.":"数组中的索引开始复制。",". The default is an empty string (\"\").":"。 默认值是一个空字符串（“”）。","The name of the parameter.":"参数的名称。","The assembly-qualified name for a ":"大会合格的名称","The errors generated by the .NET data provider when the ":".NET数据提供商生成的错误"," that is the data type of the object.":"那就是对象的数据类型。","The maximum number of digits used to represent the ":"用于表示的数字数量的最大数量"," was executed.":"被执行。"," with the specified name.":"带有指定的名称。","The type representing a ":"代表一个类型","The index of the field to return.":"该领域返回的索引。","The number of rows changed, inserted, or deleted; 0 if no rows were affected or the statement failed; and -1 for SELECT statements.":"行更改，插入或删除的行数； 0如果没有影响行或该陈述失败； 和-1用于选择语句。","The number of decimal places to which ":"小数点的数量"," to be used to synchronize access to the ":"用于同步访问","The GUID value of the specified field.":"指定字段的GUID值。"," is resolved.":"已解决。"," that specifies the number of row processed.":"这指定了处理的行数。","The invariant provider name to look up.":"不变的提供商名称要查找。","The name of the parameter to retrieve.":"要检索的参数的名称。"," to ":"至","The maximum size, in bytes, of the data within the column. The default value is inferred from the parameter value.":"列中数据的最大大小，字节。 默认值是从参数值推断的。","The value to return.":"返回的值。","The connection used.":"使用的连接。"," to execute when ":"执行何时","When this method returns, contains the ":"当此方法返回时，包含","An instance of a ":"一个实例","The name of the source column mapped to the ":"源列的名称映射到"," to copy the attribute fields into.":"将属性字段复制到。"," associated with the specified invariant provider name, if the name is found; otherwise, ":"如果找到该名称，则与指定不变的提供商名称相关联； 否则，","The type of SQL statement to execute.":"执行SQL语句的类型。",". The default is an empty string.":"。 默认值是一个空字符串。",". This parameter is passed uninitialized.":"。 该参数通过非初始化。"," for a specified connection.":"对于指定的连接。"," that contains the attributes for this object.":"其中包含此对象的属性。"," if the source column is nullable; ":"如果源列无效；"," to send through an ":"发送","The number of fields within the current record.":"当前记录中的字段数。"," if a provider is registered under the specified invariant provider name; otherwise, ":"如果提供商按照指定不变的提供商名称注册； 否则，"," containing the provider's configuration information.":"包含提供商的配置信息。","The value at the specified column in its native format.":"在其本机格式的指定列中的值。"," executes.":"执行。"," property of a data provider ":"数据提供商的财产","The invariant provider name of the registration to remove.":"不变的提供商名称要删除的注册。"," for a specified ":"对于指定的","The column name.":"列名。"," to send through the ":"发送"," object. The default value is 0, which indicates that a data provider sets the precision for ":"目的。 默认值为0，这表明数据提供商为"," if the registration is successfully found and removed; otherwise, ":"如果已成功找到并删除注册； 否则，","Invariant name of a provider.":"提供商的不变名称。"," containing information about the visible instances of the associated data source.":"包含有关关联数据源的可见实例的信息。"," is resolved. The default is 0.":"已解决。 默认值为0。"," to which this constraint will belong.":"此约束将属于的。"," for a specified provider name.":"对于指定的提供商名称。"," if a registration for ":"如果注册"," that is the value of the parameter. The default value is null.":"这就是参数的值。 默认值为null。","The DataReader through which to iterate.":"迭代的数据标准器。"," if this instance supports the ":"如果此实例支持"," objects that contain the following data:  \n  \n ":"包含以下数据的对象：","The string value of the ":"字符串值"," object in the collection.":"集合中的对象。"," class; otherwise, ":"班级; 否则，"," to automatically close the DataReader after iterating through its data; otherwise, ":"通过其数据迭代后自动关闭数据标准； 否则，"," to which the constraint belongs.":"约束所属的。"," to which the constraint applies.":"约束适用的。","An array of values of type ":"类型值数组"," if the instance supports the ":"如果实例支持"," of custom information.":"定制信息。"," through which to iterate.":"通过迭代。","Specifies whether the column should be the primary key. If ":"指定该列是否应为主要键。 如果"," to look for in the collection.":"在集合中寻找。","The starting value for the ":"的起始值",", the column will be a primary key column.":"，该列将是主键列。","Specifies whether this property is a provider-specific property.":"指定此属性是否是特定于提供商的属性。"," to automatically close the ":"自动关闭"," feature.":"特征。","The primary key, or parent, ":"主要键或父"," is in the collection; otherwise ":"在收藏中； 否则"," if the property that this attribute is applied to is a provider-specific type property; otherwise ":"如果将此属性应用于提供者特定类型的属性； 否则","The foreign key, or child, ":"外国钥匙或孩子"," after iterating through its data; otherwise, ":"迭代通过其数据； 否则，","The number by which the value of the column is automatically incremented. The default is 1.":"列的值自动增加的数字。 默认值为1。","The array of items to copy to the collection.":"要复制到集合的项目数组。",", this method releases all resources held by any managed objects that this ":"，此方法释放了任何托管对象持有的所有资源"," objects to which the constraint applies.":"约束适用的对象。","The message to display for this exception.":"为此例外显示的消息。","The caption of the column. If not set, returns the ":"列的标题。 如果未设置，请返回","The index in the collection to copy the items.":"集合中复制项目的索引。"," references.":"参考。"," objects that are the primary key, or parent, columns.":"是主要键或父列的对象。"," object that represents the column data type.":"代表列数据类型的对象。","The error message string.":"错误消息字符串。","The name of the savepoint to release.":"要发布的保存点的名称。"," in the collection.":"在集合中。"," objects that are the foreign key, or child, columns.":"是外键或子列的对象。","The inner exception reference.":"内部异常参考。"," for the specified column.":"对于指定的列。"," object at the specified index in the collection.":"集合中指定索引的对象。","The name of the savepoint to roll back to.":"保存点的名称要回到。"," to be tested for removal from the collection.":"要测试以从收藏中删除。","The error code for the exception.":"异常的错误代码。","A value appropriate to the column's ":"适合列的值"," the object with the specified name.":"带有指定名称的对象。"," can be removed from collection; otherwise, ":"可以从收集中删除； 否则，","The name of the savepoint to be created.":"要创建的保存点的名称。"," object with the specified name.":"具有指定名称的对象。","An expression to calculate the value of a column, or create an aggregate column. The return type of an expression is determined by the ":"表达式计算列的值，或创建聚合列。 表达式的返回类型由"," if the error represented could be a transient error; ":"如果表示的错误可能是瞬态错误；"," object associated with the transaction.":"与交易关联的对象。"," of the constraint.":"约束。","The index at which to insert the ":"插入的索引"," of the column.":"列。"," objects to copy the collection into.":"将集合复制成的对象。","The isolation level for this transaction.":"该交易的隔离水平。"," if the collection contains the specified constraint; otherwise, ":"如果该集合包含指定的约束； 否则，","The name of the column to return.":"列的名称要返回。"," object to insert into the collection.":"对象插入集合中。","The maximum length of the column in characters. If the column has no maximum length, the value is -1 (default).":"字符中的列的最大长度。 如果列没有最大长度，则值为-1（默认值）。","The index of the column specified by ":"由"," that is the destination of the values copied from the collection.":"那是从集合复制的值的目的地。"," if this ":"如果这","The index where the ":"索引","The namespace of the ":"名称空间"," if it is found; otherwise, -1.":"如果找到了； 否则，-1。"," object is located.":"对象已找到。","The index of the array at which to start inserting.":"开始插入的数组的索引。","The name of the column to find.":"列的名称要查找。","The position of the column. Gets -1 if the column is not a member of a collection.":"列的位置。 如果列不是集合的成员，则获得-1。"," instance supports database savepoints; otherwise, ":"实例支持数据库保存点； 否则，"," if it is in the collection; otherwise, -1.":"如果在收藏中； 否则，-1。","For a description of this member, see ":"有关此成员的描述，请参阅","The index of the constraint to return.":"返回的约束索引。","The zero-based index of the column with the specified name, or -1 if the column does not exist in the collection.":"具有指定名称的列的基于零的索引，或-1如果集合中不存在列。","The XML prefix for the ":"XML前缀"," object names in the parent ":"父对象名称"," collection).":"收藏）。","The name of the column to remove.":"列的名称要删除。"," of the constraint to return.":"返回的约束。"," namespace.":"名称空间。"," of the relation.":"关系。","The index of the column to remove.":"列的索引要删除。"," sent through an ":"通过一个"," object names in the child ":"孩子中的对象名称"," with the specified name; otherwise a null value if the ":"带有指定的名称； 否则为null值，如果"," executed when ":"执行","The zero-based index of the column to return.":"列的基于零的索引要返回。","The data necessary to serialize or deserialize an object.":"序列化或应对对象进行序列化所需的数据。"," of the column to return.":"列的列。","A value that indicates whether relationships are nested.":"指示关系是否嵌套的值。"," is called.":"叫做。"," in the collection with the specified ":"在指定的集合中"," if the column is read only; otherwise, ":" 如果列是只读的；否则, ","Description of the source and destination of the specified serialized stream.":"指定序列化流的源和目的地的描述。"," to which the ":"对此","The type of SQL statement executed.":"执行SQL语句的类型。"," belongs to.":"属于。","; otherwise a null value if the ":"; 否则为null值，如果"," belongs.":"属于。","The string to display when the exception is thrown.":"抛出异常时要显示的字符串。","The zero-based index of the relation with the specified name, or -1 if the relation does not exist in the collection.":"与指定名称的关系的基于零的索引，或-1如果该关系中不存在。"," if the value must be unique; otherwise, ":"如果值必须是唯一的； 否则，","A reference to an inner exception.":"对内部异常的引用。"," that contains customized properties.":"其中包含自定义属性。","Gets the ":"得到"," of the column with the changing value.":"列的变化值。","The relation to remove.":"删除的关系。","The data reader to get the column value from.":"数据读取器从中获取列值。"," with the changing value.":"具有变化的价值。","The name of the relation to remove.":"删除关系的名称。","The data reader to get the column type name from.":"数据读取器以获取列类型名称。"," instance that caused the current exception.":"导致当前异常的实例。"," objects are nested; otherwise, ":" 对象嵌套；否则, "," with a changing value.":"价值变化。","A string that represents the name of the column to be created. If set to ":"代表要创建的列的名称的字符串。 如果设置为","The data reader to get the field type from.":"数据读取器以获取字段类型。","The index of the relation to remove.":"关系的索引来移除。","The proposed value, of type ":"拟议的价值，类型"," objects that are the parent columns of this ":"对象是该父列"," object to verify.":"对象要验证。"," or an empty string (\"\"), a default name will be specified when added to the columns collection.":"或一个空字符串（“”），添加到列集合中时将指定默认名称。","An optional token to cancel the asynchronous operation.":"可选令牌以取消异步操作。"," of the column with a changing value.":"具有变化值的列的。"," that makes sure that values in a parent column are unique.":"这确保父列中的值是唯一的。"," to use when you create the column.":"创建列时使用。","The zero-based index to find.":"基于零的索引。","A supported ":"支持"," or an empty string (\"\"), a default name will be given when the created object is added to the ":"或一个空字符串（“”），当创建对象添加到",", or a null value if the specified ":"，或指定的零值"," of the new column.":"新列。"," that is the parent table of this relation.":"那是此关系的父表。","The named ":"命名","The expression used to create this column. For more information, see the ":"用于创建此列的表达式。 有关更多信息，请参阅","The name of the a ":"A的名称","The parent ":"父母 ","The name to use when you create the column.":"创建列时要使用的名称。","The builder that contains the table and record for the new row.":"包含表格并记录新行的构建器。","The parent column of the relation.":"关系的父列。","Parameter reference.":"参数参考。"," in the relationship.":"在关系中。","The expression to assign to the ":"分配给"," objects or an array of length zero.":"对象或长度为零的数组。","The specified ordinal.":"指定的序数。","The child ":"孩子","The child column of the relation.":"关系的子列。"," values specifying the version of the data to get. Possible values are ":"指定要获取的数据版本的值。 可能的值是"," value, if the property is set; otherwise, the ":"值，如果设置属性； 否则，"," if the column can be removed. ":" 如果列可以被移除。 ","The created relation.":"创建的关系。","The name of the relation. If ":"关系的名称。 如果","The text of the error description.":"错误描述的文本。"," if,  \n  \n-   The ":"如果， \n  \n -   这","The parent columns of the relation.":"关系的父列。"," if null values are allowed; otherwise, ":"如果允许零值； 否则，"," in the relation.":"在关系中。"," if the value of the column increments automatically; otherwise, ":"如果列的值自动增加； 否则，","The zero-based index of the column.":"列的基于零的索引。"," parameter is ":"参数为","A value that indicates whether constraints are created. ":"表示是否创建约束的值。","The child columns of the relation.":"关系的儿童柱。",", if constraints are created. Otherwise, ":"，如果创建了约束。 否则，"," objects that contain errors.":"包含错误的对象。"," upon which an action has occurred.":"采取了行动。","The name of the relation.":"关系的名称。","An array of parent ":"一系列父母",".  \n  \n-   The column does not belong to this collection.  \n  \n-   The column is part of a relationship.  \n  \n-   Another column's expression depends on this column.":"。 \n  \n  - 该列不属于此集合。 \n  \n  - 列是关系的一部分。 \n  \n  - 另一列的表达式取决于此列。"," of the current row.":"当前行。"," to create constraints; otherwise ":"创建约束； 否则"," values specifying the version of the data to get.":"指定要获取的数据版本的值。","An array of child ":"一系列孩子"," of the column to look for.":"要寻找的列。","The array of values that are used to create the new row.":"用于创建新行的值数组。","A value that indicates whether to create constraints. ":"指示是否创建约束的值。",". (The default is ":"。 （默认为","The new row.":"新行。"," of a ":"一个"," if a column exists with this name; otherwise, ":"如果存在此名称的列； 否则，"," that is the parent table of the relation.":"那是关系的父表。","The value of the primary key to test for.":"测试的主要键的值。"," to create.":"去创造。"," values that specifies the row version.":"指定行版本的值。","The created ":"创建","The name of the parent table namespace.":"父表名称空间的名称。"," with the specified primary key value; otherwise, ":"具有指定的主要键值； 否则，"," enumeration that specifies the version of the column value to return, such as ":"指定要返回的列值的版本，例如"," if the version exists; otherwise, ":"如果存在版本； 否则，"," to create a constraint; otherwise ":"创建约束； 否则"," that is the child table of the relation.":"那是关系的孩子表。","An array of primary key values to test for.":"一系列主要钥匙值要测试。"," if the column contains a null value; otherwise, ":"如果列包含一个空值； 否则，"," version.":"版本。","The name of the child table namespace.":"子桌名称空间的名称。","The relation to check.":"检查的关系。"," contains a ":"包含a"," values that specifies the row version. Possible values are ":"指定行版本的值。 可能的值是","The column index.":"列索引。"," values. Possible values for the ":"值。 可能的值","The relation to perform the check against.":"执行检查的关系。"," to set the error description for.":"设置错误描述。","The zero-based ordinal of the column to return the value of.":"列的基于零的序数以返回值。"," property are ":"属性是","The error description.":"错误描述。"," with the specified key values; otherwise, ":" 使用指定的键值；否则, "," can be removed; otherwise, ":"可以去除； 否则，","The name of the column to return the value of.":"列返回值的列的名称。","The zero-based index in the array at which copying begins.":"复制开始的数组中的基于零的索引。","The validation error on the object.":"对象上的验证错误。","The new parent ":"新父母","The primary key value of the ":"主要键值","The data needed to serialize or deserialize an object.":"序列化或应对对象进行序列化所需的数据。"," specifies which row value to retrieve.":"指定要检索的行值。","The name of the relation to find.":"找到的关系名称。","The relation ":"关系"," that contains the primary key value specified; otherwise a null value if the primary key value does not exist in the ":"其中包含指定的主要键值； 否则为null值，如果主要键值不存在","The source and destination of a given serialized stream.":"给定序列化流的来源和目的地。","The new row value for the specified column, of type ":"指定列的新行值，类型的","An array of primary key values to find. The type of the array is ":"要查找的主要钥匙值数组。 阵列的类型是",", if a relation with the specified name exists; otherwise ":"，如果存在与指定名称的关系； 否则"," if the row contains an error; otherwise, ":"如果行包含错误； 否则，","The boolean value.":"布尔值。","The zero-based ordinal of the column to set the value of.":"列的基于零的序数来设置值。"," with the same schema as the current ":"与电流相同的模式"," objects to copy the collection to.":"将集合复制到的对象。"," object that contains the primary key values specified; otherwise a null value if the primary key value does not exist in the ":"包含指定的主要键值的对象； 否则为null值，如果主要键值不存在","The name of the column to set the value of.":"列的名称设置值。","The referenced DataSet.":"引用数据集。"," that contains the data.":"其中包含数据。","a ":"一个"," for this collection.":"对于这个系列。",", but none of the data.":"，但没有一个数据。"," that contains information about the column.":"其中包含有关列的信息。","The relation to search for.":"搜索的关系。"," for the child ":"为孩子"," with the same structure (table schemas, relations, and constraints) and data as this ":"具有相同的结构（表模式，关系和约束）和数据","The zero-based index of the row, or -1 if the row is not found in the collection.":"该行的基于零的索引，如果在集合中找不到行，则为-1。"," values that specifies the row version that you want. Possible values are ":"指定您想要的行版本的值。 可能的值是","The 0-based index of the relation, or -1 if the relation is not found in the collection.":"关系的基于0的索引，如果在集合中找不到关系，则为-1。","The parent object.":"父对象。","The (zero-based) location in the collection where you want to add the ":"收藏集中的（基于零的）位置您要添加","The text describing an error.":"描述错误的文本。"," containing one or more result sets, corresponding to the ":"包含一个或多个结果集，对应于"," object with which to write.":"要编写的对象。","A string containing the ":"一个包含"," to which this row belongs.":"这一行属于的。","The index of the row to remove.":"该行的索引要删除。"," instances contained within the source ":"源中包含的实例"," object used to write the document.":"用于编写文档的对象。"," upon which an action is occurring.":"采取行动正在发生。"," to keep the created child view in sync with the parent; otherwise, ":"使创建的子观点与父母同步； 否则，","The total number of ":"总数","An array of DataTables providing the order of the result sets to be returned in the ":"提供结果集的顺序的数据集数组","The file name (including the path) to which to write.":"文件名（包括路径）要编写。"," to be compared.":"比较。","The zero-based index of the row to return.":"要返回的行的从零开始的索引。",". The returned result sets are in the order specified by the ":"。 返回的结果集按照由"," with which to write.":"用它写。"," and it returns the same row as the current ":"它返回与当前的相同行"," object to write to.":"对象要写入。","A 32-bit signed integer hash code 1, which represents Boolean ":"一个32位签名的整数哈希代码1，代表布尔值"," that a ":"那","The specified ":"指定的"," if the value of this instance is nonzero; otherwise the integer zero, which represents Boolean ":"如果此实例的值非零； 否则代表布尔值的整数零","'s protected constructor ":"受保护的构造函数","A delegate used to convert ":"用于转换的代表"," object to compare.":"对象比较。","An AttributeCollection containing the attributes for this object.":"包含此对象的属性的属性。"," is invoked with during deserialization in remoting scenarios.":"在远程场景中被调用期间被调用。","The second ":"第二"," to string.":"到字符串。","The class name of this instance of a component.":"组件的此实例的类名。"," enumeration indicating whether schema information has been omitted from the payload.":"枚举表明是否已从有效载荷中省略了模式信息。","The name of the file to write to.":"要写入的文件的名称。"," objects have ordered sets of column values that are equal; otherwise, ":"对象有相等的列列值集； 否则，"," instance that is passed during deserialization of the ":"实例在避免的情况下通过","The name of this instance of a component.":"组件的这个实例的名称。"," to write to.":"写信。"," to compute the hash code from.":" 来计算哈希码。","A copy of the changes from this ":"此更改的副本","The type converter for this instance of a component.":"组件的此实例的类型转换器。"," value representing the hash code of the row.":"代表行的哈希代码的值。"," if string comparisons are case-sensitive; otherwise, ":" 如果字符串比较区分大小写；否则, "," that can have actions performed on it and later be merged back in using ":"可以在其上执行操作，然后在使用中合并","The default event for this instance of a component.":"组件的此实例的默认事件。","The default property for this instance of a component.":"组件的此实例的默认属性。","The input ":"输入"," if rules are enforced; otherwise, ":"如果执行规则； 否则，",". If no changed rows are found, the method returns ":"。 如果找不到行更换的行，该方法返回",", which acts as the ":"，充当","The events for this instance of a component.":"组件实例的事件。","A filtered copy of the ":"过滤的副本"," with all custom user information.":" 与所有自定义用户信息。","The attributes.":"属性。"," instance for the extension method.":"扩展方法的实例。"," that can have actions performed on it, and subsequently be merged back in using ":"可以在其上执行操作，然后将其合并回使用"," if any table contains an error; otherwise, ":"如果任何表包含错误； 否则，","The properties for this instance of a component.":"组件实例的属性。",". If no rows of the desired ":"。 如果没有所需的行"," object that specifies the column to return the value of.":"指定列返回值的对象。"," if the row is in edit mode; otherwise ":"如果行处于编辑模式； 否则"," that contains data about the user's machine locale. The default is ":" 其中包含有关用户计算机区域设置的数据。 默认值为 ","The value, of type ":"类型的价值"," are found, the method returns ":"发现该方法返回"," if the row is new; otherwise ":"如果行是新的； 否则"," that contains a collection of ":"其中包含一个集合",", of the ":"， 的","The specified schema set.":"指定的模式集。"," objects. An empty collection is returned if no ":"对象。 如果没有，则返回空的集合","The value of the column.":"列的值。"," specified by ":"指定","A copy of ":"副本"," objects exist.":"存在对象。","String that contains the specified column.":"包含指定列的字符串。"," that holds the serialized data associated with the ":"持有与"," being viewed by the ":"被"," for a ":" 对于一个 "," that contains the source and destination of the serialized stream associated with the ":"包含与",". An empty collection is returned if no ":"。 如果没有，则返回空的集合","The streaming context.":"流上下文。","The description string.":"描述字符串。","A string that is a representation of the data stored in the ":"是存储在该数据中的数据的字符串","The name to give the table. If ":"给桌子的名字。 如果","String that is the XML Schema for the XML representation of the data stored in the ":"字符串是用于存储在该数据中的数据的XML架构"," or an empty string, a default name is given when added to the ":"或一个空字符串，添加到"," has changes; otherwise, ":"有变化； 否则，","The namespace for the XML representation of the data stored in the ":"存储在该数据中的XML表示的名称空间"," from which to read the schema.":"从中读取模式。","The expression to compute.":"计算的表达式。","An array of namespace Uniform Resource Identifier (URI) strings to be excluded from schema inference.":"一系列命名空间统一资源标识符（URI）字符串将排除在模式推理之外。","The filter to limit the rows that evaluate in the expression.":"限制在表达式中评估的行的过滤器。","The name of the file (including the path) from which to read the schema.":"文件的名称（包括路径）可以从中读取模式。",", set to the result of the computation. If the expression evaluates to null, the return value will be ":"，设置为计算结果。 如果表达式评估为null，则返回值将为"," with the same structure (table schemas and constraints) and data as this ":"具有相同的结构（表模式和约束）和数据"," represents a ":"代表",".  \n  \n If these classes have been derived, the copy will also be of the same derived classes.  \n  \n ":"。 \n  \n  如果这些类得出，则该副本也将是相同的派生类。"," serialized in its binary format, ":"以其二进制格式序列化，"," creates a new ":"创建一个新"," that provides one or more result sets.":"提供一个或多个结果集。"," enumeration that indicates how rows already in the ":"枚举表明在"," with the same structure and data as the original ":" 具有与原始相同的结构和数据 ",". To copy the structure to a new ":"。 将结构复制到新的"," instances within the ":"内部的实例"," will be combined with incoming rows that share the same primary key.":"将与共享相同主键的传入行结合。",", but not the data, use ":"，但不是数据，使用 "," instances, from which the ":"实例，从中"," method retrieves name and namespace information. Each of these tables must be a member of the ":"方法检索名称和名称空间信息。 这些表中的每一个都必须是"," containing one result set, corresponding to the source ":" 包含一个结果集，对应于源 ","The new expression.":"新的表达方式。"," contained by this ":"由此包含"," if no changes are found.":"如果找不到更改。"," delegate to call when an error occurs while loading data.":"加载数据时发生错误时委托呼叫。"," that can have actions performed on it, and later be merged back in the ":"可以对此采取行动，然后将其合并回"," method retrieves name and namespace information.":"方法检索名称和名称空间信息。"," using ":"使用","An array of strings, from which the ":"一系列琴弦，从中"," objects that have errors.":"具有错误的对象。"," method retrieves table name information.":"方法检索表名称信息。"," object that holds the serialized data associated with the ":"包含与之关联的串行数据的对象"," objects to be merged into the ":"将对象合并到"," to preserve changes in the ":"保留变化","The type of the ":"类型"," whose data and schema will be merged.":"将合并其数据和模式。"," that describes the XML representation of the object that is produced by the ":"描述了由该物体产生的对象的XML表示"," to preserve changes in the current ":"保留当前的变化"," method and consumed by the ":"方法，并被"," being removed.":"被删除。"," to be imported.":"被进口。","The name of the property that is about to change.":"即将更改的属性名称。","An object that derives from ":"从"," that provides a result set.":" 这提供了一个结果集。"," used to read the data.":"用于读取数据。"," are combined with incoming rows that share the same primary key.":"与共享相同主键的传入行结合。"," from which to read.":"从中阅读。","An array of values used to create the new row.":"用于创建新行的值数组。"," from which to read the schema and data.":" 从中读取架构和数据。"," to accept changes; otherwise ":"接受更改； 否则","The filename (including the path) from which to read.":"可以从中读取的文件名（包括路径）。","Used to determine how the array values are applied to the corresponding values in an existing row.":"用于确定如何将数组值应用于现有行中的相应值。"," to be merged with the current ":"与当前合并","The file name (including the path) from which to read.":"文件名（包括路径）可以读取。","The specified XML reader.":"指定的XML读取器。",", to preserve changes in the current ":"，以保留当前的变化"," if the property value has been changed from its default; otherwise, ":"如果属性值已从其默认值更改； 否则，"," with the same schema as the ":"具有与"," object used to write to a file.":"用来写入文件的对象。"," value that describes the size of the array.":"描述数组大小的值。","The new array.":"新数组。"," derived class.":"派生的类。"," that will be used to read the data.":"这将用于读取数据。"}