{"One of the enumeration values that specifies the rules for the comparison.":"指定比较规则的枚举值之一。"," parameter is the same as this string; otherwise, ":"参数与此字符串相同； 否则，"," parameter is equal to the value of the ":"参数等于","One of the enumeration values that specifies how the strings will be compared.":"指定字符串如何比较的枚举值之一。","The object to format.":"格式的对象。","The first object to format.":"格式的第一个对象。"," in which the format item or items have been replaced by the string representation of ":"格式项目或项目已被字符串表示代替"," in which format items are replaced by the string representations of ":"其中格式项目被字符串表示代替","The second object to format.":"格式的第二个对象。"," in which the format items have been replaced by the string representations of ":"格式项目已被字符串表示代替","The third object to format.":"格式的第三个对象。"," in which any format items are replaced by the string representation of ":"其中任何格式项目都被字符串表示代替"," in which the format items have been replaced by the string representation of the corresponding objects in ":" 其中格式项已被替换为相应对象的字符串表示形式 ","An enumerator object.":"枚举对象。","A read-only character span.":"只读字符跨度。","A Unicode character to seek.":"一个Unicode角色要寻找。","The number of character positions to examine.":"要检查的角色位置的数量。","The search starting position.":"搜索起始位置。","A reference to the first character in the string, or a reference to the string's null terminator if the string is empty.":"对字符串中的第一个字符的引用，如果字符串为空，则引用字符串的null终结器的引用。","The zero-based index position of ":"基于零的索引位置"," if that string is found, or -1 if it is not. If ":"如果找到该字符串，则-1如果不是。 如果","An enumeration value that specifies the rules for the search.":"指定搜索规则的枚举值。"," from the start of the string if that character is found, or -1 if it is not.":"从字符串的开头（如果找到该字符），或者-1（如果不是）。"," if that character is found, or -1 if it is not.":"如果找到该字符，则为-1，如果不是。"," from the start of the current instance if that string is found, or -1 if it is not. If ":"从当前实例的开头，如果找到该字符串，则为-1。 如果","One of the enumeration values that specifies the rules for the search.":"指定搜索规则的枚举值之一。",", the return value is 0.":"，返回值为0。"," parameter from the start of the current instance if that string is found, or -1 if it is not. If ":"参数从当前实例的开头（如果找到该字符串），或者-1（如果不是）。 如果",", the return value is ":"，返回值是"," parameter if that string is found, or -1 if it is not. If ":"参数如果找到该字符串，则为-1，如果不是。 如果","The zero-based index position of the first occurrence in this instance where any character in ":"在这种情况下，第一次出现的基于零的索引位置","The zero-based index position of the ":"基于零的索引位置"," was found.":"被找到。","The string to insert.":"插入的字符串。"," was found; -1 if no character in ":"被找到; -1如果没有字符","A Unicode character array containing one or more characters to seek.":"一个包含一个或多个字符的Unicode字符数组。","The index position of the ":"的索引位置 ","The zero-based index position of the insertion.":"插入的基于零的索引位置。","A new string that is equivalent to this instance, but with ":"一个等同于此实例的新字符串，但","The system's reference to ":"系统的引用"," inserted at position ":"插入位置"," if it is in the common language runtime intern pool; otherwise, ":"如果是在通用语言运行时实习池中； 否则，","The string to search for in the intern pool.":"在实习池中搜索的字符串。"," or an empty string (\"\"); otherwise, ":"或一个空字符串（“”）; 否则，",", if it is interned; otherwise, a new reference to a string with the value of ":"，如果被实习； 否则，对带有值的字符串的新引用","A reference to ":"引用"," if this string is in normalization form C; otherwise, ":"如果此字符串处于归一化表格C； 否则，","A string to search for in the intern pool.":"在实习池中搜索的字符串。"," has more than one element.":"有多个元素。"," consists exclusively of white-space characters.":"仅由白空间字符组成。"," character.\n\n-or-\n\n":"特点。 \n\n -或者-","An array of objects whose string representations will be concatenated.":"一系列对象的字符串表示将被串联。","The first item in ":"第一项","A Unicode normalization form.":"Unicode归一化形式。","The character to use as a separator. ":"用作分离器的角色。"," has zero elements.":" 具有零元素。","A string that consists of the elements of ":"一个由元素组成的字符串"," is included in the returned string only if ":"仅在返回的字符串中包含"," if this string is in the normalization form specified by the ":"如果此字符串以标准化形式","An array of strings to concatenate.":"一系列串成一团。"," to concatenate.":" 连接起来。","A string that consists of ":"一个由"," delimited by the ":"由"," string.\n\n-or-\n\n":"细绳。 \n\n -或者-"," to concatenate, starting with the element in the ":"为了加入，从"," starting at ":"开始于","Concatenates an array of strings, using the specified separator between each member, starting with the element located at the specified index and including a specified number of elements.":"使用每个构件之间的指定分离器，从位于指定索引的元素开始，并包括指定数量的元素开始，从而加入了一个字符串。","The string to use as a separator. ":"用作分离器的字符串。"," position.":"位置。","The string to use as a separator.":"用作分离器的字符串。","A string that consists of the members of ":"由成员组成的字符串"," if the first element of ":" 如果第一个元素 ","A string that consists of the elements in ":"一个由元素组成的字符串"," toward the beginning of this instance.":"在此实例的开始。","A collection that contains the strings to concatenate.":"一个包含串联的字符串的集合。"," has no elements.":"没有元素。","An array that contains the elements to concatenate.":"包含要连接的元素的数组。"," character.\n\n -or-\n\n ":"特点。 \n\n  -或者-"," if that character is found, or -1 if it is not found or if the current instance equals ":"如果找到该字符，或者-1如果找不到，或者当前实例等于","The Unicode character to seek.":"Unicode的角色要寻求。","A collection that contains the objects to concatenate.":"包含连接物体的对象的集合。"," has zero elements.\n\n-or-\n\n.NET Framework only: ":"具有零元素。 \n\n -或者- \n\n 仅.NET框架：","The search starting position. The search proceeds from ":"搜索起始位置。 搜索从","The starting position of the search. The search proceeds from ":"搜索的开始位置。 搜索从","The zero-based starting index position of ":"基于零的起始索引位置"," parameter if that string is found, or -1 if it is not.":"参数如果找到该字符串，则为-1，如果不是。"," if that string is found, or -1 if it is not found or if the current instance equals ":"如果找到该字符串，或者-1如果找不到，或者当前实例等于","A new string whose textual value is the same as this string, but whose binary representation is in the normalization form specified by the ":"一个新字符串，其文本值与此字符串相同，但其二进制表示为标准化表格","The number of characters in the resulting string, equal to the number of original characters plus any additional padding characters.":"结果字符串中的字符数量等于原始字符的数量以及任何其他填充字符。","The index position of the last occurrence in this instance where any character in ":"在这种情况下，上次发生的索引位置","The zero-based starting index position of the ":"基于零的起始索引位置"," if that string is found, or -1 if it is not.":" 如果找到该字符串，或-1，如果没有。","A new string that is equivalent to this instance, but right-aligned and padded on the left with as many spaces as needed to create a length of ":"一个与此实例相等的新字符串，但在左侧右侧填充并填充，并根据需要的多个空间来创建一个长度","A string to implicitly convert.":"一个用于隐式转换的字符串。"," parameter if that string is found, or -1 if it is not found or if the current instance equals ":"参数如果找到该字符串，或者-1如果找不到，或者当前实例等于"," was found or if the current instance equals ":"被发现或当前实例等于","A Unicode padding character.":"一个Unicode填充字符。"," is less than the length of this instance, the method returns a reference to the existing instance. If ":"该方法小于此实例的长度，返回对现有实例的引用。 如果","A new, normalized string whose textual value is the same as this string, but whose binary representation is in normalization form C.":"一个新的标准化字符串，其文本值与此字符串相同，但其二进制表示为标准化表C。","A new read-only span of characters representing the string.":"代表字符串的新的只读字符。","A new string that is equivalent to this instance, but left-aligned and padded on the right with as many ":"一个与此实例相等的新字符串，但左对准并在右侧填充，并带有尽可能多的","A new string that is equivalent to this instance, but right-aligned and padded on the left with as many ":"一个与此实例相等的新字符串，但在左侧右对齐和填充"," is equal to the length of this instance, the method returns a new string that is identical to this instance.":"该方法等于此实例的长度，该方法返回一个与此实例相同的新字符串。"," are replaced with ":"被取代"," is different from the value of ":"与价值不同","The zero-based position to begin deleting characters.":"基于零的位置开始删除字符。"," characters as needed to create a length of ":"根据需要创建长度的字符"," is searched within this instance.":"在此实例中搜索。","A character that delimits the substrings in this string.":"划定此字符串中的子字符串的字符。"," is not found in the current instance, the method returns the current instance unchanged.":"在当前实例中找不到，该方法返回当前实例不变。","A new string that is equivalent to this string except for the removed characters.":"除删除字符外，与此字符串相当的新字符串。","A new string that is equivalent to this instance, but left-aligned and padded on the right with as many spaces as needed to create a length of ":"一个与此实例相等的新字符串，但在右侧左对齐和填充，并根据需要的多个空格来创建长度的长度","A string whose contents match the current string, but with all newline sequences replaced with ":"内容的内容与当前字符串匹配，但用所有Newline序列替换为","An array whose elements contain the substrings from this instance that are delimited by ":"一个元素包含此实例的子字符串的数组","The string to be replaced.":"要替换的字符串。","An array whose elements contain the substrings in this string that are delimited by one or more characters in ":"一个数组，其元素包含该字符串中的子字符串，该数组由一个或多个字符界定的数组","The number of characters to delete.":"要删除的字符数。","The string to replace all occurrences of ":"替换所有出现的字符串","An array of delimiting characters, an empty array that contains no delimiters, or ":"一系列划界字符，一个不包含定界数的空阵列，或","The text to use as replacement.":"要用作替换的文本。","A new string that is equivalent to this instance except for the removed characters.":"除删除字符外，与此实例相当的新字符串。","A string that delimits the substrings in this instance.":"在这种情况下划定子字符串的字符串。","A string that is equivalent to the current string except that all instances of ":"等同于当前字符串的字符串，除了所有实例","An array whose elements contain the substrings from this instance that are delimited by one or more characters in ":"一个数组，其元素包含此实例中的子字符串，该数组由一个或多个字符界定","The Unicode character to be replaced.":"要替换的Unicode字符。","A string that delimits the substrings in this string.":"一个划定此字符串中的子字符串的字符串。","A character that delimits the substrings in this instance.":"在此实例中分隔子字符串的字符。","The Unicode character to replace all occurrences of ":"Unicode字符替换所有出现的"," to ignore casing when comparing; ":"比较时忽略套管；","An array of characters that delimit the substrings in this string, an empty array that contains no delimiters, or ":"一个字符数组，这些字符划定此字符串中的子字符串，一个不包含定界数的空数组，或","The maximum number of elements expected in the array.":"数组中预期的最大元素数量。","The strings that delimit the substrings in this string, an empty array that contains no delimiters, or ":"划定此字符串中的子字符串的字符串，一个不包含定界数的空数组，或","The culture to use when comparing. If ":"比较时要使用的文化。 如果","The maximum number of substrings to return.":"返回的最大基因数。","A string that is equivalent to this instance except that all instances of ":"等同于此实例的字符串，除了所有实例","An array whose elements contain the substrings in this string that are delimited by one or more strings in ":"一个数组，其元素包含该字符串中的子字符串，该数组由一个或多个字符串界定","One of the enumeration values that determines how ":"确定如何的枚举价值之一","A bitwise combination of the enumeration values that specifies whether to trim substrings and include empty substrings.":"枚举值的位组合，该值指定是否修剪子字符串并包括空子字符串。","An array whose elements contain the substrings in this instance that are delimited by one or more characters in ":"一个数组，其元素包含在这种情况下由一个或多个字符界定的子字符串在此中","Cultural information that determines how this string and ":"确定该字符串和如何的文化信息","A string that is equivalent to the substring of length ":"等同于长度的弦","An array of strings that delimit the substrings in this string, an empty array that contains no delimiters, or ":"一系列字符串，这些字符串在此字符串中划定了子字符串，一个不包含定界数的空阵列，或","An array that contains at most ":"最多包含的阵列","An array that contains the substrings in this string that are delimited by one or more characters in ":"一个包含该字符串中的子字符串的数组，该数组由一个或多个字符界定的数组"," parameter matches the beginning of this string; otherwise, ":"参数匹配此字符串的开头； 否则，","The character to compare.":"比较的角色。"," that begins at ":"从开始"," if this instance begins with ":"如果此实例从"," substrings from this instance that are delimited by ":"由此实例的子字符串由","The starting position of a substring in this instance.":"在这种情况下，子字符串的起始位置。","The zero-based starting character position of a substring in this instance.":"在这种情况下，基因的基于零的启动字符位置。"," matches the beginning of this string; otherwise, ":"匹配此字符串的开始； 否则，","The length of the substring in this instance.":"在这种情况下，子字符串的长度。"," is equal to the length of this instance and ":"等于此实例的长度，","The uppercase equivalent of the current string.":"当前字符串等效的大写。"," or an empty array, white-space characters are removed instead. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"或一个空的数组，而是删除白色空间字符。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。","An enumerator that can be used to iterate through the current string.":"可以用来通过当前字符串迭代的枚举器。","A string that is equivalent to the substring that begins at ":"等同于从开始的子字符串的字符串","The string that remains after all white-space characters are removed from the start and end of the current string. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"从当前字符串的开始和结尾删除所有白空间字符后仍保留的字符串。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。","A Unicode character array whose elements are the ":"一个Unicode字符数组，其元素是"," if the value of the current string is ":"如果当前字符串的值为","The string that remains after all white-space characters are removed from the end of the current string. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"从当前字符串的末端删除所有白空间字符后仍保留的字符串。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。"," in this instance, or ":"在这种情况下，或","A Unicode character to remove.":"一个Unicode字符要删除。"," number of characters in this instance starting from character position ":"在这种情况下从字符位置开始的字符数","The character at index 0 in the current ":"电流中的索引0的字符","The string that remains after all occurrences of the ":"在所有发生后仍保留的字符串"," is equal to the length of this instance.":"等于此实例的长度。","The string that remains after all instances of the ":"在所有实例之后仍保留的弦","The type of the returned object.":"返回对象的类型。","A string in lowercase.":"小写的字符串。"," character are removed from the end of the current string. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"字符从当前字符串的末端删除。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。","The number of characters in the substring.":"子弦中的字符数。"," character are removed from the start and end of the current string. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"字符从当前字符串的开始和结尾删除。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。","An object that supplies culture-specific casing rules. If ":"提供特定文化套管规则的对象。 如果","A Unicode character array whose elements are the individual characters of this instance. If this instance is an empty string, the returned array is empty and has a zero length.":"一个Unicode字符数组，其元素是此实例的单个字符。 如果此实例是一个空字符串，则返回的数组为空并且长度为零。"," parameter are removed from the end of the current string. If ":"参数从当前字符串的末端删除。 如果","An array of Unicode characters to remove, or ":"一个unicode字符数组以删除，或","A string to compare to ":"与","The lowercase equivalent of the current string.":"当前字符串等效的小写。"," or an empty array, Unicode white-space characters are removed instead. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"或一个空数组，取消了Unicode白空间字符。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。"," character are removed from the start of the current string. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":" 从当前字符串的开头删除字符。 如果不能从当前实例中修剪任何字符，则该方法将返回当前实例不变。","The string that remains after all occurrences of the characters in the ":"在所有发生字符中所有发生后仍保留的字符串","The current string.":"当前字符串。","A culture whose linguistic rules are used to perform a string comparison.":"一种语言规则的文化用于进行弦比较。","The string that remains after all white-space characters are removed from the start of the current string. If no characters can be trimmed from the current instance, the method returns the current instance unchanged.":"从当前字符串的开头删除所有白空间字符后仍保留的字符串。 如果无法从当前实例中修剪过字符，则该方法将返回当前实例不变。"," to specify that comparison operations be case-insensitive; ":"指定比较操作是对病例敏感的；","The string that remains after all occurrences of characters in the ":"在所有发生字符中所有发生的字符串"," parameter are removed from the start and end of the current string. If ":"参数从当前字符串的开始和结尾删除。 如果","The Unicode character to remove.":"Unicode字符要删除。"," are both the same type of object and those objects are equal, or both ":"都是相同类型的对象，而这些对象是相等的，或者都是"," parameter are removed from the start of the current string. If ":"参数从当前字符串的开头删除。 如果"," to specify that comparison operations be case-sensitive.":"指定比较操作对病例敏感。"," if the data was copied; ":"如果复制数据；","A new string whose textual value is the same as ":"一个新字符串，其文本值与"," if this method returns ":"如果此方法返回"," are equal, or ":"相等，或"," object that performs string comparisons according to the comparison rules used by the ":"根据比较规则进行比较的对象"," parameter and the case rule specified by the ":"参数和案例规则","A string comparer instance to convert.":"转换的字符串比较实例。"," but whose binary representation is in Unicode normalization form C.":"但是其二进制表示为Unicode归一化的形式。"," is a well-known culture-aware string comparer; otherwise, ":"是众所周知的文化意识弦乐比较； 否则，"," if the destination was too short to fit the contents of the string.":" 如果目标太短而不适合字符串的内容。","The Unicode normalization form.":"Unicode归一化形式。","When this method returns, contains a value stating whether ":"当此方法返回时，包含一个值，说明是否"," instance representing the equivalent value of the specified ":"实例表示指定的等效值","A position in the current string.":"当前字符串中的位置。"," parameter and the specified ":" 参数和指定的 "," is case-insensitive. Set to ":"是不敏感的。 调成","The object at position ":"位置的对象"," but whose binary representation is in the ":"但是谁的二进制表示","A 32-bit signed hash code calculated from the value of the ":"根据该值计算的32位签名哈希码"," refer to the same object, or ":"参考同一对象，或"," is a well-known ordinal string comparer; otherwise, ":"是一个众所周知的序弦比较； 否则，","The comparer to query.":"与查询的比较。","The number of characters in the current string.":"当前字符串中的字符数。"," normalization form.":"归一化形式。","A new object for string comparison.":"一个新对象进行字符串比较。","The address of a buffer to store the converted characters.":"缓冲区的地址存储转换后的字符。","When this method returns, contains a value indicating which ":"当此方法返回时，包含一个值，指示哪个"," that were produced by the conversion. This parameter is passed uninitialized.":"是由转换产生的。 该参数通过非初始化。","Omit array elements that contain an empty string from the result.":"省略从结果中包含一个空字符串的数组元素。"," is in normalization form C; otherwise, ":"处于归一化表格C； 否则，","The maximum number of characters in ":"最大字符数","A read-only bytes span containing the sequence to convert.":"仅读取字节跨度包含要转换的序列。"," was used to create ":" 被用来创造 ","Trim white-space characters from each substring in the result. This field is available in .NET 5 and later versions only.":"在结果中从每个子字符串中修剪白空间字符。 该字段仅在.NET 5及更高版本中可用。"," to use in the conversion.":"在转换中使用。"," is in normalization form ":"以归一化形式"," to indicate no further data is to be converted; otherwise, ":"表示没有进一步的数据要转换； 否则，","The actual number of characters written into ":"实际写入的字符数","The address of a buffer that contains the byte sequences to convert.":"包含要转换字节序列的缓冲区的地址。","The span to store the converted characters.":"存储转换后字符的跨度。","The actual number of characters written into the ":"实际写入的字符数",".  \n  \n A return value is defined, although it is unchanging, because this method implements an abstract method.":"。 \n  \n  返回值是定义的，尽管它不变，因为此方法实现了抽象方法。","When this method returns, contains the number of bytes that were produced by the conversion. This parameter is passed uninitialized.":"当此方法返回时，包含转换产生的字节数。 该参数通过非初始化。","The index position in ":"指数位置"," if all the specified characters were converted; otherwise, ":"如果所有指定的字符都被转换为； 否则，","The return value is always zero.  \n  \n A return value is defined, although it is unchanging, because this method implements an abstract method.":"返回值始终为零。 \n  \n  返回值是定义的，尽管它不变，因为此方法实现了抽象方法。","When this method returns, contains the number of characters from ":"当此方法返回时，包含来自","A span to write the resulting set of characters.":"跨度编写由此产生的字符集。"," of the byte that cannot be decoded.":"无法解码的字节。","A pointer to the first byte to decode.":"指向第一个字节解码的指针。","An object that provides a fallback buffer for a decoder.":"为解码器提供后备缓冲区的对象。"," that were used in the conversion. This parameter is passed uninitialized.":"在转换中使用的。 该参数通过非初始化。","The actual number of characters written at the span indicated by the ":"由","The exception that caused this exception.":"引起此例外的例外。","The number of bytes to decode.":"要解码的字节数。"," if all the characters specified by ":"如果所有字符由","A type derived from the ":"从","A decoder fallback buffer that throws an exception when it cannot decode a byte sequence.":"解码器的后备缓冲区在无法解码字节序列时会引发异常。","The input byte array that cannot be decoded.":"无法解码的输入字节数组。"," class. The default value is a ":"班级。 默认值是"," to simulate clearing the internal state of the encoder after the calculation; otherwise, ":"在计算后模拟清除编码器的内部状态； 否则，"," were converted; otherwise, ":"被转换了； 否则，","The index position in the input byte array of the byte that cannot be decoded. The index position is zero-based.":"字节的输入字节阵列中的索引位置无法解码。 索引位置为零。","The number of characters produced by decoding the specified sequence of bytes and any bytes in the internal buffer.":"通过解码内部缓冲区中指定的字节序列和任何字节来产生的字符数。","An object that derives from the ":"从","A byte array to convert.":"一个字节阵列要转换。","The maximum number of characters the current ":"当前字符数量的最大数量","A string that is emitted in a decoding operation in place of an input byte sequence that cannot be decoded.":"在解码操作中排放的字符串代替无法解码的输入字节序列。"," object can return.":"对象可以返回。"," and is a ":"是一个","The byte array containing the sequence of bytes to decode.":"包含字节序列的字节阵列要解码。","The first element of ":"第一个要素"," object that specifies a string to use instead of the original decoding operation input.":"指定字符串而不是原始解码操作输入的对象。","The index of the first byte to decode.":"第一个字节解码的索引。"," object that emits the QUESTION MARK character (\"?\", U+003F) in place of unknown byte sequences.":"发出问号字符（“？”，u+003F）的对象代替未知字节序列。","The return value is always the same arbitrary value, and has no special significance.":"回报值始终是相同的任意值，并且没有特殊意义。"," object having a ":"具有一个","An array to store the converted characters.":"存储转换后字符的数组。","The return value is always zero.":"返回值始终为零。","A byte span to decode.":"一个字节跨度解码。","The index position of a byte in ":"字节在"," in which data is stored.":"存储数据。"," property that is equal to the ":"等于","An input array of bytes.":"一个字节的输入阵列。","A pointer to the location at which to start writing the resulting set of characters.":"指向开始编写最终字符集的位置的指针。"," if the fallback buffer can process ":"如果后备缓冲区可以处理","The maximum number of elements of ":"最大元素数量","The index position of a byte in the input.":"输入中字节的索引位置。"," to clear the internal state of the decoder after the conversion; otherwise, ":"转换后清除解码器的内部状态； 否则，","The hash code of the value of the object.":"对象值的哈希代码。"," to indicate that no further data is to be converted; otherwise, ":"表明没有进一步的数据要转换； 否则，"," if the fallback buffer ignores ":"如果后备缓冲区忽略了","The actual number of characters written at the location indicated by the ":"实际字符数的实际字符数在位置指示的位置","None. No value is returned because the ":"没有任何。 由于","A substitute string that is emitted in place of an input byte sequence that cannot be decoded.":"发射的替代字符串代替无法解码的输入字节序列。","The next character in the fallback buffer.":"后备缓冲区中的下一个角色。","When this method returns, contains the number of bytes that were used in the conversion. This parameter is passed uninitialized.":"当此方法返回时，包含转换中使用的字节数。 该参数通过非初始化。","The character array to contain the resulting set of characters.":"字符阵列包含结果集。","The number of characters in the string that is emitted in place of a byte sequence that cannot be decoded, that is, the length of the string returned by the ":"字符串中的字符数量代替了无法解码的字节序列，即，字符串的长度"," operation was successful; otherwise, ":"操作成功； 否则，"," method always throws an exception.  \n  \n The nominal return value is ":"方法总是会引发异常。 \n  \n  名义回返回值为"," if the replacement string is not empty; ":"如果替换字符串不为空；","The index at which to start writing the resulting set of characters.":"开始编写由此产生的字符集的索引。",". A return value is defined, although it is unchanging, because this method implements an abstract method.":"。 返回值是定义的，尽管它不变，因为此方法实现了抽象方法。","The number of characters in the current fallback buffer that have not yet been processed.":"尚未处理当前后退缓冲区中的字符数量。"," object that contains a replacement string.":"包含替换字符串的对象。","The return value is always the Unicode character NULL (U+0000).  \n  \n A return value is defined, although it is unchanging, because this method implements an abstract method.":"返回值始终是Unicode字符null（U+0000）。 \n  \n  返回值是定义的，尽管它不变，因为此方法实现了抽象方法。","The index of the first character to encode.":"要编码的第一个字符的索引。"," if the replacement string is empty.":"如果替换字符串为空。","An error message.":"错误消息。","An input byte sequence. This parameter is ignored unless an exception is thrown.":"输入字节序列。 除非抛出异常，否则该参数将被忽略。","The return value is always ":"返回值始终","A character span to encode.":"要编码的字符跨度。","The next character in the replacement fallback buffer.":"替换后备缓冲区中的下一个字符。","The input byte array.":"输入字节数组。","The index position of the byte in ":"字节中的索引位置","A pointer to the location at which to start writing the resulting sequence of bytes.":"指向开始编写结果字节序列的位置的指针。","The index position of the character in the input buffer.":"输入缓冲区中字符的索引位置。","The number of characters in the replacement fallback buffer that have not yet been processed.":"尚未处理的替换后回退缓冲区中的字符数量。","An input character. This parameter is ignored in this operation unless an exception is thrown.":"输入字符。 除非抛出异常，否则在此操作中忽略了此参数。",". This parameter is ignored in this operation.":"。 在此操作中忽略了此参数。"," to clear the internal state of the encoder after the conversion; otherwise, ":"转换后清除编码器的内部状态； 否则，","The index position of the character in the input buffer. This parameter is ignored in this operation.":"输入缓冲区中字符的索引位置。 在此操作中忽略了此参数。","The return value is always the Unicode character, NULL (U+0000).  \n  \n A return value is defined, although it is unchanging, because this method implements an abstract method.":"返回值始终是Unicode字符NULL（U+0000）。 \n  \n  返回值是定义的，尽管它不变，因为此方法实现了抽象方法。","The address of a string of UTF-16 encoded characters to convert.":"要转换的UTF-16字符串的字符串的地址。","The next Unicode character in the replacement fallback buffer that the application can encode.":"应用程序可以编码的替换后退回缓冲区中的下一个Unicode字符。"," containing the result of converting a range of bytes in ":"包含转换一系列字节的结果","The actual number of bytes written at the location indicated by the ":"实际数字的字节数在该位置所指示的位置","The address of a buffer to store the converted bytes.":"缓冲区的地址存储转换后的字节。","An object that provides a fallback buffer for an encoder.":"为编码器提供后备缓冲区的对象。","The stream to wrap.":"流的流。","The code page identifier of the preferred encoding.\n\n -or-\n\n 0, to use the default encoding.":"首选编码的代码页标识符。 \n\n  -或者- \n\n  0，使用默认编码。","The maximum number of bytes in ":"最大字节数"," object that replaces unknown input characters with the QUESTION MARK character (\"?\", U+003F).":"用问号字符（“？”，u+003F）代替未知输入字符的对象。","The encoding associated with ":"与","The byte array to contain the resulting sequence of bytes.":"字节阵列包含所得字节的序列。"," if the fallback buffer ignores the surrogate pair.":"如果后备缓冲区忽略了替代对。","The encoding code page identifier.":"编码代码页标识符。","The index at which to start writing the resulting sequence of bytes.":"开始编写结果字节序列的索引。","An array of characters to convert.":"一系列字符要转换。","The encoding associated with the ":"与","An object that provides an error-handling procedure when a character cannot be encoded with the current encoding.":"当字符不能用当前编码编码时，提供错误处理过程的对象。"," if the input was a surrogate pair; otherwise, ":"如果输入是替代对； 否则，","An array where the converted bytes are stored.":"存储转换字节的阵列。","The actual number of bytes written into ":"实际写入的字节数"," that's returned by this method.":"这是通过这种方法返回的。","An object that provides an error-handling procedure when a byte sequence cannot be decoded with the current encoding.":"当一个字节序列无法用当前编码解码时，提供错误处理过程的对象。","The character that cannot be encoded.":"无法编码的字符。","The span of UTF-16 encoded characters to convert.":"UTF-16编码字符的跨度要转换。"," if disposing the ":"如果处置","A byte span to write the resulting sequence of bytes to.":"一个字节跨度以将结果字节的序列写入。","The high component character of the surrogate pair that cannot be encoded.":"无法编码的替代对的高组件特征。","The encoding format of ":"编码格式的","The target encoding format.":"目标编码格式。"," returned by this method should ":"通过此方法返回应该","The span buffer to store the converted bytes.":"跨度缓冲区存储转换后的字节。","An encoder fallback buffer that throws an exception when it cannot encode a character sequence.":"编码器的后备缓冲区在无法编码字符序列时会引发异常。","The low component character of the surrogate pair that cannot be encoded.":"无法编码的替代对的低组件特征。"," dispose ":"处置","The bytes to convert.":"要转换的字节。"," if all the characters in ":"如果所有字符","A stream that transcodes the contents of ":"转码的流"," containing the results of converting ":"包含转换的结果","The index position in the input buffer of the character that cannot be encoded.":"无法编码的字符的输入缓冲区中的索引位置。"," in Visual Basic .NET) and is a ":"在Visual Basic .net中），是","A pointer to the first character to encode.":"指向第一个要编码的字符的指针。","The number of bytes produced by encoding the specified characters.":"通过编码指定字符产生的字节数。","The encoding of the source array, ":"源数组的编码，","The high surrogate of the input pair.":"输入对的高替代物。","A string that is converted in an encoding operation in place of an input character that cannot be encoded.":"在编码操作中转换的字符串代替无法编码的输入字符。","The encoding of the output array.":"输出数组的编码。","The number of characters to encode.":"要编码的字符数。","The character array containing the characters to encode.":"字符数组包含要编码的字符。"," object equal to this ":"对象等于这个","The low surrogate of the input pair.":"输入对的低替代物。","The number of bytes produced by encoding the specified characters and any characters in the internal buffer.":"通过编码指定字符和内部缓冲区中的任何字符而产生的字节数。","The array of bytes to convert.":"要转换的字节数组。","The number of bytes produced by encoding all the characters in the specified character array.":"通过编码指定字符数组中的所有字符而产生的字节数。","The index position of the surrogate pair in the input buffer.":"输入缓冲区中替代对的索引位置。"," parameter specifies an ":"参数指定an"," method always throws an exception.":"方法总是会引发异常。","The span of characters to encode.":"要编码的字符跨度。","The index of the first element of ":"第一个元素的索引","The character array containing the set of characters to encode.":"包含要编码的字符集的字符数组。","An input character.":"输入字符。"," object and the replacement string of that object is equal to the replacement string of this ":"对象和该对象的替换字符串等于此对象的替换字符串","The number of bytes to convert.":"要转换的字节数。","The number of bytes produced by encoding the specified character span.":"通过编码指定的字符跨度产生的字节数。","A byte array containing the results of encoding the specified set of characters.":"一个字节数组，其中包含编码指定字符集的结果。","A substitute string that is used in place of an input character that cannot be encoded.":"用于代替无法编码的输入字符的替代字符串。",".\n\n -or-\n\n 0 (zero), to use the default encoding.":"。 \n\n  -或者- \n\n  0（零），使用默认编码。","The span containing the set of characters to encode.":"包含要编码的字符集的跨度。"," object is always normalized using the specified ":"对象始终使用指定的","The string containing the set of characters to encode.":"包含要编码的字符集的字符串。","The number of characters in the string used in place of an input character that cannot be encoded.":"字符串中使用的字符数代替无法编码的输入字符。","The encoding that is associated with the specified code page.":"与指定代码页面关联的编码。","The number of bytes produced by encoding the string.":"通过编码字符串产生的字节数。","A subclass of ":"一个子类"," can be used by mail and news clients for displaying content; otherwise, ":"可以由邮件和新闻客户使用以显示内容； 否则，","The byte span to hold the encoded bytes.":"字节跨度包含编码字节。","The code page name of the preferred encoding. Any value returned by the ":"首选编码的代码页名称。 由","The human-readable description of the encoding.":"编码的人类可读描述。"," that provides access to additional character encodings.":"这提供了对其他字符编码的访问。","The number of encoded bytes.":"编码字节的数量。"," can be used by mail and news clients for saving content; otherwise, ":"可以由邮件和新闻客户使用来保存内容； 否则，","The IANA name for the encoding.":"编码的IANA名称。"," property is valid. For a list of possible values, see ":"属性有效。 对于可能的值列表，请参阅"," uses single-byte code points; otherwise, ":"使用单字节代码点； 否则，","An  encoding for the ASCII (7-bit) character set.":"ASCII（7位）字符集的编码。","The string containing the characters to encode.":"包含要编码的字符的字符串。","The encoding associated with the specified code page.":"与指定代码页面关联的编码。","The code page identifier of the requested encoding.":"所请求的编码的代码页标识符。","A byte span containing a sequence of bytes that specifies the encoding used, or a span of length zero, if a preamble is not required.":"一个字节跨度包含一个字节序列，该字节指定所使用的编码，或长度为零的序列，如果不需要序言。","The index inside the string to start the encoding from.":"字符串中的索引从从编码开始。","An encoding object for the UTF-16 format that uses the big endian byte order.":"使用Big Endian字节顺序的UTF-16格式的编码对象。","The encoding that is associated with the specified code page, or ":"与指定代码页面相关联的编码"," property is valid. Possible values are listed in the Name column of the table that appears in the ":"属性有效。 可能的值在表中出现的表的名称列中列出","An encoding for the UTF-16 format using the little endian byte order.":"使用Little Endian字节订单为UTF-16格式编码。","A name for the current ":"当前名称","The number of characters produced by decoding the specified sequence of bytes.":"通过解码指定的字节序列产生的字符数。","An  encoding object for the UTF-32 format using the little endian byte order.":"使用Little Endian字节顺序的UTF-32格式编码对象。"," cannot return a valid encoding that corresponds to ":"无法返回对应于"," class topic.":"课程主题。","An object that provides an error-handling procedure when a character cannot be encoded with this encoding.":"当无法用此编码对字符编码时，提供错误处理过程的对象。"," that can be used with mail agent body tags.\n\n -or-\n\n An empty string (\"\"), if the current ":"可以与邮件代理的身体标签一起使用。 \n\n  -或者- \n\n  一个空字符串（“”），如果当前","A read-only byte span to decode.":"仅读取字节跨度进行解码。","An encoding for the UTF-7 format.":"UTF-7格式的编码。","An array that contains all encodings.":"包含所有编码的数组。"," cannot be used.":"不能使用。","The number of characters produced by decoding the byte span.":"通过解码字节跨度产生的字符数。","An object that provides an error-handling procedure when a byte sequence cannot be decoded with this encoding.":"当该编码无法解码字节序列时，提供错误处理过程的对象。","An encoding for the UTF-8 format.":"UTF-8格式的编码。","The maximum number of bytes produced by encoding the specified number of characters.":"通过编码指定的字符数来产生的最大字节数。","The code page identifier of the current ":"当前的代码页标识符","A character array containing the results of decoding the specified sequence of bytes.":"一个字符阵列，其中包含解码指定字节序列的结果。","The IANA name for the current ":"当前的IANA名称","A read-only span containing the sequence of bytes to decode.":"一个仅读取的跨度，其中包含字节的序列进行解码。","The maximum number of characters produced by decoding the specified number of bytes.":"通过解码指定的字节数来产生的最大字符数。","The name of the requested encoding.":"请求编码的名称。","The decoder fallback object for the current ":"当前的解码器后备对象","The Windows operating system code page that most closely corresponds to the current ":"Windows操作系统代码页面最紧密地对应于当前","The character span receiving the decoded bytes.":"字符跨度接收解码字节。","The encoding that is associated with the specified name, or ":"与指定名称关联的编码，或","A byte array containing a sequence of bytes that specifies the encoding used.\n\n -or-\n\n A byte array of length zero, if a preamble is not required.":"一个字节阵列包含一个字节序列，该字节指定所使用的编码。 \n\n  -或者- \n\n  长度为零的字节阵列，如果不需要序言。","The provider that created this ":"创建这个的提供商","The default encoding for this .NET implementation.":"此.NET实现的默认编码。","The number of decoded bytes.":"解码字节的数量。","A pointer to a byte array.":"指向字节数组的指针。","The name of the preferred encoding.":"首选编码的名称。","The encoding codepage.":"编码编码。"," that converts an encoded sequence of bytes into a sequence of characters.":"这将一个编码的字节序列转换为字符序列。","The encoder fallback object for the current ":"当前的编码器后备对象","An array that contains all the supported encodings.":"包含所有受支持的编码的数组。","A string that contains the results of decoding the specified sequence of bytes.":"包含解码指定字节序列的结果的字符串。"," that converts a sequence of Unicode characters into an encoded sequence of bytes.":"这将一个Unicode字符的序列转换为编码的字节序列。","The encoding name.":"编码名称。","The human-readable description of the current ":"当前的人类可读描述","A UTF-16 code unit.":"UTF-16代码单元。","The code page identifier of the preferred encoding. For a list of possible values, see ":"首选编码的代码页标识符。 对于可能的值列表，请参阅"," to use with mail agent header tags.\n\n -or-\n\n An empty string (\"\"), if the current ":"与邮件代理标头标签一起使用。 \n\n  -或者- \n\n  一个空字符串（“”），如果当前","The encoding display name.":"编码显示名称。","A read-only byte span to decode to a Unicode string.":"仅读取字节跨度将其解码为Unicode字符串。","- Less than zero: This instance precedes ":" - 小于零：此实例先于","The high surrogate of the surrogate pair.":"代理人对的高替代物。"," can be used by browser clients for displaying content; otherwise, ":"浏览器客户端可以用于显示内容； 否则，",". \n":"。"," object that corresponds to the current ":"对应于当前的对象","A string that contains the decoded bytes from the provided read-only span.":"一个包含来自提供的仅读取跨度的解码字节的字符串。","The low surrogate of the surrogate pair.":"代理对的低替代物。"," can be used by browser clients for saving content; otherwise, ":"浏览器客户端可以用于保存内容； 否则，","- Zero: The instance has the same position in the sort order as ":" - 零：实例在排序顺序中具有相同的位置","The code page identifier of the encoding.":"编码的代码页标识符。"," is always normalized; otherwise, ":"总是归一化； 否则，",".\n":"。","The numeric value associated with ":"与之关联的数字值","The instance to compare with the current instance.":"与当前实例进行比较的实例。","The zero-based index from which to extract the rune.":"从中提取符文的零索引。","The read-only character memory region to append.":"仅读取字符存储区域要附加。","- Greater than zero: This instance follows ":" - 大于零：此实例遵循","A signed integer indicating the position of this instance in the sort order in relation to ":"一个签名的整数，指示此实例的位置，以相对于排序顺序",", or -1 if ":"，或-1如果"," if a scalar value was successfully extracted from the specified index; ":"如果从指定索引成功提取标量值；","A reference to this instance after the append operation is completed.":"附录操作完成后，对此实例的引用。"," doesn't represent a numeric character.":"不代表数字字符。","A read-only UTF-16 character span.":"仅读取的UTF-16字符跨度。","An enumerator for the chunks in the ":"枚举","The string from which to create the rune.":"创建符文的字符串。","The read-only character span to append.":"仅读取字符跨度要附加。"," if a value could not be extracted because of invalid data.":"如果由于无效的数据而无法提取值。","The position in this instance where insertion begins.":"在这种情况下，插入开始的位置。","When this method returns, the decoded rune.":"当此方法返回时，解码的符文。"," if the scalar value associated is within the ASCII encoding range ([ U+0000..U+007F ]) and therefore representable by a single UTF-8 code unit; otherwise, ":"如果关联的标量值在ASCII编码范围内（[U+0000..U+007F]），则可以由单个UTF-8代码单元表示； 否则，","The string to append.":"要附加的字符串。"," at which to create the rune.":"在其中创建符文。","A reference to this instance after the insert operation has completed.":"插入操作完成后对此实例的引用。","When this method returns, the number of characters read to create the rune.":"当此方法返回时，读取的字符数以创建符文。"," if the scalar value associated is within the BMP encoding range ([ U+0000..U+FFFF ]) and therefore representable by a single UTF-16 code unit; otherwise, ":"如果关联的标量值在BMP编码范围内（[U+0000..U+FFFF]），则可以由单个UTF-16代码单元表示； 否则，","The character array to insert.":"角色阵列要插入。","The string that contains the substring to append.":"包含要附加的子字符串的字符串。"," if the source buffer begins with a valid UTF-16 encoded scalar value. ":"如果源缓冲区以有效的UTF-16编码标量值开始。","The rune obtained from ":"符文从"," to append.":"附加。","The Unicode plane (0 to 16, inclusive) that contains this scalar.":"包含此标量的Unicode平面（0至16，包含在内）。","The starting index within ":"内部的起始索引"," then contains the decoded ":"然后包含解码"," at the specified ":"在指定"," instance that represents the Unicode replacement character U+FFFD.":"代表Unicode替换字符u+fffd的实例。","The string builder to append.":"字符串构建器要附加。","The number of characters to insert.":"要插入的字符数。","The rune for which to get the Unicode category.":"获得Unicode类别的符文。"," contains the number of ":"包含数量","The string builder that contains the substring to append.":"包含要附加的子字符串的字符串构建器。","The length in code units (":"代码单元的长度（","The object to insert, or ":"插入的对象，或","The Unicode category associated with ":"与之关联的Unicode类别"," values used in the input buffer to encode the ":"输入缓冲区中使用的值用于编码","A reference to this instance after the append operation has completed. After the append operation, this instance contains any data that existed before the operation, suffixed by a copy of ":"附录操作完成后，对此实例的引用。 附加操作后，此实例包含操作前存在的任何数据，由",") of the UTF-16 sequence required to represent this scalar value.":"表示表示标量值所需的UTF-16序列。",".\n            \n":"。","The character span to insert.":"要插入的字符跨度。","The rune to evaluate.":"符文评估。","The length in code units of the UTF-8 sequence required to represent this scalar value.":"表示表示标量值所需的UTF-8序列的代码单元的长度。"," is an uppercase letter; otherwise,":"是一封大写字母； 否则，","The number of times to insert ":"插入的次数"," in which any format specification is replaced by the string representation of ":"其中任何格式规范被字符串表示代替"," if the source buffer is empty or contains only a standalone UTF-16 high surrogate character. ":"如果源缓冲区为空或仅包含独立的UTF-16高替代字符。","The Unicode scalar value as an integer.":"Unicode标量值作为整数。","The Unicode scalar value.":"Unicode标量值。"," then contains ":"然后包含"," where any format specification is replaced by the string representation of the corresponding object argument.":"其中任何格式规范被相应对象参数的字符串表示代替。","A reference to this instance after insertion has completed.":"插入完成后对此实例的引用。","The suggested starting size of this instance.":"建议的起始大小。"," contains the length of the input buffer.\n            \n":"包含输入缓冲区的长度。","The zero-based position in this instance where removal begins.":"在这种情况下，基于零的位置开始删除。"," is a valid Unicode scalar value; otherwise, ":" 是有效的Unicode标量值；否则, ","An array of objects to format.":"一系列要格式化的对象。"," if the source buffer begins with an ill-formed UTF-16 encoded scalar value. ":"如果源缓冲区以不形式的UTF-16编码标量值开始。","The suggested starting size of the ":"建议的起始大小","The number of characters to remove.":"要删除的字符数。"," is a white space character; otherwise, ":"是一个白空间角色； 否则，","A reference to this instance with ":"对此实例的引用"," values used to encode the ill-formed sequence.\n          .":"用于编码错误序列的值。 \n           。","The maximum number of characters the current string can contain.":"当前字符串可以包含的最大字符数。","The 16-bit Unicode character to convert.":"要转换的16位Unicode字符。","A reference to this instance after the excise operation has completed.":"消费税操作完成后对此实例的引用。"," appended. Each format item in ":"附加。 每个格式项目","The string used to initialize the value of the instance. If ":"字符串用于初始化实例的值。 如果","A read-only UTF-8 encoded byte span.":"仅读取的UTF-8编码字节跨度。","The character to replace.":"要替换的角色。"," is replaced by the string representation of ":"被字符串表示代替"," will contain the empty string (that is, it contains ":"将包含空字符串（即，它包含","When this method returns, the number of bytes read to create the rune.":"当此方法返回时，读取以创建符文的字节数。"," as a 32-bit Unicode character.":" 作为32位Unicode字符。","The character that replaces ":"取代的角色"," is replaced by the string representation of the corresponding object argument.":"被对应对象参数的字符串表示代替。","The string that contains the substring used to initialize the value of this instance. If ":"包含用于初始化此实例值的子字符串的字符串。 如果"," if the source buffer begins with a valid UTF-8 encoded scalar value. ":"如果源缓冲区以有效的UTF-8编码标量值开始。","the second value to compare.":"比较的第二个值。","The format to use.   \n -or-   \n":"要使用的格式。 \n  -或者-"," is included in the joined strings only if ":"仅在加入字符串中包括","The position within ":"内部的位置"," replaced by ":"取而代之"," if the source buffer is empty or contains only a standalone UTF-8 high surrogate character. ":"如果源缓冲区为空或仅包含独立的UTF-8高替代字符。","The provider to use to format the value.   \n -or-   \n":"用于格式化值的提供商。 \n  -或者-","An array that contains the strings to concatenate and append to the current instance of the string builder.":"一个包含串联并附加到字符串构建器的当前实例的字符串的数组。","The position in this instance where the substring begins.":"在这种情况下，基因开始。"," if the source buffer begins with an ill-formed UTF-8 encoded scalar value. ":"如果源缓冲区以不正确的UTF-8编码标量值开始。"," where the substring begins.":"子字符串开始的位置。","When this method returns, contains this instance's value formatted as a span of characters.":"当此方法返回时，包含此实例的值格式为一个字符的跨度。"," values used in the input buffer to encode the ill-formed sequence.\n          .":"在输入缓冲区中使用的值编码错误的序列。 \n           。"," is included in the concatenated and appended strings only if ":" 仅在以下情况下才包含在串联和追加的字符串中 ","The length of the substring.":"子字符串的长度。","The 32-bit Unicode character to convert.":"要转换的32位Unicode字符。","The Boolean value to append.":"布尔值附加的价值。","A read-only UTF-16 encoded character span.":"仅读取的UTF-16编码字符跨度。","A collection that contains the objects to concatenate and append to the current instance of the string builder.":"包含对象连接并附加到字符串构建器的当前实例的集合。","A reference to this instance after the append operation has completed.":"附录操作完成后，对此实例的引用。"," in the range from ":"从","The string representation of this rune.":"此符文的字符串表示。"," is 0 (zero).":"为0（零）。"," -1.":"-1。","The value to append.":"附加的价值。"," if the source buffer ends with a valid UTF-8 encoded scalar value. ":"如果源缓冲区以有效的UTF-8编码标量值结束。","The string to replace.":"替换的字符串。","The rune that corresponds to the specified surrogate pair.":"对应于指定的替代对的符文。","The starting position in this instance where characters will be copied from. The index is zero-based.":"在此实例中，将从中复制字符的起始位置。 该索引基于零。"," if the source buffer ends with an ill-formed UTF-8 encoded scalar value. ":"如果源缓冲区以不正确的UTF-8编码标量值结束。","The UTF-16-encoded code unit to append.":"UTF-16编码的代码单元以附加。"," if the operation succeeded; ":"如果操作成功；","The string that replaces ":"替换的字符串"," values used in the input buffer to encode the ill-formed sequence.":"在输入缓冲区中使用的值编码错误的序列。","The array where characters will be copied.":"将复制字符的数组。","The buffer to which to write this value as UTF-16.":"将此值写入UTF-16的缓冲区。","A reference to this instance with all instances of ":"对此实例的引用，所有实例","A pointer to an array of characters.":"指向一系列字符的指针。"," if the input values don't represent a well-formed UTF-16 surrogate pair.":"如果输入值不代表良好的UTF-16替代对。"," where characters will be copied. The index is zero-based.":"角色将被复制的地方。 该索引基于零。","The number of characters in the array.":"数组中的字符数。","The number of characters to be copied.":"要复制的字符数。","The character from which to create the rune.":"创建符文的角色。"," values written to ":"写入的值","A string whose value is the same as this instance.":"一个与此实例相同的字符串。","The character to append.":"要附加的角色。","The writable span where characters will be copied.":"将复制字符的可写跨度。","When this method returns, the rune that corresponds to ":"当此方法返回时，符文对应于","The number of times to append ":"附加的次数","The buffer to which to write this value as UTF-8.":"将此值写入UTF-8的缓冲区。","The buffer to which to write this value as UTF-16 encoded value.":"将此值写入UTF-16编码值的缓冲区。","The character span to compare with the current instance.":"与当前实例进行比较的字符跨度。","The starting position of the substring in this instance.":"子字符串在此实例中的起始位置。","The rune for which to get the numeric value.":"获得数值的符文。","The array of characters to append.":"要附加的字符数组。"," if the characters in this instance and ":"如果在这种情况下的字符，并且",", or 0 if the destination buffer is not large enough to contain the output.":"，或0如果目标缓冲区不足以包含输出。","The minimum number of characters that should be written for this value.  If the value is negative, it indicates left-aligned and the required minimum is the absolute value.":"为此值编写的字符数量最少。 如果该值为负，则表示左对准，所需的最小值是绝对值。","A character array.":"角色阵列。","A string whose value is the same as the specified substring of this instance.":"一个值与此实例的指定子字符串相同的字符串。"," are the same; otherwise, ":"是相同的; 否则，","The minimum number of characters that should be written for this value. If the value is negative, it indicates left-aligned and the required minimum is the absolute value.":"为此值编写的字符数量最少。 如果该值为负，则表示左对准，所需的最小值是绝对值。"," if the value was written to the buffer; otherwise, ":"如果该值写入缓冲区； 否则，","The number of characters to append.":"要附加的字符数。"," if this instance and ":"如果此实例和","The maximum number of characters that can be contained in the memory allocated by the current instance. Its value can range from ":"当前实例分配的内存中可以包含的最大字符数。 它的价值可以从","An enumerator object that can be used to iterate through the chunks.":"可以用来通过块迭代的枚举对象。","The buffer to which to write the UTF-8 encoded value.":"写入UTF-8编码值的缓冲区。","The interpolated string to append.":"插值字符串要附加。","The position of the character.":"角色的位置。","The chunk at the current position of the collection.":"集合当前位置的块。"," have equal string, ":"具有相等的字符串","The string from which to extract the rune.":"从中提取符文的字符串。","The object to append.":"要附加的对象。"," values; otherwise, ":"值； 否则，","The Unicode character at position ":"位置的Unicode字符"," is canceled.":"被取消。"," if the end of the string has been reached.":" 如果已经到达字符串的末尾。"," if cancellation has been requested for this ":"如果已要求取消","The length of this instance.":"此实例的长度。","An object representing data to be used by the continuation action.":"代表持续操作要使用的数据的对象。"," instance that can be used to unregister the callback.":"可以用来取消回调的实例。","A UTF-16 encoded read-only character span.":"UTF-16编码的仅读取字符跨度。","The maximum number of characters this instance can hold.":"该实例可以保留的最大字符数。","The time interval in milliseconds between invocations of the callback.":"回调调用之间的毫秒间隔。","A new continuation task.":"一项新的延续任务。","A value that indicates whether to capture the current ":"指示是否捕获电流的值","A UTF-8 encoded byte span.":"UTF-8编码字节跨度。","The associated StringBuilder to which to append.":"相关的弦乐程序要附加。"," for cancelling the asynchronous wait. If cancellation is requested, it affects only the single wait operation; the underlying timer continues firing.":"取消异步等待。 如果请求取消，则仅影响单个等待操作； 基础计时器继续开火。","An action to run when the ":"当","When the method returns, the number of characters read from ":"当方法返回时，字符的数量从"," and use it when invoking the ":"并在调用","A task that will be completed due to the timer firing, ":"由于计时器启动而将完成的任务，","An awaiter instance.":"等待的实例。","The state to pass to the ":"传递给"," completes. When run, the delegate will be passed the completed task and the caller-supplied state object as arguments.":"完成。 运行时，代表将通过已完成的任务和呼叫者供应状态对象作为参数传递。","When the method returns, the number of bytes written to ":"当方法返回时，字节的数量写入"," being called to stop the timer, or cancellation being requested.":"被要求停止计时器或已要求取消。","The work to execute asynchronously.":"执行异步的工作。"," that will be assigned to the new continuation task.":"这将分配给新的延续任务。"," when the delegate is invoked.  This may be ":"当召唤代表时。 这可能是"," to replace invalid UTF-16 sequences in ":"替换无效的UTF-16序列","A task that represents the work queued to execute in the ThreadPool.":"代表在ThreadPool中执行的工作的任务。","The target scheduler on which this pair should execute.":"该对应执行的目标调度程序。"," when the delegate is invoked. This may be null.":"当召唤代表时。 这可能是无效的。","A new continuation ":"一个新的延续"," with U+FFFD; ":"使用U+FFFD;","A cancellation token that can be used to cancel the work if it has not yet started. ":"如果尚未启动，则可以用来取消工作的取消令牌。","A Boolean value that indicates whether to capture the current ":"布尔值，指示是否捕获当前","The maximum number of tasks to run concurrently.":"要同时运行的最大任务数。"," completes. When run, the delegate will be  passed the completed task and the caller-supplied state object as arguments.":"完成。 运行时，代表将通过已完成的任务和呼叫者供应状态对象作为参数传递。"," does not pass ":"不通过"," if invalid characters are found in ":"如果在","The maximum number of tasks to process for each underlying scheduled task used by the pair.":"该对使用的每个基础计划任务要处理的最大任务数量。"," if the method should not return ":"如果该方法不应返回","The delegate to execute when the ":"当","A task that represents the work queued to execute in the thread pool.":"代表在线程池中执行的工作的任务。","Options for when the continuation is scheduled and how it behaves. This includes criteria, such as ":"何时安排延续及其行为方式的选项。 这包括标准，例如","The asynchronous operation that will complete when the scheduler finishes processing.":"调度程序完成处理时将完成的异步操作。","An object that can \n            be used to unregister the callback.":"一个可以 \n             被用来取消回调。","A value that indicates that status of the conversion.":"指示转换状态的值。","An object that can be used to schedule tasks concurrently.":"可以同时安排任务的对象。",", as well as execution options, such as ":"，以及执行选项，例如","A task that represents a proxy for the task returned by ":"代表代理任务的任务","An object that can be used to schedule tasks that do not run concurrently with other tasks.":"可以用于安排与其他任务同时运行的任务的对象。","A UTF-8 encoded read-only byte span.":"UTF-8编码的仅读取字节跨度。","A task object that represents the work queued to execute in the thread pool.":"代表在线程池中执行的工作的任务对象。"," if this token is capable of being in the canceled state; otherwise, ":"如果这个令牌能够处于取消状态； 否则，"," to associate with the continuation task and to use for its  execution.":"与延续任务相关联并用于执行。","A UTF-16 encoded character span.":"UTF-16编码字符跨度。"," completes.  When run, the delegate will be  passed the completed task and the caller-supplied state object as arguments.":"完成。 运行时，代表将通过已完成的任务和呼叫者供应状态对象作为参数传递。"," if cancellation has been requested for this token; otherwise, ":"如果已要求取消该令牌； 否则，","An opaque value that was provided to the ":"提供给 ","When the method returns, the number of bytes read from ":"当方法返回时，从"," to associate with the continuation task and to use for its execution.":"与延续任务相关联并用于执行。"," that represents the work queued to execute in the thread pool.":" 它表示在线程池中排队执行的工作。","An empty cancellation token.":"一个空取消令牌。","Opaque value that was provided to the ":"提供给的不透明价值"," completes. When run, the delegate will be passed the completed task as an argument.":"完成。 运行时，代表将作为一个参数将完成的任务传递。","When the method returns, the number of characters written to ":"当方法返回时，字符的数量写入"," that represents a proxy for the ":"这代表了代理","'s constructor.":"的构造函数。"," that is signaled when the token is canceled.":"当令牌被取消时，这会发出信号。"," to replace invalid UTF-8 sequences in ":"替换无效的UTF-8序列","An action to run according to the specified ":"根据指定的行动"," returned by ":"返回","The status of the current operation.":"当前操作的状态。",". When run, the delegate will be passed the completed task as an argument.":"。 运行时，代表将作为一个参数将完成的任务传递。","The other object to which to compare this instance.":"与此实例进行比较的另一个对象。","A value that indicates the status of the conversion.":"表示转换状态的值。","A function to run when the ":"当","The scheduler on which to attempt to run this task inline.":"试图在此任务中运行此任务的调度程序。","The continuation to invoke when the operation has completed.":"操作完成后延续。","The canceled state for the token.":"令牌取消状态。"," if both this and ":"如果这两个都","A function to run according to the specified ":"根据指定的功能"," with which to associate and execute this task.":"与之关联和执行此任务。"," when it's invoked.":"当被调用时。"," When run, the delegate will be passed the completed task as an argument.":"运行时，代表将作为一个参数将完成的任务传递。","The other object to compare with this instance.":"与此实例进行比较的另一个对象。"," are equal. False, otherwise.  \n  \n Two ":"相等。 错误，否则。 \n  \n  二","The number of milliseconds to wait, or ":"等待的毫秒数或","The flags describing the behavior of the continuation.":"描述延续行为的旗帜。"," and if the two instances are equal; otherwise, ":"如果两个实例相等； 否则，","A function to run according to the condition specified in ":"根据指定条件运行的功能"," instances are equal if they both refer to the output of a single call to the same Register method of a ":"如果实例都将单个调用的输出引用到同一寄存器方法"," completed execution within the allotted time; otherwise, ":"在分配的时间内完成执行； 否则，",". See the Remarks section for more information.":"。 有关更多信息，请参见备注部分。","A value that indicates the status of the current operation.":"表示当前操作状态的值。"," to which to compare this instance.":"与此实例进行比较。","The other ":"另一个","An object representing data to be used by the continuation function.":"代表持续功能要使用的数据的对象。"," instances on which to wait.":"等待的实例。"," to compare with this instance.":"与此实例进行比较。","The result of the operation.":"操作的结果。","The number of milliseconds to wait before completing the returned task, or -1 to wait indefinitely.":"在完成返回的任务之前等待的毫秒数，或-1无限期等待。"," if the method succeeds; otherwise, ":" 如果方法成功；否则, "," if all of the ":"如果全部"," if the instances are equal; otherwise, ":"如果实例相等； 否则，","A task that represents the time delay.":"代表时间延迟的任务。","A value that indicates the status of the operation.":"指示操作状态的值。"," instances completed execution within the allotted time; otherwise, ":"实例在分配的时间内完成执行； 否则，","The cancellation token with which this registration is associated, or a default token if the\n            registration isn't associated with a token.":"与此注册关联的取消令牌或默认令牌如果是 \n             注册与令牌无关。","A cancellation token to observe while waiting for the task to complete.":"在等待任务完成时观察的取消令牌。","The first instance.":"第一个实例。","The result.":"结果。","The time interval in milliseconds to wait before canceling this ":"毫秒的时间间隔等待，然后取消此"," to observe while waiting for the tasks to complete.":"在等待任务完成时观察。","The time span to wait before completing the returned task, or ":"在完成返回任务之前等待的时间跨度，或","The index of the completed ":"已完成的索引","The second instance.":"第二个实例。","The time interval to wait before canceling this ":"等待之前等待的时间间隔"," to force continuations to run asynchronously; otherwise, ":"迫使连续不同步； 否则，"," to wait indefinitely.":"无限期地等待。"," See the Remarks section for more information.":"有关更多信息，请参见备注部分。"," object in the ":"对象","The operation version.":"操作版本。"," if the instances are not equal; otherwise, ":"如果实例不相等； 否则，","A Boolean value that indicates whether this method is being called due to a call to ":"一个布尔值，指示该方法是否因调用而被调用"," if exceptions should immediately propagate; otherwise, ":"如果例外应该立即传播； 否则，","The index of the completed task in the ":"完成任务的索引","The delegate that represents the code to execute in the task.":"代表在任务中执行的代码的委托。","The cancellation token with which to complete the task.":"可以完成任务的取消令牌。","The time span to wait before canceling this ":"等待之前等待的时间跨度","The delegate to be executed when the ":"当"," array argument, or -1 if the timeout occurred.":"数组参数，或-1如果超时发生。"," that the new  task will observe.":"新任务将观察到。","The canceled task.":"取消任务。","The cancellation token to observe.":"取消令牌要观察。","A task that represents the completion of one of the supplied tasks.  The return task's Result is the task that completed.":"代表完成的任务之一的任务。 返回任务的结果是完成的任务。"," to observe while waiting for a task to complete.":"在等待任务完成时观察。"," that the new task will observe.":"新任务将观察到。","The exception with which to complete the task.":"完成任务的例外。","An object that's linked to the source token.":"链接到源令牌的对象。"," array argument.":"数组参数。","The first task to wait on for completion.":"等待完成的第一个任务。","The faulted task.":"故障任务。"," used to customize the task's behavior.":"用于自定义任务的行为。"," to monitor for a cancellation request.":"监视取消请求。","The second task to wait on for completion.":"等待完成的第二个任务。","The first cancellation token to observe.":"第一个取消令牌要观察。","The result to store into the completed task.":"将存储到完成的任务中的结果。","An object representing data to be used by the action.":"代表操作要使用的数据的对象。","A new task that represents the completion of one of the supplied tasks. Its ":"一项代表完成的任务之一的新任务。 它的"," representing the asynchronous wait. It may or may not be the same instance as the current instance.":"代表异步等待。 它可能与当前实例可能不是相同的实例。","The second cancellation token to observe.":"第二取消令牌要观察。"," is the task that completed first.":"是首先完成的任务。"," to attempt to marshal the continuation back to the original context captured; otherwise, ":"试图将延续回到捕获的原始上下文中； 否则，","The successfully completed task.":"成功完成的任务。"," that is linked to the source tokens.":"这链接到源代币。","The timeout after which the ":"之后的超时","A task that represents the completion of one of the supplied tasks. The returned task's ":"代表完成的任务之一的任务。 返回的任务的","An action to run when the antecedent ":"先决条件时要进行的行动","An object used to await this task.":"用于等待此任务的对象。","An array that contains the cancellation token instances to observe.":"一个包含取消令牌实例的阵列。","An action to run when the task completes. When run, the delegate is passed the completed task and a caller-supplied state object as arguments.":"任务完成时要进行的操作。 运行时，代表通过完成的任务和呼叫者供应状态对象作为参数。","A context that, when awaited, will asynchronously transition back into the current context at the time of the await. If the current ":"等待的上下文将在等待时会异步过渡到当前上下文。 如果电流"," should be faulted with a ":"应该有过错"," completes. When run, the delegate is passed the completed task as an argument.":"完成。 运行时，代表将通过完成任务作为参数。"," has not had cancellation requested and could have its state reset to be reused for a subsequent operation; otherwise, ":"尚未取消要求，并且可以重新设置其状态以进行后续操作； 否则，"," that will be assigned to tasks created by this ":"这将分配给由此创建的任务","The second argument passed to the ":"第二个论点传给了","The cancellation token that is passed to the new continuation task.":"传递给新连续任务的取消令牌。"," if it hasn't otherwise completed.":"如果尚未完成。"," is non-null, it is treated as the current context. Otherwise, the task scheduler that is associated with the currently executing task is treated as the current context.":"是非记，它被视为当前上下文。 否则，将与当前执行任务关联的任务调度程序视为当前上下文。","An action to run according the condition specified in ":"根据指定条件进行的操作"," unless another CancellationToken is explicitly specified while calling the factory methods.":"除非在调用工厂方法时明确指定另一个取消词。","The third argument passed to the ":"第三个论点传给了","The tasks to wait on for completion.":"等待完成的任务。"," that represents the state data that was passed in to the task when it was created.":"这代表了创建任务时传递给任务的状态数据。"," to use when creating tasks with this TaskFactory.":"使用此TaskFactory创建任务时使用。","An action to according the condition specified in ":"根据指定条件的行动","The action delegate to execute asynchronously.":"动作委托执行异步。"," to use when creating continuation tasks with this TaskFactory.":"使用此任务执行时使用连续任务时使用。"," used to create this task.":"用于创建此任务。","A task that represents the completion of all of the supplied tasks.":"代表所有提供的任务完成的任务。","The started task.":"开始任务。","A function to run according the condition specified in ":"根据指定条件运行的功能","An integer that was assigned by the system to the currently-executing task.":"该系统分配给当前执行任务的整数。"," to use to schedule any Tasks created with this TaskFactory. A null value indicates that TaskScheduler.Current should be used.":"用于安排此任务创建的任何任务。 null值表示应使用taskscheduler.current。","The started ":"开始"," that caused the ":"那引起了","The cancellation token that will be assigned to the new task.":"将分配给新任务的取消令牌。",".  \n  \n When run, the delegate will be passed as an argument this completed task.":"。 \n  \n  运行时，代表将作为参数通过此完成任务的参数。",".  \n  \n When run, the delegate will be passed the completed task as an argument.":"。 \n  \n  运行时，代表将作为一个参数将完成的任务传递。","An object that contains data to be used by the ":"一个包含要使用的数据的对象"," to use to schedule any tasks created with this TaskFactory. A null value indicates that the current TaskScheduler should be used.":"用于安排此任务创建的任何任务。 零值表示应使用当前任务。"," to end prematurely.":"过早结束。","One of the enumeration values that controls the behavior of the created task.":"控制创建任务的行为的枚举值之一。","The default cancellation token for this task factory.":"该任务工厂的默认取消令牌。","The result value of this ":"结果值","A factory object that can create a variety of ":"可以创建各种各样的工厂对象","The array of tasks from which to continue.":"继续从中继续进行的任务。","The task scheduler that is used to schedule the created task.":"用于安排创建任务的任务调度程序。",", which is of the same type as the task's type parameter.":"，与任务类型参数相同。","One of the enumeration values that specifies the default continuation options for this task factory.":"指定此任务工厂的默认连续性选项的枚举值之一。","The identifier that is assigned by the system to this ":"系统分配给此的标识符","The action delegate to execute when all tasks in the ":"当所有任务在","The source async disposable.":"来源异步一次性。","One of the enumeration values that specifies the default creation options for this task factory.":"指定此任务工厂的默认创建选项的枚举值之一。","A function delegate that returns the future result to be available through the task.":"函数委托返回未来结果，可以通过任务可用。"," if the task has completed due to being canceled; otherwise ":"如果该任务因被取消而完成； 否则"," array have completed.":"阵列已经完成。","The task scheduler for this task factory.":"该任务工厂的任务调度程序。","The default task cancellation token for this task factory.":"该任务工厂的默认任务取消令牌。","The configured async disposable.":"配置的异步一次性。"," if the task has completed (that is, the task is in one of the three final states: ":"如果任务已经完成（也就是说，任务是在三个最终状态之一中：","The new continuation task.":"新的延续任务。","The default task continuation options for this task factory.":"此任务工厂的默认任务连续选项。"," associated with the current ":"与电流相关联","The source enumerable to iterate.":"迭代的来源。","The cancellation token to assign to the new continuation task.":"取消令牌分配给新的连续任务。"," if the task ran to completion; otherwise ":"如果任务运行到完成； 否则","The default task creation options for this task factory.":"此任务工厂的默认任务创建选项。",", as determined by ":"，由","A bitwise combination of the enumeration values that control the behavior of the new continuation task.":"控制新连续任务行为的枚举值的比重组合。","The cancellation token that triggered the cancellation.":"触发取消的取消令牌。"," if the task has thrown an unhandled exception; otherwise ":"如果任务抛出了一个未手持的例外； 否则","The default task scheduler for this task factory.":"此任务工厂的默认任务调度程序。","An enumerable that allows a debugger to traverse the tasks currently queued to this scheduler.":"一个枚举，允许调试器可以穿越当前排队到该调度程序的任务。","The object that is used to schedule the new continuation task.":"用于安排新连续任务的对象。","A task that has been canceled.":"已取消的任务。","The default cancellation token that will be assigned to tasks created by this ":"默认取消令牌将分配给由此创建的任务"," to be queued.":"排队。"," of this task instance.":"此任务实例。"," that is associated with this exception.":"这与此例外有关。","A bitwise combination of the enumeration values that control the behavior of the new continuation task. The NotOn and OnlyOn members are not supported.":"控制新连续任务行为的枚举值的比重组合。 不支持Noton和Onlyon成员。"," to be dequeued.":"被脱水。"," unless another cancellation token is explicitly specified when calling the factory methods.":"除非在调用工厂方法时明确指定另一个取消令牌。"," that can be used to wait for the task to complete.":"可以用来等待任务完成。","The default options to use when creating tasks with this ":"与此创建任务时要使用的默认选项","A Boolean denoting whether the ":"布尔值表示是否","The function delegate to execute asynchronously when all tasks in the ":"当所有任务在","The state to use as the underlying ":"用作基础的国家"," if the operation completed synchronously; otherwise, ":"如果操作同步完成； 否则，"," argument was successfully dequeued.":"争论被成功地脱水。","'s ":"'","The default options to use when creating continuation tasks with this ":"在此创建继续任务时要使用的默认选项","The array of tasks from which to continue when one task completes.":"一项任务完成后可以继续的任务数组。","The delegate that represents the code to execute in the task. When the function has completed, the task's ":"代表在任务中执行的代码的委托。 功能完成后，任务的"," object to be executed.":"要执行的对象。","The options to use when creating the underlying ":"创建基础时要使用的选项","The action delegate to execute when one task in the ":"操作委托在一个任务中执行","The default scheduler to use to schedule any tasks created with this ":"默认调度程序用于安排与此创建的任何任务","The cancellation token with which to cancel the ":"取消的取消令牌"," property will be set to return the result value of the function.":"属性将设置为返回函数的结果值。","A Boolean that is true if ":"如果是真实的布尔人",". A null value indicates that ":"。 零值表示"," array completes.":"阵列完成。"," was successfully executed, false if it was not. A common reason for execution failure is that the task had previously been executed or is in the process of being executed by another thread.":"成功执行，如果不是，则为错误。 执行故障的一个常见原因是该任务先前已执行或正在由另一线程执行。"," to be assigned to this task.":"分配给此任务。","The collection of exceptions to bind to this ":"与此绑定的例外集合","The new continuation ":"新的延续"," should be used.":"应该使用。"," to be executed.":"被执行。"," that will be assigned to the new task.":"这将分配给新任务。","The exception to bind to this ":"与此结合的例外","The scheduler to use to schedule any tasks created with this ":"用于安排此使用的任何任务的调度程序"," value that controls the behavior of the created continuation ":"控制创建延续的行为的价值"," if the operation was successful; otherwise, ":"如果操作成功； 否则，","A Boolean denoting whether or not task has previously been queued. If this parameter is True, then the task may have been previously queued (scheduled); if False, then the task is known not to have been queued, and this call is being made in order to execute the task inline without queuing it.":"布尔值表示是否已排队。 如果此参数为true，则该任务可能已经排队（计划）； 如果为false，则已知任务不会排队，并且正在拨打此调用，以便在不排队的情况下执行任务。","An object representing data to be used by the function.":"代表函数要使用的数据的对象。",". A null value indicates that the current ":"。 零值表示当前"," that is used to schedule the created continuation ":"用于安排创建的延续"," to be assigned to the new task.":"被分配给新任务。","A Boolean value indicating whether the task was executed inline.":"布尔值表示该任务是否是内联执行的。","The cancellation token that will be assigned to the new continuation task.":"将分配给新连续任务的取消令牌。","'s AsyncState.":"Asyncstate。","The function delegate to execute asynchronously when one task in the ":"函数委派将在一个任务中执行异步","true to attempt to marshal the continuation back to the original context captured; otherwise, false.":"确实试图将延续回到原始上下文捕获； 否则，错误。","One of the enumeration values that controls the behavior of the created continuation task. The ":"控制创建的延续任务行为的枚举价值之一。 这","The result value to bind to this ":"结合到此的结果值"," associated with the currently executing task.":"与当前执行任务相关联。","The delegate that begins the asynchronous operation.":"开始异步操作的代表。","Returns the default ":"返回默认值"," if the operation was successful; false if the operation was unsuccessful or the object has already been disposed.":"如果操作成功； 错误，如果操作不成功或对象已经被处置。"," completes. When run, the delegate is   passed the completed task and the caller-supplied state object as arguments.":"完成。 运行时，代表通过完成的任务和呼叫者供应状态对象作为参数。"," values are not valid.":"值无效。"," created by this ":"由此创建","The delegate that ends the asynchronous operation.":"结束异步操作的代表。","Returns the unique ID for this ":"为此返回唯一的ID",", as  well as execution options, such as ":"，以及执行选项，例如","The scheduler that is used to schedule the created continuation task.":"用于安排创建的连续任务的调度程序。"," (C#) or ":"（C＃）或","An object containing data to be used by the ":"一个包含要使用的数据的对象","Options for when the continuation is scheduled and how it behaves. This includes criteria, such  as ":"何时安排延续及其行为方式的选项。 这包括标准，例如","The task scheduler that is used to schedule the created continuation task.":"用于安排创建的连续任务的任务调度程序。","Returns an integer that represents the maximum concurrency level. The default scheduler returns ":"返回代表最大并发级别的整数。 默认调度程序返回"," that represents the asynchronous operation.":"这代表异步操作。"," (Visual Basic) to unwrap.":"（Visual Basic）拆开。","The Exception that has gone unobserved.":"未观察到的例外。"," to attempt to marshal the continuation back to the captured context; otherwise, ":"试图将继续延续到被捕获的环境中； 否则，","The created task that represents the asynchronous operation.":"代表异步操作的创建任务。","A Task that represents the asynchronous operation of the provided ":"表示所提供的异步操作的任务","The TaskCreationOptions value that controls the behavior of the created ":"控制创建的行为的TaskCreationOptions值","The configured awaiter.":"配置的等待者。","The Exception that went unobserved.":"没有观察到的例外。"," whose completion should trigger the processing of the ":"其完成应触发处理","true if this exception has been marked as \"observed\"; otherwise false.":"如果此例外被标记为“观察到”，则为是真的； 否则错误。","The IAsyncResult whose completion should trigger the processing of the ":"完成的iAsyncresult将触发处理"," that represents the asynchronous operation of the provided ":"这代表了所提供的异步操作","A task that represents the asynchronous operation.":"代表异步操作的任务。","The hash code for the current object.":"当前对象的哈希代码。","An object that represents the operation.":"代表操作的对象。"," (Visual Basic).":"（Visual Basic）。","The action delegate that processes the completed ":"处理已完成的行动委托"," values are equal; otherwise, ":"值相等； 否则，","The task scheduler that is used to schedule the task that executes the end method.":"用于安排执行结束方法的任务的任务调度程序。"," that is used to schedule the task that executes the end method.":"这用于安排执行最终方法的任务。","An opaque value that is passed through to the ":"不透明的价值传递给","The first argument passed to the ":"第一个论点传给了","An object that controls the behavior of the created ":"控制创建行为的对象"," values are not equal; otherwise, ":"值不相等； 否则，","The task that represents the operation.":"代表操作的任务。","An object that controls the behavior of the created task.":"控制创建任务行为的对象。","The function delegate that processes the completed ":"处理已完成的功能委托","The preserved ":"保存"," object that is wrapped in this ":"包裹的对象"," if this object represents a canceled operation; otherwise, ":"如果此对象表示取消操作； 否则，"," if one exists, or a new ":"如果存在，或一个新的"," if this object represents a completed operation; otherwise, ":"如果此对象表示完整的操作； 否则，"," object that represents the result.":"代表结果的对象。"," if this object represents a successfully completed operation; otherwise, ":"如果此对象代表成功完成的操作； 否则，"," if this object represents a failed operation; otherwise, ":"如果此对象表示失败的操作； 否则，","The source.":"来源。","An opaque value that is passed to the ":"传递给的不透明价值","The task.":"任务。","A task object for future use.":"未来使用的任务对象。"," delegate representing a method to be executed.":"代表要执行的方法的委托。","An object containing information to be used by the callback method, or ":"一个包含回调方法要使用的信息的对象，或","The amount of time to delay before ":"延迟之前的时间"," is invoked, in milliseconds. Specify ":"以毫秒为单位调用。 指定"," to prevent the timer from starting. Specify zero (0) to start the timer immediately.":"防止计时器启动。 指定零（0）立即启动计时器。","The time interval between invocations of ":"召唤之间的时间间隔",", in milliseconds. Specify ":"，以毫秒为单位。 指定"," to disable periodic signaling.":"禁用周期性信号。","A delegate representing a method to be executed.":"代表要执行的方法的委托。","The amount of time to delay before the ":"延迟之前的时间"," is invoked. Specify ":"被调用。 指定"," to prevent the timer from starting. Specify ":"防止计时器启动。 指定"," to start the timer immediately.":"立即启动计时器。",". Specify ":"。 指定","The amount of time to delay before the invoking the callback method specified when the ":"在调用回调方法之前延迟的时间"," was constructed, in milliseconds. Specify ":"以毫秒为单位建造。 指定"," to prevent the timer from restarting. Specify zero (0) to restart the timer immediately.":"防止计时器重新启动。 指定零（0）立即重新启动计时器。","The time interval between invocations of the callback method specified when the ":"指定回调方法调用之间的时间间隔"," if the timer was successfully updated; otherwise, ":"如果计时器成功更新； 否则，"," to prevent the timer from restarting. Specify zero (0) to restart the timer immediately.  This value must be less than or equal to 4294967294.":"防止计时器重新启动。 指定零（0）立即重新启动计时器。 该值必须小于或等于4294967294。"," representing the amount of time to delay before invoking the callback method specified when the ":"表示在调用回调方法之前指定的延迟时间的量"," was constructed. Specify ":"被建造。 指定"," to prevent the timer from restarting. Specify ":"防止计时器重新启动。 指定"," to restart the timer immediately.":"立即重新启动计时器。"," to be signaled when the ":"当"," has been disposed of.":"已经处置了。"," if the function succeeds; otherwise, ":"如果功能成功； 否则，"," that completes when all work associated with the timer has ceased.":"当与计时器相关联的所有工作都停止时，这将完成。","The number of timers that are currently active.":"当前活动的计时器数量。","An object containing application-specific information relevant to the method invoked by this delegate, or ":"包含与该委托所调用的方法相关的针对应用程序的对象，或"," to signal.":"发出信号。"," to wait on.":"等待。"," if both the signal and the wait complete successfully; if the wait does not complete, the method does not return.":"如果信号和等待成功完成； 如果等待未完成，则该方法不会返回。","An integer that represents the interval to wait. If the value is ":"代表等待间隔的整数。 如果值为",", that is, -1, the wait is infinite.":"，即-1，等待是无限的。"," to exit the synchronization domain for the context before the wait (if in a synchronized context), and reacquire it afterward; otherwise, ":"在等待之前退出上下文的同步域（如果在同步上下文中），然后重新征召； 否则，"," if both the signal and the wait completed successfully, or ":"如果信号和等待成功完成，或者"," if the signal completed but the wait timed out.":"如果信号完成了，但等待时间就计时了。"," that represents the interval to wait. If the value is -1, the wait is infinite.":"这代表了等待的间隔。 如果值为-1，则等待是无限的。"," array containing the objects for which the current instance will wait. This array cannot contain multiple references to the same object.":"包含当前实例等待的对象的数组。 此数组不能包含对同一对象的多个引用。"," when every element in ":"当每个元素中的每个元素"}