{" value that specifies the total number of incoming packets with an unknown protocol.":"用未知协议指定传入数据包的总数。"," value that specifies the total number of discarded incoming packets.":"指定丢弃传入数据包的总数。"," value that specifies the total number of bytes that were received on the interface.":"指定接口上接收到的字节总数的值。"," value that specifies the total number of bytes that were transmitted on the interface.":"指定在接口上传输的字节总数的值。"," value that specifies the total number of incoming packets with errors.":"值指定带有错误的传入数据包的总数。"," value that specifies the total number of non-unicast packets that were received on the interface.":"指定接口上接收到的非unicast数据包的总数。"," value that specifies the total number of discarded outgoing packets.":"指定丢弃的外包数据包的总数。"," value that specifies the total number of non-unicast packets that were sent on the interface.":"指定在接口上发送的非unicast数据包的总数。"," value that specifies the total number of outgoing packets with errors.":"值指定带有错误的传出数据包的总数。"," value that specifies the maximum length of the output queue in packets.":"值指定数据包中输出队列的最大长度。"," value that specifies the total number of unicast packets that were sent on the interface.":"指定在接口上发送的单播数据包的总数。","The scope level.":"范围级别。"," value that specifies the total number of unicast packets that were received on the interface.":"指定接口上收到的单播数据包的总数。","The scope ID of the network interface associated with an IPv6 address.":"与IPv6地址关联的网络接口的范围ID。"," value that specifies the number of seconds left for this address to remain preferred.":"指定该地址剩余的秒数的值保持优先。"," value that contains the index of the network interface for IPv6 address.":"包含IPv6地址网络接口的索引的值。"," object exists in the collection; otherwise, ":"集合中存在对象； 否则，"," value that contains the number of seconds remaining before the computer must release the ":"包含计算机必须发布之前剩余秒数的值"," values that identifies how the prefix information was obtained.":"标识如何获得前缀信息的值。"," if the network is available; otherwise, ":"如果网络可用； 否则，"," value that specifies the number of seconds left for this address to remain assigned.":"指定该地址剩余的秒数的值。"," object that contains data about the event.":"包含有关事件的数据的对象。"," values that identifies how the suffix information was obtained.":"标识如何获得后缀信息的值。"," values that indicates the progress of the algorithm in determining the uniqueness of this IP address.":"指示算法在确定此IP地址的唯一性时的进展的值。","The instance to register.":"要注册的实例。","A StreamingContext that contains contextual information about the serialized exception.":"包含有关序列化异常的上下文信息的流媒体。"," error code.":"错误代码。"," array that contains objects that describe the available network interfaces, or an empty array if no interfaces are detected.":"包含描述可用网络接口的对象的数组，或者如果未检测到接口，则为空数组。"," value that contains the ":"包含的值","The IP statistics.":"IP统计。"," object that contains the physical address.":"包含物理地址的对象。"," object that describes this network interface.":"描述此网络接口的对象。","A SerializationInfo object that contains the serialized exception data.":"包含序列化异常数据的序列化对象。"," if a network connection is available; otherwise, ":"如果有网络连接可用； 否则，"," if the specified protocol is supported; otherwise, ":"如果支持指定的协议； 否则，"," that describes this interface.":"描述了这个接口。"," that contains the index for the IPv4 loopback interface.":"其中包含IPv4环回接口的索引。","The index for the IPv6 loopback interface.":"IPv6环回接口的索引。"," value that specifies the network interface type.":"指定网络接口类型的值。"," if the interface receives multicast packets; otherwise, ":"如果接口接收多播数据包； 否则，"," that contains the adapter name.":"其中包含适配器名称。"," that contains the identifier.":"其中包含标识符。"," if the interface only receives network traffic; otherwise, ":"如果接口仅接收网络流量； 否则，"," to compare to the current instance.":"与当前实例进行比较。"," array containing the address.":"包含地址的数组。"," instance with the specified address.":"带有指定地址的实例。"," value that specifies the speed in bits per second.":"值指定速度每秒的速度。",", if the conversion succeeded, or ":"，如果转换成功或"," if this instance and the specified instance contain the same address; otherwise ":"如果此实例和指定的实例包含相同的地址； 否则","A string containing the address that will be used to initialize the ":"一个包含将用于初始化的地址的字符串"," containing the address that will be used to initialize the ":"包含将用于初始化的地址"," if the conversion failed. This parameter is passed uninitialized; any value originally supplied in ":"如果转换失败。 该参数通过非初始化； 最初提供的任何价值"," instance that contains the IP address and port on the local computer.":"实例包含本地计算机上的IP地址和端口。"," if the conversion failed. If the ":"如果转换失败。 如果是"," will be overwritten.":"将被覆盖。","A span containing the address that will be used to initialize the ":"一个包含用于初始化的地址的跨度"," containing the address contained in this instance.":"包含本例中包含的地址。"," instance that contains the IP address and port on the remote computer.":"远程计算机上包含IP地址和端口的实例。"," was converted successfully; otherwise, ":"成功转换了； 否则，"," it contains ":"它包含"," instance returned by this method.":"实例通过此方法返回。"," enumeration values.":"枚举值。",". This parameter is passed uninitialized; any value originally supplied in ":"。 该参数通过非初始化； 最初提供的任何价值"," instance equivalent of the address contained in ":"实例等于所包含的地址"," value that specifies the total number of TCP connections initiated by clients.":"指定客户端发起的TCP连接总数的值。"," value that specifies the total number of failed TCP connection attempts.":"指定失败的TCP连接尝试的总数。"," value that specifies the total number of reset TCP connections.":"指定重置TCP连接总数的值。"," value that specifies the total number of TCP connection requests accepted.":"指定接受的TCP连接请求总数的值。"," value that specifies the total number of TCP segments sent.":"指定发送的TCP段的总数。"," value that specifies the total number of TCP connections that can be supported.":"指定可以支持的TCP连接总数的值。"," value that specifies the total number of connections established.":"指定建立的连接总数的值。"," value that specifies the total number of TCP segments sent with the reset flag set.":"指定带有重置标志集的TCP段的总数。"," value that specifies the total number of datagrams that were delivered to UDP users.":"指定交付给UDP用户的数据报的总数。"," value that specifies the total number of received UDP datagrams that could not be delivered for reasons other than the lack of an application at the destination port.":"指定已接收到的UDP数据报的总数，除了在目标端口缺少应用程序以外，无法交付的值。"," value that specifies the total number of current TCP connections.":"指定当前TCP连接总数的值。"," value that specifies the maximum number of milliseconds permitted by a TCP implementation for the retransmission time-out value.":"指定TCP实现允许的最大数量的毫秒数，用于重新加入超时值。"," value that specifies the total number of TCP segments received.":"指定收到的TCP段总数的值。"," value that specifies the total number of datagrams that were sent.":"指定发送的数据报的总数。"," value that specifies the total number of TCP errors received.":"指定收到的TCP错误总数的值。"," value that specifies the total number of sockets that are listening for UDP datagrams.":"指定正在侦听UDP数据报的插座的总数。"," value that specifies the minimum number of milliseconds permitted by a TCP implementation for the retransmission time-out value.":"指定TCP实现允许的最小数量的毫秒数量，用于重新启动超时值。"," value that specifies the total number of TCP segments retransmitted.":"指定重传的TCP段的总数。"," value that specifies the total number of received UDP datagrams that were discarded because there was no listening application at the destination port.":"指定被丢弃的UDP数据报的总数，因为目标端口没有听力应用程序。"," object that contains event data.":"包含事件数据的对象。"," object that contains the IPv4 mask.":"包含IPv4掩码的对象。","An IP address that identifies the computer that is the destination for the ICMP echo message.":"标识ICMP回声消息目的地的计算机的IP地址。"," object used to control fragmentation and Time-to-Live values for the ICMP echo message packet.":"用于控制ICMP回声消息包的片段和寿命值的对象。"," object that provides information about the ICMP echo reply message if one was received, or provides the reason for the failure if no message was received.":"如果收到一张消息，则提供有关ICMP回声回复消息的信息，或者如果未收到消息，则提供故障的原因。"," that identifies the computer that is the destination for the ICMP echo message.":"这标识了ICMP回波消息目的地的计算机。","The length, in bits, of the prefix or network part of the IP address.":"IP地址的前缀或网络部分的长度。","The maximum number of milliseconds (after sending the echo message) to wait for the ICMP echo reply message.":"最大数量的毫秒数（发送回声消息后）等待ICMP回声回复消息。"," that identifies the computer that is the destination for the ICMP echo message. The value specified for this parameter can be a host name or a string representation of an IP address.":"这标识了ICMP回波消息目的地的计算机。 该参数指定的值可以是主机名或IP地址的字符串表示。"," object that provides information about the ICMP echo reply message, if one was received, or describes the reason for the failure if no message was received.":"提供有关ICMP回声答复消息的信息，如果收到了一条消息，或者说明未收到消息的故障原因。"," array that contains data to be sent with the ICMP echo message and returned in the ICMP echo reply message. The array cannot contain more than 65,500 bytes.":"包含与ICMP回波消息一起发送的数据的数组，并在ICMP回声回复消息中返回。 阵列不能包含超过65,500个字节。","The source of the ":"的来源","The computer that is the destination for the ICMP echo message. The value specified for this parameter can be a host name or a string representation of an IP address.":"是ICMP回波消息目的地的计算机。 该参数指定的值可以是主机名或IP地址的字符串表示。"," object that provides information about the ICMP echo reply message, if one was received, or provides the reason for the failure, if no message was received.":"提供有关ICMP回声答复消息的信息，如果收到了一条或提供故障的原因，则如果未收到任何消息。"," object that provides information about the ICMP echo reply message, if one was received, or provides the reason for the failure, if no message was received. The method will return ":"提供有关ICMP回声答复消息的信息，如果收到了一条或提供故障的原因，则如果未收到任何消息。 该方法将返回"," value that specifies the maximum number of milliseconds (after sending the echo message) to wait for the ICMP echo reply message.":"指定最大数量的毫秒数（在发送回声消息之后）等待ICMP回声回复消息。"," object that describes the results of the ICMP echo request.":"描述ICMP回波请求结果的对象。"," event.":"事件。","An object that is passed to the method invoked when the asynchronous operation completes.":"当异步操作完成时，将传递给调用方法的对象。","The exception that causes the current exception.":"导致当前异常的例外。"," if the packet exceeds the Maximum Transmission Unit (MTU).":"如果数据包超过最大传输单元（MTU）。"," that specifies the contextual information about the source or destination for this serialization.":"这指定了有关此序列化的源或目的地的上下文信息。"," array containing the data received in an ICMP echo reply message, or an empty array, if no reply was received.":"如果未收到回复，则包含ICMP回声回复消息或空数组中收到的数据的数组。"," has been received from.":"已收到。",": equal sign, semicolon, comma, newline (\\n), return (\\r), tab (\\t), and space character. The dollar sign character (\"$\") cannot be the first character.":"：均等符号，分号，逗号，newline（\\ n），return（\\ r），tab（\\ t）和空格字符。 美元符号字符（“ $”）不能是第一个字符。"," that describes the error.":"描述了错误。"," value greater than zero that specifies the number of times that the ":"值大于指定次数的零次数","A reference to a ":"提及"," object that contains the Time to Live (TTL) and the fragmentation directive used for transmitting the reply if ":"包含生存时间（TTL）和用于传输答复的碎片指令的对象","The value of a ":"一个值"," data packets can be forwarded.":"数据包可以转发。"," object that is suitable for including in a HTTP Cookie: request header.":"适用于HTTP cookie中的对象：请求标头。",". Two ":"。 二"," that specifies the round trip time, in milliseconds.":"这说明了往返时间，以毫秒为单位。","An optional comment to document intended usage for this ":"可选的评论来记录此预期用法"," to prevent data sent to the remote host from being fragmented; otherwise, ":"以防止发送到遥控器的数据被分散； 否则，",": semicolon, comma.":"：samicolon，逗号。"," value indicating the result of the request.":"表示请求结果的值。"," instances are equal if their ":"如果他们的实例是平等的"," that specifies the cache behavior for resources obtained using ":"这指定了使用的资源的缓存行为","An optional comment that represents the intended usage of the URI reference for this ":"一个可选的评论，代表了URI参考的预期用法","The subset of URIs on the origin server to which this ":"URI在原始服务器上的子集"," if the data cannot be sent in multiple packets; otherwise ":"如果数据不能以多个数据包发送； 否则"," properties are equal. ":"属性相等。"," applies. The default value is \"/\".":"适用。 默认值为“/”。",". The value must conform to URI format.":"。 该值必须符合URI格式。"," for this instance.":"对于此情况。"," value that specifies the number of times the ":"指定次数的值"," string comparisons are case-insensitive.":"字符串比较是不敏感的。"," object. The following characters must not be used inside ":"目的。 不得在内部使用以下字符"," if the client is to discard the ":"如果客户要丢弃"," value that specifies the cache behavior for resources obtained using ":"指定使用资源的缓存行为的值"," data packets can be forwarded. The default is 128.":"数据包可以转发。 默认值为128。","The 32-bit signed integer hash code for this instance.":"此实例的32位签名整数哈希代码。",". The following characters must not be used inside ":"。 不得在内部使用以下字符","The optional internet domain for which this ":"这是可选的互联网域","Returns a string representation of this ":"返回此字符串表示"," containing the destination for the ICMP echo message.":"包含ICMP回波消息的目的地。"," at the end of the current session; otherwise, ":"在当前会议结束时； 否则，"," has expired; otherwise, ":"已过期; 否则，"," applies to.":"适用于。","The target array to which the ":"目标阵列"," is valid. The default value is the host this ":"已验证。 默认值是主机","The URI for which the ":"为之"," will be copied.":"将被复制。"," if the client is only to return the cookie in subsequent requests if those requests use Secure Hypertext Transfer Protocol (HTTPS); otherwise, ":"如果客户仅在后续请求中返回cookie，则这些请求使用安全的超文本传输协议（HTTPS）； 否则，","The expiration date and time for the ":"到期日期和时间"," is valid.":"已验证。"," is thread safe; otherwise, ":"线程安全； 否则，","The zero-based index in the target array where copying begins.":"零基于零的索引在其中复制开始。","The time when the cookie was issued as a ":"饼干发行的时间"," as a ":"作为一个","The maximum size in bytes for any single ":"任何单个字节的最大大小","The target ":"目标"," to be found.":"要找到。","The version of HTTP state maintenance to which the cookie conforms.":"Cookie符合的HTTP状态维护版本。"," in a ":"在一个"," array to which the ":"阵列","Boolean value that determines whether a page script or other active content can access this cookie.":"确定页面脚本或其他活动内容是否可以访问此cookie的布尔值。"," with a specific index from a ":"带有来自"," to be added to a ":"要添加到","The name for the ":"名字"," with a specific name from a ":"带有一个来自","The cookie to remove from the ":"从"," to be added to the ":"要添加到"," to be added.":"要添加。","The number of cookies contained in a ":"cookie的数量","The URIs to which the ":"乌里斯","An object to synchronize access to the ":"一个对象同步访问对","The URI of the ":"乌里"," applies.":"适用。"," if this is a read-only ":"如果这是只读的","The cookie to locate in the ":"要定位的饼干"," instances that the ":"实例"," that contains all of the ":"其中包含所有","The list of TCP ports that the ":"TCP端口列表"," instances delimited by semicolons.":"实例由分号界定。"," if the specified cookie is found in the ":"如果在"," can hold.":"能把持住。"," instances in the container.":"容器中的实例。","The maximum allowed length, in bytes, of a ":"a的最大允许长度"," instances that are associated with a specific URI.":"与特定URI相关的实例。"," instances per domain.":"每个域的实例。"," instances desired.":"实例需要。"," that specifies the URI prefix of the resources that the credential grants access to.":"这指定了凭证赠款访问的资源的URI前缀。"," instances that are allowed per domain.":"每个域允许的实例。","The contents of an HTTP set-cookie header as returned by a HTTP server, with ":"HTTP服务器返回的HTTP Set-Cookie标头的内容，","The object that holds the serialized object data. The ":"保存序列化对象数据的对象。 这","The authentication scheme used by the resource named in ":"所指定的资源使用的身份验证方案","The port number associated with the address, or 0 to specify any available port. ":"与地址关联的端口号，或0指定任何可用端口。","An HTTP cookie header, with strings representing ":"HTTP Cookie标头，带有代表的字符串","The contextual information about the source or destination. A ":"有关源或目的地的上下文信息。 一个"," instances delimited by commas.":"逗号界定的实例。"," or, if there is no matching credential in the cache, ":"或者，如果缓存中没有匹配的凭据"," instances that a ":"实例"," is in host order.":"按主机顺序。"," instance that contains the endpoint information.":"包含端点信息的实例。"," that identifies the host computer.":"这可以标识主机计算机。"," that specifies the URI prefix of the resources that the credential is used for.":"这指定了凭据所使用的资源的URI前缀。","An integer hash value for the ":"整数哈希值"," can hold. This is a hard limit and cannot be exceeded by adding a ":"能把持住。 这是一个硬限制，不能通过添加一个"," that the client is providing authentication for.":"客户正在提供身份验证。"," that specifies the port to connect to on ":"指定要连接到ON的端口","The authentication scheme used by the host named in ":"主机使用的身份验证方案","A string containing the address family, host name or IP address string, and the port number of the specified ":"一个包含地址家族，主机名或IP地址字符串的字符串以及指定的端口号","The type of authentication, as defined in the ":"身份验证的类型，如"," currently holds. This is the total of ":"目前持有。 这是总的"," that identifies the authentication scheme used when connecting to ":"该确定连接到的身份验证方案"," instances in all domains.":"所有域中的实例。","A host name or string representation of an IP address.":"IP地址的主机名或字符串表示。"," that represents the system credentials of the application.":"这代表了应用程序的系统凭据。"," that is associated with the specified URI and authentication type, or, if no credentials are available, ":"与指定的URI和身份验证类型相关联，或者，如果没有凭据可用，"," to add to the credential cache.":"添加到凭证缓存。","An integer value in the range 0 to 0xffff indicating the port number of the ":"范围0至0xFFFF中的整数值指示该端口号的端口号"," for the specified host, port, and authentication protocol, or ":"对于指定的主机，端口和身份验证协议或"," that represents the network credentials of the current user or application.":"这代表当前用户或应用程序的网络凭据。","The host computer that is authenticating the client.":"正在验证客户端的主机计算机。","A short value, expressed in host byte order.":"以主机字节顺序表示的短价值。","The socket address that serves as the endpoint for a connection.":"作为连接端点的套接字地址。","The port on ":"端口打开"," if there are no credentials available for the specified host, port, and authentication protocol.":"如果没有用于指定主机，端口和身份验证协议的凭据。","The host name or a string representation of the IP address.":"IP地址的主机名或字符串表示。"," that the client will communicate with.":"客户将与之通信。","An integer value, expressed in host byte order.":"以主机字节顺序表示的整数值。"," instance that is initialized from the specified ":"实例是从指定的","The byte array value of the IP address.":"IP地址的字节数组值。"," for IPv4 or ":"对于IPv4或","A long value, expressed in host byte order.":"长度值，以主机字节顺序表示。","The authentication protocol.":"身份验证协议。","The long value of the scope identifier.":"示波器标识符的长度值。"," for IPv6.":"对于IPv6。"," instance containing the socket address for the endpoint.":"实例包含端点的套接字地址。","The converted IP address.":"转换后的IP地址。","The host computer that authenticates the client.":"验证客户端的主机计算机。"," if the IP address is an IPv4-mapped IPv6 address; otherwise, ":"如果IP地址是IPv4映射的IPv6地址； 否则，","The long value of the IP address. For example, the value 0x2414188f in big-endian format would be the IP address \"143.24.20.36\".":"IP地址的长度值。 例如，大端格式的值0x2414188F将是IP地址“ 143.24.20.36”。","A string containing the IP address and the port number of the specified endpoint (for example, 192.168.1.2:80).":"一个包含IP地址的字符串和指定端点的端口号（例如，192.168.1.2：80）。","A string that contains an IP address in dotted-quad notation for IPv4 and in colon-hexadecimal notation for IPv6.":"一个字符串，其中包含IPv4的虚线符号中的IP地址以及IPv6的Colon-HexAdecimal符号中的字符串。","The port on the ":"端口","The byte representation of the IP address, in network byte order, with the most significant byte first in index position 0.":"IP地址的字节表示，网络字节顺序，最重要的字节在索引位置0中。"," if the IP address is an IPv6 link local address; otherwise, ":"如果IP地址是IPv6链接本地地址； 否则，","A string that contains the IP address in either IPv4 dotted-quad or in IPv6 colon-hexadecimal notation.":"在IPv4点Quad或IPv6结肠hexadecimal符号中包含IP地址的字符串。"," if the IP address is an IPv6 multicast global address; otherwise, ":"如果IP地址是IPv6多播全局地址； 否则，","The byte span value of the IP address.":"IP地址的字节跨度值。"," that the client communicates with.":" 客户端与之通信。","When this method returns, the IP address as a span of characters.":"当此方法返回时，IP地址作为字符的跨度。"," if the two addresses are equal; otherwise, ":"如果两个地址相等； 否则，","The IP endpoint to validate.":"要验证的IP端点。","The type of authentication requested, as defined in the ":"所请求的身份验证类型，如"," if the IP address is an IPv6 site local address; otherwise, ":" 如果IP地址是IPv6站点本地地址；否则, ","When this method returns, the number of characters written into the span.":"当此方法返回时，写入跨度的字符数。","The number to convert, expressed in host byte order.":"要转换的数字，以主机字节顺序表示。"," version of ":"版本的"," if the IP address is an IPv6 Teredo address; otherwise, ":"如果IP地址是IPv6 TEREDO地址； 否则，","The URI that the client provides authentication for.":"客户端提供身份验证的URI。"," if the formatting was successful; otherwise, ":"如果格式成功； 否则，","A short value, expressed in network byte order.":"短价值，在网络字节顺序中表示。","A long integer that specifies the scope of the address.":"一个长整数，指定地址范围。"," can be parsed as an IP endpoint; otherwise, ":" 可以解析为IP端点；否则, ","The name of the domain associated with the credentials.":"与凭据关联的域名。","When this method returns, the ":"当此方法返回时","An integer value, expressed in network byte order.":"一个整数值，以网络字节顺序表示。","The password associated with the credentials. If this ":"与凭据关联的密码。 如果这","The IP address of the Internet host. For example, the value 0x2414188f in big-endian format would be the IP address \"143.24.20.36\".":"互联网主机的IP地址。 例如，大端格式的值0x2414188f将是IP地址\"143.24.20.36\"。"," version of the byte span.":"字节跨度的版本。"," instance containing the IP address of the endpoint.":"包含端点的IP地址的实例。","A long value, expressed in network byte order.":"在网络字节顺序中表达的长价值。","The port number associated with the ":"与"," instance was initialized with the ":"实例是用"," is the loopback address; otherwise, ":"是回环地址； 否则，","An integer value in the range ":"范围内的整数值"," was able to be parsed as an IP address; otherwise, ":"能够被解析为IP地址； 否则，",", or 0 to specify any available port. ":"，或0指定任何可用端口。"," parameter set to ":"参数设置为",".  \n  \n An IPv4 address.":"。 \n  \n  IPv4地址。"," indicating the port number of the endpoint.":"指示端点的端口号。","When this method returns, the IP address as a span of bytes.":"当此方法返回时，IP地址作为字节的跨度。",", then the ":"，然后"," to use for the endpoint.":"用于端点。"," that specifies the requested Internet resource.":"这指定了请求的互联网资源。",".  \n  \n An IPv6 address.":"。 \n  \n  IPv6地址。"," property will return an empty string.":"属性将返回一个空字符串。","When this method returns, the number of bytes written into the span.":"当此方法返回时，写入span的字节数。"," instance using the specified socket address.":"实例使用指定的套接字地址。","The number to convert, expressed in network byte order.":"要转换的数字，以网络字节顺序表示。"," instance that contains the URI of the proxy used to contact ":"包含用于接触的代理的URI的实例"," enumerated value.":"枚举值。","A read-only span that contains an IP endpoint in dotted-quad notation or network byte order for IPv4 and in colon-hexadecimal notation for IPv6.":"仅读取的跨度包含IPv4的虚线符号或网络字节顺序以及IPv6的结肠hexadecimal符号中的IP端点。"," if the IP address is successfully written to the given span; otherwise, ":"如果IP地址成功写入给定的跨度； 否则，","The number of bytes to allocate for the underlying buffer.":"为基础缓冲区分配的字节数。"," of the host to check for proxy use.":"主机检查代理使用。","The value of the specified index element in the underlying buffer.":"基础缓冲区中指定的索引元素的值。","The object representation of an IP network endpoint.":"IP网络端点的对象表示。","A string that contains information about the ":"一个包含有关的信息的字符串"," if the proxy server should not be used for ":"如果不应该使用代理服务器","A string that contains an IP endpoint in dotted-quad notation or network byte order for IPv4 and in colon-hexadecimal notation for IPv6.":"一个包含IPv4的虚线符号或网络字节顺序以及IPv6的结肠hexadecimal符号中的IP端点的字符串。","The underlying buffer size of the ":"基础缓冲区的大小","The long value of the IP address.":"IP地址的long值。"," class containing the result of the authorization attempt. If there is no authentication module to respond to the challenge, this method returns ":"包含授权尝试结果的类。 如果没有身份验证模块应对挑战，则此方法返回","The error code that indicates the error that occurred.":"指示发生错误的错误代码。"," instance that contains the credentials that are needed to authenticate a request to the proxy server.":" 包含对代理服务器的请求进行身份验证所需的凭据的实例。","A unique string that associates a connection with an authenticating entity.":"将连接与身份验证实体相关联的唯一字符串。","The message that will be returned to the server in response to an authentication challenge.":"将返回到服务器以响应身份验证质询的消息。","A request to an internet resource.":"互联网资源的请求。"," instance that contains the information that is required to serialize the new ":"包含序列化新的信息的实例"," enumerated values.":" 枚举值。","The user name associated with the credentials.":"与凭据关联的用户名。"," if both client and server were authenticated; otherwise, ":"如果客户端和服务器都经过身份验证； 否则，","An array of strings that contains URI prefixes.":"包含URI前缀的一系列字符串。","The password for the user name associated with the credentials.":"与凭据关联的用户名的密码。","An integer error code that is associated with this exception.":"与此异常关联的整数错误代码。","The domain associated with these credentials.":"与这些凭据相关联的域。","The credentials associated with the request.":"与请求关联的凭据。"," object that specifies the time when resources stored in the cache must be revalidated.":" 指定必须重新验证缓存中存储的资源的时间的对象。","A string that contains the error message.":"包含错误消息的字符串。","The array index element of the desired information.":"所需信息的数组索引元素。","One of the following ":"以下"," class if the request can be preauthenticated; otherwise, ":"上课，如果请求可以预先定义； 否则，"," object that contains the source of the serialized stream that is associated with the new ":"包含与新的序列化流源的对象","The type of channel binding to retrieve.":"通道结合以检索的类型。"," that contains the URI of the request.":"其中包含请求的URI。",", this method returns ":"，此方法返回","The requested ":"请求"," that references the pending request for a stream.":"引用了流的待处理请求。"," enumeration values: ":" 枚举值: ","The time, in milliseconds, until the request times out, or the value ":"时间，以毫秒为止，直到请求计时或值"," to register with the authentication manager.":"在身份验证管理器上注册。"," if the channel binding is not supported by the current transport or by the operating system.":"如果通道绑定不受当前运输或操作系统的支持。"," object that the application uses to write data.":"应用程序用来编写数据的对象。"," to remove from the list of registered modules.":"从注册模块列表中删除。"," value that specifies an amount of time.":"指定时间量的值。"," that references the pending request for a response.":"该引用待定请求的响应请求。","A Boolean value that indicates if the application owns the safe handle to a native memory region containing the byte data that would be passed to native calls that provide extended protection for integrated windows authentication.":"一个布尔值，该值指示该应用程序是否将安全句柄包含到包含字节数据的本机内存区域，该数据将传递给本机呼叫，这些呼叫为集成的Windows身份验证提供了扩展保护。"," to indicate that the request does not time out.":" 以指示请求不超时。"," value that specifies the maximum age for resources.":"指定最大资源年龄的价值。","The size, in bytes, of the channel binding token in the ":"通道绑定令牌的大小，字节中的大小"," that contains the response from the file system resource.":"其中包含文件系统资源的响应。","The authentication scheme of the module to remove.":"要删除的模块的身份验证方案。"," class that contains the source of the serialized stream associated with the new ":"包含与新的序列化流的来源的类"," interface that determines whether credentials are sent with requests. The default value is ":"确定是否与请求发送凭据的接口。 默认值是"," for writing data to the file system resource.":"将数据写入文件系统资源。"," value that contains the property values for this instance.":"包含此实例的属性值的值。","The Message Digest 5 (MD5) hashing algorithm.":"消息Digest 5（MD5）哈希算法。"," that holds the serialized data for the ":"持有的序列化数据"," that contains the SPN values for keys composed of host information.":"其中包含由主机信息组成的密钥的SPN值。"," for reading data from the file system resource.":" 于从文件系统资源中读取数据。","The Secure Hashing Algorithm (SHA1).":"安全的哈希算法（SHA1）。"," value set to the date specified when this instance was created. If no date was specified, this property's value is ":"值设置为创建此实例时指定的日期。 如果未指定日期，则此属性的价值为"," that enables the registered authentication modules to be read.":"这样可以读取注册的身份验证模块。"," value that specifies the cache behavior for resources that were obtained using ":"指定使用资源的缓存行为的价值"," that contains the destination of the serialized stream that is associated with the new ":"包含与新的序列化流的目的地"," , which will hold the serialized data for the ":"，它将保存该数据的序列化数据","The challenge returned by the Internet resource.":"互联网资源返回的挑战。","The encrypted authorization message expected by the server.":"服务器期望的加密授权消息。"," value that is set to the maximum age value specified when this instance was created. If no date was specified, this property's value is ":" 设置为创建此实例时指定的最大年龄值的值。 如果未指定日期，则此属性的值为 "," containing the destination of the serialized stream associated with the new ":"包含与新的串行流的目的地","The name of the connection group for the request.":"请求的连接组名称。","The request that initiated the authentication challenge.":"发起身份验证挑战的要求。","The completion status of the authorization attempt. ":"授权尝试的完成状态。","The number of bytes returned from the file system resource.":"从文件系统资源返回的字节数。","The credentials associated with this request.":"与此请求相关的凭证。"," value that is set to the maximum staleness value specified when this instance was created. If no date was specified, this property's value is ":"创建本实例时指定的最大陈旧性值的值。 如果未指定日期，则此属性的价值为","The number of bytes of request data being sent.":"发送请求数据的字节数。"," if the authorization attempt is complete; otherwise, ":"如果授权尝试完成； 否则，"," reference that contains an ":"包含一个","The value \"binary/octet-stream\".":"值“二进制/八位字节”。","The content type of the data being sent.":"发送的数据的内容类型。"," value that specifies the minimum freshness specified when this instance was created. If no date was specified, this property's value is ":"指定创建此实例时指定的最小新鲜度的值。 如果未指定日期，则此属性的价值为"," instance. This object contains the FTP server's response to the request.":"实例。 该对象包含FTP服务器对请求的响应。","A unique identifier that can be used to create private client-server connections that are bound only to this authentication scheme.":"可用于创建仅绑定到该身份验证方案的私有客户端连接的唯一标识符。"," that contains the header name/value pairs associated with the response.":"其中包含与响应关联的标题名称/值对。"," that contains the authentication credentials that are associated with this request. The default is ":"其中包含与此请求相关联的身份验证凭证。 默认值为"," object that contains the information that is required to serialize the new ":"包含序列化的信息的对象"," instance used to store data to be sent to the server by the current request.":"实例用于存储通过当前请求发送到服务器的数据。"," that contains the URI of the file system resource that provided the response.":"其中包含提供响应的文件系统资源的URI。"," if the authentication process is complete; otherwise, ":"如果认证过程完成； 否则，"," property is supported by the ":"财产由"," object that can be used to customize connection behavior.":"可用于自定义连接行为的对象。"," object that contains the client certificates.":"包含客户端证书的对象。"," that contains header name/value pairs associated with this request.":"其中包含与此请求关联的标题名称/值对。"," that contains the welcome message sent by the server; otherwise, ":"其中包含服务器发送的欢迎消息； 否则，"," instance that indicates the status of the operation.":"表示操作状态的实例。"," value that contains a connection group name.":"包含连接组名称的值。","The protocol method to use in this request.":"在此请求中使用的协议方法。"," value that contains the number of milliseconds to wait before a request times out. The default value is ":"值包含毫秒数量等待之前的值。 默认值是"," that contains no information.":"其中不包含信息。"," object that was returned when the operation started.":"操作开始时返回的对象。"," value that should be ignored.":"值得忽略的价值。"," to preauthenticate; otherwise, ":"预先阐明； 否则，"," to indicate to the server that the data to be transferred is binary; ":"向服务器表明要传输的数据是二进制的；"," that every call to ":"每次打电话"," instance associated with this instance.":"与此实例关联的实例。"," instance that specifies the file offset, in bytes. The default value is zero.":"在字节中指定文件偏移的实例。 默认值为零。"," to indicate that the data is text. The default value is ":"指示数据是文本。 默认值是"," uses.":"用途。"," that indicates the network proxy to use for this request.":"这表明将用于此请求的网络代理。"," if the property has not been set.":"如果尚未设置该属性。"," that was returned when the operation started.":"操作开始时返回。"," if the client application's data transfer process listens for a connection on the data port; otherwise, ":"如果客户端应用程序的数据传输过程会在数据端口上侦听连接； 否则，"," method to initialize the request.":"初始化请求的方法。","The numeric value of the HTTP status from the server.":"服务器中HTTP状态的数值。","The length, in kilobytes (1024 bytes), of the default maximum for response headers received. The default configuration file sets this value to 64 kilobytes.":"收到的响应标头的默认最大值，长度为千字节（1024个字节）。 默认配置文件将此值设置为64千元。"," that defines the cache policy for FTP requests.":"这定义了FTP请求的缓存策略。","The headers returned with the 100-continue response from the server.":"标头返回了服务器的100次响应。"," if the client should initiate a connection on the data port. The default value is ":"如果客户端应在数据端口上启动连接。 默认值是"," if control and data transmissions are encrypted; otherwise, ":"如果对控制和数据传输进行加密； 否则，"," if the request should automatically follow redirection responses from the Internet resource; otherwise, ":"如果请求应自动遵循Internet资源的重定向响应； 否则，","The contents of the ":"内容的内容"," instance that contains data returned with the response; otherwise, ":"包含返回返回的数据的实例； 否则，"," if the connection to the server should not be destroyed; otherwise, ":"如果不应破坏与服务器的连接； 否则，","The starting or ending point of the range.":"范围的起点或终点。"," to enable buffering of the data received from the Internet resource; ":"启用从Internet资源收到的数据进行缓冲；"," if a response has been received; otherwise, ":"如果收到回应； 否则，"," if no response data was returned by the server.":"如果服务器未返回响应数据。"," to disable buffering. The default is ":"禁用缓冲。 默认值为","The description of the range.":"范围的描述。"," value that contains the FTP command to send to the server. The default value is ":"包含用于发送到服务器的FTP命令的值。 默认值是"," that contains the name/value pairs that make up the headers for the HTTP request.":"其中包含构成HTTP请求的标头的名称/值对。"," that contains the banner message sent by the server; otherwise, ":"其中包含服务器发送的横幅消息； 否则，","The state object for this request.":"此请求的状态对象。"," to enable buffering of the data sent to the Internet resource; ":"为了缓冲发送到Internet资源的数据；","The Host header value in the HTTP request.":"HTTP请求中的主机标头值。"," that references the asynchronous request for a response.":"这引用了异步请求的响应请求。"," instance responsible for communicating with the FTP server. On .NET Core, its value is ":"实例负责与FTP服务器通信。 在.net核心上，其价值是"," if no message is sent.":"如果没有发送消息。"," object that indicates the type of decompression that is used.":"表示所使用的解压缩类型的对象。"," that contains the contents of the ":"其中包含内容","The pending request for a stream.":"待处理的请求。"," value that contains the number of bytes of data received from the FTP server.":"值包含从FTP服务器接收到的数据的字节数。","The number of milliseconds before the reading or writing times out. The default value is 300,000 milliseconds (5 minutes).":"阅读或写作时间之前的毫秒数。 默认值为300,000毫秒（5分钟）。"," that contains the security certificates associated with this request.":"其中包含与此请求关联的安全证书。"," HTTP header.":"HTTP标头。","The new name of the file being renamed.":"文件的新名称被重命名。"," to use to write request data.":"用于编写请求数据。"," that contains the exit message sent by the server; otherwise, ":"其中包含服务器发送的退出消息； 否则，","The name of the connection group for this request. The default value is ":"此请求的连接组名称。 默认值是"," instance that identifies a resource that is accessed using the File Transfer Protocol.":"标识使用文件传输协议访问的资源的实例。"," if the request to the Internet resource should contain a ":"如果对Internet资源的请求应包含一个"," that contains the last modified date and time for a file.":"其中包含文件的最后修改日期和时间。","The pending request for a response.":"待定的响应请求。","The number of bytes of data to send to the Internet resource. The default is -1, which indicates the property has not been set and that there is no request data to send.":"发送到Internet资源的数据字节数。 默认值为-1，指示尚未设置属性，并且没有请求数据要发送。"," HTTP header with the value Keep-alive; otherwise, ":"HTTP标头带有值保持活力的值； 否则，"," object to use to proxy the request. The default value is set by calling the ":"用于代理请求的对象。 默认值是通过调用"," instance that identifies the resource associated with this response.":"标识与此响应关联的资源的实例。"," that contains the response from the Internet resource.":"其中包含Internet资源的响应。","The number of milliseconds before the writing or reading times out. The default value is 300,000 milliseconds (5 minutes).":"写作或阅读时间之前的毫秒数。 默认值为300,000毫秒（5分钟）。","A delegate that implements the callback method that executes when an HTTP Continue response is returned from the Internet resource. The default value is ":"从Internet资源返回HTTP继续响应时执行的回调方法的委托。 默认值是","The maximum number of redirection responses that the request follows. The default value is 50.":"请求随后的最大重定向响应数。 默认值为50。"," value that indicates the most recent status code returned with this response.":"指示此响应返回的最新状态代码的值。"," HTTP header. The default value is ":"HTTP标头。 默认值是"," that contains the URI of the Internet resource passed to the ":"其中包含互联网资源的URI传递给","The length, in kilobytes (1024 bytes), of the response headers.":"响应标题的千字节（1024个字节）的长度。","The timeout, in milliseconds, to wait until the 100-Continue is received.":"以毫秒为单位的超时等待直到收到100次接收到。"," that identifies the Internet resource that actually responds to the request. The default is the URI used by the ":"这确定了实际响应该请求的Internet资源。 默认值是"," to send data to the Internet resource in segments; otherwise, ":"将数据发送到细分市场中的Internet资源； 否则，"," instance that contains the status code and message returned with this response.":"包含此响应返回的状态代码和消息的实例。"," that contains the cookies associated with this request.":"其中包含与此请求关联的cookie。","The media type of the request. The default value is ":"请求的媒体类型。 默认值是","A callback function to validate the server certificate.":"回调功能以验证服务器证书。","The credentials associated with the challenge.":"与挑战相关的证书。"," that references a pending request for a response.":"这引用了待定的响应请求。"," that contains the authentication credentials associated with the request. The default is ":"其中包含与请求相关的身份验证凭证。 默认值为","The request method to use to contact the Internet resource. The default value is GET.":"用于联系Internet资源的请求方法。 默认值是获取的。"," that represents the network connection to the Internet resource.":"这代表了与Internet资源的网络连接。"," instance containing the authorization message for the request, or ":"包含请求的授权消息的实例，或"," that contains a response to the Internet request.":"其中包含对Internet请求的回应。"," if the request provides support for a ":"如果请求提供了支持","The Date header value in the HTTP request.":"HTTP请求中的日期标题值。"," if the request should be pipelined; otherwise, ":"如果应管道请求； 否则，"," if the challenge cannot be handled.":"如果无法应对挑战。"," to send an  HTTP Authorization header with requests after authentication has taken place; otherwise, ":"进行身份验证后，发送带有请求的HTTP授权标头； 否则，","The number of milliseconds to wait before the request times out. The default value is 100,000 milliseconds (100 seconds).":"等待请求时间之前等待的毫秒数。 默认值为100,000毫秒（100秒）。"," for writing data to the Internet resource.":"将数据写入Internet资源。"," that specifies the cache policy in effect for this request when no other policy is applicable.":"当不适用其他策略时，这指定了该请求实际上有效的缓存策略。"," containing the response to the Internet request.":"包含对Internet请求的响应。"," instance associated with the authentication request.":"与身份验证请求关联的实例。","The HTTP version to use for the request. The default is ":"用于请求的HTTP版本。 默认值为","The default maximum length of an HTTP error response.":"HTTP错误响应的默认最大长度。"," to keep the authenticated connection open; otherwise, ":"保持身份验证的连接打开； 否则，"," used by every call to instances of ":"每个呼叫都用于实例","The credentials associated with the authentication request.":"与身份验证请求相关的凭证。"," if the default credentials are used; otherwise, ":"如果使用默认凭据； 否则，"," class that contains header values associated with this response.":"包含与此响应关联的标头值的类。"," object indicating the status of the asynchronous operation.":"对象表示异步操作的状态。","The header value to return.":"返回的标题值。"," if the response was taken from the cache; otherwise, ":"如果从缓存中取出响应； 否则，","The complete URI or URI prefix that the ":"完整的URI或URI前缀"," instance containing the authorization message for the request.":"包含请求的授权消息的实例。","A user-defined object containing information about the write operation. This object is passed to the ":"用户定义的对象，其中包含有关写操作的信息。 这个对象传递给"," class that contains the URI of the Internet resource that actually responded to the request.":"包含实际响应该请求的Internet资源的URI的类。","The contents of the specified header.":"指定标头的内容。"," descendant services.":"后代服务。","A string indicating the authentication type provided by this authentication module.":"指示此身份验证模块提供的身份验证类型的字符串。"," array that receives the bytes read from the stream.":"从流读取字节的数组。"," object used by the ":"对象由"," containing the body of the response.":"包含响应的主体。","The create method that the ":"创建方法是","The zero-based location in ":"基于零的位置"," if the authorization module supports preauthentication; otherwise ":"如果授权模块支持预先验证； 否则"," for sending and receiving data.":"用于发送和接收数据。"," at which to begin storing the data read from this stream.":"在其中开始存储从此流中读取的数据。"," calls to create the ":"呼叫创建"," that will receive the request.":"那将收到请求。","The object into which this ":"这个对象"," that indicates whether closing this ":"这表明是否关闭"," descendant.":"后裔。","The maximum number of bytes to read from the stream.":"从流读取的最大字节数。","The destination of the serialization.":"序列化的目的地。"," object also closes ":"对象也关闭"," that represents the resource being requested.":"这代表了要请求的资源。"," if registration is successful; otherwise, ":"如果注册成功； 否则，"," delegate that references the method to invoke when the read operation is complete.":"委派该参考读取操作完成后调用的方法。"," if successful authentication occurred; otherwise, ":"如果成功进行身份验证； 否则，","A string that contains the character set of the response.":"包含响应的字符集的字符串。"," that will be sent with the request if this method returns ":"如果此方法返回，该请求将发送"," values. The default value is ":"值。 默认值是","A user-defined object containing information about the read operation. This object is passed to the ":"用户定义的对象，其中包含有关读取操作的信息。 这个对象传递给"," if data is encrypted before being transmitted over the network and decrypted when it reaches the remote endpoint; otherwise, ":"如果数据在通过网络传输之前加密并在达到远程端点时解密； 否则，","A string that describes the method that is used to encode the body of the response.":"描述用于编码响应主体的方法的字符串。"," that will conduct the authentication, if authentication is required.":"如果需要身份验证，那将进行身份验证。",".  \n  \n In mutual authentication, both the client and server present credentials to establish their identity. The ":"。 \n  \n  在相互身份验证中，客户端和服务器都存在凭据以建立其身份。 这"," array that supplies the bytes to be written to the stream.":"提供要写入流的字节的数组。","The number of bytes returned by the request. Content length does not include header information.":"请求返回的字节数。 内容长度不包括标题信息。"," if the client and server have been authenticated; otherwise, ":"如果客户端和服务器已进行身份验证； 否则，"," at which to begin reading bytes to be written to the stream.":"在其中开始阅读字节要写入流。"," values are relevant for Kerberos authentication. Kerberos authentication can be supported directly, or can be used if the Negotiate security protocol is used to select the actual security protocol. For more information about authentication protocols, see Internet Authentication.  \n  \n To determine whether mutual authentication occurred, check the ":"值与Kerberos身份验证有关。 可以直接支持Kerberos身份验证，也可以使用协商安全协议来选择实际安全协议。 有关身份验证协议的更多信息，请参见Internet身份验证。 \n  \n  要确定是否发生相互认证，请检查"," if the credentials are sent with the request; otherwise, ":"如果凭证是随请求发送的； 否则，","A string that contains the content type of the response.":"包含响应内容类型的字符串。"," value that specifies the number of bytes to read from ":"指定要读取的字节数的值"," property.  \n  \n If you specify the ":"财产。 \n  \n  如果指定"," if the local endpoint was authenticated as the server side of a client-server authenticated connection; ":"如果将本地端点作为客户服务器身份验证的连接的服务器端进行身份验证；","The uniform resource identifier (URI) of the Web resource.":"Web资源的统一资源标识符（URI）。"," authentication flag value and mutual authentication does not occur, your application will receive an ":"身份验证标志值和相互认证不会发生，您的应用程序将收到一个"," that contains the cookies that are associated with this response.":"其中包含与此响应相关的cookie。"," delegate that references the method to invoke when the write operation is complete.":"委派该引用写入操作完成后调用的方法。"," if the local endpoint was authenticated as the client.":"如果本地端点被身份验证为客户端。"," that contains the information that is required to deserialize the ":"其中包含了必不可少的信息"," with a ":"与"," that contains the header information returned with the response.":"其中包含与响应一起返回的标头信息。"," instance returned by a call to ":"实例由电话返回"," inner exception indicating that mutual authentication failed.":"内部例外表明相互身份验证失败。","The text of the error message.":"错误消息的文本。"," if mutual authentication occurred; otherwise, ":"如果发生相互认证； 否则，"," if the data is signed before being transmitted; otherwise, ":"如果在传输之前签署了数据； 否则，"," value that specifies the number of bytes read from the underlying stream.":"指定从基础流读取的字节数的值。"," object that defines a cache policy.":"定义缓存策略的对象。","A nested exception.":"一个嵌套的例外。"," if the inner stream has been left open; otherwise, ":"如果内部流保持打开； 否则，"," that contains the date and time that the contents of the response were modified.":"其中包含修改响应内容的日期和时间。"," containing the zero-based location in ":"包含基于零的位置"," instance that contains the response from the remote host.":"包含远程主机的响应的实例。","The content type of the request data.":"请求数据的内容类型。"," containing the maximum number of bytes to read from the stream.":"包含从流读取的最大字节数。","A string that contains the HTTP method that is used to return the response.":"包含用于返回响应的HTTP方法的字符串。","The collection of cipher suites allowed in this policy for negotiation.":"本政策中允许进行谈判的密码套房的收集。"," that contains the HTTP protocol version of the response.":"其中包含响应的HTTP协议版本。"," containing the authentication credentials associated with the request. The default is ":"包含与请求相关的身份验证凭证。 默认值为"," value that specifies the number of bytes read from the underlying stream. When there is no more data to be read, returns 0.":"指定从基础流读取的字节数的值。 如果没有更多的数据要读取，请返回0。","If a response is available from the Internet resource, a ":"如果可从Internet资源获得响应，则 ","An object that contains state information for this validation.":"包含此验证的状态信息的对象。"," containing the header name/value pairs associated with this request.":"包含与此请求关联的标题名称/值对。","The URI of the Internet resource that responded to the request.":"响应请求的互联网资源的URI。","The buffer to write the data to.":"将数据写入的缓冲区。"," instance that contains the error response from an Internet resource; otherwise, ":"包含Internet资源的错误响应的实例； 否则，","A string that contains the name of the server that sent the response.":"一个包含发送响应的服务器名称的字符串。","The host server specified by the client.":"客户指定的主机服务器。"," to pre-authenticate; otherwise, ":"预先实现； 否则，"," that represents the asynchronous read operation. The value of its ":"这代表异步读取操作。 其价值","The information required to serialize the new ":"序列化新的信息"," containing local certificates.":"包含本地证书。"," to use to access the Internet resource.":"用于访问Internet资源。","A string that describes the status of the response.":"描述响应状态的字符串。"," property contains the total number of bytes read into ":"属性包含读取的字节总数"," that indicates the source of the serialized stream associated with the new ":"指示与新的序列化流的来源","The certificate used to authenticate the remote party.":"用于身份验证远程方的证书。"," array of certificate issuers acceptable to the remote party.":"偏远方可以接受的证书发行人数组。","This value is ignored.":"此值被忽略。"," if headers are supported; otherwise, ":"如果支持标题； 否则，"," representing the resource associated with the request.":" 表示与请求相关联的资源。","An object containing state information for this asynchronous request.":"包含此异步请求的状态信息的对象。",". Always returns ":"。 总是返回","The URI that identifies the Internet resource.":"标识Internet资源的URI。"," value that specifies the length of the stream.":"指定流的长度的值。"," used for establishing an SSL connection.":"用于建立SSL连接。","The authentication challenge sent by the server.":"服务器发送的身份验证挑战。","The length of time, in milliseconds, until the request times out, or the value ":"以毫秒为单位的时间长度，直到请求耗尽或值"," to indicate that closing this ":"表示关闭"," descendant for the specific URI scheme.":"特定URI方案的后代。"," instance associated with the challenge.":"实例与挑战相关联。"," to indicate that the request does not time out. The default value is defined by the descendant class.":"指出该请求没有超时。 默认值由后代类定义。"," array that supplies the bytes written to the stream.":" 提供写入流的字节的数组。"," has no effect on ":"没有影响"," containing the URI of the requested resource.":"包含请求资源的URI。"," class that contains the information required to serialize the new ":"包含序列化的信息的类"," that specifies the current position in the underlying stream.":"这指定了基础流中的当前位置。"," also closes ":"也关闭"," containing the number of bytes to read from ":" 包含要从中读取的字节数 "," class that indicates the source of the serialized stream that is associated with the new ":"指示与新的序列化流的来源的类"," that specifies the amount of time that will elapse before a read operation fails.":"这指定了在读取操作失败之前将要经过的时间。"," descendant for the specified URI scheme.":"指定URI方案的后代。"," that is used to establish the identity of the client.":"这用于建立客户的身份。"," that represents the asynchronous read operation.":"这代表异步读取操作。"," object that describes the identity of the remote endpoint.":"描述远程端点的身份的对象。","A URI string that identifies the Internet resource.":"标识Internet资源的URI字符串。"," class for reading data from the Internet resource.":"从Internet资源读取数据的课程。"," that is used for extended protection.":"这用于扩展保护。","A region of memory that contains the data to write to the ":"存储区域，其中包含要写入的数据"," that will hold the serialized data for the ":"这将保留用于"," that specifies the amount of time that will elapse before a write operation fails.":"这指定了在写操作失败之前将要经过的时间。","The Service Principal Name (SPN) that uniquely identifies the server to authenticate.":"服务主名（SPN）唯一标识了服务器以进行身份验证。"," instance for the specific URI string.":" 特定URI字符串的实例。"," if authentication has occurred and the underlying stream is readable; otherwise, ":"如果发生了身份验证，并且基础流是可读的； 否则，","The chain of certificate authorities associated with the remote certificate.":"与远程证书相关的证书局链。","The number of bytes returned from the Internet resource.":"从Internet资源返回的字节数。"," values, indicating the security services for the stream.":"值，指示流的安全服务。","A URI that identifies the Internet resource.":"标识Internet资源的URI。"," if the underlying stream supports time-outs; otherwise, ":"如果基础流支持超时； 否则，","One or more errors associated with the remote certificate.":"与远程证书关联的一个或多个错误。",", which is the recommended value. See ":"，这是推荐的值。 看"," values, indicating how the server can use the client's credentials to access resources.":"值，指示服务器如何使用客户端的凭据来访问资源。"," if authentication has occurred and the underlying stream is writable; otherwise, ":"如果发生了身份验证并且基础流是可写的； 否则，"," for more details.":"更多细节。"," value that determines whether the specified certificate is accepted for authentication.":"确定是否接受身份验证的指定证书的值。"," that references a pending request for a stream.":"这引用了待登录的请求。"," that is used to establish the identity of the server.":"这用于建立服务器的身份。"," if the server has been authenticated; otherwise, ":"如果服务器已经过身份验证； 否则，","The server certificate context.":"服务器证书上下文。","The host name requested by the client. If the client doesn't use the host_name TLS extension, the ":"客户要求的主机名。 如果客户端不使用host_name tls扩展名，则"," to write data to.":"将数据写入。"," delegate that references the method to invoke when the authentication is complete.":"委托认证完成后引用了调用方法。"," if the local endpoint was successfully authenticated as the server side of the authenticated connection; otherwise, ":"如果本地端点被成功身份验证为身份验证连接的服务器端； 否则，","A Boolean value that indicates the closure behavior of the ":"一个布尔值，表示封闭行为"," is an empty string.":"是一个空字符串。"," from which to start writing data.":"从中开始编写数据。","A user-defined object containing information about the operation. This object is passed to the ":"用户定义的对象，其中包含有关操作的信息。 这个对象传递给"," that specifies the length of the underlying stream.":"这指定了基础流的长度。","The TLS stream on which the authentication happens.":"身份验证发生的TLS流。"," for sending and receiving data. This parameter indicates if the inner stream is left open.":"用于发送和接收数据。 此参数指示是否打开内部流。"," value that indicates when the extended protection policy should be enforced.":"表示何时应执行扩展保护政策的值。","The number of bytes to write to the underlying stream.":"写入基础流的字节数。"," connection remains open. The default is -1, which allows an active ":"连接保持打开状态。 默认值为-1，允许活动","Information from the Client Hello message.":"来自客户端Hello消息的信息。"," if authentication has occurred and the underlying stream is readable; otherwise ":"如果发生了身份验证，并且基础流是可读的； 否则"," delegate responsible for validating the certificate supplied by the remote party.":"负责验证远程方提供的证书的委托。"," that contains a custom channel binding to use for validation.":"其中包含用于验证的自定义频道绑定。"," connection to stay connected indefinitely. Set this property to 0 to force ":"连接以无限期保持连接。 将此属性设置为0强制"," if authentication has occurred and the underlying stream is writable; otherwise ":"如果发生了身份验证并且基础流是可写的； 否则","The information that was passed when registering the callback.":"注册回调时通过的信息。"," value that indicates the kind of protection enforced by the policy.":"表示政策强制执行的保护种类的价值。"," delegate responsible for selecting the certificate used for authentication.":"负责选择用于身份验证的证书的委托。","A value that identifies the bulk encryption algorithm used by this ":"标识此使用的批量加密算法的值"," connections to close after servicing a request.":"服务请求后关闭的连接。","The property bag for the SSL connection.":"SSL连接的属性袋。","A server authentication property bag.":"服务器身份验证属性袋。"," that contains the custom SPN list that is used to match against a client's SPN.":"其中包含用于与客户端SPN匹配的自定义SPN列表。"," value that specifies the strength of the algorithm, in bits.":"指定算法的强度的值。","The maximum number of connections allowed on this ":"此允许的最大连接数","TLS Application protocol.":"TLS应用程序协议。","The algorithm used for generating message authentication codes (MACs).":"用于生成消息身份验证代码（MAC）的算法。","The name of the server that shares this ":"共享此服务的服务器的名称"," object that holds the serialized data for an ":"持有一个序列化数据的对象"," instance to test for equality.":"实例测试平等。"," that represents the connection name.":"代表连接名称。"," value that specifies the strength of the ":"指定强度的价值"," instance that contains the representation of the ":"包含表示的实例","The name of the server that will share this ":"服务器的名称将共享此"," instance provided has matching data; otherwise, ":"提供的实例具有匹配数据； 否则，"," algorithm, in bits. Valid values are 128 or 160.":"算法，位。 有效值为128或160。","The number of open connections associated with this ":"与此关联的开放连接数量"," if the operating system supports integrated windows authentication with extended protection, otherwise ":"如果操作系统支持具有扩展保护的集成Windows身份验证，则"," if data is encrypted before being transmitted over the network and decrypted when it reaches the remote endpoint; otherwise ":"如果数据在通过网络传输之前加密并在达到远程端点时解密； 否则"," that contains client certificates.":"其中包含客户端证书。"," instance, and the ":"实例和"," class that contains the specified values of service names to be used to initialize the class.":"包含用于初始化类的服务名称的指定值。"," to expect 100-Continue responses for ":"期望100次回答"," if the server has been authenticated; otherwise ":"如果服务器已经过身份验证； 否则","The string to seek.":"绳子要寻找。"," value that specifies whether the certificate revocation list is checked during authentication.":"指定是否在身份验证期间检查证书撤销列表的值。"," if the local endpoint was successfully authenticated as the server side of the authenticated connection; otherwise ":"如果本地端点被成功身份验证为身份验证连接的服务器端； 否则"," instances have matching data; otherwise, ":"实例具有匹配数据； 否则，"," if the data is signed before being transmitted; otherwise ":"如果在传输之前签署了数据； 否则"," requests; otherwise, ":"要求; 否则，","A 32-bit signed integer hash code used to compare instances of this type.":"一个32位签名的整数哈希代码，用于比较此类实例。"," parameter occurs within this ":"参数发生在此内"," value that represents protocols used for authentication.":"代表用于身份验证的协议的值。"," algorithm, in bits.":"算法，位。","The right ":"正确的"," object that contains the date and time at which the ":"包含日期和时间的对象"," class that contains the specified values of service names to be merged.":"包含要合并的服务名称的指定值的类。","The certificate used to authenticate the server.":"用于身份验证服务器的证书。","The length of the underlying stream.":"基础流的长度。","\n          The read-only byte memory representing a TLS application protocol.":"代表TLS应用程序协议的仅读取字节内存。"," object was last connected.":"对象是最后连接的。"," instance that contains the union of the existing ":"包含现有联合的实例","An X509Certificate object that represents the certificate supplied for authentication or ":"x509certificate对象，代表提供的证书或","The X509Certificate used to authenticate the server.":"X509Certificate用于对服务器进行身份验证。","The collection containing the trusted certificates.":"包含受信任证书的集合。","The length of time, in milliseconds, that a connection associated with the ":"以毫秒为单位的时间长度是与"," if no certificate was supplied.":"如果未提供证书。"," value that specifies whether the client is asked for a certificate for authentication. Note that this is only a request -- if no certificate is provided, the server still accepts the connection request.":"指定是否要求客户验证证书的值。 请注意，这只是一个请求 - 如果不提供证书，服务器仍然接受连接请求。"," instance merged with the specified values.":" 实例与指定值合并。"," for the server to send a list of trusted certificate authorities during the TLS handshake; ":"为了使服务器在TLS握手期间发送信任证书局的列表；","The callback delegate.":"回调委托。","One of the enumeration values that identifies the cipher suite which was negotiated for this connection.":"标识有关此连接的密码套件的枚举值之一。"," object can remain idle before it is closed and reused for another connection.":"对象可以在关闭并重复使用其他连接之前保持空闲状态。"," not to send the list.":"不发送列表。","A string that contains the specified values of service names to be used to initialize the class.":"一个包含用于初始化类的服务名称的指定值的字符串。","The current position in the underlying stream.":"当前位置在基础流中。","Represents a trust policy.":"代表信任政策。"," object that contains the HTTP protocol version that the ":"包含HTTP协议版本的对象","The state object to pass to ":"状态对象传递给"," associated with the connection to be created.":"与要创建的连接相关联。","The amount of time, in milliseconds, that elapses before a synchronous read operation fails.":"在同步读取操作之前，以毫秒为单位的时间失败了。","The store containing the trusted certificates.":"该商店包含受信任的证书。"," object uses.":"对象使用。","The remote ":"遥控器"," when the callback is invoked.":"调用回调时。"," allows SSL renegotiation; otherwise, ":"允许SSL重新谈判； 否则，"," that contains the size, in bytes, of the receive buffer. The default is 8192.":"其中包含接收缓冲区的大小，字节。 默认值为8192。","The name of the server the client is trying to connect to.":"客户端试图连接到的服务器的名称。"," containing client certificates.":"包含客户端证书。"," that specifies the remote host.":"指定远程主机。","One of the values in ":"一个值之一"," object supports pipelined connections; otherwise, ":"对象支持管道连接； 否则，"," object that contains the channel binding token (CBT) used for extended protection.":"包含用于扩展保护的通道绑定令牌（CBT）的对象。","A user-defined object that contains information about the read operation. This object is passed to the ":"用户定义的对象，其中包含有关读取操作的信息。 这个对象传递给","The default value is ":"默认值是","The number of times this delegate was called for a specified connection.":"该代表的次数被要求进行指定的连接。"," to use the Nagle algorithm; otherwise, ":"使用Nagle算法； 否则，",", which is the recommended value. For more information, see ":"，这是推荐的值。 有关更多信息，请参阅","The amount of time that elapses before a synchronous write operation fails.":"同步写操作之前，以前的时间失败。","A user-defined object that contains information about the write operation. This object is passed to the ":"用户定义的对象，其中包含有关写操作的信息。 这个对象传递给","The local ":"本地的","A bitwise combination of the enumeration values that specify the TLS or SSL protocols.":"指定TLS或SSL协议的枚举值的位组合。","The URI of the Internet resource to be contacted.":"要联系的互联网资源的URI。","The server certificate.":"服务器证书。"," array that receives the bytes read from this stream.":"从此流中读取字节的数组。","The name of the connection group that contains the connections to close and remove from this service point.":"连接组的名称包含要关闭并删除此服务点的连接。","The proxy data for this request.":"此请求的代理数据。"," allow SSL renegotiation; otherwise, ":"允许SSL重新谈判； 否则，","Supplementary certificates used to build the certificate chain.":"用于建造证书链的补充证书。"," that contains the zero-based location in ":"其中包含基于零的位置"," object that manages communications for the request.":"管理请求通信的对象。","The maximum number of ":"最大数量"," to indicate that the missing certificates can be downloaded from the network; ":"指出可以从网络下载丢失的证书；"," value that indicates whether the connection group was closed.":" 指示连接组是否已关闭的值。"," object of the Internet resource to contact.":"互联网资源的对象要联系。"," that contains the maximum number of bytes to read from this stream.":"其中包含从此流读取的最大字节数。"," to indicate that only available X509Certificate stores should be searched for missing certificates.":"为了指出仅可用的X509Certificate商店才能搜索缺失的证书。","If set to true, then the TCP keep-alive option on a TCP connection will be enabled using the specified ":"如果设置为true，则将使用指定的TCP连接上的TCP keep-ailive选项启用"," value that specifies the number of bytes read. When there is no more data to be read, returns 0.":"指定字节读数的值。 如果没有更多的数据要读取，请返回0。"," object that contains the address of the Internet resource to contact.":"包含要联系的Internet资源地址的对象。"," values.  \n  \n If set to false, then the TCP keep-alive option is disabled and the remaining parameters are ignored.  \n  \n The default value is false.":"值。 \n  \n  如果设置为false，则禁用TCP Keep-Alive选项，并忽略其余参数。 \n  \n  默认值是错误的。","The certificate context with the newly created certificate chain.":"具有新创建的证书链的证书上下文。","The buffer that receives the bytes read from this stream.":"从此流中读取字节的缓冲区。","The maximum number of concurrent connections allowed by a ":"A允许的最大并发连接数","Specifies the timeout, in milliseconds, with no activity until the first keep-alive packet is sent.  \n  \n The value must be greater than 0.  If a value of less than or equal to zero is passed an ":"指定毫秒以毫秒为单位的超时，直到发送第一个保留数据包为止。 \n  \n  该值必须大于0。如果通过小于或等于零的值通过","An optional trust policy, to replace the default system trust.":"可选的信任策略，以替换默认系统信任。"," object. The default connection limit is 10 for ASP.NET hosted applications and 2 for all others. When an app is running as an ASP.NET host, it is not possible to alter the value of this property through the config file if the autoConfig property is set to ":"目的。 对于ASP.NET托管应用程序，默认连接限制为10，所有其他应用程序为2。 当应用程序作为ASP.NET主机运行时，如果AutoConfig属性设置为","The maximum number of bytes to read from this stream.":"从此流读取的最大字节数。",". When there is no more data to be read, returns 0.":"。 如果没有更多的数据要读取，请返回0。",". However, you can change the value programmatically when the autoConfig property is ":"。 但是，您可以在AutoConfig属性为","Specifies the interval, in milliseconds, between when successive keep-alive packets are sent if no acknowledgement is received.  \n  \n The value must be greater than 0.  If a value of less than or equal to zero is passed an ":"指定以毫秒为单位的间隔，如果未收到确认书，则连续的静止数据包在连续的保留数据包之间。 \n  \n  该值必须大于0。如果通过小于或等于零的值通过",". Set your preferred value once, when the AppDomain loads.":"。 当AppDomain加载时，设置您的首选值一次。"," that contains the number of bytes to read from ":"其中包含要读取的字节数"," instance that contains the information required to deserialize the new ":" 包含反序列化新的所需信息的实例 "," class that contains the URI of the Internet server that this ":"包含Internet服务器的URI的类","The data to write to the underlying stream.":"写入基础流的数据。"," object connects to.":"对象连接到。","The time-out value, in milliseconds. A value of -1 indicates an infinite time-out period. The default value is 120,000 milliseconds (two minutes).":"超时值，以毫秒为单位。 值-1表示无限超时周期。 默认值为120,000毫秒（两分钟）。"," that describes the authentication failure.":"描述了身份验证故障。","A delegate that forces a ":"迫使一个的代表","The location in ":"位置"," that is the cause of the current exception.":"那是当前例外的原因。"," if a DNS resolution always returns the first IP address for a particular host; otherwise ":"如果DNS分辨率始终返回特定主机的第一个IP地址； 否则"," to use a particular local Internet Protocol (IP) address and port number. The default value is ":"使用特定的本地Internet协议（IP）地址和端口号。 默认值是"," if data can be written to the ":"如果数据可以写入","The local IP address.":"本地IP地址。","The encryption policy to use for this ":"为此使用的加密策略"," class that contains the security certificate received for this ":"包含为此收到的安全证书的课程"," if data is available on the stream to be read; otherwise, ":"如果在流上可用的数据要读取； 否则，","The IP address of a multicast group.":"多播组的IP地址。"," object that contains the public values of the last client certificate sent to the server.":"包含发送到服务器的最后一个客户端证书的公共值的对象。"," to enable 100-Continue behavior. The default value is ":"启用100个行为。 默认值是","The length of the data available on the stream.":"流在流上可用的数据长度。","The maximum idle time, in milliseconds, of a ":"以毫秒为单位的最大闲置时间"," that specifies the number of milliseconds that an active ":"这指定了一个活动的毫秒数","The index of a ":"一个索引","The current position in the stream.":"当前位置在流中。","The count of bytes to send if the ":"如果是"," can be read; otherwise, ":"可以阅读； 否则，"," array element.":"数组元素。"," object. The default value is 100,000 milliseconds (100 seconds).":" 对象。 默认值为100,000毫秒（100秒）。"," that specifies the amount of time, in milliseconds, that will elapse before a read operation fails. The default value, ":"这说明了在读取操作失败之前将通过毫秒的时间，以毫秒为单位。 默认值，"," class was initialized with a ":"班级用","The local address associated with a multicast group.":"与多播组关联的本地地址。",", specifies that the read operation does not time out.":"，指定读取操作没有时间。"," delegate that references the method to invoke when the connect operation is complete.":"将连接操作完成后，将引用该方法调用的方法。","A Boolean value that indicates if this element should not be combined with the next element in a single send request.":"一个布尔值，指示该元素是否不应与单个发送请求中的下一个元素合并。"," that represents the underlying network connection.":"这代表了基础网络连接。"," will use to send and receive data.":"将用于发送和接收数据。","A user-defined object that contains information about the connect operation. This object is passed to the ":"用户定义的对象，其中包含有关连接操作的信息。 这个对象传递给","The filename of the file to send if the ":"文件的文件名如果是"," if data can be written to the stream; otherwise, ":"如果数据可以写入流； 否则，"," will take ownership of the ":" 将拥有 ","An object representation of the file to send if the ":"文件的对象表示，如果","At least one ":"至少一个 "," of bytes to be sent if the ":"如果是"," values that specify the type of access given to the ":"指定访问类型的值"," that specifies the amount of time, in milliseconds, that will elapse before a write operation fails. The default value, ":"这指定了在写操作失败之前将在毫秒内通过的时间。 默认值，",", designating the remote host.":"，指定远程主机。",", specifies that the write operation does not time out.":"，指定写操作没有时间。","The offset, in bytes, from the beginning of the data buffer or file to the location in the buffer or file to start sending the data.":"从数据缓冲区或文件的开头到缓冲区或文件中的位置开始发送数据。"," over the provided ":"在提供的上方"," that references the asynchronous connections.":"引用异步连接。","The socket handle for the socket that the ":"插座的插座手柄","The pre-existing handle to use.":"预先使用的手柄。"," values that specifies the type of access given to the ":"指定访问类型的值","The name of the remote host.":"远程主机的名称。","The socket information returned by ":"返回的插座信息","A byte array of data to send using the ":"一个字节阵列，用于发送的数据"," that is the location in memory to store data read from the ":"这就是存储器中存储数据读取的位置"," if this socket can be reused after the connection is closed; otherwise, ":"如果连接关闭后可以重复使用此插座； 否则，"," for a newly created connection.":"对于新创建的连接。","The offset, in bytes, from the beginning of the ":"从字节开始的偏移。"," to begin storing the data.":"开始存储数据。"," object that references the asynchronous operation.":"引用异步操作的对象。"," to the location in the ":"到达","An asynchronous task that completes with the accepted Socket.":"使用接受套接字完成的异步任务。","The number of bytes to read from the ":"从"," to start sending the data specified in the ":"要开始发送指定的数据"," that is the storage location for the received data.":"这是收到数据的存储位置。","The socket to use for accepting the connection.":"用于接受连接的套接字。"," delegate that is executed when ":"当执行时执行的委托","The zero-based position in the ":"基于零的位置","The number of bytes to send starting from the ":"从","A cancellation token that can be used to cancel the asynchronous operation.":"可以用于取消异步操作的取消令牌。"," completes.":"完成。"," parameter. If ":"范围。 如果"," object to use for this asynchronous socket operation.":"用于此异步套接字操作的对象。"," parameter at which to store the received data.":"存储收到数据的参数。","An object that contains any additional user-defined data.":"包含任何其他用户定义数据的对象。"," is zero, no bytes are sent.":"为零，没有发送字节。"," if the I/O operation is pending. The ":"如果I/O操作正在待处理。 这"," that represents the asynchronous call.":"这代表了异步电话。","The number of bytes to receive.":"接收的字节数。","The number bytes to send starting from the ":"从"," event on the ":"事件"," that contains the data to write to the ":"其中包含要写入的数据","A user-defined object that contains information about the receive operation. This object is passed to the ":"用户定义的对象，其中包含有关接收操作的信息。 这个对象传递给"," parameter will be raised upon completion of the operation.\n\n ":"操作完成后将提出参数。","A Boolean value that specifies that this element should not be combined with the next element in a single send request from the sockets layer to the transport. This flag is used for granular control of the content of each message on a datagram or message-oriented socket.":"布尔值指定该元素不应与从插座层发送到传输的单个发送请求中的下一个元素结合使用。 此标志用于对数据报或面向消息的套接字上每条消息的内容的粒状控制。"," to begin sending the data.":"开始发送数据。"," that references the asynchronous read.":"这引用了异步读取。","The file to be transmitted using the ":"使用的文件使用"," to store the received data.":"存储收到的数据。"," if the I/O operation completed synchronously. The ":"如果I/O操作同步完成。 这","The number of bytes to write to the ":"写入的字节数"," object that stores the socket error.":"存储套接字错误的对象。","The offset, in bytes, from the beginning of the file to the location in the file to start sending the bytes in the file.":"从文件的开头到文件中的位置，以开始发送文件中的字节。"," parameter will not be raised and the ":"参数不会提高，","A 32-bit signed integer that specifies the number of milliseconds to wait to send any remaining data before closing.":"一个32位签名的整数指定在关闭之前等待发送任何剩余数据的毫秒数。"," parameter at which to store the data.":"存储数据的参数。"," that represents an asynchronous call.":"这代表了一个异步电话。"," is zero, the entire file is sent.":"为零，整个文件已发送。"," object passed as a parameter may be examined immediately after the method call returns to retrieve the result of the operation.":"在方法调用返回以检索操作结果后，可以立即检查作为参数的对象。"," that represents the source of the data.":"这代表了数据的来源。","TThe offset, in bytes, from the beginning of the file to the location in the file to start sending the bytes in the file.":"从文件的开头到文件中的位置，以开始发送文件中的字节。"," that references the asynchronous ":"引用异步","The number of bytes read from the ":"从"," that contains the data to send.":"其中包含要发送的数据。","The number of bytes to send starting from the offset parameter. If count is zero, the entire file is sent.":"从偏移参数开始发送的字节数。 如果计数为零，则将发送整个文件。"," creation.":"创建。","A cancellation token used to propagate notification that this  operation should be canceled.":"一个取消令牌用于传播通知应取消此操作的通知。"," parameter at which to begin sending data.":"开始发送数据的参数。","Specifies that this element should not be combined with the next element in a single send request from the sockets layer to the transport. This flag is used for granular control of the content of each message on a datagram or message-oriented socket.":"指定该元素不应与从插座层发送到传输的单个发送请求中的下一个元素合并。 此标志用于对数据报或面向消息的套接字上每条消息的内容的粒状控制。"," to begin storing the data to.":"开始将数据存储到。","The number of bytes to accept from the sender.":"接收发件人的字节数。","The number of bytes to send.":"要发送的字节数。"," of bytes to send using the ":"使用字节发送的字节","A region of memory to store data read from the ":"存储存储数据的记忆区域从"," that references the asynchronous send.":"引用异步发送。","The accepted ":"接受的","The filename of the file to be transmitted using the ":"使用该文件的文件名","The position in the stream.":"流中的位置。","A string that contains the path and name of the file to send. This parameter can be ":"包含要发送的文件的路径和名称的字符串。 此参数可以是"," object. This value may be ":"目的。 这个值可能是","The offset, in bytes, from the beginning of the file to the location in the file to start sending the file specified in the ":"从文件的开头到文件中的位置，以开始发送指定的文件"," object that represents the asynchronous send.":"表示异步发送的对象。","The data to write to the ":"要写入的数据","The maximum number of bytes to receive.":"接收的最大字节数。","The byte buffer to send if the ":"如果是"," object was initialized with a ":"对象是用一个初始化的","A byte array that contains the data to write to the ":"一个字节数组，其中包含要写入的数据","A string that contains the path and name of the file to be sent. This parameter can be ":"包含要发送的文件的路径和名称的字符串。 此参数可以是"," object that references the asynchronous ":"引用异步的对象"," object creation.":"对象创建。","The data to be sent before the file is sent. This parameter can be ":"在发送文件之前要发送的数据。 此参数可以是"," that represents the remote device.":"这代表远程设备。"," if data can be read from the stream; otherwise, ":"如果可以从流中读取数据； 否则，"," that represents the remote host.":"这代表远程主机。","The data to be sent after the file is sent. This parameter can be ":"发送文件后要发送的数据。 此参数可以是"," to associate with the ":"与"," in all cases to indicate that ":"在所有情况下都表明"," that references the asynchronous connection.":"这引用了异步连接。"," delegate to be invoked when this operation completes. This parameter can be ":"此操作完成后要调用的委托。 此参数可以是"," object used to request the connection to the remote host by calling one of the ":"用来通过调用其中一个来请求与远程主机的连接的对象"," cannot seek a specific location in the stream.":"无法在流中寻找特定位置。"," of the remote host.":"远程主机。","A user-defined object that contains state information for this request. This parameter can be ":"用户定义的对象，其中包含此请求的状态信息。 此参数可以是"," methods.":"方法。","The port number of the remote host.":"远程主机的端口号。"," object that represents the asynchronous operation.":"代表异步操作的对象。","Wait up to ":"等待","The zero-based position in ":"基于零的位置"," seconds to send any remaining data, then close the socket.":"秒以发送任何剩余数据，然后关闭套接字。"," at which to begin sending data.":"在其中开始发送数据。","The IP address of the remote host.":"远程主机的IP地址。","The IP addresses of the remote host.":"远程主机的IP地址。","The endpoint to connect to.":"连接的端点。","An asynchronous task that completes when the connection is established.":"建立连接时完成的异步任务。","The IPAddress of the remote host to connect to.":"远程主机的iPaddress要连接到。","The port on the remote host to connect to.":"远程主机上的端口要连接到。","A list of IPAddresses for the remote host that will be used to attempt to connect to the remote host.":"远程主机的iPaddresses列表将用于尝试连接到远程主机。"," if the I/O operation completed synchronously. In this case, The ":"如果I/O操作同步完成。 在这种情况下，","The hostname of the remote host to connect to.":"远程主机的主机名已连接到。"," if this socket can be reused after the current connection is closed; otherwise, ":"如果在关闭当前连接后可以重复使用此插座； 否则，","Indicates whether the socket should be available for reuse after disconnect.":"指示断开连接后是否应重复使用套接字。","An asynchronous task that completes when the socket is disconnected.":"断开套接字时完成的异步任务。"," and equals the value of the instance; otherwise, ":"并等于实例的值； 否则，","The ID of the target process where a duplicate of the socket reference is created.":"创建套接字参考的重复的目标过程的ID。","An Int32 hash code.":"INT32哈希代码。","The socket reference to be passed to the target process.":"插座引用将传递到目标过程。"," that contains the bytes transferred.":"其中包含传输的字节。"," instance that is to the left of the equality operator.":"实例是相等运算符的左侧。"," object that stores state information for this asynchronous operation as well as any user defined data.":"为该异步操作以及任何用户定义的数据存储状态信息的对象。"," instance that is to the right of the equality operator.":"实例是平等运算符的右侧。"," object to handle communication with the remote host.":"对象处理与远程主机的通信。","The number of bytes transferred.":"传输字节数。"," instance that is to the left of the inequality operator.":"实例是不平等运算符的左侧。"," instance that is to the right of the inequality operator.":"实例是不平等运算符的右侧。"," that stores state information for this asynchronous operation as well as any user defined data.":"这将存储此异步操作以及任何用户定义的数据的状态信息。"," are unequal; otherwise, ":"不平等； 否则，"," to handle communication with the remote host.":"处理与远程主机的通信。"," object that stores state information and any user-defined data for this asynchronous operation.":"对对象存储状态信息和此异步操作的任何用户定义数据。"," that indicates the origin information of the packet that was received as a result of calling the ":"这表明由于致电而收到的数据包的来源信息"," method or ":"方法或","The number of bytes received.":"接收的字节数。"," method. For packets that were sent from a unicast address, the ":"方法。 对于从单媒体地址发送的数据包，","If successful, the number of bytes received. If unsuccessful, returns 0.":"如果成功，则收到的字节数。 如果不成功，返回0。"," property will return the ":"属性将返回"," values for the received packet.":"接收数据包的值。"," of the sender; for multicast or broadcast packets, the ":"发件人; 对于多播或广播数据包，"," and interface of the received packet.":"和接收到的数据包的接口。"," that stores state information for this asynchronous operation.":"这存储了此异步操作的状态信息。","If successful, the number of bytes sent to the ":"如果成功，则将字节数发送到","; otherwise, an invalid ":"; 否则，无效"," property will return the multicast or broadcast ":"属性将返回多播或广播"," error.":"错误。"," value, which represents the index of the network interface. You can use this index with ":"值，代表网络接口的索引。 您可以使用此索引"," object that stores state information for this asynchronous operation.":"为该异步操作存储状态信息的对象。"," to get more information about the relevant interface.":"获取有关相关接口的更多信息。","If successful, the number of bytes sent; otherwise, an invalid ":"如果成功，则发送的字节数； 否则，无效"," of the multicast group.":"多播组。","The platform-defined option level.":"平台定义的选项级别。","The platform-defined option name.":"平台定义的选项名称。","The group ":"群组","The local interface address.":"本地接口地址。","The span into which the retrieved option value should be stored.":"应存储检索选项值的跨度。"," that contains the Internet address of a multicast group.":"其中包含一个多播组的互联网地址。","The number of bytes written into ":"写入的字节数"," value that specifies the address of the interface.":"指定接口地址的值。"," for a successfully retrieved value.":"对于成功检索的值。","An object that represents the value of the option. When the ":"代表选项值的对象。 当。。。的时候"," to remain connected after the ":"保持联系之后"," parameter is set to ":"参数设置为"," method is called; otherwise, ":"方法称为; 否则，"," the return value is an instance of the ":"返回值是","The number of seconds to remain connected after the ":"在此之后保持连接的秒数"," class. When ":"班级。 什么时候"," method is called.":"方法被调用。",", the return value is an instance of the ":"，返回值是"," is any other value, the return value is an integer.":"是任何其他值，返回值是整数。"," should linger after ":"之后应该持续"," that is to receive the option setting.":"那就是接收选项设置。"," is called; otherwise, ":"叫做; 否则，","The length, in bytes, of the expected return value.":"预期返回值的长度，字节。","The amount of time, in seconds, to remain connected after calling ":"打电话后保持连接的时间（几秒钟内）"," that contains the value of the socket option.":"其中包含套接字选项的值。"," value that specifies the control code of the operation to perform.":"指定要执行操作的控制代码的值。","The IP address of the multicast group.":"多播组的IP地址。"," array that contains the input data required by the operation.":"包含操作所需的输入数据的数组。","The index of the interface that's used to send and receive multicast packets.":"用于发送和接收多播数据包的接口的索引。"," array that contains the output data returned by the operation.":"包含操作返回的输出数据的数组。","The group IP address.":"组IP地址。"," that contains the input data required by the operation.":"其中包含操作所需的输入数据。"}