{", nothing is written to the text stream.":"，没有写在文本流中。","The string builder to write to the string.":"字符串构建器写入字符串。","The span of characters to write to the string.":"字符的跨度写入字符串。","The character to write to the string.":"写入字符串的字符。"," in which the output is written.":"在其中写入输出。","The character memory region to write to the string.":"字符内存区域写入字符串。","The string, as a string builder, to write to the string.":"字符串作为字符串构建器，以写入字符串。","A memory region of characters to write to the string.":"字符的记忆区域要写入字符串。","An integer representing the next character to be read, or -1 if no more characters are available or the reader does not support seeking.":"代表要读取的下一个字符的整数，或者-1如果没有更多字符，或者读者不支持寻求。","The next character from the text reader, or -1 if no more characters are available. The default implementation returns -1.":"文本读取器中的下一个字符，如果没有更多字符，则为-1。 默认实现返回-1。","The maximum number of characters to read. If the end of the reader is reached before the specified number of characters is read into the buffer, the method returns.":"最多要读的字符数。 如果在读取指定数量的字符数之前，将到达读者的末尾，则方法返回。"," length, depending on whether the data is available within the reader. This method returns 0 (zero) if it is called when no more characters are left to read.":"长度，取决于读者中是否可用的数据。 如果没有更多字符要读取时，此方法将返回0（零）。",", depending on whether the data is available within the reader. This method returns 0 (zero) if it is called when no more characters are left to read.":"，取决于读者中是否可用数据。 如果没有更多字符要读取时，此方法将返回0（零）。","The maximum number of characters to read. If the end of the text is reached before the specified number of characters is read into the buffer, the current method returns.":"最多要读的字符数。 如果在读取指定数量的字符数量之前到达缓冲区中的末尾，则当前方法返回。","When this method returns, this parameter contains the specified character array with the values between ":"当此方法返回时，此参数包含指定的字符数组"," parameter contains the total number of bytes read into the buffer. The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the text has been reached.":"参数包含读取到缓冲区的字节总数。 如果当前可用的字节数小于请求的数字，则结果值可能小于请求的字节数，或者如果达到文本末尾，则可以为0（零）。"," -1) replaced by the characters read from the current source.":"-1）被当前源读取的字符所取代。","The next line from the reader, or ":"读者的下一行，或"," parameter contains the next line from the text reader, or is ":"参数包含文本读取器的下一行，或IS","A string that contains all characters from the current position to the end of the text reader.":"一个包含从当前位置到文本读取器末尾的所有字符的字符串。","A value task that represents the asynchronous read operation. The value of the type parameter contains the number of characters that have been read, or 0 if at the end of the stream and no data was read. The number will be less than or equal to the ":"代表异步读取操作的价值任务。 类型参数的值包含已读取的字符数，或者在流的末尾且没有读取数据。 该数字将小于或等于","A value task that represents the asynchronous read operation. The value of the type parameter contains the total number of characters read into the buffer. The result value can be less than the number of characters requested if the number of characters currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"代表异步读取操作的价值任务。 类型参数的值包含读取到缓冲区的字符总数。 如果当前可用的字符数小于请求的数字，则结果值可能小于请求的字符数，也可以小于所请求的数字，或者如果达到流的末尾，则可以为0（零）。"," if all of the characters have been read.":"如果所有字符都已阅读。"," parameter contains a string with the characters from the current position to the end of the text reader.":"参数包含一个带有字符的字符串，从当前位置到文本读取器的末尾。","A thread-safe wrapper.":"线程安全包装器。"," if all characters have been read.":"如果所有字符都已阅读。","The 8-byte signed integer to write.":"8个字节签名的整数要写。","The character array to write to the text stream.":"字符数组写入文本流。","The 8-byte floating-point value to write.":"要编写的8字节浮点值。","The string, as a string builder, to write to the text stream.":"字符串作为字符串构建器，以写入文本流。","The character to write to the text stream.":"写入文本流的字符。","The 4-byte floating-point value to write.":"要编写的4字节浮点值。","The 4-byte signed integer to write.":"4个字节签名的整数要编写。","The 4-byte unsigned integer to write.":"4个字节的未签名整数编写。","The character position in the buffer at which to start retrieving data.":"在缓冲区中开始检索数据的角色位置。","The 8-byte unsigned integer to write.":"8个字节的未签名整数编写。"," at which to start reading data.":"在其中开始读取数据。","The character memory region to write to the text stream.":"字符内存区域写入文本流。","The character array to write to the text stream. If ":"字符数组写入文本流。 如果","The character encoding in which the output is written.":"编码输出的字符编码。","The char span value to write to the text stream.":"字符跨度值写入文本流。","The object to write. If ":"要编写的对象。 如果","The character array from which data is read.":"读取数据的字符阵列。","The line terminator string for the current ":"当前的线终结器字符串"," - 1) replaced by the bytes read from the current source. This parameter is passed uninitialized.":" -  1）由从当前源读取的字节替换。 该参数通过非初始化。"," object for a specific culture, or the formatting of the current culture if no other culture is specified.":"如果未指定其他文化，则是特定文化或当前文化的格式。","The buffer to contain the unmanaged memory stream.":"缓冲区包含未托管的内存流。","The character array to write to the text stream. If the character array is ":"字符数组写入文本流。 如果字符数组为","The maximum number of bytes to read from the current stream.":"从当前流读取的最大字节数。","A pointer to an unmanaged memory location.":"指向不受管理的内存位置的指针。","A task that represents the asynchronous read operation, and wraps the total number of bytes read into the buffer.":"代表异步读取操作的任务，并将读取的字节总数包装到缓冲区中。","The total number of bytes read into the destination.":"字节的总数读取到目的地。","The byte position in the buffer at which to start the unmanaged memory stream.":"在缓冲区中的字节位置，以启动非托管内存流。","The offset in the buffer at which to begin copying bytes to the current stream.":"缓冲区中开始将字节复制到当前流的偏移量。","The length of the memory to use.":"要使用的内存长度。"," object, or -1 if at the end of the stream.":"对象，或-1在流的末端。","The length of the unmanaged memory stream.":"不受管理的内存流的长度。","When the asynchronous method finishes, this memory region contains all the bytes read from the unmanaged memory stream.":"当异步方法完成时，此内存区域包含从未管理的内存流中读取的所有字节。","The number of bytes to write to the current stream.":"写入当前流的字节数。"," to begin seeking from.":"开始寻求。","The total amount of memory assigned to the stream.":"分配给流的内存总量。","The mode of file access to the unmanaged memory stream.":"对未托管内存流的文件访问方式。"," parameter that did not include reading the stream and if the stream is closed; otherwise, ":"参数不包括读取流和流是否关闭； 否则，","The byte array from which to copy bytes to the current stream.":"将字节复制到当前流的字节数组。","A byte value written to the stream.":"写入流的字节值。","The length of the data in the stream.":"流中数据的长度。"," if the stream is closed; otherwise, ":"如果流关闭； 否则，","An object that provides additional information about the error.":"提供有关错误的其他信息的对象。"," if the object was created by a constructor with an ":"如果对象是由构造函数创建的"," to make this instance usable concurrently by multiple threads; ":"使此实例可通过多个线程同时使用；","A byte pointer.":"字节指针。"," parameter value that supports writing or was created by a constructor that had no parameters, or if the stream is closed; otherwise, ":"支持写作或由没有参数的构造函数创建的参数值，或者流关闭； 否则，","The object that is to receive notifications.":"接收通知的对象。","The current notification information.":"当前的通知信息。","One of the enumeration values that specifies the thread safety mode.":"指定线程安全模式的枚举值之一。"," to make the instance usable by only one thread at a time.":"使实例一次仅通过一个线程可用。","The size or capacity of the stream.":"流的大小或容量。","A reference to an interface that allows observers to stop receiving notifications before the provider has finished sending them.":"对界面的引用，该接口允许观察者在提供商完成发送之前停止接收通知。","The value of the updated progress.":"更新进度的价值。","The result of calling the ":"打电话给","The delegate that is invoked to produce the lazily initialized value when it is needed.":"需要在需要时引起懒惰初始化值的代表。"," if a value has been created for this ":"如果为此创建了一个值","The preinitialized value to be used.":"用于使用的原始化值。"," property for this instance, if the value has been created (that is, if the ":"此实例的属性，如果创建了值（也就是说，如果"," object that is created will be thread-safe.":"创建的对象将是线程安全。"," constant.":"持续的。"," to make this instance usable by only one thread at a time.":"使此实例一次仅通过一个线程可用。","The lazily initialized value of the current ":"电流的懒惰初始化值","The thread synchronization mode.":"线程同步模式。","). Otherwise, a string indicating that the value has not been created.":"）。 否则，一个字符串表示该值尚未创建。","A number that is greater than or equal to ":"一个大于或等于","A function that returns the referenced object.":"返回引用对象的函数。","The metadata associated with the referenced object.":"与引用对象关联的元数据。","Indicates whether the ":"指示是否","A value equivalent to a ":"等效于一个的值"," object's identity, which will cause the object to be assigned a new identity when it is marshaled across a remoting boundary. A value of ":"对象的身份，这将导致对象在远程边界上进行封为新身份。 一个值",", but less than or equal to ":"，但小于或等于"," must be greater than or equal to -1, but less than or equal to 1.":"必须大于或等于-1，但小于或等于1。","A decimal number, x, such that 0 ≤ x ≤ ":"小数号，x，使得0≤x≤"," used to control the lifetime policy for this instance.":"用于控制此实例的生命周期策略。","A number that is greater than ":"一个大于"," is usually appropriate. ":"通常是合适的。","An angle, θ, measured in radians, such that 0 ≤ θ ≤ π.\n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得0≤θ≤π。 \n  \n  -或者-","A double-precision floating-point number, x, such that 0 ≤ x ≤ ":"双精度的浮点数x，使得0≤x≤"," object's identity to its clone, which will cause remoting client calls to be routed to the remote server object.":"对象对其克隆的身份，这将导致远程客户端调用路由到远程服务器对象。"," used to control the lifetime policy for this instance. This is the current lifetime service object for this instance if one exists; otherwise, a new lifetime service object initialized to the value of the ":"用于控制此实例的生命周期策略。 如果存在，这是本实例的当前寿命服务对象； 否则，将新的寿命服务对象初始化为"," < -1 or ":"<-1或","A 16-bit signed integer, x, such that 0 ≤ x ≤ ":"一个16位签名的整数，x，使得0≤x≤"," to delete the current ":"删除电流","A number representing a sine, where ":"代表正弦的数字","A shallow copy of the current ":"电流的浅副本","A 32-bit signed integer, x, such that 0 ≤ x ≤ ":"一个32位签名的整数，x，使得0≤x≤"," > 1 or ":"> 1或","An angle, θ, measured in radians, such that -π/2 ≤ θ ≤ π/2.\n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得-π/2≤θ≤π/2。 \n  \n  -或者-",", or π/2 rounded to double precision (1.5707963267949) if ":"或π/2舍入双重精度（1.5707963267949）","A number representing a hyperbolic cosine, where ":"代表双曲余弦的数字，其中","A 64-bit signed integer, x, such that 0 ≤ x ≤ ":"一个64位签名的整数，x，使得0≤x≤",") in quadrant 2, π/2 < θ ≤ π.\n  \n-   For (":"）正方形2，π / 2 <θ≤π。 \n  \n - 为了 （","A number representing a hyperbolic sine, where ":"代表双曲正弦的数字，其中","The y coordinate of a point.":"点的y坐标。","A native signed integer, x, such that 0 ≤ x ≤ ":"本机签名的整数x，使得0≤x≤x"," must be greater than or equal to 1, but less than or equal to ":"必须大于或等于1，但小于或等于",") in quadrant 3, -π < θ < -π/2.  \n  \n-   For (":"）在象限3中，-π<θ<-π / 2。 \n  \n - 为了 （"," must be greater than or equal to ":"必须大于或等于","The x coordinate of a point.":"点的X坐标。","An 8-bit signed integer, x, such that 0 ≤ x ≤ ":"一个8位签名的整数，x，使得0≤x≤","An angle, θ, measured in radians, such that 0 ≤ θ ≤ ∞.  \n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得0≤θ≤∞。 \n  \n  -或者-","A single-precision floating-point number, x, such that 0 ≤ x ≤ ":"单精度的浮点数x，使得0≤x≤","An angle, θ, measured in radians. \n  \n -or-  \n  \n ":"一个角度，θ，以弧度测量。 \n  \n  -或者-","An angle, θ, measured in radians, such that -π ≤ θ ≤ π, and tan(θ) = ":"一个角度为θ，以弧度测量，使得-π≤θ≤π和tan（θ）=",") in quadrant 4, -π/2 < θ < 0.  \n  \n For points on the boundaries of the quadrants, the return value is the following:  \n  \n-   If y is 0 and x is not negative, θ = 0.  \n  \n-   If y is 0 and x is negative, θ = π.  \n  \n-   If y is positive and x is 0, θ = π/2.  \n  \n-   If y is negative and x is 0, θ = -π/2.  \n  \n-   If y is 0 and x is 0, θ = 0.  \n  \n If ":"）在象限4中，-π/2 <θ<0。 \n  \n  对于象限边界上的点，返回值为以下： \n  \n  - 如果y为0，x不是负，则θ= 0。 \n  \n  - 如果y为0，x为负，则θ=π。 \n  \n  - 如果y为正，x为0，则θ=π/2。 \n  \n  - 如果y为负，x为0，则θ=-π/2。 \n  \n  - 如果y为0，x为0，则θ= 0。 \n  \n  如果"," < 1 or ":"<1或"," / ":"/","A number representing a tangent.":"代表切线的数字。"," are either ":"是","A number representing a cosine, where ":"代表余弦的数字","The high 64-bit of the product of the specied numbers.":"物种数量的产物的高64位。","An angle, θ, measured in radians, such that -π/2 ≤ θ ≤ π/2.  \n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得-π/2≤θ≤π/2。 \n  \n  -或者-",", where (":"， 在哪里 （",", that value is returned. Note that this method returns a ":"，返回该值。 请注意，此方法返回","The next smallest value that compares less than ":"比较小于",", -π/2 rounded to double precision (-1.5707963267949) if ":"，-π/2舍入双重精度（-1.5707963267949）","The value to be clamped.":"要夹紧的值。","A number representing a hyperbolic tangent, where ":"代表双曲线切线的数字，其中",") is a point in the Cartesian plane. Observe the following:\n  \n-   For (":"）是笛卡尔平面中的一点。 观察以下内容： \n  \n -   为了 （",".\n  \n -or-  \n  \n ":"。 \n  \n  -或者-","The lower bound of the result.":"结果的下限。","An angle, θ, measured in radians, such that -∞ < θ < -1, or 1 < θ < ∞. \n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得-∞<θ<-1或1 <θ<∞。 \n  \n  -或者-","A number whose magnitude is used in the result.":"一个数字在结果中使用。","The next largest value that compares greater than ":"比较大于",") in quadrant 1, 0 < θ < π/2.  \n  \n-   For (":"）象限1，0 <θ<π / 2。 \n  \n - 为了 （","The upper bound of the result.":"结果的上限。","A number whose sign is the used in the result.":"一个数字在结果中使用的符号。","The number containing the product of the specified numbers.":"包含指定数字的乘积的数字。","The number whose cube root is to be found.":"要找到立方根的数字。","The quotient of the specified numbers.":"指定数字的商。"," ≤ ":"≤","The low 64-bit of the product of the specified numbers.":"指定数字的产品的低64位。","A number specifying a power.":"指定电源的数字。"," <":"<","A value with the magnitude of ":"具有大小的值","The cube root of ":"立方根的根",", that value is returned. If ":"，返回该值。 如果",".\n  \n -or-  \n  \n  ":"。 \n  \n  -或者-"," multiplied by ":"乘以",".\n             -or- \n               ":"。 \n              -或者-",", 0 is returned.":"，返回0。","The smallest integral value that is greater than or equal to ":"最小的积分值大于或等于"," and the sign of ":"和标志","(x * y) + z, rounded as one ternary operation.":"（x * y） + z，被舍入一个三元操作。","The largest integral value less than or equal to ":"最大的积分值小于或等于"," falls halfway between two integers, the even integer is returned).  \n  \n If ":"落在两个整数之间的一半，返回整数）。 \n  \n  如果",". Note that this method returns a ":"。 请注意，此方法返回","An angle, measured in radians.":"一个以弧度测量的角度。",".  Note that the method returns an integral value of type ":"。 请注意，该方法返回类型的积分值"," Q) is zero, the value +0 is returned if ":"q）为零，如果返回值+0，如果",", and NaN denotes ":"，而南表示","A dividend.":"股息。"," is returned. If ":"退回。 如果",".)  \n  \n ":"）","The number to be multiplied with ":"要乘以"," is positive, or -0 if ":"是积极的，或-0如果","A divisor.":"除数。","The quotient and the remainder of the specified numbers.":"商和其余的指定数字。","The first of two 8-bit unsigned integers to compare.":"两个8位未签名整数中的第一个要比较。","The number to be added to the result of ":"要添加到结果的数字"," is negative.  \n  \n If ":"负面。 \n  \n  如果","The remainder.":"其余的。","A number equal to ":"等于","The first of two double-precision floating-point numbers to compare.":"要比较的两个双精度浮点数中的第一个。","The second of two 8-bit unsigned integers to compare.":"两个8位未签名整数中的第二个要进行比较。"," - (":" - （（（"," = 0, ":"= 0，","The second of two 32-bit signed integers to compare.":"两个32位签名的整数中的第二个要进行比较。","The second of two double-precision floating-point numbers to compare.":"要比较两个双精度浮点数中的第二个。","Parameter ":"范围","One of the values in the following table.  \n  \n ":"下表中的值之一。","The first of two 64-bit signed integers to compare.":"两个64位签名整数中的第一个要比。"," Q), where Q is the quotient of ":"问），其中Q是",", whichever is larger. If ":"，以较大者为准。 如果",", whichever is larger.":"，以较大者为准。","One of the values in the following table. (+Infinity denotes ":"下表中的值之一。 （+无穷大表示"," rounded to the nearest integer (if ":"四舍五入到最近的整数（如果","The second of two 64-bit signed integers to compare.":"两个64位签名的整数中的第二个要进行比较。",", or both ":"， 或两者","The first of two decimal numbers to compare.":"要比较的两个小数数中的第一个。",", -Infinity denotes ":"， -  infinity表示"," are equal to ":"等于","The second of two single-precision floating-point numbers to compare.":"要比较两个单精度浮点数中的第二个。","The first of two native signed integers to compare.":"两个本地签名整数中的第一个要比较。","The second of two decimal numbers to compare.":"要比较的两个小数数中的第二个。","The first of two 16-bit signed integers to compare.":"两个16位签名的整数中的第一个要比。","The second of two native unsigned integers to compare.":"两个本机未签名整数中的第二个要比较。","The first of two 16-bit unsigned integers to compare.":"两个16位未签名的整数中的第一个要比较。","The second of two native signed integers to compare.":"两个本地签名整数中的第二个要比较。"," that contains a number of fractional digits equal to ":"其中包含许多等于",", whichever has the larger magnitude. If ":"，以较大的幅度为准。 如果","The second of two 16-bit signed integers to compare.":"两个16位签名的整数中的第二个要进行比较。","The second of two 16-bit unsigned integers to compare.":"两个16位未签名的整数中的第二个要进行比较。","The first of two 8-bit signed integers to compare.":"两个8位签名整数中的第一个要比。","The number with ":"带有数字",", whichever is smaller.":"，以较小者为准。","The first of two 32-bit signed integers to compare.":"两个32位签名整数中的第一个要比。","The second of two 8-bit signed integers to compare.":"两个8位签名整数中的第二个要进行比较。","The first of two 32-bit unsigned integers to compare.":"两个32位未签名的整数中的第一个要比较。",", whichever is smaller. If ":"，以较小者为准。 如果"," fractional digits that ":"分数数字","A number that indicates the sign of ":"一个指示标志的数字","The second of two 32-bit unsigned integers to compare.":"两个32位未签名的整数中的第二个要进行比较。",", whichever has the smaller magnitude. If ":"，以较小的尺寸为准。 如果","The first of two single-precision floating-point numbers to compare.":"要比较的两个单精度浮点数中的第一个。","A signed number.":"一个签名号。"," is rounded to. If ":"被舍入。 如果","The sine and cosine of ":"正弦和余弦","The first of two 64-bit unsigned integers to compare.":"两个64位未签名的整数中的第一个要比较。","The next largest value that is greater than ":"第二大价值大于","A double-precision floating-point number to be raised to a power.":"要提高功率的双精度浮点数。"," has fewer fractional digits than ":"比分数少于","The number whose reciprocal is to be estimated.":"将估算的数字。","The second of two 64-bit unsigned integers to compare.":"两个64位未签名的整数中的第二个要进行比较。","The base.":"基地。",", this method returns a ":"，此方法返回"," is rounded to. This method returns a ":"被舍入。 此方法返回","An estimate of the reciprocal of ":"倒数的估计","The number whose square root is to be found.":"要找到平方根的数字。","A single-precision floating-point number to be raised to a power.":"单精度的浮点数要升至电源。","The first of two native unsigned integers to compare.":"两个本机未签名整数中的第一个要比较。","The number whose reciprocal square root is to be estimated.":"将要估计其倒数平方根的数字。","A double-precision floating-point number to be rounded.":"要舍入的双精度浮点数。",", this method returns -1. If value is equal to ":"，此方法返回-1。 如果值等于","A single-precision floating-point number that specifies a power.":"指定电源的单精度浮点数。","The number of elements to include in the slice.":"在切片中包含的元素数量。","An estimate of the reciprocal square root ":"倒数平方根的估计值","A single-precision floating-point number to be rounded.":"一个单精度的浮点数要舍入。",", this method returns 1. If ":"，此方法返回1.如果","The integer nearest ":"整数最近",". If the fractional component of ":"。 如果是","An object that contains ":"一个包含的对象"," is rounded to that has ":"被舍入的","A number to truncate.":"一个要截断的数字。","A decimal number to be rounded.":"小数号要舍入。"," elements from the current instance starting at ":"从当前实例开始的元素"," is halfway between two integers, one of which is even and the other odd, then the even number is returned. Note that this method returns a ":"是两个整数之间的一半，一个是偶数，另一个是奇数，然后返回偶数。 请注意，此方法返回"," fractional digits. If ":"分数数字。 如果","The integral part of ":"不可或缺的部分","The integer nearest the ":"整数最近","An array containing the elements in the current memory.":"一个包含当前内存中元素的数组。"," rounding convention. This method returns a ":"舍入惯例。 此方法返回","The number of fractional digits in the return value.":"返回值中的分数数字数。"," parameter. If the fractional component of ":"范围。 如果是","; that is, the number that remains after any fractional digits have been discarded.":"; 也就是说，在丢弃任何分数数字后仍保留的数字。","the string representation of this ":"字符串表示"," is halfway between two integers, one of which is even and the other odd, the even number is returned. Note that this method returns a ":"是两个整数之间的一半，一个是偶数，另一个是奇数，均匀的数字被返回。 请注意，此方法返回","A single-precision floating-point number that specifies the base value.":"指定基本值的单精度浮点数。","The number that has ":"具有的数字"," if the copy operation succeeds; otherwise, ":"如果复制操作成功； 否则，","; that is, the number that remains after any fractional digits have been discarded, or one of the values listed in the following table.  \n  \n ":"; 也就是说，在丢弃任何分数数字之后保留的数字，或下表中列出的值之一。","A single-precision floating-point number that specifies the power.":"指定功率的单精度浮点数。","The number of decimal places in the return value.":"返回值中的小数位数。","An angle, θ, measured in radians, such that 0 ≤ θ ≤ ∞.\n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得0≤θ≤∞。 \n  \n  -或者-","An empty object.":"一个空的对象。","A double-precision floating-point number that specifies the base value.":"指定基本值的双精度浮点数。","The array from which to create the ":"创建的数组","The number nearest to ":"最接近的数字",") is a point in the Cartesian plane. Observe the following:  \n  \n-   For (":"）是笛卡尔平面中的一点。 观察以下内容： \n  \n -   为了 （"," if the current instance is empty; otherwise, ":"如果当前实例为空； 否则，","A 32-bit integer that specifies the power.":"一个指定功率的32位整数。","The source array.":"源数组。",") in quadrant 2, π/2 < θ ≤ π.  \n  \n-   For (":"）正方形2，π / 2 <θ≤π。 \n  \n - 为了 （","The name of the class in which access to a nonexistent member was attempted.":"尝试访问不存在的成员的班级名称。","x * 2^n computed efficiently.":"x * 2^n有效地计算出来。","The number of items in the current instance.":"当前实例中的项目数。","An angle, θ, measured in radians, such that -∞ < θ <-1, or 1 < θ < ∞.  \n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，使得-∞<θ<-1或1 <θ<∞。 \n  \n  -或者-","The index of the first element to include in the new ":"新的第一个元素的索引","A signed decimal number.":"一个签名的小数号。","The name of the member that cannot be accessed.":"无法访问的成员名称。","A span created from the current ":"从当前创建的跨度"," is equals ":"是平等的","The number of elements to include in the new ":"新的元素数量","The name of the class in which access to a nonexistent field was attempted.":"尝试访问不存在的字段的班级名称。","The name of the class in which access to a nonexistent method was attempted.":"尝试访问不存在的方法的类的名称。"," structures representing the generic type arguments of the method where the token is in scope, or ":"代表令牌范围中的方法的通用类型参数的结构，或"," have the same invocation lists; otherwise, ":"具有相同的调用列表； 否则，","An object that contains all elements of the current instance from ":"一个包含当前实例的所有元素的对象","The name of the field that cannot be accessed.":"无法访问的字段名称。"," do not have the same invocation lists; otherwise, ":"没有相同的调用列表； 否则，"," structures objects representing the generic type arguments of the method where the token is in scope, or ":"结构对象表示令牌范围中的方法的通用类型参数，或","The name of the method that cannot be accessed.":"无法访问的方法的名称。"," to the end of the instance.":"到实例的末尾。"," that is the cause of the current ":"那是当前的原因"," structure to be compared with the current ":"将结构与电流进行比较","The delegate to search for in the invocation list.":"在调用列表中搜索的代表。","The object on which ":"对象","The count, in bytes, to decode from the ":"计数，在字节中，从"," is found in the invocation list for this instance, then a new ":"在此实例的调用列表中找到，然后是新的","The object to be compared with the current ":"将对象与电流进行比较"," is not a null reference (":"不是零引用（","A decoded ":"一个解码"," without ":"没有","The name of the method for which a delegate is created.":"创建委托的方法的名称。"," structure, and is equal to the current ":"结构，等于电流"," in its invocation list; otherwise, this instance with its original invocation list.":"在其调用列表中； 否则，此实例带有其原始调用列表。","The text to URL-encode.":"URL字母的文字。"," in Visual Basic), then the current ":"在Visual Basic中），然后是当前","The type of object on which ":"对象的类型","The string to decode.":"要解码的字符串。","A 32-bit signed integer that is the hash code for this instance.":"一个32位签名的整数，是此实例的哈希代码。","A URL-encoded string.":"URL编码的字符串。","The name of the static method for which a delegate is created.":"创建委托的静态方法的名称。"," is raised in a catch block handling ":"在捕获块处理中抬起"," for the field identified by ":"对于由","A decoded string.":"一个解码的字符串。"," array to URL-encode.":"数组到URL字母。","The delegate to combine with this delegate.":"与此代表结合的代表。"," stream of output.":"输出流。","The type argument of the ":"类型参数"," for the method or constructor identified by ":"对于由"," array to encode.":"编码的数组。","The string to encode.":"用于编码的字符串。"," for the type identified by ":"对于确定的类型","A delegate that is the new root of the ":"代表，这是"," parameter, if the ":"参数，如果","An encoded string.":"一个编码的字符串。","The count, in bytes, to encode from the ":"计数，在字节中，从"," structure to the left of the equality operator.":"平等操作员左侧的结构。"," parameter is a closed generic nullable type; otherwise, ":"参数是一种封闭的通用性nullable类型； 否则，"," invocation list.":"调用列表。"," output stream.":"输出流。","An encoded ":"编码"," structure to the right of the equality operator.":"平等操作员右侧的结构。","A value type.":"值类型。"," and this instance have the same invocation lists; otherwise, ":"并且此实例具有相同的调用列表； 否则，","A URL-encoded string to decode.":"解码的URL编码字符串。"," structure to the left of the inequality operator.":"不等式操作员左侧的结构。","The value of the argument that caused the exception.":"引起异常的论点的价值。",".  \n  \n This table describes how equality is defined for the compared values:  \n  \n ":"。 \n  \n  该表描述了如何为比较值定义平等：","An array of delegates whose invocation lists collectively match the invocation list of this instance.":"一系列委托列表的委托列表共同匹配了此实例的调用列表。"," structure to the right of the inequality operator.":"不平等操作员右侧的结构。","The invalid number.":"无效号码。","The hash code of the object returned by the ":"对象的哈希代码由","A static method represented by the current ":"电流表示的静态方法","An integer that indicates the relative values of the ":"一个表示表示相对值的整数"," structures representing the generic type arguments of the type where the token is in scope, or ":"代表令牌范围中的类型的通用类型参数的结构，或",", or zero if the ":"，或为零",", or an empty string (\"\") if the ":"，或一个空字符串（“”）如果","An object that holds all the data needed to serialize or deserialize this instance.":"保留序列化或应对此实例所需的所有数据的对象。"," parameters.  \n  \n ":"参数。"," property if the  ":"属性，如果是"," parameter is equal to the ":"参数等于"," object has a value; ":"对象具有一个值；","A URL-encoded ":"URL编码的 ","; otherwise, the default value of the underlying type.":"; 否则，基础类型的默认值。","(Reserved) The location where serialized data is stored and retrieved.":"（保留）存储和检索串行数据的位置。","A value to return if the ":"如果一个值",".  \n  \n The return value depends on the ":"。 \n  \n  返回值取决于"," object has no value.":"对象没有价值。","The left operand.":"左操作数。","; otherwise, the ":"; 否则，"," array to decode.":" 阵进行解码。"," properties of the two parameters that are compared.  \n  \n ":"比较两个参数的属性。",". An exception is thrown if the ":"。 如果有例外","The offset, in bytes, from the start of the ":"从字节开始的偏移。","The right operand.":"合适的操作数。","A nullable value.":"一个无效的值。","The exception that is the cause of the current exception. If ":"例外是当前异常的原因。 如果","The value to evaluate as being a power of two.":"评估为两者的力量的价值。"," object that describes a closed generic nullable type.":"描述封闭的通用无效类型的对象。","The value to round up to a power of two.":"汇总到两个力量的价值。","The name of the disposed object.":"处置对象的名称。"," property for the ":" 物业 ","The smallest power of two that's greater than or equal to ":"两者中最小的功率，大于或等于"," if the specified value is a power of two; ":"如果指定的值是两个的幂；","The major release number.":"主要发行号。","A string that describes the error.":"描述错误的字符串。",".\n            If ":"。 \n             如果","The mask.":"面具。"," property is initialized with the ":"属性是用","The minor release number.":"次要发行号。"," is 0 or the result overflows, returns 0.":"为0或结果溢出，返回0。","The text string that describes alternative workarounds.":"描述替代解决方法的文本字符串。",".\n\nIf ":"。 \n\n 如果","The build release number.":"构建发布号。","The number of leading zero bits in a mask.":"面具中的零位数的数量。","The text representation of the value of the current ":"当前值的文本表示 "," if the obsolete element usage generates a compiler error; ":"如果过时的元素用法会生成编译器误差；","The number of trailing zero bits in the integer value.":"整数值中尾部零位的数量。","The number from which to obtain the logarithm.":"获得对数的数字。","The revision release number.":"修订版本编号。"," if it generates a compiler warning.":"如果生成编译器警告。"," object if the ":"对象，如果是","The log of the specified value, base 2.":"指定值的日志，基数2。","The number of trailing zero bits in the mask.":"掩码中尾随零位的数量。"," if the current application is running on macOS; ":"如果当前应用程序在MacOS上运行；"," if the current application is running on an Android version that is at least what was specified in the parameters; ":"如果当前应用程序在Android版本上运行，该版本至少是参数中指定的内容；","The unique diagnostic ID.":"独特的诊断ID。","The population count of a mask.":"面具的人口计数。"," if the specified object  is equal to the current object; otherwise, ":"如果指定的对象等于当前对象； 否则，"," if the current application is running on an macOS version that is at least what was specified in the parameters; ":"如果当前应用程序在MACOS版本上运行，该版本至少是参数中指定的内容；"," if the obsolete element usage is considered an error; otherwise, ":"如果过时的元素使用被认为是错误； 否则，"," if the current application is running as WASM in a browser; ":"如果当前应用程序正在运行，则在浏览器中运行；","The population count of the mask.":"面具的人口计数。","The case-insensitive platform name. Examples: Browser, Linux, FreeBSD, Android, iOS, macOS, tvOS, watchOS, Windows.":"案例不敏感的平台名称。 示例：浏览器，Linux，FreeBSD，Android，iOS，MacOS，TVOS，WatchOS，Windows。"," if the objects are considered equal; otherwise, ":"如果对象被认为是平等的； 否则，"," if the current application is running on FreeBSD; ":" 如果当前应用程序在FreeBSD上运行; ","The value to rotate.":"旋转的值。"," if the current application is running on the specified platform; ":"如果当前应用程序在指定平台上运行；",". If both ":"。 如果两者","The number of bits to rotate by. Any value outside the range [0..31] is treated as congruent mod 32.":"要旋转的位数。 [0..31]范围之外的任何值都被视为一致的mod 32。"," if the current application is running on a FreeBSD version that is at least what was specified in the parameters; ":"如果当前应用程序在freeBSD版本上运行，该版本至少是参数中指定的内容；","The minor release number (optional).":"次要发行号（可选）。"," are null, the method returns ":"是零，方法返回"," if the current application is running on iOS; ":"如果当前应用程序在iOS上运行；","The rotated value.":"旋转值。","The build release number (optional).":"构建发布号（可选）。","The exact runtime type of the current instance.":"当前实例的确切运行时类型。","The number of bits to rotate by. Any value outside the range [0..63] is treated as congruent mod 64.":"要旋转的位数。 [0..63]范围之外的任何值都被视为一致的mod 64。","The revision release number (optional).":"修订版本编号（可选）。"," if the current application is running on an iOS version that is at least what was specified in the parameters; ":" 如果当前应用程序运行的iOS版本至少是参数中指定的; ","The second object  to compare.":"比较的第二个对象。"," object that describes the major version, minor version, build, and revision numbers for the operating system.":"描述操作系统的主要版本，次要版本，构建和修订号的对象。"," if the current application is running on the specified platform and is at least in the version specified in the parameters; ":"如果当前应用程序在指定的平台上运行，并且至少在参数中指定的版本中；"," is the same instance as ":"与","A cancellation token associated with the operation that was canceled.":"与已取消的操作相关的取消令牌。"," if the current application is running on Linux; ":"如果当前应用程序在Linux上运行；"," if the current application is running on tvOS; ":"如果当前的应用程序在TVOS上运行；"," or if both are null; otherwise, ":"或者两者都是无效的； 否则，","A token associated with the operation that was canceled, or a default token.":"与已取消的操作或默认令牌相关的令牌。"," if the current application is running on Mac Catalyst; ":"如果当前应用程序在MAC Catalyst上运行；","The version major number.":"版本主要编号。"," if the current application is running on a tvOS version that is at least what was specified in the parameters; ":"如果当前应用程序在TVOS版本上运行，该版本至少是参数中指定的内容；","The text message that explains the reason for the exception.":"说明例外原因的短信。","A string containing the name of the disposed object.":"包含处置对象名称的字符串。","The version minor number.":"版本次要编号。","The object to compare against the criteria defined within the method represented by this delegate.":"与该代表表示的方法中定义的标准进行比较的对象。"," if the current application is running on watchOS; ":"如果当前的应用程序在WatchOS上运行；","The exclusive end index of the range.":"该范围的独家端索引。"," meets the criteria defined within the method represented by this delegate; otherwise, ":"符合该代表代表的方法中定义的标准； 否则，","The version build number.":"版本构建号码。","The position of the last element up to which the ":"最后一个元素的位置"," if the current application is running on a watchOS version that is at least what was specified in the parameters; ":"如果当前应用程序在WatchOS版本上运行，该版本至少是参数中指定的内容；","A handler to invoke for each reported progress value. This handler will be invoked in addition to any delegates registered with the ":"一个用于调用每个报告的进度值的处理程序。 除了在"," if the Mac Catalyst version is greater or equal than the specified version comparison; ":"如果MAC Catalyst版本大于或等于指定版本的比较；"," if the current application is running on Windows; ":"如果当前应用程序在Windows上运行；"," object will be created.":"将创建对象。"," event. Depending on the ":"事件。 取决于","A pointer to the starting address of a specified number of ":"指向指定号码的起始地址的指针"," instance captured by the ":"实例由","A range that starts from the first element to ":"从第一个元素到"," if the current application is running on a Windows version that is at least what was specified in the parameters; ":"如果当前应用程序在Windows版本上运行，该版本至少是参数中指定的内容；"," elements in memory.":"内存中的元素。"," at construction, it is possible that this handler instance could be invoked concurrently with itself.":"在施工时，可能会同时调用此处理程序实例。"," elements to be included in the ":"要包含在","An object to compare with this Range object.":"与此范围对象进行比较的对象。","The string representation of the values returned by the ":"由","A number used to calculate a starting value for the pseudo-random number sequence. If a negative number is specified, the absolute value of the number is used.":"用于计算伪随机数序列的起始值的数字。 如果指定了负数，则使用数字的绝对值。","The service pack version, if service packs are supported and at least one is installed; otherwise, an empty string (\"\").":"服务包版本，如果支持服务包，并且至少安装了一个服务包； 否则，一个空字符串（“”）。","A Range object to compare with this Range object.":"与此范围对象进行比较的范围对象。","An enumerator for this read-only span.":"此仅阅读跨度的枚举器。","A 32-bit signed integer that is greater than or equal to 0 and less than ":"一个大于或等于0且小于0的32位签名整数"," if the current instance is equal to ":"如果当前实例等于"," objects via reflection. If ":"通过反射对象。 如果","A reference to the element of the span at index 0, or ":"对索引0处的跨度元素的引用，或","The exclusive upper bound of the random number to be generated. ":"要生成的随机数的独家上限。","A positive integer that represents the length of the collection that the range will be used with.":"代表将使用范围的集合长度的正整数。","An array that contains the arguments to be passed to the constructor. This array of arguments must match in number, order, and type the parameters of the constructor to be invoked. If the parameterless constructor is desired, ":"包含要传递给构造函数的参数的数组。 这个参数数组必须匹配要调用的构造函数的参数。 如果需要无参数构造函数，"," must be greater than or equal to 0.":"必须大于或等于0。"," if the span is empty.":"如果跨度为空。","The start offset and length of the range.":"范围的开始偏移和长度。"," must be an empty array or ":"必须是一个空数组或","A 32-bit signed integer that is greater than or equal to 0, and less than ":"一个大于或等于0的32位签名整数，小于","The first span to compare.":"第一个比较的跨度。"," for the current thread is used. (This is necessary to convert a string that represents 1000 to a ":"用于当前线程。 （这是必须将代表1000的字符串转换为","The position of the first element from which the Range will be created.":"创建范围的第一个元素的位置。","The second span to compare.":"第二个要比的跨度。","; that is, the range of return values ordinarily includes 0 but not ":"; 也就是说，返回值的范围通常包括0但不包括","A range from ":"来自"," value, for example, since 1000 is represented differently by different cultures.)":"例如，由于1000的代表不同。）","The array to convert to a ":"转换为一个的数组",". However, if ":"。 但是，如果"," object that specifies the URL that is required to activate a remote object.  This parameter is related to client-activated objects. Client activation is a legacy technology that is retained for backward compatibility but is not recommended for new development. Distributed applications should instead use Windows Communication Foundation.":"指定激活远程对象所需的URL的对象。 此参数与客户激活的对象有关。 客户激活是一种遗留技术，保留了向后兼容性，但不建议用于新开发。 分布式应用程序应该使用Windows Communication Foundation。"," to the end of the collection.":"到收藏的尽头。","The read-only span that corresponds to ":"仅读取的跨度对应于"," equals 0, ":"等于0，","An instance of the specified type, or ":"指定类型的实例，或","The string representation of the range.":"范围的字符串表示。","The array segment to be converted to a ":"要转换为一个的数组段","The inclusive lower bound of the random number returned.":"随机数返回的包含下限。"," is not found. The supplied arguments are used to resolve the type, and to bind the constructor that is used to create the instance.":"找不到。 提供的参数用于解析类型，并绑定用于创建实例的构造函数。","A range from the start to the end.":"从开始到结束的范围。","A read-only span that corresponds to the array segment.":"与数组段相对应的仅读取跨度。","The exclusive upper bound of the random number returned. ":"返回随机数的独家上限。","The display name of an assembly.":"组件的显示名称。","The first read-only span to compare.":"比较的第一个仅阅读跨度。","The end index of the range.":"范围的端索引。","The full name of a type.":"类型的全名。","A 32-bit signed integer greater than or equal to ":"一个32位签名的整数大于或等于","The memory region to copy items into.":"存储区域要复制项目。","The second read-only span to compare.":"第二个仅阅读跨度要进行比较。"," and less than ":"而且少于","The full name of the type qualified by the display name of the assembly.":"由汇编显示名称合格的类型的全名。","The read-only memory to compare.":"仅读取的内存要比较。"," instances are not equal; otherwise, ":"实例不等； 否则，","; that is, the range of return values includes ":"; 也就是说，返回值的范围包括","An array of type T to convert.":"T型T型阵列要转换。","An object representing a type in the assembly that will be returned.":"代表将要返回的装配中类型的对象。","A span that consists of all elements of the current span from ":"由当前跨度的所有元素组成的跨度"," but not ":"但不是","The read-only memory representation of the array of type T.":"T型阵列的仅读取内存表示。","The assembly in which the specified type is defined.":"定义指定类型的组件。"," to the end of the span.":"到跨度的尽头。","The array to be filled with random numbers.":"填充随机数的数组。"," object of the method that invoked the currently executing method.":"调用当前执行方法的方法的对象。","A read-only memory representation of the array segment.":"数组段的仅读取内存表示。","A double-precision floating point number that is greater than or equal to 0.0, and less than 1.0.":"双精度浮点数大于或等于0.0，小于1.0。","A read-only span that consists of ":"仅阅读跨度包括","A handle for the memory.":"记忆的手柄。","This argument is ignored for objects of type ":"对于类型的对象，忽略了此参数","A 64-bit signed integer that is greater than or equal to 0 and less than ":"一个大于或等于0且小于0的64位签名整数"," elements from the current span starting at ":"当前跨度的元素从","A read-only memory region representing the desired slice.":"仅读取的内存区域，代表所需的切片。","An array that contains the custom attributes for this assembly.":"包含此组件的自定义属性的数组。","An array containing the data in the current span.":"在当前跨度中包含数据的数组。","A 64-bit signed integer that is greater than or equal to 0, and less than ":"一个大于或等于0的64位签名整数，小于",", returns a new instance of string that represents the characters pointed to by the memory. Otherwise, returns a ":"，返回字符串的新实例，该实例表示内存指向的字符。 否则，返回","The type for which the custom attributes are to be returned.":"返回自定义属性的类型。","The string representation of this instance.":"此实例的字符串表示。","A 64-bit signed integer greater than or equal to ":"一个64位签名的整数大于或等于"," with the name of the type and the number of elements.":"带有类型的名称和元素数。","An array that contains the custom attributes for this assembly as specified by ":"一个包含该汇编的自定义属性的数组，",". If minValue equals ":"。 如果Minvalue等于","The target of the copy operation.":"复制操作的目标。"," if the copy operation succeeded. ":"如果复制操作成功。"," objects representing data about the attributes that have been applied to the current assembly.":"代表有关已应用于当前组件的属性的数据。","A single-precision floating point number that is greater than or equal to 0.0, and less than 1.0.":"单精度的浮点数大于或等于0.0，小于1.0。"," if the copy operation succeeded; otherwise, ":"如果复制操作成功； 否则，"," is smaller than the current instance, and no data is written to ":"小于当前实例，没有将数据写入","The assembly that is the process executable in the default application domain, or the first executable that was executed by ":"是默认应用程序域中可执行的过程的汇编，或者是由","The inclusive start index of the range.":"该范围的包容性开始索引。","An empty read-only memory region.":"一个空的只读内存区域。"," when the current span is empty; otherwise ":"当当前跨度为空时； 否则",". Can return ":"。 可以返回","The case-sensitive name of the manifest resource being requested.":"案例敏感的名称是要请求的清单资源。"," if the read-only memory region is empty (that is, its ":"如果仅读取的内存区域是空的（也就是说"," when called from unmanaged code.":"从非托管代码调用时。","The element from the read-only span.":"仅读取跨度的元素。","The manifest resource; or ":"清单资源； 或者"," is 0); otherwise, ":"是0）; 否则，","The assembly that contains the code that is currently executing.":"包含当前执行的代码的程序集。"," if the end of the span has been passed.":"如果跨度的结束已通过。","A memory span.":"记忆跨度。"," if no resources were specified during compilation or if the resource is not visible to the caller.":"如果在汇编过程中未指定资源，或者呼叫者看不到资源。","An array that represents the types defined in this assembly that are visible outside the assembly.":"代表该组件中定义的类型的数组，在组件外可见。","A string indicating the reason this exception was thrown.":"一根弦表示此例外的原因。","The index of the first element to include.":"要包括的第一个元素的索引。","The name of the module being requested.":"要请求的模块的名称。","The name of the specified file. Do not include the path to the file.":"指定文件的名称。 不包括文件的路径。"," of the type to locate.":"要定位的类型。","The number of elements to include.":"要包括的元素数量。","An object that contains the fully parsed display name for this assembly.":"包含此组件的完全解析的显示名称的对象。","A stream that contains the specified file, or ":"包含指定文件的流或","An instance of the specified type created with the parameterless constructor; or ":"使用无参数构造器创建的指定类型的实例； 或者","The path of the file that contains the manifest of the assembly.":"包含组件清单的文件路径。"," to the location of the assembly after it was shadow copied; ":"在复制影子后，要到大会的位置；"," if the file is not found.":"如果找不到文件。"," is not found. The type is resolved using the default binder, without specifying culture or activation attributes, and with ":"找不到。 该类型是使用默认活页夹解决的，而无需指定文化或激活属性，并使用","An array of streams that contain the files.":"包含文件的一系列流。","The full name of the assembly, or the class name if the full name of the assembly cannot be determined.":"如果无法确定组件的全名，则组件的全名或类名。"," to the original location.":"到原始位置。"," to ignore the case of the type name; otherwise, ":"忽略类型名称的情况； 否则，","An array of modules.":"一个模块。","The location of the assembly as specified originally.":"按原始指定的组件位置。","A bitmask that affects the way in which the search is conducted. The value is a combination of bit flags from ":"一个影响搜索方式的bitmask。 该值是来自位旗的组合","An array that contains the fully parsed display names of all the assemblies referenced by this assembly.":"包含该组件引用的所有组件的完全解析的显示名称的数组。","The case-sensitive name of the resource.":"资源的案例敏感名称。","A string containing the name of the supported culture.":"一个包含受支持文化名称的弦。","A collection that contains this assembly's custom attributes.":"包含此组件的自定义属性的集合。","The full name of the type.":"该类型的全名。","An object that is populated with information about the resource's topology, or ":"带有有关资源拓扑信息的对象，或","The assembly default alias information.":"组件默认别名信息。","A collection of the types defined in this assembly.":"此组件中定义的类型的集合。","An array that contains the names of all the resources.":"包含所有资源名称的数组。","An object that represents the specified class, or ":"表示指定类或","A string containing the default alias information.":"包含默认别名信息的字符串。","An object that represents the entry point of this assembly. If no entry point is found (for example, the assembly is a DLL), ":"代表此组件的入口点的对象。 如果找不到入口点（例如，组件是DLL），则"," if the class is not found.":"如果找不到班级。","The full name of the assembly, or the class name if the full name cannot be determined.":"如果无法确定全名，则组件的全名或类名。"," if the feature this attribute represents is activated; otherwise, ":"如果该属性代表的功能被激活； 否则，"," to throw an exception if the type is not found; ":"如果找不到类型，请引发例外；","A URI with escape characters.":"带有逃生角色的URI。","A string that is the URL location of the assembly.":"一个是组件的URL位置的字符串。","An object that represents the specified class.":"表示指定类的对象。"," if this assembly has been built as delay-signed; otherwise, ":"如果该组件已作为延迟签名； 否则，","A collection of the public types defined in this assembly that are visible outside the assembly.":"在大会外可见的集合中定义的公共类型的集合。","A value that indicates what type of content the assembly contains.":"一个表示组件包含的内容类型的值。","An array that contains all the types that are defined in this assembly.":"一个包含此组件中定义的所有类型的数组。","The assembly description.":"集会描述。","An object that represents the culture supported by the assembly.":"代表集会支持的文化的对象。","\n          .NET Framework only: ":"仅.NET框架：","The type of the attribute to be checked for this assembly.":"要检查此组件的属性类型。","A string containing the assembly description.":"包含装配说明的字符串。","The culture name.":"文化名称。"," if the attribute has been applied to the assembly; otherwise, ":"如果属性已应用于组件； 否则，"," if the assembly was loaded from the global assembly cache; otherwise, ":"如果从整体组件缓存中加载了组件； 否则，","The file version.":"文件版本。","A value that represents the attributes of the assembly.":"代表组件属性的值。",".\n        \n          .NET Core and .NET 5.0 and later: ":"。 \n        \n           .NET CORE和.NET 5.0及以后：","A byte array that is a COFF-based image containing an emitted assembly.":"一个字节阵列，是一个基于COFF的图像，其中包含发射的组件。","A string containing the file version resource name.":"包含文件版本资源名称的字符串。","The format string that represents a URL to corresponding documentation.":"表示相应文档的URL的格式字符串。"," value that indicates the host context with which the assembly was loaded, if any.":"表示装配给装配体加载的主机上下文的值（如果有）。","A string that is the full name of the assembly, also known as the display name.":"一个字符串，是汇编的全名，也称为显示名称。","The object that describes the assembly to be loaded.":"描述要加载的组件的对象。"," flags, cast as an integer value, representing just-in-time (JIT) compiler options, longevity, whether an assembly is retargetable, and whether it has a full or tokenized public key.":"旗帜，铸造为整数值，代表即时（JIT）编译器选项，寿命，是否可以重新定位组件，以及它是否具有完整的公共密钥或标记的公钥。"," values that indicates the operating system platform.":"表示操作系统平台的值。","The CLR version folder name. This is not a full path.":"CLR版本文件夹名称。 这不是一条完整的道路。","The hash algorithm used by the assembly manifest.":"组件使用的哈希算法表现出来。","The long or short form of the assembly name.":"大会名称的长或短形式。"," if this assembly is held in a collectible ":"如果该集会在收藏品中举行","The public and private cryptographic key pair to be used to create a strong name for the assembly.":"公共和私人加密密钥对用于为组件创建一个强名。"," object that indicates the version of the operating system.":"指示操作系统版本的对象。"," flags representing just-in-time (JIT) compiler options, longevity, whether an assembly is retargetable, and whether it has a full or tokenized public key.":"代表即时（JIT）编译器选项，寿命，是否可以重新定位的标志，以及它是否具有完整的公共密钥。","The name or path of the file that contains the manifest of the assembly.":"包含组件清单的文件的名称或路径。","The simple name of the assembly.":"组件的简单名称。"," if the current assembly was generated dynamically in the current process; otherwise, ":"如果当前组件在当前过程中动态生成； 否则，"," object that is a copy of this instance.":"对象是此实例的副本。"," flags, cast as an unsigned integer value, representing just-in-time (JIT) compiler options, longevity, whether an assembly is retargetable, and whether it has a full or tokenized public key.":"标志是无签名的整数值，代表即时（JIT）编译器选项，寿命，是否可以重新定位组件，以及它是否具有完整的公共密钥。","The value of the computed hash code.":"计算的哈希代码的值。"," if the current assembly is loaded with full trust; otherwise, ":"如果当前的组件充满了完全信任； 否则，","One of the enumeration values that identifies the processor and bits-per-word of the platform targeted by an executable.":"可执行文件针对的平台的处理器和一个单词的处理器和钻头的枚举值之一。","An integer value representing a bitwise combination of ":"整数值，代表了一个位的组合","The object to populate with serialization information.":"填充序列化信息的对象。"," flags.":"标志。","The hash algorithm used for hashing files and for generating the strong name.":"哈希算法用于哈希文件和生成强名称。","The location of the loaded file that contains the manifest. If the assembly is loaded from a byte array, such as when using ":"包含清单的加载文件的位置。 如果从字节数组加载组件，例如使用","An object that represents the major, minor, build, and revision numbers of the assembly.":"代表组件的主要，次要，构建和修订的对象。","The place to store and retrieve serialized data. Reserved for future use.":"存储和检索序列化数据的地方。 保留供将来使用。","A value that represents information about the assembly's compatibility with other assemblies.":"代表有关集件与其他组件兼容的信息的值。","The name of the module. This string must correspond to a file name in this assembly's manifest.":"模块的名称。 该字符串必须对应于此组件清单中的文件名。",", the value returned is an empty string (\"\").":"，返回的值是一个空字符串（“”）。","An unsigned integer value representing a bitwise combination of ":"未签名的整数值，代表了一定的位组合"," if the current application is running on Android; ":"如果当前应用程序在Android上运行；","The assembly file for which to get the ":"要获得的装配文件","A byte array that is a COFF-based image containing an emitted module, or a resource.":"一个字节阵列，它是一个基于COFF的图像，其中包含发射模块或资源。","The assembly version information.":"汇编版本信息。","The module that contains the manifest for the assembly.":"包含组件清单的模块。","The matching field.":"匹配字段。"," object representing the given file.":"代表给定文件的对象。","The loaded module.":"已加载的模块。","A string containing the version information.":"包含版本信息的字符串。","The product name information.":"产品名称信息。","The set of methods that are candidates for matching. For example, when a ":"作为匹配候选的方法集。 例如，当","A collection that contains the modules in this assembly.":"包含此组件中的模块的集合。","A byte array containing the raw bytes representing the symbols for the module. Must be ":"一个包含原始字节的字节数组，代表模块的符号。 一定是","A string containing the product name.":"包含产品名称的字符串。"," if the assembly was loaded into the reflection-only context, rather than the execution context; otherwise, ":"如果将组件加载到仅反射上下文中，而不是执行上下文； 否则，",", this parameter specifies the set of methods that reflection has determined to be possible matches, typically because they have the correct member name. The default implementation provided by ":"，此参数指定反射已确定可能是匹配的方法集，通常是因为它们具有正确的成员名称。 由","The name of the file containing the key pair.":"包含密钥对的文件的名称。"," if this is a resource file.":"如果这是资源文件。","The public or identity key.":"公共或身份密钥。","The display name of the assembly.":"组件的显示名称。","The security rule set that the CLR enforces for this assembly.":"安全规则设置了CLR为此组件执行的规则。","A string containing the name of the file that contains the key pair.":"包含包含密钥对的文件名称的字符串。","The arguments that are passed in. The binder can change the order of the arguments in this array; for example, the default binder changes the order of arguments if the ":"传递的论点。活页夹可以更改此数组中的论点的顺序； 例如，如果是","The loaded assembly. If ":"加载的组件。 如果","The countersignature, which is the signature key portion of the strong-name key.":"柜台签名，这是强名密钥的签名密钥部分。","The name of the container containing the key pair.":"包含密钥对的容器的名称。"," parameter is used to specify an order other than positional order. If a binder implementation coerces argument types, the types and values of the arguments can be changed as well.":"参数用于指定位置顺序以外的订单。 如果粘合剂实现强制参数类型，则可以更改参数的类型和值。"," that represents the hash algorithm.":"这代表哈希算法。"," is not found, this method returns ":"找不到，此方法返回","The countersignature for this signature key.":"此签名键的反签名。","A string containing the name of the container that has the relevant key pair.":"一个包含具有相关键对的容器名称的字符串。","An array of parameter modifiers that enable binding to work with parameter signatures in which the types have been modified. The default binder implementation does not use this parameter.":"一个参数修饰符的数组，可以绑定与已修改类型的参数签名一起工作。 默认的粘合剂实现不使用此参数。","An unsigned integer representing the hash algorithm.":"代表哈希算法的未签名整数。","The assembly to compare to ":"大会比较","The public key for this assembly.":"该集会的公钥。","An unsigned integer representing the assembly hash algorithm.":"代表组件哈希算法的无符号整数。","An object that is a copy of this ":"一个副本的对象","The parameter names, if parameter names are to be considered when matching, or ":"参数名称，如果在匹配时要考虑参数名称，或","The display name of the assembly, as returned by the ":"组件的显示名称，由"," if arguments are to be treated as purely positional. For example, parameter names must be used if arguments are not supplied in positional order.":"如果要将争论视为纯粹的位置。 例如，如果未按位置顺序提供参数，则必须使用参数名称。","The assembly title.":"大会标题。","The path for the assembly whose ":"集会的路径","The company name information.":"公司名称信息。","An array of values that matches the number, order and type (under the constraints of the default binder) of the parameters for this constructor. If this constructor takes no parameters, then use either an array with zero elements or ":"与此构造函数的参数的数字，顺序和类型（在默认活页夹的约束下）相匹配的值数组。 如果此构造函数不采用参数，请使用具有零元素的数组或","The trademark information.":"商标信息。","After the method returns, ":"方法返回后，","A string containing the company name.":"包含公司名称的字符串。"," is to be returned.":"要退还。",", as in Object[] parameters = new Object[0]. Any object in this array that is not explicitly initialized with a value will contain the default value for that object type. For reference-type elements, this value is ":"，如对象[]参数=新对象[0]。 该数组中未用一个值显式初始初始初始初始初始初始初始初始初米的对象包含该对象类型的默认值。 对于参考类型元素，此值是"," containing trademark information.":"包含商标信息。","The assembly configuration.":"组件配置。"," contains a binder-provided object that keeps track of argument reordering. The binder creates this object, and the binder is the sole consumer of this object. If ":"包含一个提供粘合剂的对象，以跟踪参数重新排序。 粘合剂创建此对象，并且活页夹是该对象的唯一消费者。 如果",". For value-type elements, this value is 0, 0.0, or ":"。 对于值元素，此值为0、0.0或","An object that represents the given assembly file.":"表示给定的汇编文件的对象。"," when ":"什么时候","The version number of the attributed assembly.":"属性组件的版本号。","A string containing the assembly configuration information.":"包含汇编配置信息的字符串。","A byte array that contains the public key of the assembly.":"包含大会的公钥的字节阵列。"," returns, you must pass ":"回报，你必须通过",", depending on the specific element type.":"，取决于特定元素类型。","The copyright information.":"版权信息。","A string containing the assembly version number.":"包含汇编版本号的字符串。"," values that specifies the type of binding.":"指定绑定类型的值。"," method if you want to restore ":"方法如果要还原","A byte array that contains the public key token.":"包含公共密钥令牌的字节阵列。","A string containing the copyright information.":"包含版权信息的字符串。","The set of fields that are candidates for matching. For example, when a ":"一组是匹配候选人的字段。 例如，当","The reference assembly name.":"参考组件名称。",", then ":"， 然后"," to its original order, for example, so that you can retrieve the values of ":"例如，按照其原始顺序，以便您可以检索","The culture supported by the attributed assembly.":"归因组装支持的文化。"," object is used by ":"对象使用"," used to match the number, order and type of the parameters for this constructor, under the constraints of ":"用于匹配此构造函数的数字，顺序和类型，"," and that match ":"那是比赛",", this parameter specifies the set of fields that reflection has determined to be possible matches, typically because they have the correct member name. The default implementation provided by ":"，此参数指定反射已确定可能是匹配的一组字段，通常是因为它们具有正确的成员名称。 由"," parameters (":"参数 （","The assembly name that is compared to the reference assembly.":"与参考组件进行比较的组件名称。",". If this constructor does not require parameters, pass an array with zero elements, as in Object[] parameters = new Object[0]. Any object in this array that is not explicitly initialized with a value will contain the default value for that object type. For reference-type elements, this value is ":"。 如果此构造函数不需要参数，请像object [] parameters = new Object [0]中传递具有零元素的数组。 该数组中未用一个值显式初始初始初始初始初始初始初始初始初米的对象包含该对象类型的默认值。 对于参考类型元素，此值是"," that match the specified criteria, or an empty collection if no such attributes exist.":"如果不存在此类属性，则匹配指定条件或空集合。"," parameters in Visual Basic).":"Visual Basic中的参数）。"," changes the order of this array.":"更改此数组的顺序。"," if the simple assembly names are the same; otherwise, ":"如果简单的组件名称相同； 否则，"," value indicating that this member is a constructor.":"值表示该成员是构造函数。","The type of the attribute to search for.":"要搜索的属性类型。","The matching method.":"匹配方法。","The assembly whose custom attribute data is to be retrieved.":"将检索其自定义属性数据的程序集。","A byte array containing the public key of the assembly.":"包含大会公共密钥的字节阵列。"," if an attribute of the specified type is applied to ":"如果将指定类型的属性应用于","The field value used to locate a matching field.":"用于定位匹配字段的字段值。","The object to change into a new ":"变成新的对象","A list of objects that represent data about the attributes that have been applied to the target assembly.":"代表有关已应用于目标组件的属性的数据的对象列表。"," that is used to control the coercion of data types, in binder implementations that coerce types. If ":"这用于控制数据类型的胁迫，在限制类型的粘合剂实现中。 如果"," that ":"那","A byte array containing the public key token of the assembly.":"包含大会的公共密钥令牌的字节阵列。","The data for serializing or deserializing the custom attribute.":"用于序列化或应对自定义属性的数据。"," object representing the method used to add an event handler delegate to the event source.":"代表用于将事件处理程序委托给事件源添加的方法的对象。","The member whose attribute data is to be retrieved.":"要检索其属性数据的成员。"," will become.":"会变成。","The source and destination for the custom attribute.":"自定义属性的源和目的地。","An object containing the value of the field reflected by this instance.":"包含本实例反映的字段值的对象。","A list of objects that represent data about the attributes that have been applied to the target member.":"代表有关已应用于目标成员的属性的数据的对象列表。"," that is used to control the coercion of data types. If ":"用于控制数据类型的强制性。 如果"," if non-public methods can be returned; otherwise, ":"如果可以返回非公共方法； 否则，","The message that indicates the reason this exception was thrown.":"表示此例外原因的消息。"," structure that encapsulates a managed pointer to a location and a runtime representation of the type that might be stored at that location.":"结构将托管指针封装为位置的指针以及可能存储在该位置的类型的运行时表示。","The module whose custom attribute data is to be retrieved.":"将要检索其自定义属性数据的模块。","An array representing the public methods that have been associated with the event in metadata by using the ":"代表与元数据中事件相关联的公共方法的数组"," containing a field value.":"包含一个场值。","A field or property of the custom attribute. The new ":"自定义属性的字段或属性。 新的","An object that contains the given value as the new type.":"包含给定值作为新类型的对象。"," directive. If there are no such public methods, an empty array is returned.":"指示。 如果没有这样的公共方法，则返回一个空数组。","A list of objects that represent data about the attributes that have been applied to the target module.":"代表有关已应用于目标模块的属性的数据的对象列表。","The object whose field value will be set.":"将设置字段值的对象。","The parameter whose attribute data is to be retrieved.":"要检索其属性数据的参数。","The actual arguments that are passed in. Both the types and values of the arguments can be changed.":"传递的实际参数。参数的类型和值都可以更改。"," object represents this member and its value.":"对象代表此成员及其价值。","An array representing methods that have been associated with an event in metadata by using the ":"代表与元数据中事件相关联的方法的数组"," that specifies the type of binding that is desired (for example, ":"这指定了所需的绑定类型（例如，","A list of objects that represent data about the attributes that have been applied to the target parameter.":"代表有关已应用于目标参数的属性的数据的对象列表。","A binder-provided object that keeps track of argument reordering.":"粘合剂提供的对象，可跟踪参数重新排序。","The value of the field or property of the custom attribute.":"自定义属性的字段或属性的值。"," directive. If there are no methods matching the specification, an empty array is returned.":"指示。 如果没有匹配规范的方法，则返回一个空数组。","A set of properties that enables the binding, coercion of argument types, and invocation of members through reflection. If ":"一组属性，可以通过反射来实现绑定，强制性类型的绑定，强制性的胁迫和调用。 如果","A string value that represents the custom attribute.":"表示自定义属性的字符串值。","An object that describes the type and value of the field or property.":"描述字段或属性的类型和值的对象。","The method that is called when the event is raised.":"事件提出时调用的方法。","The parameter types used to locate a matching method.":"用于定位匹配方法的参数类型。"," structure that encapsulates a managed pointer to a location and a runtime representation of the type that can be stored at that location.":"结构将可以存储在该位置的类型的托管指针和运行时表示。","An array of parameter modifiers that enable binding to work with parameter signatures in which the types have been modified.":"一个参数修饰符的数组，可以绑定与已修改类型的参数签名一起工作。","An object that represents the constructor that would have initialized the custom attribute represented by the current instance of the ":"一个代表构造函数的对象，该对象将初始化以当前实例表示的自定义属性","The structure to the left of the equality operator.":"平等操作员左侧的结构。"," object that was called when the event was raised.":"事件升起时称为对象。","The matching method, if found; otherwise, ":"匹配方法，如果发现； 否则，"," object representing the method used to remove an event handler delegate from the event source.":"代表用于从事件源中删除事件处理程序委托的方法的对象。"," for this field.":"对于这个领域。","The structure to the right of the equality operator.":"平等操作员右侧的结构。","A collection of structures that represent the positional arguments specified for the custom attribute instance.":"代表为自定义属性实例指定的位置参数的结构集合。","The set of properties that are candidates for matching. For example, when a ":"作为匹配候选者的属性集。 例如，当","The delegate to be disassociated from the events raised by target.":"与目标提出的事件相关的代表。","The structure to the left of the inequality operator.":"不等式操作员左侧的结构。",", this parameter specifies the set of properties that reflection has determined to be possible matches, typically because they have the correct member name. The default implementation provided by ":"，此参数指定反射已确定可能匹配的属性集，通常是因为它们具有正确的成员名称。 由","A handle to the internal metadata representation of a field.":"一个字段内部元数据表示的手柄。","A collection of structures that represent the named arguments specified for the custom attribute instance.":"代表为自定义属性实例指定的命名参数的结构集合。"," object representing the delegate event handler.":"代表代表事件处理程序的对象。","The return value the matching property must have.":"匹配属性必须具有的返回值。","The structure to the right of the inequality operator.":"不平等操作员右侧的结构。","The assembly to inspect.":"大会检查。","The type of this field object.":"此字段对象的类型。"," if the delegate is an instance of a multicast delegate; otherwise, ":"如果代表是多播代表的实例； 否则，","The index types of the property being searched for. Used for index properties such as the indexer for a class.":"搜索属性的索引类型。 用于索引属性，例如类的索引器。","A string that consists of the argument name, the equal sign, and a string representation of the argument value.":"由参数名称，平等符号和参数值的字符串表示形式组成的字符串。","The type of attribute to search for.":"搜索属性的类型。"," if the visibility of this field is exactly described by ":"如果该领域的可见性是由","The matching property.":"匹配属性。"," if this event has a special name; otherwise, ":"如果此事件有特殊名称； 否则，","A custom attribute that matches ":"匹配的自定义属性"," if the named argument is a field; otherwise, ":"如果指定的参数是一个字段； 否则，"," if access to this field is exactly described by ":"如果访问该字段的访问是由"," objects containing all the field information for this reflection object that meets the search constraints specified in ":"包含此反射对象的所有字段信息的对象，该对象符合指定的搜索约束"," value indicating that this member is an event.":"值表示该成员是一个事件。"," if no such attribute is found.":"如果找不到这样的属性。","The attribute member that would be used to set the named argument.":"用于设置命名参数的属性成员。","The name of the member to find.":"要找到的成员名称。"," if the field has the ":"如果字段有"," object for removing a method of the event.":"删除事件方法的对象。"," attribute set; otherwise, ":"属性集; 否则，","The member to inspect.":"成员检查。","The name of the attribute member that would be used to set the named argument.":"属性成员的名称，用于设置命名参数。"," objects matching the ":"对象匹配","A string that lists appropriate property values for the filter clause type.":"列出过滤器子句类型的适当属性值的字符串。"," attribute is set in ":"属性设置为"," to inspect the ancestors of ":"检查祖先","A structure that can be used to obtain the type and value of the current named argument.":"可用于获得当前命名参数的类型和值的结构。"," objects containing all the member information for this reflection object.":"包含此反射对象的所有成员信息的对象。"," object that represents that type of exception handled by this clause, or ":"代表该条款处理的类型异常的对象，或"," if the field is private; otherwise; ":"如果字段是私人的； 否则;","The value of the custom attribute argument.":"自定义属性参数的值。","The module to inspect.":"检查的模块。"," object containing the method information, with the match being based on the method name and search constraints specified in ":"包含方法信息的对象，匹配是基于方法名称和搜索约束的对象","The offset within the method body, in bytes, of the user-supplied filter code. The value of this property has no meaning if the ":"用户提供的过滤器代码中方法主体内的偏移。 如果该属性的价值没有任何意义","The parameter to inspect.":"检查的参数。"," if this field is public; otherwise, ":"如果这个领域是公开的； 否则，","The type of the custom attribute argument.":"自定义属性参数的类型。"," property has any value other than ":"财产除了任何其他值","An array used to choose among overloaded methods.":"用于在超载方法中选择的数组。"," and this instance are the same type and represent the same value; otherwise, ":"此实例是相同的类型，代表相同的值； 否则，"," if the current field is security-critical or security-safe-critical at the current trust level; ":"如果当前字段在当前信托级别是至关重要的或关键的安全安全；","A custom attribute matching ":"自定义属性匹配","The requested method that matches all the specified parameters.":"匹配所有指定参数的请求方法。"," value that indicates what kind of action this clause performs.":"表示该条款执行的操作的值。"," objects containing all the methods defined for this reflection object that meet the search constraints specified in ":"包含针对此反射对象定义的所有方法的对象，该对象满足搜索约束"," if the current field is security-safe-critical at the current trust level; ":"如果当前字段在当前信托级别上是安全安全的；","A string consisting of the argument name, the equal sign, and a string representation of the argument value.":"由参数名称，平等符号和参数值的字符串表示形式组成的字符串。","A collection of the custom attributes that are applied to ":"应用于应用于的自定义属性的集合"," if the field is security-transparent at the current trust level; otherwise, ":"如果该字段是当前信托级别的安全性透明; 否则，","An integer that represents the length, in bytes, of the MSIL that forms the body of this exception-handling clause.":"代表MSIL的长度的整数，形成了此异常处理子句的主体。","The binding attribute used to control the search.":"用于控制搜索的绑定属性。"," if this field is static; otherwise, ":"如果此字段是静态的； 否则，"," object representing the type of the argument or of the array element.":"代表参数类型或数组元素的对象。",", or an empty collection if no such attributes exist.":"，如果没有此类属性，则为空的集合。","An integer that represents the offset within the method body, in bytes, of this exception-handling clause.":"代表该异常处理子句中方法主体内部偏移的整数。"," if the object referred to by the variable is pinned in memory; otherwise, ":"如果将变量引用的对象固定在内存中； 否则，"," value indicating that this member is a field.":"值表示该成员是一个字段。","An object that represents the value of the argument or element, or a generic ":"代表参数或元素值的对象，或一个通用的对象",", look up the hierarchy chain for the inherited custom attribute.":"，查找继承的自定义属性的层次结构链。","The type of the local variable.":"本地变量的类型。"," objects for all the properties defined on the reflection object.":" 反射对象上定义的所有属性的对象。","The assembly that contains the manifest resource.":"包含清单资源的组件。","An array of Objects representing custom attributes, or an empty array.":"代表自定义属性或空数组的对象数组。"," objects that represent the values of an array-type argument.":"代表数组型参数值的对象。","The name of the property to find.":"要查找的属性名称。","The type of the custom attributes.":"自定义属性的类型。"," containing the name of the member to invoke. This may be a constructor, method, property, or field. A suitable invocation attribute must be specified when the member is invoked. The default member of a class can be specified by passing an empty ":"包含要调用的成员名称。 这可能是构造函数，方法，属性或字段。 调用成员时，必须指定合适的调用属性。 可以通过空白来指定类的默认成员","The name of the file that contains the manifest resource, if the file is not the same as the manifest file.":"如果文件与清单文件不同，则包含清单资源的文件的名称。"," is defined on this member; ":"在此成员上定义；"," object for the located property that meets the search constraints specified in ":"符合搜索约束的位置属性的对象","A bitwise combination of enumeration values that provides information about the location of the manifest resource.":"枚举值的比重组合，提供有关清单资源位置的信息。"," as the name of the member.  \n  \n The default member of a type is marked with the ":"作为成员的名字。 \n  \n  类型的默认成员标记","The type to convert.":"要转换的类型。","The manifest resource's file name.":"清单资源的文件名。"," if the property was not located.":"如果该物业未找到。"," custom attribute or marked in COM in the usual way.":"自定义属性或以com标记以通常的方式。"," object that contains the information required to serialize this instance.":"包含序列化此实例所需信息的对象。","The manifest resource's containing assembly.":"清单资源的包含组件。","The type of the property.":"属性的类型。","A string representing the member name.":"代表成员名称的字符串。"," flags that indicates the location of the manifest resource.":"指示清单资源位置的标志。"," object that contains the source and destination of the serialized stream associated with this instance.":"包含与此实例关联的序列化流的源和目标的对象。","An array used to choose among overloaded methods with the same name.":"用于在具有相同名称的过载方法中选择的数组。","The message text for the exception.":"邮件文本以例外。"," object to which the filter is applied.":"应用过滤器的对象。","Encapsulates a method or methods to be invoked when the event is raised by the target.":"封装目标时要调用的方法或方法。","An array used to choose the parameter modifiers.":"用于选择参数修饰符的数组。","The binding attributes used to control the search.":"用于控制搜索的绑定属性。"," if the current method or constructor is security-critical or security-safe-critical at the current trust level; ":"如果当前的方法或构造函数在当前信托级别上是至关重要的或安全安全的；","An arbitrary object used to filter the list.":"用于过滤列表的任意对象。"," object for the located property, if a property with the specified name was located in this reflection object, or ":"位置的属性对象，如果该反射对象中有指定名称的属性，或"," object containing the field information for the named object that meets the search constraints specified in ":"包含符合符合搜索约束的指定对象的字段信息的对象"," if the method or constructor is security-safe-critical at the current trust level; ":"如果方法或构造函数在当前信托级别上是安全安全的；"," to include the member in the filtered list; otherwise ":"将成员包括在过滤列表中； 否则"," invocation attributes. The ":"调用属性。 这"," if the method or constructor is security-transparent at the current trust level; otherwise, ":"如果方法或构造函数是当前信托级别的安全性透明剂； 否则，",". This parameter is ignored for properties and events.":"。 对于属性和事件，忽略了此参数。"," parameter may be a constructor, method, property, or field. A suitable invocation attribute must be specified. Invoke the default member of a class by passing the empty string (\"\") as the name of the member.":"参数可以是构造函数，方法，属性或字段。 必须指定合适的调用属性。 通过将空字符串（“”）传递为会员名称，调用类的默认成员。"," if this method has a special name; otherwise, ":"如果此方法具有特殊名称； 否则，"," bit flags. Implements ":"位标志。 工具","An array that contains all the custom attributes applied to this member, or an array with zero elements if no attributes are defined.":"一个包含应用于此成员的所有自定义属性的数组，或者如果未定义属性，则具有零元素的数组。","The object on which to invoke the specified member. This parameter is ignored for static members.":"调用指定成员的对象。 对于静态成员而言，此参数被忽略。"," that contains the MSIL for the method body.":"其中包含MSIL的方法主体。","An array of custom attributes applied to this member, or an array with zero elements if no attributes assignable to ":"应用于此成员的自定义属性数组，或者如果没有可分配给的属性，则具有零元素的数组","An array of objects that contains the number, order, and type of the parameters of the member to be invoked. This is an empty array if there are no parameters.":"包含要调用的成员参数的数字，顺序和类型的对象数组。 如果没有参数，这是一个空数组。"," objects representing the exception-handling clauses in the body of the method.":"代表该方法正文中异常处理子句的对象。"," have been applied.":"已应用。"," objects. This array has the same length as the ":"对象。 这个阵列的长度与"," parameter, representing the invoked member's argument attributes in the metadata. A parameter can have the following attributes: ":"参数，代表元数据中调用成员的参数属性。 参数可以具有以下属性："," objects representing data about the attributes that have been applied to the target member.":"代表有关已应用于目标成员的属性的数据。"," if the method body contains code to initialize local variables to ":" 如果方法体包含将局部变量初始化为 "," for reference types, or to the zero-initialized value for value types; otherwise, ":"用于参考类型或值类型的零限量值； 否则，",". These represent [In], [Out], [retval], [optional], and a default parameter, respectively. These attributes are used by various interoperability services.":"。 这些分别表示[In]，[out]，[retval]，[可选]和默认参数。 这些属性由各种互操作服务使用。","The type of custom attribute to search for. The search includes derived types.":"要搜索的自定义属性的类型。 搜索包括派生类型。"," used to govern the coercion of types. For example, ":"用于管理类型的强制。 例如，","An integer that represents the metadata token.":"代表元数据令牌的整数。"," or any of its derived types is applied to this member; otherwise, ":"或其任何派生类型都适用于此成员； 否则，"," objects that describe the local variables declared in the method body.":"描述方法主体中声明的局部变量的对象。"," converts a string that represents 1000 to a ":"将代表1000的字符串转换为","The type of the delegate to create.":"要创建的代表的类型。"," value, since 1000 is represented differently by different cultures. If this parameter is ":"价值，因为不同培养物以不同的方式表示1000。 如果此参数为","A collection that contains this member's custom attributes.":"包含此成员的自定义属性的集合。","The delegate for this method.":"该方法的代表。","A string array of parameters.":"一个参数的字符串数组。"," is part of an assembly held in a collectible assembly load context; otherwise, ":"是在收藏组装负载环境中举行的集会的一部分； 否则，","The object targeted by the delegate.":"代表针对的对象。","The specified member.":"指定成员。"," value indicating the type of member.":"表示成员类型的值。"," object for the first implementation of this method.":"首次实现此方法的对象。","The underlying type that represents the ":"代表的基础类型","A value which, in combination with ":"与之结合的价值","A string that displays information about the local variable, including the type name, index, and pinned status.":"显示有关本地变量的信息的字符串，包括类型名称，索引和固定状态。"," object representing a generic method definition from which the current method can be constructed.":"代表可以从中构造当前方法的通用方法定义的对象。",", uniquely identifies a metadata element.":"，独特地识别元数据元素。","An array of types to be substituted for the type parameters of the current generic method definition.":"一个类型的数组被替换为当前通用方法定义的类型参数。"," in which the type that declares the member represented by the current ":"其中声明的类型由当前表示"," object that represents the constructed method formed by substituting the elements of ":"代表通过替换元素形成的构造方法的对象"," is a static method that is called from within an executing method and that returns information about that method.  \n  \n A ":"是一种静态方法，它是从执行方法中调用的，并返回有关该方法的信息。 \n  \n  一个"," for the type parameters of the current generic method definition.":"对于当前通用方法定义的类型参数。"," object representing the currently executing method.":"代表当前执行方法的对象。"," value indicating that this member is a method.":"值表示该成员是一种方法。"," objects that represent the type arguments of a generic method or the type parameters of a generic method definition. Returns an empty array if the current method is not a generic method.":"代表通用方法的类型参数或通用方法定义的类型参数。 如果当前方法不是通用方法，则返回一个空数组。"," object that provides access to the MSIL stream, local variables, and exceptions for the current method.":"提供对MSIL流，本地变量以及当前方法的异常的对象。","The return type of this method.":"此方法的返回类型。","The method's handle.":"该方法的手柄。"," object representing the custom attributes for the return type.":"代表返回类型的自定义属性的对象。"," containing information about the method.":"包含有关该方法的信息。"," object to be populated with serialization information.":"对象将填充序列化信息。","A handle to the internal metadata representation of a constructor or method.":"构造函数或方法的内部元数据表示的手柄。"," object representing the destination context of the serialization.":"代表序列化目标上下文的对象。","A handle to the generic type that defines the constructor or method.":"定义构造函数或方法的通用类型的句柄。"," object representing the method or constructor specified by ":"代表方法或构造函数的对象由"," containing information that matches the signature of the method (or constructor) reflected by this ":"包含与此反映的方法（或构造函数）签名的信息","The object on which to invoke the method or constructor. If a method is static, this argument is ignored. If a constructor is static, this argument must be ":"调用方法或构造函数的对象。 如果方法是静态的，则该参数将被忽略。 如果构造函数是静态的，则必须是"," or an instance of the class that defines the constructor.":"或定义构造函数的类的实例。","An argument list for the invoked method or constructor. This is an array of objects with the same number, order, and type as the parameters of the method or constructor to be invoked. If there are no parameters, ":"调用方法或构造函数的参数列表。 这是具有相同数字，顺序和类型的对象数组，与要调用的方法或构造函数的参数。 如果没有参数，"," should be ":" 应该是 ",".  \n  \n If the method or constructor represented by this instance takes a ":"。 \n  \n  如果该实例表示的方法或构造函数"," in Visual Basic), no special attribute is required for that parameter in order to invoke the method or constructor using this function. Any object in this array that is not explicitly initialized with a value will contain the default value for that object type. For reference-type elements, this value is ":"在Visual Basic）中，该参数不需要特殊属性才能使用此函数调用该方法或构造函数。 该数组中未用一个值显式初始初始初始初始初始初始初始初始初米的对象包含该对象类型的默认值。 对于参考类型元素，此值是","An object containing the return value of the invoked method, or ":"包含调用方法返回值的对象，或"," in the case of a constructor.":"如果是构造函数。","A bitmask that is a combination of 0 or more bit flags from ":"来自0或更多位标志的组合",", this parameter is assigned the value ":"，为该参数分配值","; thus, whatever you pass in is ignored.":"; 因此，无论您传递的任何内容都被忽略了。","An argument list for the invoked method or constructor. This is an array of objects with the same number, order, and type as the parameters of the method or constructor to be invoked. If there are no parameters, this should be ":"调用方法或构造函数的参数列表。 这是具有相同数字，顺序和类型的对象数组，与要调用的方法或构造函数的参数。 如果没有参数，则应该是",".  \n  \n If the method or constructor represented by this instance takes a ByRef parameter, there is no special attribute required for that parameter in order to invoke the method or constructor using this function. Any object in this array that is not explicitly initialized with a value will contain the default value for that object type. For reference-type elements, this value is ":"。 \n  \n  如果该实例代表的方法或构造函数采用BYREF参数，则该参数不需要特殊属性即可使用此函数调用方法或构造函数。 该数组中未用一个值显式初始初始初始初始初始初始初始初始初米的对象包含该对象类型的默认值。 对于参考类型元素，此值是"," containing the return value of the invoked method, or ":"包含调用方法的返回值，或"," in the case of a constructor, or ":"如果是构造函数，或"," if the method's return type is ":"如果方法的返回类型为",". Before calling the method or constructor, ":"。 在调用方法或构造函数之前，"," checks to see if the user has access permission and verifies that the parameters are valid.":"检查以查看用户是否具有访问权限，并验证参数是否有效。","An integer that represents the offset within the method, in bytes, of the try block that includes this exception-handling clause.":"代表包括此例外处理子句的TRY块中方法中的偏移的整数。"," object represents a generic method that contains unassigned generic type parameters; otherwise, ":"对象表示包含未分配的通用类型参数的通用方法； 否则，"," structure that contains the handle to the internal metadata representation of a field.":"包含字段内部元数据表示的手柄的结构。"," object representing the field specified by ":"代表由字段指定的对象"," if the method is abstract; otherwise, ":" 如果方法是抽象的;否则, "," structure that contains the handle to the generic type that defines the field.":"包含定义字段的通用类型的手柄的结构。"," if the visibility of this method or constructor is exactly described by ":"如果该方法或构造函数的可见性由",", in the generic type specified by ":"，在指定的通用类型中"," if this method is a constructor represented by a ":"如果此方法是由A表示的构造函数"," objects that identify the optional custom modifiers of the current field, such as ":"识别当前字段的可选自定义修饰符的对象，例如"," object (see note in Remarks about ":"对象（请参阅有关的注释"," that contains the literal value associated with the field. If the literal value is a class type with an element value of zero, the return value is ":"其中包含与字段相关的文字值。 如果文字值是元素值零的类类型，则返回值为"," objects); otherwise, ":"对象）; 否则，"," objects that identify the required custom modifiers of the current property, such as ":"识别当前属性所需的自定义修饰符的对象，例如","The object whose field value will be returned.":"将返回其字段值的对象。"," if access to this method or constructor is exactly described by ":" 如果对此方法或构造函数的访问完全由 "," if this method is ":"如果此方法是"," represents a generic method; otherwise, ":"代表一种通用方法； 否则，"," if the member is hidden by signature; otherwise, ":"如果成员被签名隐藏； 否则，"," if access to this method is restricted to other members of the class itself; otherwise, ":"如果访问此方法仅限于班级本身的其他成员； 否则，"," if this method is public; otherwise, ":"如果此方法是公开的； 否则，"}