{"A new delegate with an invocation list that concatenates the invocation lists of ":"一个带有调用列表的新代表，该列表与","The delegate whose invocation list comes first.":"其调用列表的代表首先出现。",", returns ":"，返回","The delegate whose invocation list comes last.":"其调用列表的代表最终出现。"," in that order. Returns ":"以该顺序。 返回"," is a null reference, and returns a null reference if both ":"是一个null引用，如果两者都将返回null引用"," are null references.":"是零引用。","The array of delegates to combine.":"组合的代表阵列。","A new delegate with an invocation list that concatenates the invocation lists of the delegates in the ":"一个带有调用列表的新委托，该列表与代表的调用列表相连"," array. Returns ":"大批。 返回"," contains zero elements, or if every entry in ":"包含零元素，或者如果每个条目中的每个条目","A new multicast (combinable) delegate with an invocation list that concatenates the invocation list of the current multicast (combinable) delegate and the invocation list of ":"新的多播（可组合）委托与调用列表，该列表与当前的多播（可组合）委托的调用列表和调用列表相连","The multicast (combinable) delegate whose invocation list to append to the end of the invocation list of the current multicast (combinable) delegate.":"多播（可组合）委托的调用列表以附加到当前多播（可组合）委托的调用列表的末尾。","The object to which the delegate is bound, or ":"委托绑定的对象或"," as ":"作为"," of delegate to create.":"代表创建。",", or the current multicast (combinable) delegate if ":"，或当前的多播（可组合）委托"," to treat ":"治疗","A delegate of the specified type that represents the specified static or instance method.":"代表指定静态或实例方法的指定类型的委托。"," that is the first argument of the method the delegate represents. For instance methods, it must be compatible with the instance type.":"这是代表代表的方法的第一个参数。 例如，它必须与实例类型兼容。"," describing the static or instance method the delegate is to represent.":"描述代表代表的静态或实例方法。"," and the delegate cannot be bound to ":"代表不能绑定"," cannot be bound; otherwise, ":"不能束缚; 否则，"," representing the type of delegate to create.":"代表要创建的委托类型。"," to throw an exception if ":"如果不例外"," is invoked.":"被调用。","The class instance on which ":"班级实例","A delegate of the specified type that represents the specified static or instance method, or ":"代表指定静态或实例方法的指定类型的委托，或","A delegate of the specified type that represents the specified instance method to invoke on the specified class instance.":"指定类型的委托，该类型表示指定的实例方法在指定的类实例上调用。"," describing the static or instance method the delegate is to represent. Only static methods are supported in the .NET Framework version 1.0 and 1.1.":"描述代表代表的静态或实例方法。 .NET Framework版本1.0和1.1中仅支持静态方法。"," representing the class that implements ":"代表实施的班级","The name of the instance method that the delegate is to represent.":"代表要表示的实例方法的名称。","A delegate of the specified type that represents the specified static method of the specified class.":"指定类型的指定类型的委托，该类型表示指定类的指定静态方法。","A Boolean indicating whether to ignore the case when comparing the name of the method.":"布尔值指示在比较方法名称时是否忽略了情况。","The name of the static method that the delegate is to represent.":"代表代表的静态方法的名称。","A delegate of the specified type to represent the specified static method.":"指定类型的委托表示指定的静态方法。",", if the method represented by the current delegate does not require arguments.":"，如果当前代表代表的方法不需要参数。","A hash code for the delegate.":"代表的哈希代码。","An array of objects that are the arguments to pass to the method represented by the current delegate.  \n  \n -or-  \n  \n ":"一系列对象是传递到当前代表表示的方法的参数。 \n  \n  -或者-","The second delegate to compare.":"第二代表比较。","The object to compare with the current delegate.":"与当前委托进行比较的对象。","The object returned by the method represented by the delegate.":"由代表表示的方法返回的对象。","The delegate that supplies the invocation list to remove from the invocation list of ":"提供调用列表的代表从调用列表中删除","An array of delegates representing the invocation list of the current delegate.":"代表当前委托的调用列表的代表数组。"," and removing the last occurrence of the invocation list of ":"并删除最后发生的调用列表","The delegate from which to remove the invocation list of ":"删除调用列表的代表"," and the current delegate have the same targets, methods, and invocation list; otherwise, ":"当前的代表具有相同的目标，方法和调用列表； 否则，","A new delegate with an invocation list formed by taking the invocation list of ":"通过获取调用列表形成的新代表"," describing the static method represented by the current delegate.":"描述当前代表表示的静态方法。",", if the invocation list of ":"，如果调用列表"," is not found within the invocation list of ":"在调用列表中找不到"," is a null reference.":"是一个零引用。","The first delegate to compare.":"第一个比较的代表。","A new delegate with an invocation list formed by taking the invocation list of the current delegate and removing the invocation list of ":"通过获取当前代表的调用列表并删除调用列表的新委托列表形成的调用列表"," is found within the invocation list of ":"在调用列表中找到",". Returns a null reference if the invocation list of ":"。 如果调用列表"," and removing all occurrences of the invocation list of ":"并删除所有发生的调用列表"," is equal to the current delegate's invocation list.":"等于当前代表的调用列表。"," is found within the current delegate's invocation list. Returns the current delegate if ":"在当前代表的调用列表中找到。 返回当前代表"," or if the invocation list of ":"或者如果调用列表"," contains only a series of invocation lists that are equal to the invocation list of ":"仅包含一系列等于调用列表的调用列表"," is equal to the invocation list of ":"等于调用列表"," describing the method represented by the delegate.":"描述代表表示的方法。"," is not found within the current delegate's invocation list. Returns ":"在当前代表的调用列表中找不到。 返回","The condition parameter value. Code after the method is considered unreachable by diagnostics if the argument to the associated parameter matches this value.":"条件参数值。 如果对关联参数的参数匹配此值，则诊断方法将方法视为无法实现的代码。","The delegate that supplies the invocation list to remove from the invocation list of the current delegate.":"提供调用列表的代表从当前代表的调用列表中删除。"," if the invocation list of ":"如果调用列表","The object on which the current delegate invokes the instance method, if the delegate represents an instance method; ":"如果委托代表实例方法，则当前委托的对象调用实例方法；"," or if ":"或者如果","The assembly name of the type containing the specified members.":"包含指定成员的类型的汇编名称。","The types of the dynamically accessed members.":"动态访问成员的类型。"," if the delegate represents a static method.":"如果代表代表静态方法。","The list of field and property members that are promised to be non-null.":"承诺为非无效的字段和属性成员列表。","The assembly name of the type containing the specified member.":"包含指定成员的类型的汇编名称。","The type that contains the specified members.":"包含指定成员的类型。","A message that contains information about the need for assembly files to be on disk.":"一条包含有关在磁盘上需要汇编文件的信息的消息。","The types of members depended on.":"成员的类型取决于。","The type that contains ":"包含的类型","The return value condition. If the method returns this value, the associated parameter will not be ":"返回值条件。 如果该方法返回此值，则关联的参数将不为","The full name of the type containing the specified members.":"包含指定成员的类型的全名。","The signature of the member depended on.":"成员的签名取决于。","A message that contains information about the usage of unreferenced code.":"一条包含有关未参考代码的信息的消息。","The return value condition. If the method returns this value, the associated parameter may be ":"返回值条件。 如果该方法返回此值，则关联的参数可能为","The associated parameter name.  The output will be non-null if the argument to the parameter specified is non-null.":"关联的参数名称。 如果指定参数的参数为非编号，则输出将是非null。","The category identifying the attribute.":"识别属性的类别。","The category for the attribute.":"属性的类别。","The associated parameter name. The output will be non-null if the argument to the parameter specified is non-null.":"关联的参数名称。 如果指定参数的参数为非编号，则输出将是非null。","The full name of the type containing the specified member.":"包含指定成员的类型的全名。","The field or property member that is promised to be non-null.":"承诺为非零的字段或属性成员。","The identifier of the code analysis tool rule to be suppressed.":"代码分析工具规则的标识符将被抑制。","The scope of the code that is relevant for the attribute.":"与属性相关的代码范围。","The identifier of the analysis tool rule the attribute applies to.":"属性适用的分析工具规则的标识符。","A string that specifies the case-sensitive conditional compilation symbol that is associated with the ":"一个指定与案例敏感的条件汇编符号的字符串","An object whose name is sent to the ":"一个将名称发送到的对象","A fully qualified path that represents the code analysis target.":"代表代码分析目标的完全合格的路径。","The justification for suppressing the message.":"压制消息的理由。",", the message is written to the trace listeners in the collection.":"，该消息写给集合中的跟踪听众。","The composite format string to send to the ":"复合格式字符串发送到",", the category name and message are written to the trace listeners in the collection.":"，类别名称和消息写入集合中的跟踪听众。","The identifier of the analysis rule the attribute applies to.":"属性适用的分析规则的标识符。","The indent level. The default is 0.":"缩进水平。 默认值为0。","A string containing the expanded exclusion criteria.":"包含扩展的排除标准的字符串。"," collection. This message contains text intermixed with zero or more format items, which correspond to objects in the ":"收藏。 此消息包含与零或更多格式项目混合的文本，这与对象相对应",", the value is written to the trace listeners in the collection.":"，该值写入集合中的跟踪听众。","The condition Boolean passed to the ":"条件布尔传递给","A string that specifies the case-sensitive conditional compilation symbol that is associated with the attribute.":"指定与属性关联的情况敏感的条件汇编符号的字符串。"," values specifying the debugging mode for the JIT compiler.":"为JIT编译器指定调试模式的值。","An object array that contains zero or more objects to format.":"一个包含零或更多对象格式的对象数组。",", the category name and value are written to the trace listeners in the collection.":"，类别名称和值写入集合中的跟踪听众。","A description of the importance of the message.":"描述消息的重要性。"," values describing the debugging mode for the just-in-time (JIT) compiler. The default is ":"描述恰当（JIT）编译器的调试模式的值。 默认值为","A value indicating whether formatting should proceed.":"指示格式是否应进行的值。","The name of the attribute's target type.":"属性目标类型的名称。","The type of the visualizer object source.":"可视化器对象源的类型。","The category of the message.":"消息的类别。"," if the runtime optimizer is disabled; otherwise, ":"如果禁用了运行时优化器； 否则，","Minimum number of characters that should be written for this value.  If the value is negative, it indicates left-aligned and the required minimum is the absolute value.":"为此值编写的字符数量最少。 如果该值为负，则表示左对准，所需的最小值是绝对值。","The string to display in the type column of the debugger variable windows.":"在调试器变量窗口的类型列中显示的字符串。","The type of the visualizer.":"可视化器的类型。","The message to show.":"显示的消息。","The string to display in the value column of the debugger variable.":"在调试器变量的“值”列中显示的字符串。","The span to write.":"写的跨度。"," if the runtime will track information during code generation for the debugger; otherwise, ":"如果运行时会在调试器的代码生成过程中跟踪信息； 否则，","The description of the visualizer.":"可视化器的描述。"," to enable debugging; otherwise, ":"启用调试； 否则，"," if a debugger is attached; otherwise, ":"如果附加了调试器； 否则，","The type that is the target of the visualizer.":"可视化器目标的类型。","The type name of the proxy type.":"代理类型的类型名称。"," if a debugger is attached and logging is enabled; otherwise, ":"如果附加了调试器并启用记录； 否则，"," values that specifies how to display the member.":"指定如何显示成员的值。"," to disable the optimizer for execution; otherwise, ":"禁用执行优化器； 否则，","The proxy type.":"代理类型。","The fully qualified type name of the target type.":"目标类型的完全合格的类型名称。",". The attached debugger is the registered managed debugger in the ":"。 随附的调试器是注册的托管调试器"," representing the total elapsed time measured by the current instance.":"表示由当前实例测量的总经过的时间。","The string to be displayed in the value column for instances of the type; an empty string (\"\") causes the value column to be hidden.":"类型实例中要显示在值列中的字符串； 一个空字符串（“”）导致值列隐藏。","The target type for the attribute.":"属性的目标类型。","The fully qualified visualizer type name.":"完全合格的可视化器类型名称。","A read-only long integer representing the total number of milliseconds measured by the current instance.":"仅读取的长整数，代表通过当前实例测量的毫秒总数。","The name to display in the debugger variable windows.":"在调试器变量窗口中显示的名称。"," registry key. For more information on this key, see Enabling JIT-Attach Debugging.":"注册表密钥。 有关此键的更多信息，请参见启用Jit-Attach调试。","The fully qualified type name of the visualizer.":"可视化器的完全合格的类型名称。","A read-only long integer representing the total number of timer ticks measured by the current instance.":"一个仅读取的长整数，代表按当前实例测量的计时器滴答总数。","The attribute's target type.":"属性的目标类型。","The fully qualified type name of the visualizer object source.":"可视化器对象源的完全合格的类型名称。","A long integer representing the tick counter value of the underlying timer mechanism.":"一个长整数，代表基础计时器机制的刻度计数器值。"," if the startup is successful or if the debugger is already attached; otherwise, ":"如果创业公司成功或已连接调试器； 否则，"," if the value is normal; ":"如果值正常；"," instance is currently running and measuring elapsed time for an interval; otherwise, ":"实例当前正在运行并测量间隔的经过的时间； 否则，","A character span that contains the string representation of the number to convert.":"包含要转换数字的字符串表示的字符跨度。"," that has just begun measuring elapsed time.":"刚刚开始测量经过的时间。"," if the value is subnormal; ":"如果值是亚正式；"," is a valid number greater than ":"有效数字大于","When this method returns, contains the double-precision floating-point number equivalent of the numeric value or symbol contained in ":"当此方法返回时，包含双精度的浮点数，等同于数字值或包含的符号","A double-precision floating-point number to compare.":"比较的双精度浮点数。"," or is not a number in a valid format. It also fails on .NET Framework and .NET Core 2.2 and earlier versions if ":"或不是有效格式的数字。 它也会在.NET框架和.NET Core 2.2和更早版本上失败","A character span that contains the number to convert.":"字符跨度包含要转换的数字。","A read-only character span that contains the number to convert.":"仅读取字符跨度包含要转换的数字。"," parameter, if the conversion succeeded, or zero if the conversion failed. The conversion fails if the ":"参数，如果转换成功，则如果转换失败，则为零。 转换失败，如果"," represents a number less than ":"代表一个小于","A double-precision floating-point number.":"双精度浮点数。","A bitwise combination of enumeration values that indicate the style elements that can be present in ":"枚举价值的位组合，指示可以存在的样式元素"," values that indicates the permitted format of ":"表示允许格式的值"," or empty, or is not in a format compliant with ":"或空的，或不符合格式",".  A typical value to specify is ":"。 指定的典型值是"," that supplies culture-specific formatting information about ":"提供有关文化特定格式的信息"," if the value is finite (zero, subnormal or normal); ":"如果该值是有限的（零，下正常或正常）；"," combined with ":"结合","When this method returns and if the conversion succeeded, contains a double-precision floating-point number equivalent of the numeric value or symbol contained in ":"当此方法返回并且如果转换成功，则包含一个双精度的浮点数，等同于数字值或包含的符号",". The conversion also fails if ":"。 如果转换也会失败","When this method returns, contains a double-precision floating-point number equivalent of the numeric value or symbol contained in ":"当此方法返回时，包含一个双精度的浮点数，等同于数字值或包含的符号"," if the value is negative; ":"如果值为负；","A double-precision floating-point number that is equivalent to the numeric value or symbol specified in ":"双精度的浮点数，等同于数字值或符号",". Contains zero if the conversion failed. The conversion fails if the ":"。 如果转换失败，则包含零。 转换失败，如果"," is not a valid combination of ":"不是有效的组合","The enumeration type of the value to convert.":"要转换的值的枚举类型。"," or is not in a format compliant with ":"或不符合格式"," enumerated constants. If ":"枚举常数。 如果",". A typical value to specify is a combination of ":"。 指定的典型价值是",", an empty character span, or not a number in a format compliant with ":"，一个空的字符跨度，或不符合格式的数字","A string containing a number to convert.":"一个包含要转换数字的字符串。","The output format to use.":"要使用的输出格式。"," is a valid number less than ":"有效数字小于"," enumeration constants. It also fails on .NET Framework or .NET Core 2.2 and earlier versions if ":"枚举常数。 它也会在.NET框架或.NET Core 2.2和更早版本上失败","A string array of the names of the constants in ":"常数名称的字符串数组","When this method returns, contains the double-precision floating-point number equivalent of the ":"当此方法返回时，包含双精度的浮点数等同的浮点数","The value or name of a constant in ":"常数的值或名称","A string representation of ":"字符串表示","A signed number that indicates the relative values of this instance and ":"指示此实例的相对值的签名数字和","The type code of the underlying type of this instance.":"此实例的基础类型的类型代码。"," if a constant in ":"如果是常数","An enumeration type.":"枚举类型。","A string containing the name or value to convert.":"一个包含要转换名称或值的字符串。"," is an enumeration value of the same type and with the same underlying value as this instance; otherwise, ":"是相同类型的枚举值，并且具有与此实例相同的基础值； 否则，"," has a value equal to ":"具有等于","The enumeration whose underlying type will be retrieved.":"将检索其基础类型的枚举。"," An object of type ":"类型的对象","An enumeration object whose value is ":"枚举对象的价值为","The value of a particular enumerated constant in terms of its underlying type.":"特定列举常数的价值在其基本类型方面。"," if a given integral value, or its name as a string, exists in a specified enumeration; ":"如果给定的积分值或其名称为字符串，则在指定的枚举中存在；","The underlying type of ":"基础类型","This member always throws an exception.":"该成员总是抛出异常。","A string containing the name of the enumerated constant in ":"一个包含枚举常数名称的字符串","(obsolete)":"（过时的）","An array that contains the values of the constants in ":"一个包含常数值的数组","A span containing the name or value to convert.":"包含要转换名称或值的跨度。"," whose value is ":"谁的价值","A format specification.":"格式规范。","The converted value.":"转换值。","An enumeration value.":"枚举价值。"," if no such constant is found.":"如果找不到这样的常数。"," whose value is represented by ":"其价值由","The enumeration type to return.":"要返回的枚举类型。","(Obsolete.)":"（过时的。）"," to ignore case; ":"忽略案件；"," in case sensitive mode.":"如果敏感模式。"," if the bit field or bit fields that are set in ":"如果设置的位字段或位字段",", an object containing an enumeration constant representing the parsed value.":"，一个包含代表解析值的枚举常数的对象。"," to regard case.":"关于案件。","The value to convert to an enumeration member.":"转换为枚举成员的价值。"," are also set in the current instance; otherwise, ":"还设置在当前实例中； 否则，","The enum type to use for parsing.":"用于解析的枚举类型。"," if the conversion succeeded; ":"如果转换成功；","An exception that represents the error that caused the termination. This is typically the exception in a ":"代表导致终止的错误的例外。 这通常是一个例外","One of the enumeration values that identifies a system special folder.":"标识系统特殊文件夹的枚举值之一。","The span representation of the name or numeric value of one or more enumerated constants.":"一个或多个枚举常数的名称或数值的跨度表示。","The string representation of the name or numeric value of one or more enumerated constants.":"一个或多个枚举常数的名称或数值的字符串表示。","An instance of the enumeration set to ":"枚举的实例","An array of strings where each element contains a command-line argument. The first element is the executable file name, and the following zero or more elements contain the remaining command-line arguments.":"每个元素包含命令行参数的一系列字符串。 第一个元素是可执行文件名称，以下零或更多元素包含剩余的命令行参数。","One of the enumeration values that specifies options to use for accessing a special folder.":"指定用于访问特殊文件夹的选项的枚举值之一。"," to consider case.":"考虑案件。"," to read ":"读书","The value convert to an enumeration member.":"值转换为枚举成员。","An array of strings where each element contains the name of a logical drive. For example, if the computer's hard drive is the first logical drive, the first element returned is \"C:\\\".":"每个元素都包含逻辑驱动器的名称。 例如，如果计算机的硬盘驱动器是第一个逻辑驱动器，则返回的第一个元素是“ C：\\”。","The name of the environment variable.":"环境变量的名称。","The case-sensitive string representation of the enumeration name or underlying value to convert.":"枚举名称或基础值的案例敏感字符串表示。"," in case insensitive mode; ":"如果不敏感的模式；","A value to assign to ":"分配给的值","A number that represents the unique identifier for the current process.":"代表当前过程的唯一标识符的数字。"," contains an object of type ":"包含一个类型的对象","The value of the environment variable specified by ":"由环境变量的值指定"," property of the current exception is a null reference (":"当前异常的属性是null引用（","One of the enumeration values that specifies the location of the environment variable.":"指定环境变量位置的枚举值之一。","The 32-bit signed integer that specifies the number of processors that are available.":"32位签名的整数指定可用的处理器数量。"," in Visual Basic), this property returns the current exception.":"在Visual Basic）中，此属性返回当前异常。"," if the environment variable is not found.":"如果找不到环境变量。"," if the parse operation succeeds. If the parse operation fails, ":"如果解析操作成功。 如果解析操作失败，","A string containing command-line arguments.":"一个包含命令行参数的字符串。"," object that represents the exact runtime type of the current instance.":"代表当前实例的确切运行时类型的对象。","The path of the executable that started the currently executing process.":"启动当前执行过程的可执行文件的路径。"," contains the default value of the underlying type of ":"包含基础类型的默认值","The name of an environment variable.":"环境变量的名称。","A string containing stack trace information. This value can be ":"包含堆栈跟踪信息的字符串。 这个值可以是"," interface and contains a collection of user-defined key/value pairs. The default is an empty collection.":"接口并包含用户定义的键/值对的集合。 默认值是一个空的集合。","The directory path.":"目录路径。",". Note that this value need not be a member of the ":"。 请注意，此值不必是"," values. Only ":"值。 仅有的","A string containing a directory path.":"包含目录路径的字符串。","The Uniform Resource Name (URN) or Uniform Resource Locator (URL).":"统一资源名称（URN）或统一资源定位器（URL）。","The string representation of the enumeration name or underlying value to convert.":"枚举名称或基础值的字符串表示。","A unique identifier for this managed thread.":"该托管线程的唯一标识符。"," is supported on .NET Core running on Unix-bases systems.":"在Unix-Bases系统上运行的.NET Core上支持。","The number of bytes in the system memory page.":"系统内存页面中的字节数。","A 32-bit signed integer containing the exit code. The default value is 0 (zero), which indicates that the process completed successfully.":"包含出口代码的32位签名整数。 默认值为0（零），表明该过程成功完成。","The HRESULT value.":"HRESULT值。","The exit code to return to the operating system. Use 0 (zero) to indicate that the process completed successfully.":"退出代码返回操作系统。 使用0（零）表示该过程成功完成。","The value of the environment variable specified by the ":"环境变量的值","A 32-bit signed integer containing the amount of time in milliseconds that has passed since the last time the computer was started.":"一个32位签名的整数，其中包含自上次启动以来已经过去的毫秒的时间。"," if the current application domain is being unloaded or the CLR is shutting down; otherwise, ":"如果当前的应用程序域被卸载或CLR关闭； 否则，","An object that describes the error that caused the current exception. The ":"描述导致当前异常的错误的对象。 这"," if the operating system is 64-bit; otherwise, ":"如果操作系统为64位； 否则，"," parameters, or ":"参数，或"," property returns the same value as was passed into the ":"属性返回与传递到的相同的值"," if the process is 64-bit; otherwise, ":"如果该过程为64位； 否则，","A dictionary that contains all environment variable names and their values; otherwise, an empty dictionary if no environment variables are found.":"包含所有环境变量名称及其值的字典； 否则，如果找不到环境变量，则为空词典。"," constructor, or ":"构造函数，或","The elapsed milliseconds since the system started.":"自系统启动以来经过的毫秒。","A string containing the names of zero or more environment variables. Each environment variable is quoted with the percent sign character (%).":"包含零个或多个环境变量名称的字符串。 每个环境变量都用百分号字符(%)引用。","The name of this computer.":"这台计算机的名称。"," is supported on .NET Core running on Unix-based systems.":"在基于UNIX的系统上运行的.NET Core上支持。"," if the inner exception value was not supplied to the constructor. This property is read-only.":"如果未向构造函数提供内部异常值。 此属性仅阅读。","A string with each environment variable replaced by its value.":"一个带有每个环境变量的字符串被其值替换。","The network domain name associated with the current user.":"与当前用户关联的网络域名。","A dictionary that contains all environment variable names and their values from the source specified by the ":"一个包含所有环境变量名称及其值的字典","The error message that explains the reason for the exception, or an empty string (\"\").":"说明异常原因的错误消息或一个空字符串（“”）。"," for non-Unix platforms, or ":"对于非Unix平台或"," parameter; otherwise, an empty dictionary if no environment variables are found.":"范围; 否则，如果找不到环境变量，则为空词典。"," if the current process is running in user interactive mode; otherwise, ":"如果当前过程以用户交互模式运行； 否则，","A message that explains why the process was terminated, or ":"一条消息，说明为什么终止该过程或","The name of the application or the object that causes the error.":"应用程序的名称或导致错误的对象。"," for Unix platforms.":"对于Unix平台。"," if no explanation is provided.":"如果没有提供解释。","One of enumeration values that identifies a system special folder.":"枚举值之一可以标识系统特殊文件夹。","A string that describes the immediate frames of the call stack.":"描述呼叫堆栈的直接帧的字符串。","The platform identifier and version number.":"平台标识符和版本号。"," that threw the current exception.":"这引发了当前的例外。","The index of the argument. Its value can range from zero to one less than the value of ":"论点的索引。 它的值的范围从零到1的范围比","The user name of the person who is associated with the current thread.":"与当前线程关联的人员的用户名。","The path to the specified system special folder, if that folder physically exists on your computer; otherwise, an empty string (\"\").\n\n A folder will not physically exist if the operating system did not create it, the existing folder was deleted, or the folder is a virtual directory, such as My Computer, which does not correspond to a physical path.":"如果该文件夹在您的计算机上存在物理存在，则指定系统特殊文件夹的路径； 否则，一个空字符串（“”）。 \n\n  如果操作系统未创建它，将现有文件夹删除，或者该文件夹是虚拟目录，例如我的计算机，则该文件夹将不存在，例如我的计算机，它与物理路径不符。","An array object.":"数组对象。","The string to be formatted.":"要格式化的字符串。","The argument.":"论点。"," that refers to the target object whose generation number is to be determined.":"这是指确定生成编号的目标对象。","The string that results from formatting the current instance by using the conventions of the current culture.":"通过使用当前文化的约定格式化当前实例的字符串。","An array object with uninitialized memory except if it contains references or if it's too small for unpinned.":"一个具有非初始化内存的数组对象，除非它包含引用或对于未递录而言太小。","The version of the common language runtime.":"通用语言运行时的版本。","The current generation number of the target of ":"当前一代的目标","The number of the oldest generation to be garbage collected.":"收集垃圾的最古老一代的数量。","An object array that contains one or more objects to format.":"一个包含一个或多个格式的对象数组。","A 64-bit signed integer containing the number of bytes of physical memory mapped to the process context.":"一个64位签名的整数，其中包含映射到过程上下文的物理内存的字节数。","The amount of memory in bytes to allocate without triggering a garbage collection. ":"在不触发垃圾收集的情况下分配字节中的内存量。",", gather a precise number; otherwise, gather an approximate count. Gathering a precise value entails a significant performance penalty.":"，收集一个精确的数字； 否则，收集大约计数。 收集精确的价值需要重大绩效罚款。","The object to convert to a result string.":"转换为结果字符串的对象。","An enumeration value that specifies whether the garbage collection is forced (":"指定是否强制垃圾收集的枚举值（","An object that contains no event data.":"一个不包含事件数据的对象。","The total number of bytes allocated over the lifetime of the process.":"在整个过程中分配的字节总数。"," -":" -","An object that contains the event data.":"包含事件数据的对象。","The string that results from formatting the current instance by using the conventions of the invariant culture.":"通过使用不变文化的惯例格式化当前实例的字符串。",") or optimized (":"）或优化（"," to indicate that this method can wait for garbage collection to occur before returning; otherwise, ":" 以指示此方法可以等待垃圾回收发生后再返回；否则, ","The first exception thrown in a chain of exceptions. If the ":"第一个例外是在一系列异常中。 如果是"," must be less than or equal to the size of an ephemeral segment. For information on the size of an ephemeral segment, see the \"Ephemeral generations and segments\" section in the Fundamentals of Garbage Collection article.":"必须小于或等于短暂段的大小。 有关短暂细分市场大小的信息，请参见垃圾收集文章基础知识中的“短暂世代和细分市场”部分。"," to perform a blocking garbage collection; ":"执行阻塞垃圾收集；","A string. This argument is ignored.":"一个字符串。 这个论点被忽略。","A number that is the best available approximation of the number of bytes currently allocated in managed memory.":"一个数字是当前在托管内存中分配的字节数的最佳可用近似值。","The number of bytes in ":"字节数中","The total fragmentation when the last garbage collection occurred.":"上次垃圾回收时的总碎片。"," to perform a background garbage collection where possible.":"尽可能执行背景垃圾收集。","An object that provides culture-specific formatting information.":"提供特定文化格式信息的对象。","The object to reference.":"引用的对象。"," to use for large object heap (LOH) allocations.":"用于大对象堆（LOH）。","The generation this GC collected.":"这一代GC收集了。"," to compact the small object heap; ":"压缩小物体堆；"," to omit a full blocking garbage collection if the garbage collector is initially unable to allocate the specified memory on the small object heap (SOH) and LOH; otherwise, ":"如果垃圾收集器最初无法分配小物体堆（SOH）和LOH上的指定内存，请省略完整的垃圾收集； 否则，","A number between 1 and 99 that specifies when the notification should be raised based on the objects allocated in generation 2.":"根据第2代分配的对象提出通知何时应提出通知的数字。","A string formatted using the conventions of the ":"使用惯例的弦","The generation information for all generations.":"所有世代的发电信息。"," to sweep only.":"仅扫扫。","The status of the registered garbage collection notification.":"注册垃圾收集通知的状态。","The total heap size, in bytes, when the last garbage collection occurred.":"当发生最后一个垃圾收集时，总堆大小，字节。","A result string formatted by using the conventions of the current culture.":"通过使用当前文化的惯例进行格式化的结果字符串。","A number between 1 and 99 that specifies when the notification should be raised based on objects allocated in the large object heap.":"一个数字在1到99之间，指定应根据分配在大对象堆中的对象提出通知何时。","The length of time to wait before a notification status can be obtained. Specify -1 to wait indefinitely.":"等待通知状态之前等待的时间长度。 指定-1无限期等待。","The generation of objects for which the garbage collection count is to be determined.":"要确定垃圾收集计数的对象的产生。","A result string formatted by using the conventions of ":"通过使用的惯例格式化的结果字符串","The high memory load threshold, in bytes, when the last garbage collection occurred.":"当发生最后一个垃圾收集时，高内存负载阈值在字节中。","The amount of unmanaged memory that has been released.":"已发布的未管理记忆量。","The number of times garbage collection has occurred for the specified generation since the process was started.":"自该过程启动以来，指定生成的垃圾收集次数。","A value that ranges from zero to the maximum number of supported generations.":"一个值范围从零到受支持的世代的最大数量。","The object that a finalizer must be called for.":"必须要求最终制度的对象。","The number of arguments to be formatted.":"要格式化的参数数量。","The index of this GC.":"该GC的索引。","The total number of bytes allocated to the current thread since the beginning of its lifetime.":"自寿命开始以来，分配给当前线程的字节总数。","The object whose finalizer must not be executed.":"最终制度不得执行的对象。","The composite format string.":"复合格式字符串。","A number representing the fragmentation in bytes on exit from the reported collection.":"一个数字表示从报告集合中退出的字节中的片段化。","The return value of the method that this delegate encapsulates.":"此委托封装的方法的返回值。","The physical memory load, in bytes, when the last garbage collection occurred.":"当发生最后一个垃圾收集时，物理内存负载，字节。","An object that contains information about the garbage collector's memory usage.":"一个包含有关垃圾收集器内存使用信息的对象。","A number representing the fragmentation in bytes on entry to the reported collection.":"一个数字代表报告收集的输入时字节中的片段。","The amount of memory in bytes to allocate without triggering a garbage collection. It must be less than or equal to the size of an ephemeral segment. For information on the size of an ephemeral segment, see the \"Ephemeral generations and segments\" section in the Fundamentals of Garbage Collection article.":"在不触发垃圾收集的情况下分配字节中的内存量。 它必须小于或等于短暂段的大小。 有关短暂细分市场大小的信息，请参见垃圾收集文章基础知识中的“短暂世代和细分市场”部分。","The incremental amount of unmanaged memory that has been allocated.":"分配的非管理内存的增量量。","A timespan representing the pause durations.":"代表暂停持续时间的时间板。","The kind of collection for which to retrieve memory information.":"为检索内存信息的收藏集。"," if the runtime was able to commit the required amount of memory and the garbage collector is able to enter no GC region latency mode; otherwise, ":"如果运行时能够提交所需的内存量，并且垃圾收集器能够进入没有GC区域延迟模式； 否则，","A number representing the size in bytes on exit from the reported collection.":"一个数字表示报告收集的退出时字节中的大小。","The pause time percentage.":"暂停时间百分比。","Specifies the length of the array.":"指定数组的长度。","The object that generation information is retrieved for.":"检索一代信息的对象。"," to omit a full blocking garbage collection if the garbage collector is initially unable to allocate ":"如果垃圾收集器最初无法分配，请省略完整的垃圾收集","A number representing the size in bytes on entry to the reported collection.":"一个数字表示报告集合的输入时字节中的大小。","The total number of pinned objects observed by this GC.":"该GC观察到的固定对象的总数。","Specifies whether the allocated array must be pinned.":"指定是否必须固定分配的数组。"," bytes; otherwise, ":"字节； 否则，","The current generation number of ":"当前一代的数字"," if this is a compacting GC; ":"如果这是一个紧凑的GC；","The number of promoted bytes for this GC.":"该GC的促进字节数量。"," that results from adding the specified number of days to the specified ":"这是由于将指定的天数添加到指定的","The number of days in the specified year in the current era.":"当前时代指定年份的天数。"," to which to add weeks.":" 要增加几周。","The total available memory, in bytes, for the garbage collector to use when the last garbage collection occurred.":"在最后一次垃圾收集时，可用的总内存（以字节为单位）供垃圾收集器使用。"," if this is a concurrent GC (background GC); ":"如果这是并发的GC（背景GC）；","The number of days in the specified year in the specified era.":"指定时代指定年份的天数。"," to which to add hours.":"要增加数小时。","The total committed bytes of the managed heap.":"托管堆的总体字节总数。","The number of weeks to add.":"要添加的几周数。","The number of hours to add.":"要添加的小时数。","The total number of objects observed by this GC that are ready for finalization.":"该GC观察到的对象总数已准备好完成。","An integer that represents the era of ":"代表时代的整数","Specify the options for this ":"为此指定选项"," that results from adding the specified number of hours to the specified ":"这是由于将指定的小时数添加到指定的"," that results from adding the specified number of weeks to the specified ":"这是由于将指定的周数添加到指定的","An integer from 0 to 23 that represents the hour in ":"一个从0到23的整数代表小时","An enumeration value that defines a calendar week.":"定义日历周的枚举值。"," to add milliseconds to.":"将毫秒添加到。"," to which to add days.":"要增加几天。"," to which to add years.":"要增加几年。","An enumeration value that represents the first day of the week.":"代表一周第一天的枚举价值。","A year.":"一年。","The number of days to add.":"要添加的天数。","The number of milliseconds to add.":"要添加的毫秒数。","The number of years to add.":"要添加的年数。","A positive integer that represents the week of the year that includes the date in the ":"一个积极整数，代表一年中的一周，其中包括日期","A positive integer that indicates the leap month in the specified year.  \n  \n -or-  \n  \n Zero if this calendar does not support a leap month or if the ":"一个积极的整数，指示指定年份的leap月。 \n  \n  -或者- \n  \n  零，如果该日历不支持leap月或"," that is set to the specified date and time in the current era.":"该设置为当前时代的指定日期和时间。"," that results from adding the specified number of milliseconds to the specified ":"这是由于将指定数量的毫秒数添加到指定的"," that results from adding the specified number of years to the specified ":"这是由于将指定的年数添加到指定的","An integer that represents the year in ":"代表年份的整数"," parameter does not represent a leap year.":"参数不代表leap年。","A two-digit or four-digit integer that represents the year to convert.":"代表转换年份的两位数或四位数整数。"," to which to add minutes.":"要添加分钟。"," that is the memberwise clone of the current ":"那是电流的成员克隆","An era.":"一个时代。","A positive integer that represents the day.":"代表一天的积极整数。","An integer that contains the four-digit representation of ":"一个包含四位数表示的整数"," to read.":"读书。","The number of minutes to add.":"要添加的分钟数。","A positive integer that indicates the leap month in the specified year and era.  \n  \n -or-  \n  \n Zero if this calendar does not support a leap month or if the ":"一个积极的整数，指示指定年度和时代的leap月。 \n  \n  -或者- \n  \n  零，如果该日历不支持leap月或"," if the specified day is a leap day; otherwise, ":"如果指定的一天是leap日； 否则，","The number of days in the year that precedes the year specified by ":"在规定的一年的一年中的数量","A positive integer that represents the day of the month in the ":"一个积极的整数，代表一个月的一天"," parameters do not specify a leap year.":"参数未指定leap年。"," that results from adding the specified number of minutes to the specified ":"这是由于将指定的分钟数添加到指定的"," if the specified month is a leap month; otherwise, ":"如果指定的月份是leap月； 否则，","An array of integers that represents the eras in the current calendar.":"代表当前日历中的时代的整数数组。"," value that represents the day of the week in the ":"代表一周中的一天的价值"," if the specified year is a leap year; otherwise, ":"如果指定年份是leap年； 否则，","A double-precision floating-point number from 0 to 999 that represents the milliseconds in the ":"从0到999的双精度浮点数，代表毫秒"," to which to add months.":"要增加几个月。"," object specified by the ":"对象由","A positive integer that represents the day of the year in the ":"一个积极整数，代表一年中的一天","The latest date and time supported by this calendar. The default is ":"此日历支持的最新日期和时间。 默认值为","The number of months to add.":"要添加的月数。","An integer from 0 to 59 that represents the minutes in ":"一个从0到59的整数代表分钟数"," is read-only.  \n  \n -or-  \n  \n A read-only memberwise clone of the ":"是只读的。 \n  \n  -或者- \n  \n  一个只读的成员克隆","An integer that represents the year.":"代表年份的整数。","The earliest date and time supported by this calendar. The default is ":"该日历支持的最早日期和时间。 默认值为"," that results from adding the specified number of months to the specified ":"这是由于将指定的月数添加到指定的","A positive integer that represents the month in ":"一个积极整数，代表一个月"," object specified by ":"对象指定","A positive integer that represents the month.":"代表月份的积极整数。","The last year of a 100-year range that can be represented by a 2-digit year.":"100年范围的最后一年可以在2位年的一年中代表。"," to which to add seconds.":"要添加秒。","The number of months in the specified year in the current era.":"当前时代指定年份的月数。"," is not read-only.":"不是只读。","The Unicode character for which to get the decimal digit value.":"获得小数位数值的Unicode字符。","The number of seconds to add.":"要添加的秒数。","The number of days in the specified month in the specified year in the current era.":"当前时代指定年度指定月份的天数。","An integer from 0 to 23 that represents the hour.":"一个从0到23的整数代表小时。"," that results from adding the specified number of seconds to the specified ":"这是由于将指定的秒数添加到指定的","The number of months in the specified year in the specified era.":"指定时代指定年份的月数。","The decimal digit value of the specified numeric character.  \n  \n -or-  \n  \n -1, if the specified character is not a decimal digit.":"指定数字字符的十进制数值。 \n  \n  -或者- \n  \n  -1，如果指定的字符不是十进制数字。","An integer from 0 to 59 that represents the minute.":"一个从0到59的整数，代表分钟。","An integer that represents the era.":"代表时代的整数。","The index of the Unicode character for which to get the digit value.":"获得数字值的Unicode字符的索引。","An integer from 0 to 59 that represents the seconds in ":"一个从0到59的整数，代表秒","The digit value of the numeric character at the specified index of the specified string.  \n  \n -or-  \n  \n -1, if the character at the specified index of the specified string is not a digit.":"在指定字符串的指定索引处数字字符的数字值。 \n  \n  -或者- \n  \n  -1，如果指定字符串指定索引处的字符不是数字。"," containing the Unicode character for which to get the decimal digit value.":"包含获得小数位数值的Unicode字符。","An integer from 0 to 59 that represents the second.":"一个从0到59的整数代表第二个。","The second string to compare.":"要比较的第二个字符串。","The number of days in the specified month in the specified year in the specified era.":"指定年度指定年度指定月份的天数。","An integer from 0 to 999 that represents the millisecond.":"一个从0到999的整数代表毫秒。","The Unicode character for which to get the numeric value.":"获得数值值的Unicode字符。","The index of the Unicode character for which to get the decimal digit value.":"获得小数位数值的Unicode字符的索引。","When this method returns, contains the number of characters of ":"当此方法返回时，包含","A 32-bit signed integer indicating the lexical relationship between the two comparands.\n\n ":"一个32位签名的整数，指示两个比较之间的词汇关系。"," parameter is sortable; otherwise, ":"参数可排序； 否则，","The numeric value associated with the specified character.  \n  \n -or-  \n  \n -1, if the specified character is not a numeric character.":"与指定字符关联的数字值。 \n  \n  -或者- \n  \n  -1，如果指定的字符不是数字字符。"," that matched the desired value. This may be different than the length of ":"这与所需的值匹配。 这可能与长度不同","The decimal digit value of the numeric character at the specified index of the specified string.  \n  \n -or-  \n  \n -1, if the character at the specified index of the specified string is not a decimal digit.":"在指定字符串的指定索引处数字字符的十进制数值。 \n  \n  -或者- \n  \n  -1，如果指定字符串指定索引处的字符不是十进制数字。","A value that defines how ":"定义如何","A read-only span of characters of zero or more Unicode characters.":"零或更多Unicode字符的仅读取字符。"," containing the Unicode character for which to get the numeric value.":"包含获得数值的Unicode字符。"," if a linguistic comparison is performed. Set to 0 if ":"如果进行语言比较。 设置为0如果"," should be compared. ":"应该比较。","The Unicode character for which to get the digit value.":"获得数字值的Unicode字符。","The index of the Unicode character for which to get the numeric value.":"获得数值值的Unicode字符的索引。"," is non-empty and contains only sortable Unicode characters; otherwise, ":"是非空的，仅包含可排序的Unicode字符； 否则，"," is either the enumeration value ":"是枚举价值","The digit value of the specified numeric character.  \n  \n -or-  \n  \n -1, if the specified character is not a digit.":"指定数字字符的数字值。 \n  \n  -或者- \n  \n  -1，如果指定的字符不是数字。"," is not found within ":"没有发现","The numeric value associated with the character at the specified index of the specified string.  \n  \n -or-  \n  \n -1, if the character at the specified index of the specified string is not a numeric character.":"在指定字符串的指定索引处与字符关联的数字值。 \n  \n  -或者- \n  \n  -1，如果指定字符串指定索引处的字符不是数字字符。","A string of zero or more Unicode characters.":"一个零或更多的Unicode字符串。"," containing the Unicode character for which to get the digit value.":"包含获得数字值的Unicode字符。",", or a bitwise combination of one or more of the following values: ":"，或一个或多个以下值的位组合：","The Unicode character for which to get the Unicode category.":"获得Unicode类别的Unicode字符。"," to locate within ":"要定位"," parameter is not an empty string (\"\") and all the Unicode characters in ":"参数不是一个空字符串（“”）和所有Unicode字符"," if the specified object is equal to the current ":"如果指定的对象等于当前"," where ":"在哪里"," value indicating the category of the specified character.":"指示指定字符类别的值。"," name, ":"姓名，"," are sortable; otherwise, ":"可以分类； 否则，","An integer representing the culture identifier.":"代表文化标识符的整数。"," of an existing ":"现有的","The string to search.":"搜索的字符串。","A number representing the 32-bit code point value of the Unicode character.":"一个代表Unicode字符的32位代码点值的数字。"," object associated with the culture with the specified identifier and using string comparison methods in the current ":"与培养物与指定标识符相关的对象，并使用当前的字符串比较方法","A Unicode scalar value.":"Unicode标量值。",", or Windows-only culture name. ":"，或仅限窗户的文化名称。"," containing the Unicode character for which to get the Unicode category.":"包含获得Unicode类别的Unicode字符。"," that contains the string comparison methods to use.":"其中包含使用的字符串比较方法。","The character to locate within ":"要定位的角色"," is not case-sensitive.":"不是对病例敏感的。"," is a sortable Unicode scalar value; otherwise, ":"是可排序的Unicode标量值； 否则，","A string representing the culture name.":"代表文化名称的弦。","The index of the Unicode character for which to get the Unicode category.":"为获得Unicode类别的Unicode字符的索引。","A copy of the current ":"电流的副本","The suffix to attempt to match at the end of ":"试图在结束时尝试匹配的后缀",", if found, within ":"，如果发现，"," occurs at the end of ":"发生在","The character span whose hash code is to be returned.":"将返回哈希代码的字符跨度。"," value indicating the category of the character at the specified index of the specified string.":"在指定字符串的指定索引处指示字符类别的值。","; otherwise, -1. Returns 0 (zero) if ":"; 否则，-1。 返回0（零）如果"," name or the name of an existing ":"名称或现有的名称"," type to read.":"类型要阅读。","A value that determines how strings are compared.":"一个确定字符串如何比较的值。","The read-only span of characters containing the suffix to attempt to match at the end of ":"只读字符的读物跨度包含后缀，以尝试匹配的结尾"," object. ":"目的。"," is an ignorable character.":"是一个可忽视的角色。","The string whose hash code is to be returned.":"将返回哈希代码的字符串。"," that matched the desired suffix. This may be different than the length of ":"与所需的后缀匹配。 这可能与长度不同","An integer that represents the era in the ":"一个代表时代的整数","The text to get the sort key for.":"要获取排序键的文本。","A value that defines how the strings should be compared. ":"定义应如何比较字符串的值。"," object that represents:\n\n The invariant culture, if ":"代表的对象： \n\n  不变的文化，即"," if a linguistic comparison is performed. Set to 0 if the suffix did not match.":"如果进行语言比较。 如果后缀不匹配，则设置为0。","An array of 32-bit signed integers that specify the relevant eras. The return value for a ":"指定相关时代的32位签名整数的数组。 返回值",", using the specified comparison options; otherwise, -1. Returns 0 (zero) if ":"，使用指定的比较选项； 否则，-1。 返回0（零）如果"," is an empty string (\"\").\n\n -or-\n\n The specific culture associated with ":"是一个空字符串（“”）。 \n\n  -或者- \n\n  与","The string to compare with the end of ":"与结尾进行比较的字符串","The buffer into which the resulting sort key bytes are stored.":"存储所得排序键字节的缓冲区。"," object is always an array containing one element equal to the ":"对象始终是一个数组，其中一个元素等于"," ends with ":"以。。结束"," is a neutral culture.\n\n -or-\n\n The culture specified by ":"是一种中立的文化。 \n\n  -或者- \n\n  由",", if found, within the section of ":"，如果发现，则在"," enumeration values to use for computing the sort key. The default value is ":"用于计算排序键的枚举值。 默认值是"," type that represents the last moment on January 28, 2101 in the Gregorian calendar, which is approximately equal to the constructor ":"类型代表2101年1月28日在格里高利日历中的最后时刻，该日历大约等于构造函数"," used by itself, or the bitwise combination of one or more of the following values: ":"自身使用，或一个或多个以下值的位组合："," is already a specific culture.":"已经是一种特定的文化。"," type that represents February 19, 1901 in the Gregorian calendar, which is equivalent to the constructor, ":"在格里高利日历中代表1901年2月19日的类型，相当于构造函数，","The string for which a ":"一个字符串"," to the end of ":"到达"," is the same culture as the current ":"与当前的文化是相同的文化"," last appears; or a negative value if ":"最后出现； 或负值如果","; otherwise, -1. Returns ":"; 否则，-1。 返回","The first read-only span of characters to compare.":"比较字符的第一个只读跨度。"," object is obtained.":"获得对象。",", using the specified comparison options; otherwise, -1. Returns ":"，使用指定的比较选项； 否则，-1。 返回"," last appears; or a negative number if ":"最后出现； 或负数","An alternate culture that is used to read and display text on the console.":"一种用于在控制台上读取和显示文本的替代文化。"," object that contains the sort key for the specified string.":"包含指定字符串的排序键的对象。",", using the specified comparison options; otherwise, -1.":"，使用指定的比较选项； 否则，-1。","The second read-only span of characters to compare.":"要比较的第二个字符跨度。","A locale identifier (LCID).":"到本地标识符（LCID）。"," and contains the number of elements specified by ":"并包含由","A bitwise combination of one or more of the following enumeration values that define how the sort key is calculated: ":"以下一个或多个枚举值的位组合，该值定义了如何计算排序键："," that extends from the beginning of ":"从一开始","An optional combination of ":"可选组合"," that contains the number of elements specified by ":"其中包含由","The name of a culture. ":"文化的名称。","The string to locate within ":"要定位的字符串"," enumeration values to use during the comparison. The default value is ":"比较期间使用的枚举值。 默认值是","The length, in bytes, of the sort key.":"排序键的长度，字节。","The prefix to attempt to match at the start of ":"尝试在开始时尝试匹配的前缀","The name of a culture. It is not case-sensitive.":"文化的名称。 它不区分大小写。"," and that ends at ":"结束于","Zero if ":"零如果","The string to search within.":"在内部搜索的字符串。","The object that initiated the callback.":"启动回调的对象。"," enumeration values to use during the match. The default value is ":"比赛期间使用的枚举值。 默认值是"," are equal; or a negative value if ":"相等； 或负值如果"," if requesting to create an instance of a culture that is known by the platform. ":"如果要求创建平台已知的文化实例。"," occurs at the start of ":"发生在","The substring to locate within ":"要定位的子字符串","The properly formed culture identifier for the current ":"当前的正确形成的文化标识符"," sorts before ":"以前"," if it is ok to retreive a made-up culture even if the platform does not carry data for it.":"如果可以检索虚构文化，即使该平台没有携带数据。","The name of a culture.":"文化的名称。"," enumeration values to use during the search. The default value is ":"在搜索过程中使用的枚举值。 默认值是","The read-only span of characters containing the prefix to attempt to match at the start of ":"只读字符的读取跨度，该字符包含前缀，以尝试在开始时进行匹配","; or a positive value if ":"; 或阳性价值如果","A read-only instance of a culture.":"文化的仅读实例。"," sorts after ":"之后","The zero-based index into ":"基于零的索引","An object that contains information about the Unicode version used for comparing and sorting strings.":"一个包含有关用于比较和排序字符串的Unicode版本的信息。"," to use during the match.":" 在比赛中使用。","The name of a culture that supplies the ":"一种文化的名称，提供 ","A predefined ":"一个预定义的","The first string to compare.":"第一个要比较的字符串。"," where the substring ":" 子字符串的位置 "," that matched the desired prefix. This may be different than the length of ":"与所需的前缀相匹配。 这可能与长度不同"," objects used to initialize ":"用于初始化的对象"," identifier, ":"标识符，","The zero-based index of the character in ":"字符的基于零的索引","The name of a language as specified by the RFC 4646 standard.":"RFC 4646标准指定的语言名称。"," first appears; or a negative value if ":"首先出现； 或负值如果"," if a linguistic comparison is performed. Set to 0 if the prefix did not match.":"如果进行语言比较。 如果前缀不匹配，则设置为0。"," property of an existing ":"现有的属性"," at which to start comparing.":"开始比较。","The string to search in.":"搜索的字符串。","A bitwise combination of the enumeration values that filter the cultures to retrieve.":"枚举值的比重组合，以滤除培养物的检索。"," object, or Windows-only culture identifier.":"对象或仅限Windows文化标识符。"," cannot be found within ":"在里面找不到","The string to compare with the beginning of ":"与开始的字符串","An array that contains the cultures specified by the ":"包含由","The number of consecutive characters in ":"连续字符中的数量","A Boolean that denotes whether to use the user-selected culture settings (":"表示是否使用用户选择的文化设置的布尔值（"," parameter. The array of cultures is unsorted.":"范围。 文化阵列未分类。"," if the length of ":"如果长度","The read-only span of characters to search within.":"在内部搜索的字符的只读跨度。"," is any other object.":"是任何其他对象。",") or the default culture settings (":"）或默认文化设置（"," is less than or equal to the length of ":"小于或等于长度"," for which to get a formatting object. This method only supports the ":"为此获得格式化对象。 此方法仅支持"," object to wrap.":"对象包装。"," uses the user-selected culture settings; otherwise, ":"使用用户选择的文化设置； 否则，"," starts with ":"以。。开始"," types.":"类型。","The read-only span of characters containing the substring to locate within ":"只读字符的读取跨度包含要位于内部的子字符带"," property, which is a ":"财产，这是一个","A Unicode character.":"一个Unicode字符。","The error message to display with this exception.":"与此异常显示要显示的错误消息。","A string containing the name of the current ":"一个包含当前名称的字符串"," containing the default number format information for the current ":"包含当前的默认编号格式信息"," to use during the search.":"在搜索过程中使用。","The standard format string associated with the custom format strings specified in the ":"与自定义格式字符串关联的标准格式字符串"," that represents the default calendar used by the culture.":"这代表了文化使用的默认日历。","The Culture ID that cannot be found.":"无法找到的文化ID。"," class.\n\n -or-\n\n The value of the ":"班级。 \n\n  -或者- \n\n  价值","A string array of day names.":"一个日名的字符串数组。"," that defines how to compare strings for the culture.":"这定义了如何比较文化的字符串。","A one-dimensional array of type ":"一维类型","The name of the parameter that is the cause the current exception.":"原因是原因当前异常的名称。"," containing the default date and time format information for the current ":"包含当前的默认日期和时间格式信息","The custom format string for a short time value.":"用于短时值的自定义格式字符串。","A bitwise combination of one or more ":"一个或多个的位组合","The name of the parameter that is the cause of the current exception.":"参数的名称是当前异常原因。"," containing the culture-specific abbreviated names of the days of the week. The array for ":"包含一周中的日子的特定文化缩写名称。 阵列"," values. There is no default value.":"值。 没有默认值。","The custom format string for a sortable date and time value.":"可排序的日期和时间值的自定义格式字符串。"," class.\n\n -or-\n\n null, if ":"班级。 \n\n  -或者- \n\n  null，如果"," contains \"Sun\", \"Mon\", \"Tue\", \"Wed\", \"Thu\", \"Fri\", and \"Sat\".":"包含“太阳”，“ mon”，“ tue”，“ wed”，“ th”，“ fri”和“ sat”。","The culture used by the current thread and task-based asynchronous operations.":"当前线程和基于任务的异步操作使用的文化。","The Culture Name that cannot be found.":"无法找到的文化名称。","The string that separates the components of time. The default for ":"分开时间组件的字符串。 默认值"," parameter is a leap month; otherwise, ":"参数是leap月； 否则，","An array of abbreviated month names.":"一系列缩写的月份名称。","The culture used by the Resource Manager to look up culture-specific resources at run time.":"资源经理使用的文化在运行时查找特定文化的资源。","The invalid culture identifier.":"无效的文化标识符。"," is \":\".":"是 ”：”。","An integer from 0 through 23 that represents the hour.":"一个从0到23的整数代表小时。"," that defines the culturally appropriate format of displaying dates and times.":"这定义了显示日期和时间的文化适当格式。","The invalid culture name.":"无效的文化名称。","The custom format string for a universal, sortable date and time string.":"通用，可排序的日期和时间字符串的自定义格式字符串。","A one-dimensional string array with 13 elements that contains the culture-specific abbreviated names of the months. For 12-month calendars, the 13th element of the array is an empty string. The array for ":"一个一维弦阵列，其中包含13个元素，其中包含月份的缩写名称。 对于12个月的日历，数组的第13个元素是一个空字符串。 阵列","An integer from 0 through 59 that represents the minute.":"一个从0到59的整数，代表分钟。","A text string describing the details of the exception.":"描述异常细节的文本字符串。"," contains \"Jan\", \"Feb\", \"Mar\", \"Apr\", \"May\", \"Jun\", \"Jul\", \"Aug\", \"Sep\", \"Oct\", \"Nov\", \"Dec\", and \"\".":"包含“ Jan”，“ 2月”，“ MAR”，“ APR”，“ May”，“ Jun”，“ Jul”，“ Aug”，“ Sep”，“ Oct”，“ Oct”，“ Nov”，“ Nov”，“ Dec”和 “”。","The default culture for threads in the current application domain, or ":"当前应用程序域中线程的默认文化，或","The custom format string for a year and month value.":"定制格式字符串一年和月价值。"," object copied from the original ":"从原始的物体复制","The string designator for hours that are ante meridiem. The default for ":"数小时的弦乐器指定器是ante meridiem。 默认值","An integer from 0 through 59 that represents the second.":"代表第二个的0到59的整数。","The object that represents the date and time when daylight saving time begins. The value must be in local time.":"代表日期节省时间开始的日期和时间的对象。 值必须在当地。","An integer from 0 through 999 that represents the millisecond.":"代表毫秒的0到999的整数。"," if the current system culture is the default thread culture in the application domain.":"如果当前的系统文化是应用域中的默认线程文化。","The culture-specific abbreviated name of the day of the week represented by ":"一周中的特定文化特定缩写名称代表"," is \"AM\".":"是”。","The object that represents the date and time when daylight saving time ends. The value must be in local time.":"代表日光节省时间结束的日期和时间的对象。 值必须在当地。","The default UI culture for threads in the current application domain, or ":"当前应用程序域中线程的默认UI文化，或","The integer representing the era.":"代表时代的整数。"," that is set to the specified date, time, and era.":"设置为指定的日期，时间和时代。"," if the current system UI culture is the default thread UI culture in the application domain.":"如果当前的系统UI培养是应用域中的默认线程UI文化。","The object that represents the difference between standard time and daylight saving time, in ticks.":"代表标准时间和日光节省时间之间差异的对象，在滴答中。","The calendar to use for the current culture. The default for ":"用于当前区域性的日历。 默认值为 ","A string containing the abbreviated name of the specified era, if an abbreviation exists.  \n  \n -or-  \n  \n A string containing the full name of the era, if an abbreviation does not exist.":"如果存在缩写，则包含指定时代的缩写名称。 \n  \n  -或者- \n  \n  如果不存在缩写，则包含该时代的全名。","An integer that contains the four-digit representation of the ":"一个包含四位数表示的整数","The time interval that represents the difference between standard time and daylight saving time.":"表示标准时间和日光节省时间之间差异的时间间隔。","The full localized culture name in the format languagefull [country/regionfull], where languagefull is the full name of the language and country/regionfull is the full name of the country/region.":"格式的完整局部文化名称[country/conignfull]，其中语言是语言和国家/地区的全名是国家/地区的全名。","A value that determines the first calendar week of the year. The default for ":"确定一年中第一个日历周的值。 默认值","An integer from 1 through 13 representing the name of the month to retrieve.":"一个从1到13的整数代表要检索的月份的名称。","The culture name in the format languagefull [country/regionfull] in English, where languagefull is the full name of the language and country/regionfull is the full name of the country/region.":"语言以英语为单位的文化名称[country/conienfull]，其中语言是语言和国家/地区的全名是国家/地区的全名。","The object that represents the date and time when the daylight saving period ends. The value is in local time.":"表示夏令时间结束时的日期和时间的对象。 该值以本地时间为单位。","An object that supports culture-sensitive string comparison.":"一个支持文化敏感弦比较的对象。"," object based on the ":"基于","The culture-specific abbreviated name of the month represented by ":"本月的特定文化特定缩写名称","A string that is the RFC 4646 standard identification for a language.":"是一种语言的RFC 4646标准标识的字符串。","A value that defines how strings should be compared. ":"定义应如何比较字符串的值。","The object that represents the date and time when the daylight saving period begins. The value is in local time.":"代表日期节省期开始的日期和时间的对象。 该值在当地。"," that represents the culture installed with the operating system.":"这代表了操作系统安装的文化。"," object for the current thread.":"当前线程的对象。","An array that contains the standard patterns in which date and time values can be formatted.":"包含可以设置日期和时间值格式的标准模式的数组。"," to which to add ":"要添加",", the enumeration value ":"，枚举价值","The string that separates the components of a date, that is, the year, month, and day. The default for ":"将日期组成部分分开的字符串，即年度，月和日。 默认值","The object that is culture-independent (invariant).":"独立于文化的对象（不变）。","A standard format string.":"标准格式字符串。","An object that can be used to perform string comparisons.":"可用于执行字符串比较的对象。"," that results from adding the specified number of months to the ":"这是由于将指定的月数添加到"," is \"/\".":"是 ”/”。"," value that denotes which language version of the calendar to create.":"值表示要创建的日历的语言版本。","An array containing the standard patterns in which date and time values can be formatted using the specified format string.":"一个包含标准模式的数组，可以使用指定格式字符串格式化日期和时间值。"," represents a neutral culture; otherwise, ":"代表中性文化； 否则，"," that results from adding the specified number of years to the ":"这是由于将指定年数添加到","A one-dimensional string array that contains the culture-specific full names of the days of the week. The array for ":"一个一维弦阵列，其中包含本周日子的特定文化全名。 阵列","An integer from 1 to 31 that represents the day of the month in ":"一个从1到31的整数代表一个月的一天","The culture-specific full name of the day of the week represented by ":"一周中的特定于文化的全名代表","A 32-bit signed number that specifies an input locale identifier.":"一个32位签名的号码，指定输入语言环境标识符。"," contains \"Sunday\", \"Monday\", \"Tuesday\", \"Wednesday\", \"Thursday\", \"Friday\", and \"Saturday\".":"包含“星期日”，“星期一”，“星期二”，“星期三”，“星期四”，“星期五”和“星期六”。","The string containing the name of the era.":"包含该时代名称的弦。","The culture identifier for the current ":"当前的文化标识符"," value that represents the day of the week in ":"代表一周中的一天的价值","An integer from 1 through 60 that represents a year in the sexagenary cycle.":"一个从1到60个整数，代表性生物循环一年。","An enumeration value that represents the first day of the week. The default for ":"代表一周第一天的枚举价值。 默认值","The culture name in the format languagecode2-country/regioncode2, if the current ":"格式的文化名称languagecode2-count/regioncode2，如果当前","The integer representing the era, if ":"代表时代的整数，如果","A number from 1 through 10.":"一个从1到10的数字。","The custom format string for a long date and long time value.":"自定义格式字符串长期和长时间值。","An integer from 1 to 366 that represents the day of the year in ":"一个从1到366的整数代表一年中的一天"," is culture-dependent; or an empty string, if it's an invariant culture. languagecode2 is a lowercase two-letter code derived from ISO 639-1. country/regioncode2 is derived from ISO 3166 and usually consists of two uppercase letters, or a BCP-47 language tag.":"是文化依赖的； 或一个空的弦，如果是不变的文化。 languagecode2是从ISO 639-1派生的小写两个字母代码。 country/regioncode2源自ISO 3166，通常由两个大写字母或一个BCP-47语言标签组成。"," is valid; otherwise, -1.":"已验证; 否则，-1。","An integer from 1 through 31 that represents the day of the month specified in the ":"一个从1到31的整数，代表在","A read-only object that is culture-independent (invariant).":"一个仅读取的对象，它是独立的（不变）。","An integer from 1 to 12 that represents the month.":"代表月份的1到12个整数。"," values that represents the day of the week specified in the ":"代表在一周中指定的一天的值","The culture name, consisting of the full name of the language, the full name of the country/region, and the optional script. The format is discussed in the description of the ":"文化名称，包括语言的全名，国家/地区的全名和可选脚本。 格式在描述中讨论","A string containing the name of the era.":"一个包含该时代名称的弦。","The custom format string for a long date value.":"长期值的自定义格式字符串。","An integer from 1 through 354 in a common year, or 1 through 384 in a leap year, that represents the day of the year specified in the ":"一个从普通年份的1到354的整数，或LEAP年的1至384个整数，代表了一年中指定的一天","An integer that represents the era in ":"代表时代的整数","The type of the required formatting service.":"所需格式服务的类型。","The format pattern for a long time value.":"长时间值的格式模式。"," that defines the culturally appropriate format of displaying numbers, currency, and percentage.":"这定义了显示数字，货币和百分比的文化适当格式。","An integer from 1 through 12 in a common year, or 1 through 13 in a leap year, that represents the month.":"一个共同年份的1到12个整数，即代表月份的LEAP年中的1至13个整数。","An era. Specify either ":"一个时代。 指定","The current  object, if ":"当前对象，如果","The custom format string for a month and day value.":"定制格式字符串一个月和一天的价值。"," that represents the calendars that can be used by the culture represented by the current ":"代表了当前代表的文化可以使用的日历"," is the same as the type of the current ":"与电流的类型相同","The number of days in the specified month of the specified year and era.":"指定年度和时代指定月份的天数。","Always 0 because the Gregorian calendar does not recognize leap months.":"总是0，因为Gregorian日历无法识别Leap月。","A string array of month names.":"一个月名称的字符串数组。"," that represents the parent culture of the current ":"代表当前的父母文化"," that defines the writing system associated with the culture.":"这定义了与文化相关的写作系统。","The number of days in the specified year and era.":"指定年度和时代的天数。","An integer from 1 to 12 that represents the month in ":"一个从1到12的整数，代表一个月"," containing the culture-specific full names of the months. In a 12-month calendar, the 13th element of the array is an empty string. The array for ":"包含月份的特定文化全名。 在12个月的日历中，数组的第13个元素是一个空字符串。 阵列"," that gets the ":"那得到了","An integer from 1 to 31 that represents the day.":"一个代表一天的整数从1到31。","A positive integer from 1 through 13 that indicates the leap month in the specified year and era.  \n  \n -or-  \n  \n Zero if this calendar does not support a leap month, or if the ":"一个从1到13的正整数表示指定年度和时代的leap月。 \n  \n  -或者- \n  \n  零如果该日历不支持leap月，或者","The ISO 639-2 three-letter code for the language of the current ":"当前语言的ISO 639-2三个字母代码"," to get ":"要得到"," value that denotes the language version of the current ":"表示当前的语言版本的价值"," contains \"January\", \"February\", \"March\", \"April\", \"May\", \"June\", \"July\", \"August\", \"September\", \"October\", \"November\", \"December\", and \"\".":"包含“ 1月”，“ 2月”，“ 3月”，“ 4月”，“ 5月”，“六月”，“七月”，“八月”，“九月”，“十月”，“ 11月”，“ 12月”和 “”。","An integer from 1 to 13 that represents the month specified in the ":"一个从1到13的整数，代表在"," object associated with ":"与之关联的对象","The three-letter code for the language as defined in the Windows API.":"Windows API中定义的语言的三个字母代码。","An array of integers that represents the eras in the ":"代表时代的一系列整数","The native name of the calendar used in the culture associated with the current ":"与当前相关的文化中使用的日历的本地名称","The culture-specific full name of the month represented by ":"代表的本月的特定于文化的全名","The number of months in the specified year in the specified era. The return value is 12 months in a common year or 13 months in a leap year.":"指定时代指定年份的月数。 回报价值在普通年份或leap年中的13个月为12个月。","The ISO 639-1 two-letter code for the language of the current ":"当前语言的ISO 639-1两个字母代码","The latest date and time supported by the ":"最新日期和时间由","A number from 1 through 60 in the sexagenary cycle that corresponds to the ":"在性生物循环中的1到60个数字对应于"," object if that name is available, or the empty string (\"\") if the native calendar name is not available.":"如果该名称可用，则对象或空字符串（“”）如果本机日历名称不可用。","The abbreviated name of the week that corresponds to the ":"对应于本周的缩写名称","An integer that represents the era in the specified ":"代表指定时代的整数","An integer from 1 through 12.":"一个从1到12的整数。"," type, which is the last moment of December 31, 9999 C.E. and is equivalent to ":"类型，这是9999年12月31日的最后一刻，相当于","An array of custom format strings.":"一系列自定义格式字符串。","The string designator for hours that are \"post meridiem\" (after noon). The default for ":"数小时的字符串指定器为“后Meridiem”（中午之后）。 默认值","An integer that represents the year in the specified ":"代表指定年份的整数","The earliest date and time supported by the ":"最早的日期和时间由"," is \"PM\".":"是“ PM”。"," parameter, consisting of displayable Unicode characters in the US-ASCII character range (U+0020 to U+007E) and formatted according to the IDNA standard.":"参数，由US-ASCII字符范围内的可显示的Unicode字符（U+0020至U+007E）组成，并根据IDNA标准格式化。",". The return value is always ":"。 返回值始终"," type, which is the first moment of January 1, 0001 C.E. and is equivalent to ":"类型，这是公元1月1日的第一刻","An integer from 1 through 13 that represents the month.":"代表月份的1到13个整数。","A zero-based offset into ":"基于零的偏移到","The custom format string for a time value that is based on the IETF RFC 1123 specification.":"定制格式字符串，用于基于IETF RFC 1123规范的时间值。","A positive integer that indicates the leap month in the specified year and era. The return value is 7 if the ":"一个积极的整数，指示指定年度和时代的leap月。 如果返回值是7","An integer from 1 to 30 that represents the day of the month in the specified ":"一个从1到30的整数，代表指定的每月的一天","An integer from 1 through 31 that represents the day.":"代表一天的1到31的整数。","The custom format string for a short date value.":"短日期值的自定义格式字符串。"," that specifies the start of the substring to convert. The conversion operation continues to the end of the ":"这指定了要转换的子字符串的开始。 转换操作一直持续到"," parameters specify a leap year, or 0 if the year is not a leap year.":"参数指定leap年，如果年份不是leap年，则为0。","The format pattern for positive currency values. The default for ":"正货币价值的格式模式。 默认值"," value that represents the day of the week in the specified ":"代表指定的一周中的价值",", if the specified day is a leap day; otherwise, ":"，如果指定的一天是leap日； 否则，","An integer from 1 to 13 that represents the month in the specified ":"一个从1到13的整数代表指定的月份","The equivalent of the substring specified by the ":"相当于由","An integer from 1 to 385 that represents the day of the year in the specified ":"一个从1到385的整数，代表了一年中的一天",", if the specified year is a leap year; otherwise, ":"，如果指定年份是leap年； 否则，"," is 0, which represents \"$n\", where \"$\" is the ":"是0，代表“ $ n”，其中“ $”是","An integer from 1 to 13 that represents the month.":"一个代表月份的整数从1到13。","The number of months in the specified year in the specified era. The return value is either 12 in a common year, or 13 in a leap year.":"指定时代指定年份的月数。 回报值在普通年中为12个，或者在leap年中为13。"," parameters, consisting of displayable Unicode characters in the US-ASCII character range (U+0020 to U+007E) and formatted according to the IDNA standard.":"参数，由US-ASCII字符范围内的可显示的Unicode字符（U+0020至U+007E）组成，并根据IDNA标准格式化。","An integer that represents the era. Specify either ":"代表时代的整数。 指定","An integer (usually two digits) that represents the year to convert.":"代表转换年份的整数（通常是两个数字）。","The string to use as the currency symbol. The default for ":"用作货币符号的字符串。 默认值","An integer from 1 to 30 that represents the day.":"代表一天的1到30的整数。"," is \"Infinity\".":"是“无限”。"," type, which is equivalent to the first moment of September 8, 1868 C.E. in the Gregorian calendar.":"类型，相当于1868年9月8日在格里高利日历中的第一刻。"," that specifies the start of the substring.":"这指定了子字符串的开始。","A 2-digit year from 0 through 99, or a 4-digit Hebrew calendar year from 5343 through 5999.":"从0到99的2位年份，或4位希伯来语日历年，从5343到5999。"," is \"¤\".":"是“”。","The string that denotes that the associated number is positive. The default for ":"表示关联的数字为正的字符串。 默认值","If the ":"如果是","An integer that represents the era specified in the ":"一个代表当时指定时代的整数"," based on the culture of the current thread.":"基于当前线的文化。","The number of characters to convert in the substring that starts at the position specified by  ":"在从指定的位置开始的子字符中要转换的字符数","An array of 32-bit signed integers that specify the relevant eras.":"指定相关时代的32位签名整数的数组。"," is \"+\".":"是“+”。","One of four 32-bit signed constants derived from the properties of an ":"从一个属性的四个32位签名常数之一"," parameter is a 2-digit year, the return value is the corresponding 4-digit year. If the ":"参数是2位年份，回报值是相应的4位年。 如果是","One of the enumeration values that specifies the culture-specific digit shape.":"指定特定数字形状的枚举值之一。"," class, which is equivalent to the last moment of January 22, 2050 C.E. in the Gregorian calendar.":"班级，相当于2050年1月22日的最后一刻，在格里高利日历中。","The positive or negative number of months to add.":"添加的正数或负数。"," object.  The return value has no special meaning and is not suitable for use in a hash code algorithm.":"目的。 返回值没有特殊的含义，也不适合在哈希代码算法中使用。"," parameter is a 4-digit year, the return value is the unchanged ":"参数是四位数的年份，回报值是未改变的"," class, which is equivalent to the first moment of January 28, 1960 C.E. in the Gregorian calendar.":"班级，相当于1960年1月28日在格里高利日历中的第一时刻。","A read-only  object that is culture-independent (invariant).":"一个仅读取的对象，是与文化无关的（不变）。"," object that represents the date yielded by adding the number of months specified by the ":"代表通过添加由"," type. The return value is always an array containing one element equal to ":"类型。 返回值始终是包含一个等于一个元素的数组","The string to decode, which consists of one or more labels in the US-ASCII character range (U+0020 to U+007E) encoded according to the IDNA standard.":"解码的字符串由US-ASCII字符范围（U+0020至U+007E）中的一个或多个标签组成，根据IDNA标准编码。","A positive integer that indicates the leap month in the specified year and era. Alternatively, this method returns zero if the calendar does not support a leap month, or if ":"一个积极的整数，指示指定年度和时代的leap月。 或者，如果日历不支持leap月，或者如果","The string that represents the IEEE NaN (not a number) value. The default for ":"表示IEEE NAN（不是数字）值的字符串。 默认值"," parameter to the date specified by the ":"参数到由"," type, which is equivalent to the last moment of September, 29, 2239 C.E. in the Gregorian calendar.":"类型，相当于格里高利日历中2239年9月29日的最后一刻。","The Unicode equivalent of the IDNA substring specified by the ":"由IDNA子字符串的Unicode等效。"," is \"NaN\".":"是“ nan”。","The positive or negative number of years to add.":"积极或负年的添加年数。"," do not specify a leap year.":"不要指定leap年。"," type, which is equivalent to the first moment of January, 1, 1583 C.E. in the Gregorian calendar.":"类型，相当于1583年1月1日的第一刻，在格里高利日历中。"," that specifies the start of the substring to decode. The decoding operation continues to the end of the ":"这指定了基因的开始解码。 解码操作一直持续到","A string array that contains the native equivalent of the Western digits 0 through 9. The default is an array having the elements \"0\", \"1\", \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", and \"9\".":"一个字符串数组包含western数字0到9的本机等效的字符串阵列。默认值是一个具有元素“ 0”，“ 1”，“ 2”，“ 3”，“ 4”，“ 4”，“ 5”，“ 6，” 6的数组 “，“ 7”，“ 8”和“ 9”。"," object that results from adding the specified number of years to the specified ":"将指定年数添加到指定的对象"," to add months to.":"增加几个月。"," class, which is equivalent to the last moment of December 31, 9999 C.E. in the Gregorian calendar.":"班级，相当于格里高利日历中9999年12月31日的最后一刻。","The number of characters to convert in the substring that starts at the position specified by ":"在从指定的位置开始的子字符中要转换的字符数","The string that represents negative infinity. The default for ":"代表负无穷大的字符串。 默认值"," to add years to.":"增加几年。","An integer from 1 through 31 that represents the day of the month in the specified ":"一个从1到31的整数，代表指定的月份"," if unassigned code points are used in operations; otherwise, ":"如果在操作中使用未分配的代码点； 否则，"," class, which is equivalent to the first moment of January 1, 0001 C.E. in the Gregorian calendar.":"班级，相当于Gregorian日历中1月1日，公元1月1日的第一刻。"," is \"-Infinity\".":"是“ -infinity”。","An integer from 1 to 355 that represents the day of the year in the specified ":"一个从1到355的整数，代表一年中的一年中的一天"," if standard naming conventions are used in operations; otherwise, ":"如果在操作中使用标准命名约定； 否则，","The string that denotes that the associated number is negative. The default for ":"表示关联的数字为负的字符串。 默认值","An integer from 1 through 366 that represents the day of the year in the specified ":"一个从1到366的整数，代表一年中的一年中的一天"," class does not support the notion of a leap month.":"班级不支持leap月份的概念。","The number of days in the specified year and era. The number of days is 354 in a common year or 355 in a leap year.":"指定年度和时代的天数。 在普通年份中的天数为354，在leap年中为355。","An era. Specify ":"一个时代。指定"," is \"-\".":"是 ”-”。","A date in the Gregorian calendar.":"格里高利日历中的日期。","An integer that represents the era specified by the ":"代表由","An integer from 1 through 9378 that represents the year.":"代表年份的1到9378的整数。","Always 0 because the ":"总是0，因为","The number of decimal places to use in numeric values. The default for ":"数值中使用的小数位数的数量。 默认值","A number between 1 and 53 representing the ISO week number of the given Gregorian date.":"一个代表给定格里高利日期的ISO周数的1到53之间的数字。"," parameter. The return value for a ":"范围。 返回值"," type does not support the notion of a leap month.":"类型不支持leap月的概念。","An integer that represents the month, and ranges from 1 through 12 if ":"代表月份的整数，如果","The string to use as the decimal separator in numeric values. The default for ":"用作数字值的小数分离器的字符串。 默认值","An ISO week-numbering year (also called an ISO year informally).":"ISO周数年度（也称为非正式的ISO年）。"," object is always the ":"对象始终是","An integer from 1 to 12 that represents the month in the specified ":"一个从1到12的整数，代表指定的月份","The string that separates groups of digits to the left of the decimal in numeric values. The default for ":"将数字组分开的字符串以数字值分离为十进制的左侧。 默认值"," is not 9378, or 1 through 10 if ":"不是9378，如果是1至10"," class, which is equivalent to the last  moment of February 10, 2051 C.E. in the Gregorian calendar.":"班级，相当于2051年2月10日的最后一刻，在格里高利日历中。","The number of ISO weeks in the year. Returns either 52 or 53.":"一年中的ISO周数。 返回52或53。","The number of digits in each group to the left of the decimal in numeric values. The default for ":"数字值的小数点左侧的每个组中的数字数。 默认值","The number of months in the specified year and era.":"指定年度和时代的月数。","A new object copied from the original ":"从原始物体复制的新物体"," is 9378.":"是9378。","The format pattern for negative numeric values.":"负数值的格式模式。","The ISO week-numbering year, between 1 and 9999":"ISO周数年，1至9999年之间","An integer from -2 to 2 that represents the number of days to add or subtract from the calendar.":"一个从-2到2的整数表示从日历中添加或减去的天数。","An integer from 0 through 1 that represents the era.":"代表时代的0到1的整数。","The number of decimal places to use in percent values. The default for ":"以百分比为单位的十进制位置的数量。 默认值"," of the required formatting service.":"所需的格式服务。"," type, which is equivalent to the last moment of December 31, 9999 C.E. in the Gregorian calendar.":"类型，相当于格里高利日历中9999年12月31日的最后一刻。","The Gregorian date at which the week-numbering year will end.":"周刊年度结束的格里高利日期。","The number of days in the specified year and era. The number of days is 365 in a common year or 366 in a leap year.":"指定年度和时代的天数。 在普通年份中的天数为365，在leap年中为366。","The string to use as the decimal separator in percent values. The default for ":"以百分比为单位的小数分离器的字符串。 默认值"," used to get the ":"用来获取","The Gregorian date at which the week-numbering year will start.":"周刊年度开始的格里高利日期。"," type, which is equivalent to the first moment of July 18, 622 C.E. in the Gregorian calendar.":"类型，相当于622年7月18日在格里高利日历中的第一刻。","The string that separates groups of digits to the left of the decimal in percent values. The default for ":"将数字组分开到小数百分比左侧的字符串。 默认值","An integer from 1 through 9378 that represents the year to convert.":"一个从1到9378的整数代表转换年的一年。","The ISO week number in the given ISO week-numbering year.":"ISO周的ISO周数中，在给定的ISO周数年度。","The object to compare to the current object.":"与当前对象进行比较的对象。"," associated with the specified ":"与指定的","The return value is always 0.":"返回值始终为0。","The day of week inside the given ISO week.":"给定ISO周的一周中的一天。","The number of digits in each group to the left of the decimal in percent values. The default for ":"小数百分比左侧的每个组中的数字数。 默认值"," if the object specified by the ":"如果对象由","The number of decimal places to use in currency values. The default for ":"货币价值中使用的小数位数的数量。 默认值","The Gregorian date equivalent to the input ISO week date.":"Gregorian日期等于输入ISO周日期。","An integer from 1 through 12 that represents the month in the specified ":"从1到12的整数代表指定的月份"," parameter is derived from ":"参数是从","The format pattern for negative percent values. The default for ":"负百分比值的格式模式。 默认值"," is 2.":"是2。"," properties are equal; otherwise, ":"属性相等； 否则，","Returns 10 if the ":"如果返回10","An integer from 1 to 31 that represents the day of the month in the specified ":"一个从1到31的整数代表指定的月份","The string to use as the decimal separator in currency values. The default for ":"用作货币值的小数分离器的字符串。 默认值"," is 0, which represents \"-n %\", where \"%\" is the ":"IS 0，代表“ -n％”，其中“％”是","An integer from 1 to 366 that represents the day of the year in the specified ":"一个从1到366的整数，代表一年中指定的一天","The string to convert, which consists of one or more domain name labels delimited with label separators.":"要转换的字符串由一个或多个域名标签组成，该名称标签标签分隔符。"," parameter is 9378; otherwise, always returns 12.":"参数为9378； 否则，始终返回12。"," is \".\".":"是 ”。”。","The return value is always 0 because the ":"返回值始终为0，因为","An integer from 1 through 9378 that represents the year in the specified ":"从1到9378的整数代表指定年份","The equivalent of the string specified by the ":"相当于字符串","The string that separates groups of digits to the left of the decimal in currency values. The default for ":"将数字组分开的字符串以货币值的小数左侧。 默认值","The format pattern for positive percent values. The default for ":"正值的格式模式。 默认值","The return value is always 12.":"返回值始终为12。"," is 0, which represents \"n %\", where \"%\" is the ":"IS 0，代表“ n％”，其中“％”是"," is \",\".":"是 ”，”。","A string containing the culture name or ISO 3166 two-letter country/region codes defined for the current ":"包含文化名称或ISO 3166两个字母的国家/地区/区域代码的字符串","An integer that represents the month and ranges from 1 through 12 if ":"代表月份的整数，如果是1到12"," values that defines a calendar week.":"定义日历周的值。","The number of digits in each group to the left of the decimal in currency values. The default for ":"货币值小数点左侧的每个组中的数字数。 默认值","The string to use as the percent symbol. The default for ":"用作百分比符号的字符串。 默认值","The name, in English, of the currency used in the country/region.":"该国/地区使用的货币的名称。"," values that represents the first day of the week.":"代表一周的第一天的值。"," is a one-dimensional array with only one element, which is set to 3.":"是一个仅具有一个元素的一维数组，该元素设置为3。","An integer from 1 through 12 that represents the month.":"代表月份的1到12个整数。","The native name of the currency used in the country/region, formatted in the language associated with the ISO 3166 country/region code.":"该国/地区使用的货币的本地名称，采用与ISO 3166国家/地区代码相关的语言格式。"," is \"%\".":"是 ”％”。","A 1-based integer that represents the week of the year that includes the date in the ":"一个基于1的整数，代表一年中的一周，其中包括日期","The format pattern for negative currency values. The default for ":"负货币值的格式模式。 默认值","The currency symbol associated with the country/region.":"与国家/地区相关的货币符号。"," object that is set to the specified date and time in the current era.":"设置为当前时代指定的日期和时间的对象。"," is 0, which represents \"($n)\", where \"$\" is the ":"是0，代表“（$ n）”，其中“ $”是","The string to use as the per mille symbol. The default for ":"用作Per Mille符号的字符串。 默认值"," that represents the country/region used by the current thread.":"这代表当前线程使用的国家/地区。"," is \"‰\", which is the Unicode character U+2030.":"为“‰”，这是Unicode字符u+2030。","An array of integers that represents the eras in a ":"代表时代的一系列整数","The full name of the country/region in the language of the localized version of .NET.":"以局部版本的.NET语言使用该国家/地区的全名。","The string that represents positive infinity. The default for ":"代表正无穷大的字符串。 默认值"," is a number.":"是一个数字。"," object. The array consists of a single element having a value of ":"目的。 数组由一个具有值的单个元素组成","The full name of the country/region in English.":"英语国家/地区的全名。","A culture identifier.":"文化标识符。","A 32-bit signed number that uniquely identifies a geographical location.":"一个唯一标识地理位置的32位签名数字。","A string that contains a two-letter code defined in ISO 3166 for country/region.  \n  \n -or-  \n  \n A string that contains the culture name for a specific culture, custom culture, or Windows-only culture. If the culture name is not in RFC 4646 format, your application should specify the entire culture name instead of just the country/region.":"一个包含ISO 3166中定义的两个字母代码的字符串针对国家/地区定义。 \n  \n  -或者- \n  \n  包含特定文化，自定义文化或仅限窗户文化的文化名称的弦。 如果文化名称不采用RFC 4646格式，则您的应用程序应指定整个文化名称，而不仅仅是国家/地区。"," if the country/region uses the metric system for measurements; otherwise, ":"如果国家/地区使用度量系统进行测量； 否则，"," object and its ":"对象及其","The three-character ISO 4217 currency symbol associated with the country/region.":"与国家/地区相关的三个字符ISO 4217货币符号。"," property is the same as the ":"财产与","The value specified by the ":"由"," property of the current ":"当前的属性"," parameter of the ":"参数"," constructor. The return value is in uppercase.  \n  \n -or-  \n  \n The two-letter code defined in ISO 3166 for the country/region specified by the ":"构造函数。 返回值在大写中。 \n  \n  -或者- \n  \n  ISO 3166在ISO 3166中定义的两个字母代码"," constructor. The return value is in uppercase.":" 构造函数。 返回值为大写。","The native name of the country/region formatted in the language associated with the ISO 3166 country/region code.":"以与ISO 3166国家/地区代码相关的语言格式的国家/地区的本地名称。","The three-letter code defined in ISO 3166 for the country/region.":"在ISO 3166中针对该国/地区定义的三个字母代码。","The three-letter code assigned by Windows to the country/region represented by this ":"Windows分配给国家/地区的三个字母代码","The two-letter code defined in ISO 3166 for the country/region.":"在ISO 3166中针对该国/地区定义的两个字母代码。","The first sort key to compare.":"比较的第一个键。","The second sort key to compare.":"比较的第二种键。","A signed integer that indicates the relationship between ":"一个指示的签名整数"," parameter is equal to the current ":"参数等于电流","A byte array representing the current ":"代表电流的字节数组","The original string used to create the current ":"用于创建电流的原始字符串","A version number.":"版本号。","A sort ID.":"排序ID。"," represents the same version as this instance; otherwise, ":"代表与此实例相同的版本； 否则，"," object that represents the same version as this instance; otherwise, ":"代表与此实例相同版本的对象； 否则，"," if the values of ":"如果值","The version number of this ":"这个版本的编号","A globally unique identifier for this ":"全球唯一的标识符","A string to initialize this ":"一个初始化此的字符串","A 32-bit signed integer hash code based on the string value of this ":"基于此的字符串值32位签名的整数哈希代码","The string from which to get the text element.":"从中获取文本元素的字符串。","A string containing the first text element in the specified string.":"一个包含指定字符串中第一个文本元素的字符串。","The zero-based index at which the text element starts.":"文本元素启动的基于零的索引。","A string containing the text element at the specified index of the specified string.":"在指定字符串的指定索引处包含文本元素的字符串。","The input span to analyze.":"要分析的输入跨度。","The length (in chars) of the substring corresponding to the first text element within ":"子字符串的长度（以字符为单位），对应于内部的第一个文本元素","The input string to analyze.":"要分析的输入字符串。","The char offset in ":"char偏移"," at which to begin analysis.":"开始分析。"," starting at index ":"从索引开始"," corresponds to the end of ":"对应于结尾","The string to iterate through.":"字符串到迭代。"," for the entire string.":"对于整个字符串。","The zero-based index at which to start iterating.":"零基于零的索引开始迭代。"," for the string starting at ":"对于从开始的字符串","An array of integers that contains the zero-based indexes of each base character, high surrogate, or control character within the specified string.":"一个整数数组，其中包含指定字符串中每个基本字符、高位代理或控制字符的从零开始的索引。","The zero-based index of a text element in this ":"本文中的文本元素的零索引","A substring of text elements in this ":"此文本元素的子字符串 "," object, starting from the text element index specified by the ":"对象，从文本元素索引开始"," parameter and continuing through the last text element in this object.":"参数并继续通过此对象中的最后一个文本元素。","The number of text elements to retrieve.":"要检索的文本元素数量。"," object. The substring consists of the number of text elements specified by the ":"目的。 子字符串由由"}