{"The index of the last occurrence of the value in the span.":"该值在跨度中的最后一次出现的索引。","The index of the last occurrence of the value in the span. If not found, returns -1.":"该值在跨度中的最后一次出现的索引。 如果找不到，返回-1。","The set of values to search for.":"要搜索的值集。","The index of the last occurrence of any of the values in the span. If not found, returns -1.":"跨度中任何值的最后一次出现的索引。 如果找不到，返回-1。"," if the span contains only whitespace characters, ":"如果跨度仅包含空格字符，","The first sequence.":"第一个序列。"," if the two sequences overlap; otherwise, ":"如果两个序列重叠； 否则，","The second sequence.":"第二个序列。","The span to compare.":"比较的跨度。","When the method returns, contains the offset between ":"当方法返回时，包含","The first sequence to compare.":"比较的第一个序列。","The second sequence to compare.":"比较的第二个序列。","The read-only span to compare.":"比较的只读跨度。"," if the two sequences are equal; otherwise, ":"如果两个序列相等； 否则，"," for the type of an element.":"对于元素的类型。","The span to reverse.":"跨越跨度。"," to use each element's ":"使用每个元素的","The method to use when comparing elements.":"比较元素时使用的方法。","The span that contains the keys to sort.":"包含排序键的跨度。"," interface implementation of each element.":"每个元素的接口实现。","The span of memory to sort.":"内存的跨度要排序。","The span that contains the items that correspond to the keys in ":"包含与键相对应的项目的跨度"," interface implementation.":"接口实现。","The method to use when comparing elements, or ":"比较元素时使用的方法，或","A sequence to search for at the start of ":"在开始时搜索的序列"," matches the beginning of ":"匹配","The sequence to compare to the beginning of the source span.":"与源跨度的开始进行比较的序列。","The source memory from which the characters are removed.":"删除字符的源内存。","An object that supplies culture-specific casing rules.":"提供特定文化套管规则的对象。","The destination span which contains the transformed characters.":"包含转换字符的目标跨度。","The source span from which the characters are removed.":"删除字符的源跨度。","The read-only character span to search.":"只读字符跨度要搜索。","The span which contains the set of characters to remove.":"包含要删除的字符集的跨度。","The source span from which the character is removed.":"删除字符的源跨度。","The number of characters written into the destination span. If the destination is too small, returns -1.":"写入目标跨度的字符数。 如果目的地太小，则返回-1。","The trimmed character memory region.":"修剪的字符存储区域。","The trimmed read-only character span.":"修剪的只读字符跨度。","The specified character to look for and remove.":"指定的字符要查找和删除。","The source memory from which the element is removed.":"删除元素的源内存。","The trimmed character span.":"修剪的字符跨度。","The trimmed memory region.":"修剪内存区域。","The span which contains the set of elements to remove.":"包含要删除的元素集的跨度。","The source span from which the element is removed.":"删除元素的源跨度。","The trimmed read-only character memory region.":"修剪的仅读取字符存储区域。","The source memory from which the elements are removed.":"删除元素的源内存。","The specified element to look for and remove.":"指定的元素要查找和删除。","The trimmed read-only memory region.":"修剪的仅读取内存区域。","The interpolated string, passed by reference.":"插值字符串，通过引用传递。","The trimmed read-only span.":"修剪的只读跨度。","The source memory region from which the element is removed.":"删除元素的源存储区域。","The number of interpolation expressions in the interpolated string.":"插值字符串中的插值表达式数量。"," if it won't be.":"如果不会。","The source span from which the elements are removed.":"删除元素的源跨度。","When this method returns, contains the number of characters written to the span.":"当此方法返回时，包含写入跨度的字符数。","The span to which the interpolated string should be formatted.":"应格式化的插值字符串的跨度。","The minimum number of characters that should be written for this value. A negative value indicates left-aligned, and the required minimum is the absolute value.":"为此值编写的字符数量最少。 负值表示左对准，所需的最小值是绝对值。","The destination buffer.":"目标缓冲区。"," if the entire interpolated string could be formatted successfully; otherwise, ":"如果整个插值字符串可以成功地格式化； 否则，","The trimmed span.":"修剪跨度。","An object that supplies culture-specific formatting information.":"提供特定文化格式信息的对象。","Upon return, ":"返回后，","The format string.":"格式字符串。","The number of constant characters outside of interpolation expressions in the interpolated string.":"插值字符串中插值表达式之外的常数字符数。",">The minimum number of characters that should be written for this value. If the value is negative, it indicates left-aligned and the required minimum is the absolute value.":">为此值编写的字符数量最少。 如果该值为负，则表示左对准，所需的最小值是绝对值。","A read-only span of type ":"只读类型的跨度"," if the destination may be long enough to support the formatting, or ":"如果目的地可能足够长以支持格式，或者"," if the operation failed; ":"如果操作失败；","The read-only span to reinterpret.":"重新诠释的仅读取跨度。","A span of type ":"类型的跨度","The minimum number of characters that should be written for this value.A negative value indicates left-aligned, and the required minimum is the absolute value.":"为此值编写的字符数量最小数量。一个负值表示左对准，所需的最小值是绝对值。","The converted read-only span.":"转换后的只读跨度。","The number of items to include in the memory block.":"在内存块中包含的项目数。","The read-only memory buffer.":"仅读取的内存缓冲区。","The read-only reference to the structure of type ":"仅读取类型结构","The converted span.":"转换的跨度。","A block of memory over the specified elements of ":"在指定元素上的记忆块"," if the value could be formatted to the span; otherwise, ":"如果值可以格式为跨度； 否则，","A memory block that represents the same memory as the ":"代表与的内存相同的内存块","The span to reinterpret.":"重新诠释的跨度。"," zero.":"零。"," are 0, the method returns a ":"是0，该方法返回","The pre-pinned source array.":"预先插入的源阵列。","The source slice to convert.":"源切片要转换。","The reference to the structure of type ":"对类型结构的引用"," instance of ":"实例","A reference to data.":"对数据的引用。","The pointer to the null-terminated string of bytes.":"指向无效字符串字符串的指针。"," at which to begin the memory block.":"开始内存块。","The array to analyze.":"分析的阵列。"," elements that ":"元素","A reference to the element at index 0.":"对索引0的元素的引用。","An enumerable view of ":"列举的看法","A read-only span.":"只读跨度。","A read-only span representing the specified null-terminated string, or an empty span if the pointer is ":"仅读取的跨度代表指定的null端端字符串，或者如果指针为","The span from which the reference is retrieved.":"检索引用的跨度。","A reference to the 0th element of ":"对0个元素的引用","When this method returns, contains the array segment retrieved from the underlying read-only memory buffer. If the method fails, the method returns a default array segment.":"当此方法返回时，包含从基础读取的内存缓冲区检索的数组段。 如果方法失败，则该方法返回默认数组段。","The pointer to the null-terminated string of characters.":"指向无效的字符串字符串的指针。","The structure retrieved from the read-only span.":"从仅读取的跨度检索的结构。","When the method returns, the manager of ":"当方法返回时，","Reference to the 0th element in ":"引用0的0元素"," if the method call succeeds; ":"如果方法呼叫成功；","A span.":"一个跨度。"," if the method retrieved the memory manager; otherwise, ":"如果该方法检索了内存管理器； 否则，","A read-only memory buffer.":"仅读取的内存缓冲区。","The read-only memory buffer for which to get the memory manager.":"仅读取的内存缓冲区来获取内存管理器。","The read-only span from which the reference is retrieved.":"检索引用的仅读取跨度。","The starting location in ":"起始位置","When the method returns, the offset from the start of the ":"当方法返回时，偏移了"," if the read-only memory can be retrieved; otherwise, ":"如果可以检索仅读取的内存； 否则，"," if the write operation succeeded; otherwise, ":"如果写操作成功； 否则，","The returned value if the read was successful. ":"如果读取成功，则返回的值。","The read-only sequence from which the read-only sequence segment will be retrieved.":"将检索仅读取序列段的仅读取序列。"," if the span is too small to contain ":"如果跨度太小而无法包含","The number of characters in ":"字符数量"," represents.":"代表。"," if failed (due to lack of space).":"如果失败（由于缺乏空间）。","When the method returns, the length of the ":"当方法返回时，","The beginning read-only sequence segment.":"开头仅读取序列段。","The read-only sequence from which the array segment will be retrieved.":"将检索阵列段的仅读取序列。"," if the read attempt was successful, ":"如果阅读尝试成功，"," if the method successfully retrieves the underlying string; otherwise, ":"如果该方法成功检索了基础字符串； 否则，","The returned array segment.":"返回的数组段。","The initial position.":"初始位置。"," if the method succeeded; otherwise, ":"如果该方法成功了； 否则，","A non-contiguous set of memory.":"一组不连续的内存。","A read-only span of bytes.":"仅读取字节。"," if it's possible to retrieve the array segment; otherwise, ":"如果可以检索数组段； 否则，","The position in ":"位置","Read-only memory containing a block of characters.":"只读的内存包含一个字符块。","The ending read-only sequence segment.":"结尾仅读取序列段。"," and is equal to the current instance; otherwise, ":"并且等于当前实例； 否则，"," and a default array segment is returned.":"并返回默认数组段。","The final position.":"最终位置。","When the method returns, the string contained in the memory buffer.":"当方法返回时，存储器缓冲区中包含的字符串。","When the method returns, an instance of ":"当方法返回时，","The read-only sequence from which the memory will be retrieved.":"从中检索内存的仅读取顺序。","The sequence position to compare with the current instance.":"与当前实例进行比较的序列位置。"," if the two instances are equal; ":"如果两个实例相等；"," if the method succeeds in retrieving an instance of the structure; otherwise, ":"如果该方法成功地检索了结构的实例； 否则，","The integer part of this sequence position.":"该序列位置的整数部分。"," if the read-only sequence segment can be retrieved; otherwise, ":"如果可以检索仅读取序列段； 否则，","The returned read-only memory of type T.":"Type T类的返回的只读内存。","The object part of this sequence position.":"该序列位置的对象部分。","A reference to the sequence reader.":"对序列读取器的引用。","A sequence of characters to encode.":"一系列字符要编码。","The span of bytes to contain the structure.":"字节的跨度包含结构。","The decoder instance that can convert bytes to ":"可以将字节转换为的解码器实例"," whose contents should be encoded.":"其内容应编码。","The buffer to which the encoded bytes will be written.":"编码字节的缓冲区将编写。","The structure to be written to the span.":"要写入跨度的结构。","A sequence of bytes to decode.":"一个字节序列解码。","The destination buffer to which the encoded bytes will be written.":"编码字节的目标缓冲区将编写。"," if all input up until ":"如果全部输入直到","The span of bytes to decode.":"字节的跨度解码。"," contains no partial internal state; otherwise, ":"不包含部分内部状态； 否则，"," should be decoded.":"应该解码。","The buffer to which the decoded characters will be written.":"解码字符的缓冲区将被编写。","The sequence to decode into characters.":"分解为字符的序列。",".\n If ":"。 \n  如果"," was converted; otherwise, ":"被转换了； 否则，","The sequence whose bytes should be decoded.":"应该解码字节的序列。"," to indicate no further data is to be converted; otherwise ":"表示没有进一步的数据要转换； 否则"," which represents the decoded contents of ":"代表解码的内容","The encoding that represents how the data in ":"代表数据中数据的编码",", this will always be set to ":"，这将始终设置为","The number of chars written to ":"写给的字符数量","When this method returns, contains the count of characters that were written to ":"当此方法返回时，包含写入的字符计数","This instance as an enumerator.":"此实例作为枚举者。"," when the method returns.":"当方法返回时。"," should be encoded.":"应该编码。"," is encoded.":"编码。","When this method returns, contains ":"当此方法返回时，包含"," if the enumerator successfully advanced to the next line; ":"如果枚举者成功升级到下一行；","The buffer to which the decoded chars will be written.":"解码的炭将写的缓冲区。","The sequence to encode to bytes.":"编码为字节的序列。","The sequence to decode to characters.":"解码为字符的序列。"," if the end of the span has been reached.":"如果达到了跨度的末端。","s which were written to ":"写信给"," if the enumerator has advanced past the end of the span.":"如果枚举者已超过跨度的末端。"," array that represents the encoded contents of ":"代表编码内容的数组","The destination buffer to which the decoded characters will be written.":"将编写解码字符的目标缓冲区。","The client used to send the request.":"客户用于发送请求。","The encoder instance that can convert ":"可以转换的编码器实例","The line at the current position of the enumerator.":"枚举器当前位置的线。","Options to control the behavior during serialization, the default options are ":"在序列化过程中控制行为的选项，默认选项是","Source generated JsonTypeInfo to control the behavior during deserialization.":"来源生成了jsontypeinfo，以控制避难化过程中的行为。","The Uri the request is sent to.":"请求发送给URI。"," values to bytes.":"值为字节。","The current enumerator instance.":"当前的枚举实例。"," to be serialized by this instance.":"通过这种情况序列化。","The value to serialize.":"序列化的价值。","The type of the object to deserialize to and return.":"对象的类型应归因于和返回。","The inner handler which is responsible for processing the HTTP response messages.":"负责处理HTTP响应消息的内部处理程序。"," starting from the ":"从","Options to control the behavior during serialization. The default options are those specified by ":"在序列化过程中控制行为的选项。 默认选项是由","The value to be serialized and used as the body of the ":"要序列化并用作主体的价值","Options to control the behavior during deserialization. The default options are those specified by ":"控制避难所期间行为的选项。 默认选项是由"," to releases only unmanaged resources.":"仅发布非管理资源。","The cancellation token to cancel the operation.":"取消令牌取消操作。","Source generated JsonTypeInfo to control the behavior during serialization.":"来源生成了jsontypeinfo，以控制序列化过程中的行为。"," that sends this instance.":"发送此实例。","A cancellation token that can be used by other objects or threads to receive notice of cancellation.":"可以通过其他对象或线程使用的取消令牌来接收取消通知。","The content to read from.":"要阅读的内容。","The HTTP request message to send to the server.":"HTTP请求消息发送到服务器。","The HTTP content stream.":"HTTP内容流。","The content used to initialize the ":"用于初始化的内容","A cancellation token to cancel operation.":"取消令牌以取消操作。","The task object representing the asynchronous operation.":"代表异步操作的任务对象。","The offset, in bytes, in the ":"偏移，字节中的偏移","Source generated JsonSerializerContext used to control the behavior during deserialization.":"来源生成的jsonserializerializercontext用于控制避难化过程中的行为。","The target stream.":"目标流。","Source generated JsonSerializerContext used to control the deserialization behavior.":"来源生成的jsonserializerizercontext用于控制避难行为。","An HTTP response message.":"HTTP响应消息。"," parameter used to initialize the ":"用于初始化的参数","The type of the value to serialize.":"序列化值的类型。","Optional information about the transport, like the channel binding token. This parameter can be ":"有关传输的可选信息，例如通道绑定令牌。 此参数可以是","The type we are encoding/decoding the headers for.":"我们正在编码/解码标题的类型。","The number of bytes in the ":"字节数","The media type to use for the content.":"用于内容的媒体类型。","The inner handler for HTTP response messages.":"HTTP响应消息的内部处理程序。","Information about the transport, like channel binding token. This parameter may be ":"有关运输的信息，例如通道绑定令牌。 此参数可能是","A collection of cache-extension tokens each with an optional assigned value.":"一个带有可选分配值的高速缓存延伸令牌的集合。","The encoding to use, or ":"使用的编码，或","The length in bytes of the byte array.":"字节阵列的字节长度。","A collection of name/value pairs.":"名称/价值对的集合。","A suggested filename.":"建议的文件名。","The time in seconds.":"几秒钟内的时间。"," to use the default behavior.":"使用默认行为。"," is a valid length; otherwise, ":"是有效的长度； 否则，","The name of the header to specify for the encoding.":"为编码指定标题的名称。"," if the HTTP client is willing to accept a response that has exceed the expiration time; otherwise, ":"如果HTTP客户端愿意接受已超过到期时间的响应； 否则，","A string that contains an ":"一个包含一个的字符串","The scheme to use for authorization.":"用于授权的计划。","A suggested filename of the form filename*.":"表单文件名*的建议文件名。"," if the specified header exists in the collection; otherwise ":"如果集合中存在指定的标头； 否则","A string that contains an  ":"一个包含一个的字符串"," if the origin server requires revalidation of a cache entry on any subsequent use when the entry becomes stale; otherwise, ":"如果原始服务器需要在条目变为后续使用时在任何后续使用中重新验证缓存条目； 否则，","The credentials containing the authentication information of the user agent for the resource being requested.":"包含用户代理的身份验证信息的凭据，以提供所请求的资源。","The specified header to return values for.":"指定的标头要返回值。","The file modification date.":"文件修改日期。"," if the HTTP client is not willing to accept a cached response; otherwise, ":"如果HTTP客户不愿意接受缓存的响应； 否则，","A value that indicates if this entity-tag header is a weak validator. If the entity-tag header is weak validator, then ":"指示该实体标签标头是否为弱验证器的值。 如果实体标签标题是弱验证器，则","The object to compare with the current object.":"与当前对象进行比较的对象。","An array of header strings.":"一系列的标题字符串。","A collection of fieldnames.":"字段名的集合。"," is equal to the current object; otherwise, ":"等于当前对象； 否则，"," should be set to ":"应该设置为","The name for the content body part.":"内容主体部分的名称。","The name of the header to remove from the collection.":"从集合中删除的标题名称。","A hash code for the current object.":"当前对象的哈希代码。","A collection of parameters.":"参数集合。"," if a cache must not store any part of either the HTTP request message or any response; otherwise, ":"如果缓存不得存储HTTP请求消息或任何响应的任何部分； 否则，",". If the entity-tag header is a strong validator, then ":"。 如果实体标签标头是强大的验证器，则","An instance of an implementation of an ":"实施的实例","The last read date.":"最后一个读取日期。","A string that represents entity tag header value information.":"代表实体标签标头值信息的字符串。"," if a cache or proxy must not change any aspect of the entity-body; otherwise, ":"如果缓存或代理不得改变实体身体的任何方面； 否则，","A string that represents authentication header value information.":"表示身份验证标头值信息的字符串。","The approximate size, in bytes.":"大约大小，字节。"," if the entity-tag is prefaced by a weakness indicator; otherwise, ":"如果实体标签由弱点指标组成； 否则，"," that can iterate through a ":"可以通过","A copy of the current instance.":"当前实例的副本。"," if a cache should either respond using a cached entry that is consistent with the other constraints of the HTTP request, or respond with a 504 (Gateway Timeout) status; otherwise, ":"如果缓存应使用与HTTP请求的其他约束的缓存条目进行响应，或者以504（网关超时）状态响应； 否则，","An opaque quoted string.":"不透明的引用字符串。","The starting or ending point of the range, in bytes.":"范围的起点或终点，字节。","The values of the header.":"标题的值。","The string to validate.":"验证的字符串。","An enumerator for all the strings in the collection.":"集合中所有字符串的枚举者。","The position, in bytes, at which to start sending data.":"以字节开始发送数据的位置。"," if the specified header ":"如果指定的标题"," version of the string.":"字符串的版本。","The string representation of all the headers in the collection.":"集合中所有标题的字符串表示。"," if the HTTP response message is intended for a single user and must not be cached by a shared cache; otherwise, ":" 如果HTTP响应消息是针对单个用户的，并且不能由共享缓存缓存；否则, "," could be added to the collection; otherwise ":"可以添加到集合中； 否则","The position, in bytes, at which to stop sending data.":"在字节中，该位置停止发送数据。"," is valid ":"已验证"," header on an HTTP response.":"HTTP响应的标题。","The specified header.":"指定的标题。"," if the origin server requires revalidation of a cache entry on any subsequent use when the entry becomes stale for shared user agent caches; otherwise, ":"如果原始服务器需要在随后使用的任何后续使用中重新验证缓存条目，则当该条目变为共享用户代理缓存时； 否则，"," information; otherwise, ":"信息; 否则，","A string that represents content range header value information.":"表示内容范围标题值信息的字符串。"," content header on an HTTP response.":"HTTP响应上的内容标头。","The specified header values.":"指定的标头值。"," if the HTTP response may be cached by any cache, even if it would normally be non-cacheable or cacheable only within a non- shared cache; otherwise, ":"如果HTTP响应可能会被任何缓存缓存，即使通常仅在非共享缓存中是不可能或可缓存的； 否则，"," if the Content-Range has a length specified; otherwise, ":"如果内容范围的长度指定； 否则，","The credentials containing the authentication information.":"包含身份验证信息的凭证。","A string that contains a ":"一个包含一个的字符串"," are stored in the collection; otherwise ":"存储在该系列中； 否则"," if the Content-Range has a range specified; otherwise, ":"如果内容范围指定范围； 否则，","A string that represents cache-control header value information.":"代表缓存控制标头值信息的字符串。","The header to add to the collection.":"要添加到集合的标题。","The name of the header.":"标题的名称。","A string that represents content disposition header value information.":"表示内容处置标头值信息的字符串。"," if the collection contains the specified header; otherwise, ":"如果该集合包含指定的标头； 否则，","The file creation date.":"文件创建日期。","The length of the full entity-body.":"完整实体的长度。","A list of header values to add to the collection.":"添加到集合的标题值列表。"," if the collection contains the header; otherwise, ":"如果该系列包含标头； 否则，","The disposition type.":"处置类型。","The retrieved header values.":"检索的标题值。","The position at which to stop sending data.":"停止发送数据的位置。","The content of the header.":"标题的内容。"," if the read-only dictionary contains an element that has the specified key; otherwise, ":"如果仅读取字典包含具有指定键的元素； 否则，"," header contains chunked, otherwise ":"标头包含分块，否则","The specific header.":"特定的标题。","When this method returns, contains the value associated with the specified key, if the key is found; otherwise, contains the default value of ":"当此方法返回时，包含与指定键关联的值（如果找到键）； 否则，包含的默认值"," that contains range units.":"其中包含范围单元。"," header for an HTTP response.":"HTTP响应的标题。","A collection containing the parameters.":"包含参数的集合。","The values for the specified header.":"指定标头的值。","A string that represents transfer-coding header value information.":"表示传输编码标头值信息的字符串。","The position at which to start sending data.":"开始发送数据的位置。","The product name.":"产品名称。"," object used to initialize the new instance.":"用于初始化新实例的对象。","The item to add to the header collection.":"要添加到标题集合的项目。","A string that represents range header value information.":"表示范围标头值信息的字符串。","The product name value.":"产品名称价值。","The transfer-coding parameters.":"传输编码参数。","The source represented as a string to initialize the new instance.":"源表示为初始化新实例的字符串。","The item to find to the header collection.":"要查找标题集合的项目。","he string to validate.":"他串起验证。","The transfer-coding value.":"传输编码值。","The product version value.":"产品版本值。","A string that represents media type header value information.":"表示媒体类型标头值信息的字符串。"," if the entry is contained in the ":"如果条目包含在","A value for the quality factor.":"质量因素的价值。","The ranges from the ":"从","A string that represents product header value information.":"代表产品标头值信息的字符串。","The character set.":"角色集。","The unit from the ":"来自","The media-type header value.":"媒体型标题值。","The entry to add.":"要添加的条目。","A string that represents transfer-coding value information.":"表示传输编码值信息的字符串。","The date and time offset used to initialize the new instance.":"日期和时间偏移用于初始化新实例。","The name of the product token.":"产品令牌的名称。","The media-type header value parameters.":"媒体类型的标题值参数。"," was removed from the ":"被从","The protocol version of the received protocol.":"接收协议的协议版本。","The delta, in seconds, used to initialize the new instance.":"三角洲在几秒钟内用于初始化新实例。","The version of the product token.":"产品令牌的版本。"," represented as string to initialize the new instance.":"表示为字符串以初始化新实例。","The entry to validate.":"验证的条目。","The host and port that the request or response was received by.":"接收请求或响应的主机和端口。","A string that represents retry condition header value information.":"表示重试条件标头值信息的字符串。","A comment value.":"评论价值。","The quality associated with this header value.":"与此标头值相关的质量。","The protocol name of the received protocol.":"接收协议的协议名称。"," could be parsed and added to the ":"可以解析并添加到","A string that represents product info header value information.":"代表产品信息标头值信息的字符串。","The date and time offset from the ":"与","The comment field used to identify the software of the recipient proxy or gateway.":"评论字段用于识别收件人代理或网关的软件。","The number of headers in a collection.":"集合中的标题数。","A string that represents media type with quality header value information.":"用质量标头值信息表示媒体类型的字符串。","The delta in seconds from the ":"从几秒钟内的三角洲","The comment value this ":"评论价值这个","A string that represents via header value information.":"通过标头值信息表示的字符串。","The quality value for the ":"质量价值"," header for an HTTP request.":"HTTP请求的标题。","The string used to initialize the new instance.":"用于初始化新实例的字符串。","The product value from this ":"此产品价值","The protocol name.":"协议名称。","A string used to initialize the new instance.":"用于初始化新实例的字符串。","The header name.":"标题名称。"," header contains Close, otherwise ":"标题包含关闭，否则","A date value used to initialize the new instance.":"用于初始化新实例的日期值。","The protocol version.":"协议版本。","A quality factor used to initialize the new instance.":"用于初始化新实例的质量因素。","The header value.":"标题值。"," header contains Continue, otherwise ":"标题包含继续，否则","The specific warning code.":"特定的警告代码。","An entity tag represented as a string used to initialize the new instance.":"实体标签表示为初始化新实例的字符串。",".  \n  \n The value of the ":"。 \n  \n  价值","A string that represents quality header value information.":"代表质量标头价值信息的字符串。","A string that represents name value header value information.":"表示名称值标头值信息的字符串。","The host that attached the warning.":"附加警告的主机。","A string that represents range condition header value information.":"表示范围条件标头值信息的字符串。","A string that represents name value with parameter header value information.":"用参数标头值信息表示名称值的字符串。","The quality factor from the ":"来自","The date from the ":"来自","A quoted-string containing the warning text.":"带有警告文本的引号。","The string value from the ":"字符串值来自","The entity tag from the ":"实体标签来自","Returns a copy of the current instance.":"返回当前实例的副本。","Gets the value of the ":"获取 ","The headers which should be sent with each request.":"每个请求都应发送的标题。","The date/time stamp of the warning.":"警告的日期/时间戳。","The HTTP handler stack to use for sending requests.":"用于发送请求的HTTP处理程序堆栈。","The default version to use for any requests made with this ":"用于此请求的任何请求的默认版本","The maximum number of redirection responses that the handler follows. The default value is 50.":"处理程序遵循的重定向响应的最大数量。 默认值为50。"," if the handler should use a proxy for requests; otherwise ":"如果处理程序应使用代理来请求； 否则"," responsible for processing the HTTP response messages.":"负责处理HTTP响应消息。","The maximum number of concurrent connections (per server endpoint) allowed by an ":"同时连接的最大数量（每个服务器端点）","The HttpVersionPolicy used when the HTTP connection is established.":"建立HTTP连接时使用的HTTPVersionPolicy。"," to an inequality operator.":" 到不等式运算符。","Information about the transport (for example, the channel binding token). This parameter may be ":"有关运输的信息（例如，通道绑定令牌）。 此参数可能是"," if the inner handler should be disposed of by HttpClient.Dispose; ":"如果内部处理程序应通过httpclient.dispose处置；","The maximum request content buffer size in bytes. The default value is 2 gigabytes.":"字节中的最大请求内容缓冲区大小。 默认值为2千兆字节。","The maximum number of bytes to buffer when reading the response content. The default value for this property is 2 gigabytes.":"阅读响应内容时，最大对缓冲区的字节数。 该属性的默认值为2千兆字节。"," parameters are inequal; otherwise, ":"参数不平等； 否则，","The maximum length, in kilobytes (1024 bytes), of the response headers.":"响应标头的最大长度为千字节（1024个字节）。","Information about the transport (channel binding token, for example). This parameter may be ":"有关传输的信息（例如，通道绑定令牌）。 此参数可能是"," if you intend to reuse the inner handler.":"如果您打算重复使用内部处理程序。","The timespan to wait before the request times out.":"时间板在请求时间之前等待。"," for the handler to send an HTTP Authorization header with requests after authentication has taken place; otherwise, ":"为了使处理程序在进行身份验证后发送带有请求的HTTP授权标头； 否则，","The output memory stream which contains the serialized HTTP content.":"包含序列化HTTP内容的输出内存流。","A string representing the current object.":"表示当前对象的字符串。","The HTTP request message.":"HTTP请求消息。","a writable dictionary of custom properties.":"自定义属性的可写词典。","An HTTP completion option value that indicates when the operation should be considered completed.":"HTTP完成选项值，该值指示何时应考虑完成操作。","The maximum size, in bytes, of the buffer to use.":"缓冲区的最大尺寸，字节。","An HTTP method represented as a ":"HTTP方法表示为","A cancellation token to cancel the operation.":"取消令牌以取消操作。","The proxy information used by the handler. The default value is ":"处理程序使用的代理信息。 默认值是","An HTTP  completion option value that indicates when the operation should be considered completed.":"HTTP完成选项值，该值指示何时应考虑完成操作。","The stream that represents the HTTP content.":"表示HTTP内容的流。","The HTTP PATCH protocol method.":"HTTP补丁协议方法。"," if the handler should follow redirection responses; otherwise ":"如果处理程序应遵循重定向响应； 否则","A callback method to validate the server certificate.":"验证服务器证书的回调方法。","The HTTP request content sent to the server.":"发送到服务器的HTTP请求内容。","The automatic decompression method used by the handler.":"处理程序使用的自动减压方法。","One of the values defined in the ":"在","A message that describes the current exception.":"描述当前异常的消息。","The length in bytes of the HTTP content.":"HTTP内容的以字节为单位的长度。","The HTTP request message to send.":"要发送的HTTP请求消息。"," if the certificate revocation list is checked; otherwise, ":"如果检查了证书吊销列表； 否则，"," if the if the handler supports automatic response content decompression; otherwise ":"如果处理程序支持自动响应内容减压； 否则","The HTTP status code.":"HTTP状态代码。","One of the enumeration values that specifies when the operation should complete (as soon as a response is available or after reading the response content).":"指定操作应完成的枚举值之一（一旦可用或阅读响应内容后，立即完成）。","The content headers as defined in RFC 2616.":"RFC 2616中定义的内容标题。","The collection of security certificates associated with this handler.":"与此处理程序关联的安全证书的收集。"," if the if the handler supports proxy settings; otherwise ":"如果处理程序支持代理设置； 否则","The HTTP response message.":"HTTP响应消息。","An HTTP status code if the exception represents a non-successful result, otherwise ":"HTTP状态代码如果异常表示不成功的结果，否则"," if the if the handler supports configuration settings for the ":"如果处理程序支持配置设置","The X509CertificateCollection that is presented to the server when performing certificate based client authentication.":"执行基于证书的客户端身份验证时，X509CertificateCollection将显示给服务器。"," if the inner handler should be disposed of by Dispose(), ":"如果应通过distose（）处置内部处理程序，","A string that represents the request  ":"表示请求的字符串"," properties; otherwise ":"特性; 否则","The token to cancel the operation.":"代币取消操作。","The cookie container used to store server cookies by the handler.":"用处理程序存储服务器cookie的cookie容器。"," to request.":"请求。","The HTTP method.":"HTTP方法。","When the operation should complete (as soon as a response is available or after reading the whole response content).":"当操作应完成时（一旦可用或阅读了整个响应内容后）。"," if the if the handler supports uses the  ":"如果处理程序支持使用","The HTTP method to compare with the current object.":"与当前对象进行比较的HTTP方法。","The authentication credentials associated with the handler. The default is ":"与处理程序相关的身份验证凭证。 默认值为","A string representation of the current object.":"当前对象的字符串表示。","The cancellation token to cancel operation.":"取消令牌取消操作。"," property  to store server cookies and uses these cookies when sending requests; otherwise ":"属性存储服务器cookie并在发送请求时使用这些cookie； 否则"," if the specified object is equal to the current object; otherwise, ":"如果指定的对象等于当前对象； 否则，","A cached delegate that always returns ":"一个始终返回的缓存代表","The content of a message.":"消息的内容。"," if the default credentials are used; otherwise ":"如果使用默认凭据； 否则","The base address of Uniform Resource Identifier (URI) of the Internet resource used when sending requests.":"发送请求时使用的Internet资源的统一资源标识符（URI）的基本地址。","The collection of HTTP request headers.":"HTTP请求标头的集合。","The credentials needed to authenticate a request to the default proxy server.":"为默认代理服务器验证请求所需的凭据。","The left ":"左边",", unless you're targeting .NET Core 2.1 or 2.2. In that case, the default value is ":"，除非您针对.NET Core 2.1或2.2。 在这种情况下，默认值为","The HTTP method used by the request message. The default is the GET method.":"请求消息使用的HTTP方法。 默认值是GET方法。","A proxy used by every call that instantiates a ":"每个呼叫都使用的代理"," to an equality operator.":"到平等操作员。","The file name for the HTTP content to add to the collection.":"HTTP内容的文件名添加到集合中。","The strongly typed key for the HTTP request option.":"HTTP请求选项的强键键。"," used for the HTTP request.":"用于HTTP请求。","The right  ":"正确的","The plaintext stream that will be used for HTTP protocol requests and responses.":"将用于HTTP协议请求和响应的明文流。","The request message that's causing the connection to be created.":"引起连接创建的请求消息。","The HTTP message version. The default value is ":"HTTP消息版本。 默认值是","The value of the HTTP request option.":"HTTP请求选项的值。","The size, in bytes, of the buffer for the ":"缓冲区的大小，字节"," parameters are equal; otherwise, ":"参数相等； 否则，"," that holds the password.":"包含密码。","The strongly typed key to get the value of an HTTP request option.":"强烈键入的键，以获取HTTP请求选项的值。","The length in bytes of the stream content.":"流的长度在流内容的字节中。","The type of decompression method used by the handler for automatic decompression of the HTTP content response.":"处理程序用于自动减压HTTP内容响应的解压缩方法的类型。"," if the client request did not include an ":"如果客户请求不包括","The supported WebSocket sub-protocol.":"支持的Websocket子协议。","When this method returns, contains the value of the specified HTTP request option.":"当此方法返回时，包含指定的HTTP请求选项的值。","A callback method to create a stream.":"创建流的回调方法。","The encoding to use for the content.":"用于内容的编码。"," value that contains a Windows error code.":"包含Windows错误代码的值。","The receive buffer size in bytes.":"接收缓冲区大小为字节。"," if the collection contains an element with the specified key; otherwise, ":"如果该集合包含带有指定密钥的元素； 否则，"," instance for which to select an authentication scheme.":"为其选择身份验证方案的实例。","Name of the HTTP request option.":"HTTP请求选项的名称。","The timespan to wait before the connection establishing times out. The default value is ":"时间板等待连接建立时间之前等待。 默认值是","The WebSocket protocol keep-alive interval in milliseconds.":"Websocket协议保持空位间隔以毫秒为单位。"," object suitable for use with the data in the ":"适合与数据一起使用的对象","The status code of the HTTP response.":"HTTP响应的状态代码。"," values that indicates the method of authentication to use for the specified client request.":"指示用于指定客户端请求的身份验证方法的值。","The managed cookie container object.":"托管cookie容器对象。","An internal buffer to use for this operation.":"用于此操作的内部缓冲区。","The value from the request's ":"请求的值","The HTTP response message if the call is successful.":"HTTP响应消息如果呼叫成功。","The authentication credentials associated with the handler. The default value is ":"与处理程序相关的身份验证凭证。 默认值是"," object used to send a response back to the client.":"用于将响应发送回客户的对象。"," delegate that references the method to invoke when a client request is available.":"委派该引用客户请求时调用的方法。"," header. This value is -1 if the content length is not known.":"标题。 如果内容长度未知，则此值为-1。","The credentials used to authenticate the user to an authenticating proxy.":"用于对用户进行身份验证代理的凭证。"," object that describes the client, or ":"描述客户端的对象或","The content of the HTTP response message.":"HTTP响应消息的内容。"," that contains the text of the request's ":"其中包含请求的文字","A user-defined object that contains information about the operation. This object is passed to the ":"一个包含有关操作信息的用户定义对象。 这个对象传递给"," that contains cookies that accompany the request. This property returns an empty collection if the request does not contain cookies.":"其中包含请求随附的cookie。 如果请求不包含cookie，则此属性将返回一个空集合。"," if additional HTTP/2 connections are allowed to be created; otherwise, ":"如果允许创建其他HTTP/2连接； 否则，"," that supplied this ":"提供了这一点","The collection of HTTP response headers.":"HTTP响应标头的集合。"," delegate when the operation completes.":"操作完成时委派。","The timespan to wait for the HTTP 100 Continue. The default value is 1 second.":"TimePan等待HTTP 100继续。 默认值为1秒。"," was in the range 200-299; otherwise, ":"在200-299范围内； 否则，"," if the request has associated body data; otherwise, ":"如果请求具有关联的身体数据； 否则，"," does not require authentication.":"不需要身份验证。"," object that indicates the status of the asynchronous operation.":"表示异步操作状态的对象。"," value that identifies the error that occurred.":"识别发生错误的值。"," if the handler is supported; otherwise, ":"如果支持处理程序； 否则，","The reason phrase sent by the server.":"服务器发送的短语。"," that contains the HTTP headers included in the request.":"其中包含请求中包含的HTTP标头。"," object that was obtained when the asynchronous operation was started.":"启动异步操作时获得的对象。"," that describes the error that occurred.":"这描述了发生的错误。","The keep alive ping delay. Defaults to ":"保持生命的ping延迟。 默认为"," that contains the method used in the request.":"其中包含请求中使用的方法。","The request message which led to this response message.":"导致此响应消息的请求消息。"," object that represents the client request.":"代表客户端请求的对象。","The keep alive ping behaviour.":"保留的ping行为。","The collection of trailing headers in the HTTP response.":"HTTP响应中的尾随标头的集合。"," object that contains the information required to deserialize the new ":"包含应对新的所需信息的对象","The keep alive ping timeout. Defaults to 20 seconds.":"保持生命的ping超时。 默认为20秒。","A readable ":"可读"," object that represents a client request.":"代表客户端请求的对象。"," that identifies the URI information that is compared in incoming requests. The prefix must be terminated with a forward slash (\"/\").":"这标识了在传入请求中比较的URI信息。 前缀必须用前斜线（“/”）终止。","The HTTP message version. The default is 1.1.":"HTTP消息版本。 默认值为1.1。","The maximum number of allowed HTTP redirects.":"允许的HTTP重定向的最大数量。","The task object representing the asynchronous operation. The ":"代表异步操作的任务对象。 这"," object that contains the bytes sent by the client in the body of the request. This property returns ":"包含客户端在请求正文中发送的字节的对象。 此属性返回","The maximum number of simultaneous TCP connections allowed to a single server.":"单个服务器允许同时使用TCP连接的最大数量。","Only use the requested version.":"仅使用请求的版本。"," property on the task object returns an ":"任务对象上的属性返回"," that contains the Uniform Resource Identifier (URI) prefix to test.":"其中包含用于测试的统一资源标识符（URI）前缀。"," if no data is sent with the request.":"如果没有发送请求的数据。","Use the highest available version, downgrading only to the requested version but not below.":"使用最高的可用版本，仅降级到请求的版本，但不下文。"," enumeration values that indicates how clients are to be authenticated. The default value is ":"指示如何认证客户的枚举值。 默认值是","The maximum amount of data that can be drained from responses in bytes.":"可以从字节中的响应中排出的最大数据量。"," if the client was authenticated; otherwise, ":"如果客户经过身份验证； 否则，"," if this collection contains the prefix specified by ":"如果此集合包含由","The maximum size of the header portion from the server response, in kilobytes.":"服务器响应中的标头部分的最大尺寸，以千字节为单位。","Use the requested version or downgrade to a lower one. This is the default behavior.":"使用请求的版本或降级到较低的版本。 这是默认行为。"," delegate that invokes the method used to select an authentication protocol. The default value is ":"调用用于选择身份验证协议的方法的委托。 默认值是"," if the request originated on the same computer as the ":"如果请求与与计算机相同的计算机","The one dimensional ":"一个维度","The HTTP request message to process.":"HTTP请求消息要处理。"," that contains a list of SPNs.":"其中包含SPN的列表。","A callback that provides access to the plaintext HTTP protocol stream.":"提供对明文HTTP协议流的访问权限的回调。"," object that provided the request; otherwise, ":"提供请求的对象； 否则，"," that receives the Uniform Resource Identifier (URI) prefix strings in this collection.":"在此集合中接收统一资源标识符（URI）前缀字符串。","The HTTP request message that was processed.":"处理的HTTP请求消息。"," that specifies the policy to use for extended protection.":"这指定了用于扩展保护的策略。","The maximum idle time for a connection in the pool. The default value for this property is 2 minutes.":"池中连接的最大空闲时间。 该属性的默认值为2分钟。"," if the TCP connection is using SSL; otherwise, ":"如果TCP连接使用SSL； 否则，","The one dimensional string array that receives the Uniform Resource Identifier (URI) prefix strings in this collection.":"该集合中接收统一资源标识符（URI）前缀字符串的一个维字符串数组。","The HTTP response message to process.":"HTTP响应消息要处理。","The maximum time for a connection to be in the pool. The default value for this property is ":"连接在池中的最大时间。 此属性的默认值为",".  \n  \n ":"。"," should not return exceptions that occur when sending the response to the client; otherwise, ":"不应返回将响应发送给客户时发生的例外； 否则，"," was started; otherwise, ":"开始了; 否则，","The HTTP response message that was processed.":"处理的HTTP响应消息。"," interface and provides access to the strings in this collection.":"接口并提供对该集合中字符串的访问。"," if the handler sends an Authorization header with the request; otherwise, ":"如果处理程序发送请求的授权标题； 否则，"," if the TCP connection is a WebSocket request; otherwise, ":"如果TCP连接是Websocket请求； 否则，"," that contains the URI prefix to remove.":"其中包含要删除的URI前缀。","The subtype of the multipart content.":"多部分内容的子类型。"," on all platforms.":"在所有平台上。","The custom proxy.":"自定义代理。"," if the connection should be kept open; otherwise, ":"如果应保持连接开放； 否则，","The boundary string for the multipart content.":"多部分内容的边界字符串。"," was found in the ":"在","The header encoding selector callback that selects the ":"编码选择器回调的标题，该回调选择"," that represents the IP address that the request is sent to.":"这表示请求已发送到的IP地址。"," that contains the URI prefixes that this ":" 它包含以下URI前缀 "," and removed; otherwise ":"并删除； 否则"," to encode the value for the specified request header name, or ":"编码指定请求标头名的值，或"," that identifies the client's version of HTTP.":"这标识了客户端的HTTP版本。","The HTTP content to add to the collection.":"要添加到集合的HTTP内容。"," object is configured to handle.":"对象配置为处理。"," that contains the number of prefixes in this collection.":"其中包含此集合中的前缀数量。","The timespan to wait for data to be drained from responses.":"时间板等待数据从响应中排出。"," value that contains the name of the realm associated with the ":"包含与之关联的领域名称的值"," object that contains the query data included in the request ":"包含请求中包含的查询数据的对象","The HTTP content stream that represents the multipart/* encoded HTTP content.":"表示多部分/*编码的HTTP内容的HTTP内容流。"," delegate that references the method to invoke when the operation is complete.":"委托该操作完成后引用了调用方法。"," to decode the value for the specified response header name, or ":"解码指定响应标头名称的值，或"," that contains the raw URL for this request.":"其中包含此请求的原始URL。","The timeout manager for this ":"此时的超时经理","The set of options used for client TLS authentication.":"客户端TLS身份验证的选项集。","The length in bytes of the HHTP content.":"HHTP内容的字节长度。","A user-defined object that contains information about the operation. This object is passed to the callback delegate when the operation completes.":"一个包含有关操作信息的用户定义对象。 操作完成后，此对象将传递给回调委托。"," that represents the IP address and port number from which the request originated.":"这表示请求起源的IP地址和端口号。"," of the first request will be used for subsequent requests on the same connection; otherwise, ":"第一个请求将用于相同连接的后续请求； 否则，","A value that indicates whether the handler should use cookies.":"指示处理程序是否应使用cookie的值。"," that indicates the status of the operation.":"这表示操作的状态。","The header encoding selector callback to decode the value for the specified response header name, or ":"编码选择器回调的标题以解码指定响应标头名称的值，或"," object that contains the identifier of the HTTP request.":"包含HTTP请求的标识符的对象。"," to determine the extended protection policy that the ":"确定扩展保护政策","The pending request for the certificate.":"悬而未决的证书请求。","A value that indicates whether the handler should use a proxy.":"指示处理程序是否应使用代理的值。"," instance will use to provide extended protection.":"实例将用于提供扩展保护。"," to indicate the default behavior.":" 以指示默认行为。"," that contains the SPN the client sent on the request.":"其中包含客户端在请求中发送的SPN。","The HTTP request message that is causing the stream to be used.":"引起流的HTTP请求消息。"," object that is returned when the operation started.":"操作启动后返回的对象。"," object that specifies the extended protection policy to use for this request.":"指定用于此请求的扩展保护策略的对象。","The boundary string for the multipart form data content.":"多部分形式数据内容的边界字符串。"," object for the client request.":"客户请求的对象。","The version of HTTP in use for this stream.":"此流中使用的HTTP版本。","The user name.":"用户名。"," object that contains the client's X.509 v.3 certificate.":"包含客户端的X.509 v.3证书的对象。","The name for the HTTP content to add.":"HTTP内容的名称要添加。"," object that identifies the resource requested by the client.":"确定客户端请求的资源的对象。","The time allowed for an idle connection.":"允许闲置连接的时间。"," property on the task object returns a ":"任务对象上的属性返回","The password.":"密码。"," that contains the host address information.":"其中包含主机地址信息。"," object that contains the text of the request's ":"包含请求文本的对象"," that contains a file path to use to create this attachment.":"其中包含用于创建此附件的文件路径。"," array that contains the type names specified in the request's ":"包含请求中指定的类型名称的数组"," value that contains the text of the request's ":"包含请求文本的值"," header, or ":"标题，或"," object that represents the Multipurpose Internet Mail Exchange (MIME) protocol Content-Type header to be used.":"代表要使用的多功能Internet邮件交换（MIME）协议内容类型标头的对象。"," array that contains the languages specified in the request's ":"包含请求中指定的语言的数组"," if the header was not included in the request.":"如果标题未包含在请求中。"," header or ":" 标题或 ","The name of the HTTP header to set.":"要设置的HTTP标头的名称。","The MIME content type name value in the content type associated with this attachment.":"与此附件关联的内容类型中的MIME内容类型名称值。","The display name associated with address. This parameter can be ":"与地址关联的显示名称。 此参数可以是"," that was used to encode the ":"用来编码"," that provides the presentation information for this attachment.":"这提供了此附件的演示信息。","The value for the ":"价值"," that contains the value for the content type ":"其中包含内容类型的值"," containing event data.":"包含事件数据。","The encoding that defines the character set used for ":"定义用于用于的字符集的编码"," to add to the collection to be sent with this response.":"添加到收藏集中，并通过此响应发送。"," represented by the ":" 由 "," that contains the email address.":"其中包含电子邮件地址。"," that contains the name or IP address of the host computer used for SMTP transactions.":"其中包含用于SMTP交易的主机计算机的名称或IP地址。","The name of the HTTP header to append ":"HTTP标头的名称要附加"," to.":"至。"," value that specifies the type of name encoding. The default value is determined from the name of the attachment.":"指定名称编码类型的值。 默认值是从附件的名称确定的。"," that contains the display name; otherwise, ":"包含显示名称； 否则，"," that contains the name or IP address of the host used for SMTP transactions.":"其中包含用于SMTP交易的主机的名称或IP地址。","The value to append to the ":"附加到的价值","A stream containing the content for this attachment.":"包含此附件内容的流。"," (\"\") if no display name information was specified when this instance was created.":"（“”）如果在创建此实例时未指定显示名称信息。"," array that contains the response to send to the client.":"包含发送给客户端的响应的数组。"," greater than zero that contains the port to be used on ":" 大于零，包含要在其上使用的端口 ","The file name holding the content for this attachment.":"保留此附件内容的文件名。"," that contains the name of the host computer that accepts email for the ":"其中包含接受主机计算机的名称，该计算机接受电子邮件"," to block execution while flushing the stream to the client; otherwise, ":"在将流冲洗到客户端时阻止执行； 否则，"," that contains the user name portion of the ":"其中包含了用户名的部分"," that contains event data.":"其中包含事件数据。"," holding the content ID.":"持有内容ID。","The email addresses to add to the ":"电子邮件地址要添加到","The content stream of this attachment.":"此附件的内容流。"," instance to copy.":" 实例进行复制。"," that contains the message to send.":"其中包含要发送的消息。",". Multiple email addresses must be separated with a comma character (\",\").":"。 必须使用逗号字符（“，”）分开多个电子邮件地址。","The content type for this attachment.":"此附件的内容类型。"," that contains the address information of the message sender.":"其中包含消息发送者的地址信息。","The URL that the client should use to locate the requested resource.":"客户端应使用的URL定位请求的资源。","The location at which to insert the email address that is specified by ":"插入由指定的电子邮件地址的位置","The encoding for this attachment.":"此附件的编码。"," that contains the addresses that the message is sent to.":"其中包含消息发送到的地址。","A stream that contains the content for this embedded resource.":"包含此嵌入资源的内容的流。"," for this response.":"为此回应。","The email address to be inserted into the collection.":"要插入收藏的电子邮件地址。"," that contains the subject line for the message.":"其中包含消息的主题行。"," if no encoding is specified.":"如果未指定编码。","The index of the email address element to be replaced.":"电子邮件地址元素的索引要替换。","A user-defined object that is passed to the method invoked when the asynchronous operation completes.":"当异步操作完成时，将传递给所调用方法的用户定义对象。","The file name holding the content for this embedded resource.":"保存此嵌入资源内容的文件名。","An email address that will replace the element in the collection.":"一个将替换集合中元素的电子邮件地址。","The value of the response's ":"响应的价值"," containing the email addresses in this collection.":"包含此集合中的电子邮件地址。"," that contains the address that the message is sent to.":" 它包含消息发送到的地址。","The file name that holds the content for this embedded resource.":"保存此嵌入资源的内容的文件名。"," instance that contains the text of the response's ":"包含响应文本的实例"," that contains the address of the sender of the email message.":"其中包含电子邮件发送者的地址。","The message to send.":"发送的消息。","A string that contains the embedded resource to be included in the email attachment.":"包含电子邮件附件中包含的嵌入式资源的字符串。"," that contains the address of the recipient of the email message.":"其中包含电子邮件消息收件人的地址。"," that contains cookies to accompany the response. The collection is empty if no cookies have been added to the response.":"其中包含cookie伴随响应。 如果没有在响应中添加cookie，则该集合为空。","The address information of the message sender.":"消息发送者的地址信息。"," object that contains the embedded resource to be included in the email attachment.":"包含要包含在电子邮件附件中的嵌入式资源的对象。"," that contains the addresses of the recipients of the email message. Multiple email addresses must be separated with a comma character (\",\").":"其中包含电子邮件消息收件人的地址。 必须使用逗号字符（“，”）分开多个电子邮件地址。"," instance that contains all the explicitly set HTTP headers to be included in the response.":"包含所有明确设置的HTTP标头的实例将包含在响应中。","The addresses that the message is sent to.":"消息发送到的地址。"," is a relative URI, the recipient of the message must resolve it.":"是相对的URI，消息的接收者必须解决它。"," that contains the subject text.":"其中包含主题文本。"," if the server requests a persistent connection; otherwise, ":"如果服务器请求持久连接； 否则，","The subject line for the message.":"消息的主题行。"," that contains an email address.":"其中包含一个电子邮件地址。"," that contains the message body.":"其中包含消息主体。"," object to which a response can be written.":"可以写出响应的对象。","The message body.":"消息正文。","A writable ":"可写的"," that contains the display name associated with ":"其中包含与之关联的显示名称"," object indicating the version of HTTP used when responding to the client. Note that this property is now obsolete.":"对象表示响应客户端时使用的HTTP版本。 请注意，此属性现在已过时。",". This parameter can be ":"。 此参数可以是",", holding one or more client certificates. The default value is derived from the mail configuration attributes in a configuration file.":"，持有一个或多个客户证书。 默认值是从配置文件中的邮件配置属性得出的。"," that contains the absolute URL to be sent to the client in the ":"其中包含要发送给客户端的绝对URL"," value that contains the body text.":"包含身体文本的值。"," that defines the character set used for ":"定义了用于"," that represents the credentials to use for authentication; or ":"这代表用于身份验证的凭证； 或者"," if the response is set to use chunked transfer encoding; otherwise, ":"如果响应设置为使用块的传输编码； 否则，"," applied to the contents of the ":"应用于"," instance to compare to the current instance.":"实例与当前实例进行比较。"," if no credentials have been specified.":"如果未指定凭据。"," value that contains the delivery notifications for this message.":"包含此消息的交付通知的值。"," value that specifies the HTTP status code for the requested resource. The default is ":"为请求的资源指定HTTP状态代码的值。 默认值为"," if the two mail addresses are equal; otherwise, ":"如果两个邮件地址相等； 否则，","The delivery format used by ":"由"," that contains the from address information.":"其中包含来自地址信息。",", indicating that the server successfully processed the client's request and included the requested resource in the response body.":"，表明服务器成功处理了客户端的请求，并将请求的资源包括在响应主体中。","An integer hash value.":"整数哈希值。"," that indicates how email messages are delivered.":"这表明了电子邮件的传递方式。"," that contains the email headers.":"其中包含电子邮件标头。","The text description of the HTTP status code returned to the client. The default is the RFC 2616 description for the ":"HTTP状态代码的文本说明返回给客户端。 默认值是RFC 2616描述"," uses SSL; otherwise, ":"使用SSL; 否则，"," that contains the contents of this ":"其中包含其中的内容","An email address.":"电子邮件地址。","The encoding used for user-defined custom headers for this email message.":"此电子邮件的用户定义自定义标头使用的编码。"," property value, or an empty string (\"\") if an RFC 2616 description does not exist.":"如果不存在RFC 2616描述，则属性值或一个空字符串（“”）。"," that contains the name or IP address of the computer to use for SMTP transactions.":"其中包含用于用于SMTP交易的计算机的名称或IP地址。"," if the message body is in HTML; else ":"如果消息主体在html中； 别的","The time allowed for the ":"允许的时间","When this method returns, contains the email address object  if parsing succeeded.":"当此方法返回时，如果解析成功，则包含电子邮件地址对象。"," that specifies the pickup directory for mail messages.":"这为邮件邮件指定了拾取目录。"," that contains the priority of this message.":"其中包含此消息的优先级。"," was successfully created; otherwise, ":"成功创建了； 否则，"," to drain the entity body on a Keep-Alive connection.":"在野生连接上排干实体主体。"," that contains the port number on the SMTP host. The default value is 25.":"其中包含SMTP主机上的端口号。 默认值为25。","The display name associated with the address. This parameter can be ":"与地址关联的显示名称。 此参数可以是","The time allowed for the request entity body to arrive.":"允许请求实体机构到达的时间。","A MailAddress that indicates the value of the ":"指示值的邮递"," that connects to the ":"连接到"," to parse the request header.":"解析请求标题。","The list of the addresses to reply to for the mail message.":"要回复邮件的地址列表。","When this method returns, contains the email address object if parsing succeeded.":"当此方法返回时，如果解析成功，则包含电子邮件地址对象。"," property used for SMTP.":"用于SMTP的属性。"," to populate with data.":"填充数据。"," that contains the sender's address information.":"其中包含发件人的地址信息。"," that contains the current settings for this ":"其中包含当前设置"," that specifies the SPN to use for extended protection. The default value for this SPN is of the form \"SMTPSVC/<host>\" where <host> is the hostname of the SMTP mail server.":"这指定了用于扩展保护的SPN。 此SPN的默认值是“ SMTPSVC/<主机>”的形式，其中<主机>是SMTP邮件服务器的主机名。"," that specifies the destination for this serialization.":"这指定了此序列化的目的地。"," that contains the subject content.":"其中包含主题内容。"," that contains the value associated with the boundary parameter.":"其中包含与边界参数关联的值。"," that specifies the time-out value in milliseconds. The default value is 100,000 (100 seconds).":"这说明了以毫秒为单位的超时值。 默认值为100,000（100秒）。"," that contains the value associated with the charset parameter.":"其中包含与Charset参数关联的值。"," object that contains the IP address of the gateway.":"包含网关的IP地址的对象。",", which holds the serialized data for the ":"，其中保存了序列化数据"," that contains the information required to serialize the new ":"其中包含序列化新的信息"," that contains the media type and subtype value. This value does not include the semicolon (;) separator that follows the subtype.":"其中包含媒体类型和亚型值。 该值不包括遵循亚型的半分离器。","The object to be added to the collection.":"要添加到集合中的对象。"," that contains the destination of the serialized stream associated with the new ":"包含与新的序列化流的目的地"," that contains the source and destination of the serialized stream associated with the new instance.":"其中包含与新实例关联的序列化流的源和目标。"," that contains the value associated with the name parameter.":"其中包含与名称参数关联的值。"," value that indicates the error that occurred.":"表示发生错误的值。"," object to be searched in the collection.":"要在集合中搜索的对象。"," value that specifies the total number of Source Quench messages that were sent.":"指定发送的源淬火消息总数。"," that contains name and value pairs.":"其中包含名称和价值对。"," that contains the server response.":"其中包含服务器响应。"," object exists in the collection; otherwise ":"集合中存在对象； 否则"," value that specifies the total number of ICMP Time Exceeded messages that were received.":"指定ICMP时间超过收到的消息的总数。"," that contains the source and destination of the serialized stream that is associated with the new instance.":"其中包含与新实例关联的序列化流的源和目标。","The host name or IP address to resolve.":"主机名或IP地址要解决。","A one-dimensional array that receives a copy of the collection.":"接收收藏副本的一维数组。"," value that specifies the total number of ICMP Time Exceeded messages that were sent.":"指定ICMP时间超过已发送消息的总数。"," that contains the error message.":"其中包含错误消息。"," delegate when the operation is complete.":"操作完成后委派。"," at which the copy begins.":"副本开始。"," instance, which holds the serialized data for the ":"实例，该实例保存着序列化数据"," value that specifies the total number of Timestamp Reply messages that were received.":"指定收到的时间戳答复消息的总数。"," instance that references the asynchronous request.":"引用异步请求的实例。"," interface and provides access to the ":"接口并提供对"," instance that contains the destination of the serialized stream that is associated with the new ":"包含与新的序列化流的目的地的实例"," value that specifies the total number of Timestamp Reply messages that were sent.":"指定发送的时间戳答复消息的总数。","The DNS name of the host.":"主机的DNS名称。"," types in this collection.":"此集合中的类型。"," value that specifies the total number of Timestamp Request messages that were received.":"指定收到的时间戳请求消息总数。"," instance that contains the information required to serialize the new ":"包含序列化的信息的实例"," value that specifies the total number of Timestamp Request messages that were sent.":"指定发送的时间戳请求消息总数。","The IP address to resolve.":"解决的IP地址。","The object to be removed.":"要删除的对象。"," that contains the source of the serialized stream that is associated with the new ":"包含与新的序列化流的来源"," value that specifies the total number of Destination Unreachable messages received.":"指定目的地无法接收的消息的总数。"," instance returned by a call to the ":"实例由呼叫返回","Always throws a ":"总是抛出一个","The exception message.":"异常消息。"," value that specifies the total number of number of ICMP Echo Reply messages received.":"指定收到的ICMP回声回复消息的总数。"," value that contains the number of ":"包含数量的值"," that holds the IP addresses for the host specified by the ":"保留了由主机指定的主机的IP地址"," value that specifies the total number of number of ICMP Echo Reply messages sent.":"指定发送的ICMP回声回复消息的总数。","The array of recipients with delivery errors.":"带有交货错误的接收者数组。","The index of interest.":"感兴趣的指数。"," parameter of ":"参数"," to be used.":"要使用的。"," value that specifies the total number of number of ICMP Echo Request messages received.":"指定收到的ICMP回波请求消息的总数。"," at the specific index in the collection.":"在集合中的特定索引。"," instance that is returned by a call to the ":"实例由呼叫返回"," value that specifies the total number of number of ICMP Echo Request messages sent.":"指定发送的ICMP回波请求消息的总数。"," that lists the recipients with delivery errors.":"这列出了收件人的交付错误。"," value that specifies the total number of Address Mask Reply messages that were received.":"指定收到的地址掩码答复消息的总数。"," object that contains DNS information about a host.":"包含有关主机的DNS信息的对象。"," value that contains the disposition.":"包含处置的值。"," value that specifies the total number of ICMP error messages received.":"指定收到的ICMP错误消息总数的值。"," object to compare with this object.":"对象与此对象进行比较。"," value that specifies the total number of Address Mask Reply messages that were sent.":"指定已发送的地址掩码答复消息的总数。"," instance returned by a call to an ":"实例由通话返回"," value that specifies the total number of ICMP error messages sent.":"指定发送的ICMP错误消息总数。"," instance that contains address information about the host.":"包含有关主机的地址信息的实例。"," if the content-disposition headers are the same; otherwise ":"如果内容分配标题相同； 否则"," value that specifies the total number of Address Mask Request messages that were received.":"指定收到的地址掩码请求消息总数。"," value that specifies the total number of Group Membership Query messages received.":"指定群体成员资格查询消息总数的值。"," that contains the property values for this instance.":"其中包含此实例的属性值。"," that holds the IP addresses for the host that is specified by the ":"保留由主机指定的主机的IP地址"," value that specifies the total number of Address Mask Request messages that were sent.":"指定已发送的地址掩码请求消息总数。"," value that specifies the total number of Group Membership Query messages sent.":"指定分组成员资格查询消息的总数。","The address family for which IPs should be retrieved. If ":"应该检索IP的地址家庭。 如果"," value that indicates the file creation date; otherwise, ":"表示文件创建日期的值； 否则，"," value that specifies the total number of Group Membership Reduction messages received.":"指定收到的小组成员资格消息总数的值。"," value that specifies the total number of Destination Unreachable messages that were received.":"指定接收到的目标无法实现的消息总数。"," if no date was specified.":"如果未指定日期。",", retrieve all IPs regardless of address family.":"，无论地址家庭如何，都可以检索所有IP。"," value that specifies the total number of Group Membership Reduction messages sent.":"指定已发送的组成员资格消息总数的值。"," value that specifies the total number of Destination Unreachable messages sent.":"指定目的地无法实现的消息的总数。"," that contains the disposition type. The value is not restricted but is typically one of the ":"其中包含处置类型。 该值不受限制，但通常是"," property on the task object returns an array of type ":"任务对象上的属性返回类型数组"," value that specifies the total number of number of ICMP Echo Reply messages that were received.":"指定收到的ICMP回声答复消息的总数。"," value that specifies the total number of Group Membership Report messages received.":"指定收到的小组成员报告消息总数的值。"," that contains the file name.":"其中包含文件名。","A cancellation token that can be used to signal the asynchronous operation should be canceled.":"应取消可用于发出异步操作的取消令牌。","The time allowed for the request to remain in the request queue before the ":"允许请求保留在请求队列之前的时间"," value that specifies the total number of number of ICMP Echo Reply messages that were sent.":"指定发送的ICMP回声答复消息的总数。"," value that specifies the total number of Group Membership Report messages sent.":"指定已发送的组成员报告消息总数的值。","An IP address.":"IP地址。"," if content in the attachment is presented inline as part of the email body; otherwise, ":"如果将附件中的内容作为电子邮件主体的一部分进行内联呈现； 否则，"," value that specifies the total number of number of ICMP Echo Request messages that were received.":"指定收到的ICMP回波请求消息的总数。"," picks it up.":"捡起它。"," value that specifies the total number of ICMPv6 messages received.":"指定收到的ICMPV6消息总数的值。","The cookies received by the ":"收到的饼干"," value that indicates the file modification date; otherwise, ":"指示文件修改日期的值； 否则，"," value that specifies the total number of number of ICMP Echo Request messages that were sent.":"指定发送的ICMP回波请求消息的总数。"," object that contains host information for the address specified in ":"包含在指定地址的主机信息的对象"," value that specifies the total number of ICMPv6 messages sent.":"指定发送的ICMPV6消息总数。","The HTTP headers received by the ":"HTTP收到的HTTP标头"," that contains parameter name/value pairs.":"其中包含参数名称/值对。"," instance that contains address information about the host specified in ":"其中包含有关指定主机的地址信息"," value that specifies the total number of ICMP Neighbor Advertisement messages received.":"指定收到的ICMP邻居广告消息总数。"," if the WebSocket client is authenticated; otherwise, ":"如果Websocket客户端已进行身份验证； 否则，"," value that specifies the total number of ICMP error messages that were received.":"指定接收到的ICMP错误消息总数。"," instance that contains the address information about the host specified in ":"其中包含有关指定主机的地址信息"," value that indicates the file read date; otherwise, ":"指示文件读取日期的值； 否则，"," value that specifies the total number of Neighbor Advertisement messages sent.":"指定发送的邻居广告消息总数。"," if the WebSocket client connected from the local machine; otherwise, ":"如果Websocket客户端从本地计算机连接； 否则，"," value that specifies the total number of number of ICMP error messages that were sent.":"指定发送的ICMP错误消息的总数。","A string that contains the DNS host name of the local computer.":"包含本地计算机的DNS主机名的字符串。"," value that specifies the total number of Neighbor Solicitation messages received.":"指定接收到的邻居招标消息总数。"," that specifies the number of bytes in the file attachment. The default value is -1, which indicates that the file size is unknown.":"这指定了文件附件中的字节数。 默认值为-1，表明文件大小未知。"," if the WebSocket connection is secured using SSL; otherwise, ":"如果使用SSL保护Websocket连接； 否则，"," value that specifies the total number of ICMPv4 messages that were received.":"指定收到的ICMPV4消息总数的值。"," value that specifies the total number of Neighbor Solicitation messages sent.":"指定发送的邻居招标消息总数。","A DNS-style host name or IP address.":"DNS风格的主机名或IP地址。","The value of the Origin HTTP header.":"原点HTTP标头的值。",", for example, ":"， 例如，"," value that specifies the total number of ICMPv4 messages that were sent.":"指定发送的ICMPV4消息总数。"," value that specifies the total number of ICMP Packet Too Big messages received.":"指定ICMP数据包总数太大消息的值。",", that contains the MIME media type, subtype, and optional parameters.":"，其中包含MIME媒体类型，亚型和可选参数。"," that contains IP addresses that resolve to the host names that are contained in the ":"其中包含解析到主机名中包含的主机名的IP地址"," value that specifies the total number of ICMP Parameter Problem messages that were received.":"指定接收到的ICMP参数问题消息总数。","The URI requested by the WebSocket client.":"Websocket客户端请求的URI。"," value that specifies the total number of ICMP Packet Too Big messages sent.":"指定ICMP数据包的总数太大消息的值。","An array of strings that contain DNS names that resolve to the IP addresses in the ":"一系列包含DNS名称的字符串，这些名称解析为IP地址"," value that specifies the total number of ICMP Parameter Problem messages that were sent.":"指定发送的ICMP参数问题消息总数。"," if the content-type headers are the same; otherwise ":"如果内容类型的标题相同； 否则"," value that specifies the total number of ICMP Parameter Problem messages received.":"指定收到的ICMP参数问题消息总数。","The value of the SecWebSocketKey HTTP header.":"SECWebSocketKey HTTP标头的值。"," value that specifies the total number of Router Advertisement messages received.":"指定接收到的路由器广告消息总数。","A string that contains the primary host name for the server.":"一个包含服务器的主要主机名的字符串。"," value that specifies the total number of ICMP Parameter Problem messages sent.":"指定发送的ICMP参数问题消息总数。"," value that specifies the total number of ICMP Redirect messages that were received.":"指定收到的ICMP重定向消息总数的值。","The list of the Secure WebSocket protocols.":"安全WebSocket协议的列表。"," value that specifies the total number of ICMP Redirect messages received.":"指定收到的ICMP重定向消息总数的值。"," if this interface is configured to automatically register a mapping between its dynamic IP address and static domain names; otherwise, ":"如果该接口被配置为自动在其动态IP地址和静态域名之间注册映射； 否则，"," value that specifies the total number of ICMP Redirect messages that were sent.":"指定发送的ICMP重定向消息总数的值。"," value that specifies the total number of Router Advertisement messages sent.":"指定路由器广告消息总数的值。"," value that specifies the total number of ICMP Redirect messages sent.":"指定ICMP重定向消息总数的值。","The list of sub-protocols requested by the WebSocket client.":"WebSocket客户端请求的子协议列表。"," value that specifies the total number of Router Solicitation messages received.":"指定接收到的路由器招标消息的总数。"," that contains the multicast addresses for this interface.":"其中包含此接口的多播地址。"," value that specifies the total number of Source Quench messages that were received.":"指定接收到的源淬火消息总数。","The identity, authentication information, and security roles for the WebSocket client.":"Websocket客户端的身份，身份验证信息和安全角色。"," value that specifies the total number of Router Solicitation messages sent.":"指定路由器招标消息总数的值。"," that contains the unicast addresses for this interface.":"其中包含该接口的单播地址。"," instance used to send and receive data over the ":"实例用于通过"," value that specifies the total number of ICMP Time Exceeded messages received.":"指定ICMP时间超过收到的消息的总数。"," that contains the address information for WINS servers, or an empty array if no servers are found.":"其中包含WINS服务器的地址信息，如果找不到服务器，则包含一个空数组。"," value that specifies the total number of ICMP Time Exceeded messages sent.":"指定ICMP时间超过发送消息的总数。","The total number of bytes that were received on the interface.":"接口上接收到的字节总数。"," connection.":"联系。"," instance that contains the IP address of an interface.":"包含接口的IP地址的实例。","The total number of bytes that were sent on the interface.":"接口上发送的字节总数。","A stream that contains the content for this view.":"包含此视图内容的流。"," if the address can appear in a DNS database; otherwise, ":"如果地址可以出现在DNS数据库中； 否则，"," if the address is transient; otherwise, ":"如果地址是瞬态的； 否则，","A stream that contains the content for this attachment.":"包含此附件内容的流。","The total number of incoming packets that were discarded.":"丢弃的传入数据包的总数。"," object exists in the collection; otherwise. ":"集合中存在对象； 否则。","The type of the content.":"内容的类型。","The zero-based index of the element.":"元素的基于零的索引。","The total number of incoming packets with errors.":"传入数据包的总数。","The MIME media type of the content.":"内容的MIME媒体类型。","The name of the file that contains the content for this alternate view.":"包含此替代视图内容的文件的名称。"," at the specified location.":"在指定位置。","The total number of incoming packets with an unknown protocol that were received on the interface.":"接口上收到的带有未知协议的传入数据包总数。"," that contains the content of the email message.":"其中包含电子邮件的内容。"," delegate.":"代表。","The total number of incoming non-unicast packets received on the interface.":"接口上接收到的非固定数据包的总数。","An object that contains state information for this request.":"一个包含此请求的状态信息的对象。"," object that represents an alternate view of an email message.":"代表电子邮件消息的替代视图的对象。","The total number of non-unicast packets that were sent on the interface.":"在接口上发送的非unicast数据包的总数。"," that contains the content for this attachment.":"其中包含此附件的内容。","The total number of outgoing packets that were discarded.":"丢弃的即将发出的数据包的总数。"," that references the asynchronous request.":"引用异步请求。","The total number of outgoing packets with errors.":"带有错误的外发数据包的总数。"," that describes the data in ":"描述数据中的数据","The total number of packets in the output queue.":"输出队列中的数据包总数。"," that stores state information and any user defined data for this asynchronous operation.":"这将存储状态信息和任何用户为此异步操作的数据定义数据。",". This value can be ":"。 这个值可以是","The total number of unicast packets that were received on the interface.":"接口上收到的单播数据包的总数。"," array that contains objects that describe the active TCP connections, or an empty array if no active TCP connections are detected.":"包含描述活动TCP连接的对象的数组，或者如果未检测到活动的TCP连接，则为空数组。","The base URI to use for resolving relative URIs in the ":"用于解决相对URI的基本URI","The total number of unicast packets that were sent on the interface.":"接口上发送的单播数据包的总数。"," array that contains objects that describe the active TCP listeners, or an empty array, if no active TCP listeners are detected.":"如果未检测到活动的TCP侦听器，则包含描述活动TCP侦听器或空数组的对象的数组。"," that contains the index of the IPv4 interface.":"其中包含IPv4接口的索引。"," object that stores the collection of linked resources to be sent as part of an email message.":"存储作为电子邮件的一部分发送的链接资源集合的对象。"," array that contains objects that describe the UDP listeners, or an empty array if no UDP listeners are detected.":"包含描述UDP侦听器的对象的数组，或者如果未检测到UDP侦听器，则为空数组。"," if the interface uses an APIPA address; otherwise, ":"如果接口使用APIPA地址； 否则，"," that contains the value for the ":"其中包含"," object that provides ICMP version 4 traffic statistics for the local computer.":"为本地计算机提供ICMP版本4流量统计信息的对象。"," if the interface uses APIPA; otherwise, ":"如果接口使用apipa； 否则，"," associated with this attachment. This value can be ":"与此附件相关联。 这个值可以是"," object that provides ICMP version 6 traffic statistics for the local computer.":"为本地计算机提供ICMP版本6流量统计信息的对象。"," if the interface is configured to obtain an IP address from a DHCP server; otherwise, ":"如果将接口配置为从DHCP服务器获得IP地址； 否则，"," that contains the MIME Content-Header information for this attachment. This value can be ":"其中包含此附件的MIME内容标头信息。 这个值可以是"," object that contains information about the local computer.":"包含有关本地计算机的信息的对象。"," if this interface routes packets; otherwise ":"如果此接口路由数据包； 否则"," object that provides IPv4 traffic statistics for the local computer.":"为本地计算机提供IPv4流量统计信息的对象。"," value that specifies the MTU.":"指定MTU的值。"," object that provides IPv6 traffic statistics for the local computer.":"为本地计算机提供IPv6流量统计信息的对象。"," if the interface uses WINS; otherwise, ":"如果界面使用获胜； 否则，"," object that provides TCP/IPv4 traffic statistics for the local computer.":"为本地计算机提供TCP/IPv4流量统计信息的对象。"," object that provides TCP/IPv6 traffic statistics for the local computer.":"为本地计算机提供TCP/IPv6流量统计信息的对象。"," object that provides UDP/IPv4 traffic statistics for the local computer.":"为本地计算机提供UDP/IPv4流量统计信息的对象。"," object that provides UDP/IPv6 traffic statistics for the local computer.":"为本地计算机提供UDP/IPv6流量统计信息的对象。"," that contains a list of stable unicast IP addresses on the local computer.":"其中包含本地计算机上稳定的单播IP地址的列表。"," instance that contains the computer's DHCP scope name.":"包含计算机的DHCP范围名称的实例。"," instance that contains the computer's domain name. If the computer does not belong to a domain, returns ":"包含计算机域名的实例。 如果计算机不属于域，请返回"," instance that contains the computer's NetBIOS name.":"包含计算机的NetBios名称的实例。"," if the local computer is a WINS proxy; otherwise, ":"如果本地计算机是胜利的代理； 否则，"," value that specifies the TTL.":"指定TTL的值。"," value that specifies whether packet forwarding is enabled.":"指定是否启用数据包转发的值。"," value containing the number of network interfaces for the address family used to obtain this ":"包含用于获取此地址家族的网络接口数的值"," value that indicates the number of IP addresses assigned to the address family (Internet Protocol version 4 or Internet Protocol version 6) described by this object.":"指示该对象描述的为地址家族（Internet协议版本4或Internet协议版本6）的IP地址数量的值。"," value that specifies the total number of routes in the routing table.":"指定路由表中路由总数的值。"," value that specifies the total number of outgoing packets.":"指定外包总数的值。"," value that specifies the total number of valid routes that have been discarded.":"指定已丢弃的有效路由的总数。"," value that specifies the total number of outgoing packets that have been discarded.":"指定已丢弃的数据包的总数。"," value that specifies the number of packets that could not be sent because a route could not be found.":"指定无法发送的数据包数的值，因为找不到路由。"," value that specifies the total number of packets that required fragmentation but had the \"Don't Fragment\" bit set.":"指定需要碎片但具有“不碎片”位的数据包的总数。"," value that specifies the total number of packet reassemblies required.":"指定数据包重新组件总数的值。"," value that specifies the total number of packets that could not be reassembled.":"指定无法重新组装的数据包的总数。"," value that specifies the maximum number of milliseconds within which all fragments of a packet must arrive to avoid being discarded.":"指定最大数量的毫秒数，其中所有数据包的所有片段都必须到达以避免被丢弃。"," value that specifies the total number of fragmented packets.":"指定碎片数据包总数的值。"," value that specifies the total number of fragmented packets that have been successfully reassembled.":"指定已成功重新组装的碎片数据包的总数。"," value that specifies the total number of IP packets received.":"指定收到的IP数据包的总数。"," value that specifies the total number of IP packets delivered.":"指定输送的IP数据包的总数。"," value that specifies the total number of incoming packets that have been discarded.":"指定已丢弃的数据包的总数。"," value that specifies the total number of forwarded packets.":"指定转发数据包的总数。"," value that specifies the total number of IP packets received with errors in the address portion of the header.":"指定收到的IP数据包的总数在标题的地址部分中带有错误。"," value that specifies the total number of IP packets received and discarded due to errors in the header.":"指定由于标题中错误而收到和丢弃的IP数据包总数的值。"," value that indicates the total number of IP packets received with an unknown protocol.":"值表示带有未知协议的IP数据包总数。"," object that contains IPv4 configuration data.":"包含IPv4配置数据的对象。"," object that contains IPv6 configuration data.":"包含IPv6配置数据的对象。"," that contains the anycast addresses for this interface.":"其中包含此接口的任何播放地址。"," that contains the address information for DHCP servers, or an empty array if no servers are found.":"其中包含DHCP服务器的地址信息，如果找不到服务器，则包含一个空数组。"," that contains the DNS server addresses.":"其中包含DNS服务器地址。"," that contains the DNS suffix for this interface, or ":"其中包含此接口的DNS后缀，或"," if there is no DNS suffix for the interface.":"如果没有界面的DNS后缀。"," that contains the address information for network gateways, or an empty array if no gateways are found.":"其中包含网络网关的地址信息，如果没有找到网关，则包含一个空数组。"," if NetBt is configured to use DNS name resolution on this interface; otherwise, ":"如果NetBT配置为在此接口上使用DNS名称分辨率； 否则，"}