{" that indicates where this operation is used.":"这表示使用此操作的位置。","The sequence of ":"序列","The flags with which to initialize the binder.":"用来初始化粘合剂的标志。","The binary operation kind.":"二进制操作类型。","The ":"这"," instances for the arguments to this operation.":"该操作的论点实例。","A new CSharp binary operation binder.":"新的CSHARP二进制操作粘合剂。","The type to convert to.":"要转换的类型。","A new CSharp convert binder.":"新的CSHARP转换活页夹。","A new CSharp get index binder.":"新的CSHARP获取索引粘合剂。","A new CSharp get member binder.":"新的CSHARP获得成员活页夹。","The name of the member to get.":"要获得的成员的名字。","A new CSharp invoke constructor binder.":"新的CSHARP调用构造函数。","A new CSharp invoke binder.":"新的CSHARP调用活页夹。","The list of type arguments specified for this invoke.":"为此调用指定的类型参数列表。","The name of the member to invoke.":"调用成员的名字。","A new CSharp set index binder.":"新的CSHARP集索引粘合剂。","The name of the event to look for.":"事件的名称要寻找。","A new CSharp invoke member binder.":"新的CSHARP调用成员活页夹。","A new CSharp set member binder.":"新的CSHARP套件成员活页夹。","A new CSharp unary operation binder.":"新的CSHARP单一操作粘合剂。","The name of the member to set.":"要设置的成员名称。","A new CSharp is event binder.":"新的CSHARP是事件活页夹。","The name of the argument, if named; otherwise null.":"该论点的名称，如果命名； 否则为空。","The unary operation kind.":"单一操作类型。","The flags for the argument.":"参数的标志。"," class.":"班级。","A new instance of the ":"一个新实例","The contextual information about the source or destination.":"有关源或目的地的上下文信息。"," that holds the serialized object data about the exception being thrown.":"该序列化对象数据涉及被抛出的异常。","The error message that explains the reason for the exception.":"错误消息解释了异常的原因。","The object that holds the serialized object data about the exception being thrown.":"保存有关抛出异常的序列化对象数据的对象。","Required. An object of any type that specifies the element to add to the collection.":"必需的。 指定要添加到集合的元素的任何类型的对象。"," that contains contextual information about the source or destination.":"其中包含有关源或目的地的上下文信息。","The message that describes the exception. The caller of this constructor is required to ensure that this string has been localized for the current system culture.":"描述异常的消息。 需要该构造函数的呼叫者，以确保该字符串已定位为当前系统文化。","The exception that is the cause of the current exception, or a null reference if no inner exception is specified.":"如果未指定内部异常，则是当前异常原因的例外。"," expression that specifies a key string that can be used instead of a positional index to access this new element in the collection.":"表达式指定可以使用的键字符串代替可以使用的位置索引来访问集合中的新元素。","Optional. A unique ":"可选的。 一个特别的"," property. If ":"财产。 如果"," argument. If ":"争论。 如果","Optional. An expression that specifies a relative position in the collection. The element to be added is placed in the collection before the element identified by the ":"可选的。 指定集合中相对位置的表达式。 要添加的元素放在集合中"," expression, it must correspond to the key string specified when the element being referred to was added to the collection. You cannot specify both ":"表达式，它必须对应于指定的键字符串，当添加到集合中的元素时。 您不能同时指定"," is a ":"是一个",".":"。"," expression that specifies the key for which to search the elements of the collection.":"表达式指定搜索集合元素的关键。"," is a numeric expression, it must be a number from 1 through the value of the collection's ":"是数字表达式，必须是一个数字，从1到集合的值","A numeric expression that specifies the position of an element of the collection. ":"指定集合元素的位置的数字表达式。"," and ":"和"," if Visual Basic ":"如果视觉基础","Optional. An expression that specifies a relative position in the collection. The element to be added is placed in the collection after the element identified by the ":"可选的。 指定集合中相对位置的表达式。 在由"," expression that specifies a key string that can be used, instead of a positional index, to access an element of the collection. ":"表达式指定可以使用的键字符串而不是位置索引来访问集合的元素。"," must be a number from 1 through the value of the collection's ":"必须是从1到集合的值的数字"," object contains an element with a specific key; otherwise, ":"对象包含带有特定键的元素； 否则，"," property. Or (B) An ":"财产。 或（b）"," expression, it must correspond to the key string specified when the element referred to was added to the collection. You cannot specify both ":"表达式，它必须与指定的元素添加到集合中时指定的键字符串。 您不能同时指定"," must correspond to the ":"必须对应于"," property.":"财产。"," expression that specifies the position or key string of an element of the collection.":"指定集合元素的位置或键字符串的表达式。","An enumerator that can be used to iterate through the collection.":"可以用来通过集合迭代的枚举者。"," argument specified when the element was added to the collection.":"何时将元素添加到集合中时指定的参数。","A specific element of a ":"一个特定元素","Required. A ":"必需的。 一个","A unique ":"一个特别的","Initializes the value of the ":"初始化","The number of elements in a collection.":"集合中的元素数量。"," object either by position or by key.":"对象按位置或按键对象。","Read-only. A string that can be used by the compiler to uniquely identify the class when a COM object is created.":"只读。 当创建COM对象时，编译器可以使用的字符串可以唯一标识类。"," property that is used to uniquely identify a class.":"用于唯一标识类的属性。"," value that indicates that the COM interface name shadows another member of the class or base class.":"表示COM接口名称阴影类或基类的另一个成员的值。"," value to convert.":"值转换的值。","Required. String to convert to a ":"必需的。 串转换为"," property that is used to uniquely identify an interface.":"用于唯一标识接口的属性。","Read only. A string that can be used by the compiler to uniquely identify an event for the class when a COM object is created.":"只读。 当创建COM对象时，编译器可以使用编译器可以使用该类事件的字符串。","Required. Object to convert to a ":"必需的。 对象转换为","The byte count of the ":"字节数","The object to convert.":"要转换的对象。"," property that is used to uniquely identify an event.":"用于唯一标识事件的属性。","Read-only. A string that can be used by the compiler to uniquely identify an interface for the class when a COM object is created.":"只读。 当创建COM对象时，编译器可以使用编译器可以使用的字符串唯一识别类的接口。"," value.":"价值。","The string representation of the specified value.":"指定值的字符串表示。","The string representation of the specified array.":"指定数组的字符串表示。","The type to which to convert the object.":"转换对象的类型。"," value that corresponds to ":"对应于","A ":"一个","Zero-based index of the start position.":"起始位置的基于零的索引。"," array to convert.":"阵列要转换。"," value. Returns ":"价值。 返回","An object of the specified target type.":"指定目标类型的对象。","Length of the subset in bytes.":"子集的长度在字节中。"," value of the object.":"对象的值。","A Boolean value to convert.":"布尔值转换。"," if the object is null; otherwise, ":"如果对象为空； 否则，","The number format to use, according to ":"根据数字格式要使用","The string representation of the specified array from the start position to the specified length.":"指定数组的字符串表示从开始位置到指定的长度。"," value of the string.":"字符串的值。","The string to convert.":"要转换的字符串。"," value of the Boolean value.":"布尔值的价值。","The string representation of the ":"字符串表示","Required. ":"必需的。"," if the string is null; otherwise, ":"如果字符串为null； 否则，","A one-dimensional ":"一维"," representation of the object.":"对象的表示。","A structure or object of generic type ":"通用类型的结构或对象","The method name of ":"方法名称的名称"," value to convert to a ":"值转换为"," object that defines how date values are formatted and displayed, depending on the culture.":"定义日期值如何格式和显示的对象，具体取决于文化。"," array.":"大批。"," to call.":"打电话。"," representation of the ":"表示"," object that defines how numeric values are formatted and displayed, depending on the culture.":"定义数字值的格式和显示的对象，具体取决于文化。","The object to return the value from.":"从中返回值的对象。"," at the location specified by ":"在指定的位置","An array of parameter values to pass to the method.":"参数值数组传递到该方法。"," to identify ":"识别"," value corresponding to ":"值对应于","The member name of ":"成员名称","An array that contains the names of the parameters to which the values in the ":"一个包含参数名称的数组",". If ":"。 如果","Required. Object to convert to an ":"必需的。 对象转换为"," as the result of a late-bound expression.":"由于后期表达式。"," array are passed.":"数组通过。"," to retrieve a value from.":"从中检索一个值。","Required. String to convert to an ":"必需的。 字符串转换为"," is an object, the return value of ":"是一个对象，返回值","An array of ":"一系列","An array of one or more index values that specify the location in ":"一个或多个索引值的数组指定位置","The object to call a method on.":"调用方法的对象。"," invoked by using the named parameters in ":"通过在","The object to set the member value for.":"设置成员值的对象。"," values, where ":"值，其中"," if ":"如果","The type of the object.":"对象的类型。","The member name to set.":"要设置的成员名称。"," and their associated values in ":"以及它们相关的价值"," is a one-dimensional or multi-dimensional array, or argument values to pass to the object ":"是一个一维或多维数组，或传递给对象的参数值"," indicates that the associated parameter is passed ":"表示关联的参数已传递"," is being compared.":"正在比较。","An array of one or parameter values to pass to the member of ":"一个或参数值的数组将传递给","The object to set the value for.":"设置值的对象。","An array of argument names.":"一系列参数名称。","If ":"如果","An array of one or more parameter values to pass to the member of ":"一个或多个参数值的数组将传递给"," enumeration specifying whether or not to use text comparison. If ":"枚举指定是否使用文本比较。 如果"," value indicating whether or not the return value can be ignored.":"表示是否可以忽略返回值的值。","An array of one or more parameter values to pass to the object ":"一个或多个参数值的数组传递到对象","The string to compare.":"比较的字符串。"," is an array, the value from ":"是一个数组，来自","An instance of the call object.":"呼叫对象的实例。",", this method uses text comparison; if ":"，此方法使用文本比较； 如果"," to suppress the exception thrown when the set member is not found.":"在找不到设置成员时抑制异常。","The string against which ":"符合的字符串","; this allows you to generate a run-time exception for late assignments to fields of ":"; 这使您可以生成用于延迟作业的运行时间异常"," value used to determine whether the set operation will work. Set to ":"用于确定设定操作是否有效的值。 调成",", this method uses binary comparison.":"，此方法使用二进制比较。"," representing the type of procedure being called. The value of CallType can be ":"表示被调用的过程类型。 Calltype的价值可以是"," when an error is encountered.":"当遇到错误时。"," when you believe that an intermediate value has been set in the property or field; otherwise ":"当您认为已在属性或字段中设置了中间值时； 否则"," of value types. Otherwise, set to ":"价值类型。 否则，设置为",", ":"，，，，"," if the strings match; otherwise, ":"如果琴弦匹配； 否则，"," value that specifies when the base reference of the late reference is an ":"指定延迟参考的基本参考为一个的值","The type of the call object.":"呼叫对象的类型。",", or ":"， 或者","An instance of the call object exposing the property or method. If ":"呼叫对象的实例公开属性或方法。 如果",". Set to ":"。 调成","An instance of the call object exposing the property or method.":"呼叫对象的实例公开属性或方法。","An array of argument types; used only for generic calls to pass argument types.":"一系列参数类型； 仅用于通用呼叫来传递参数类型。",". Only ":"。 仅有的"," is of type ":"是类型"," when the base reference of the late reference is an ":"当延迟参考的基本参考为","The name of the property or method on the call object.":"呼叫对象上属性或方法的名称。"," values that the late binder uses to communicate back to the call site which arguments match ":"已故活页夹用来向呼叫网站传达的值，该论点与之匹配"," is used.":"用来。","The value of the ":"价值",", then bind using the Dynamic Language Runtime; otherwise perform standard late-binding.":"，然后使用动态语言运行时绑定； 否则执行标准的后期结合。"," parameters. Each ":"参数。 每个","An array containing the arguments to be passed to the property or method being called.":"一个包含要传递给属性或调用方法的参数的数组。"," option.":"选项。","The data type for which to check for synchronization lock.":"检查同步锁的数据类型。"," value indicates that the arguments matched and should be copied out after the call to ":"值表示匹配的参数，应在呼叫之后复制"," value used to specify whether to throw exceptions when an error is encountered. Set to ":"用于指定是否遇到错误时是否抛出异常的值。 调成","An object that contains verified values for loop values.":"包含循环值的验证值的对象。"," is greater than zero and ":"大于零，"," is complete.":"已经完成。","The loop counter variable.":"循环计数器变量。"," to throw exceptions. Set to ":"抛出例外。 调成","The counter value for the next loop iteration.":"下一个循环迭代的计数器值。"," is less than or equal to ":"小于或等于","The initial value of the loop counter.":"循环计数器的初始值。","An enumeration member of type ":"枚举类型成员"," to return ":"返回"," or ":"或者"," if the loop has terminated; otherwise, ":"如果循环终止； 否则，","The sum of ":"总数是","Required. Any string expression conforming to the pattern-matching conventions described in Like Operator.":"必需的。 任何符合类似运算符中描述的模式匹配约定的字符串表达式。","The full quotient of ":"完整的商"," is less than or equal to zero and ":"小于或等于零，并且"," value that represents the initial value passed for the loop counter variable.":"表示循环计数器变量传递的初始值的值。","Required. Any ":"必需的。 任何"," value that specifies that the operation use either text or binary comparison.":"指定操作使用文本或二进制比较的值。"," divided by ":"除以"," value that represents the value passed by using the ":"代表通过使用该值的值"," is greater than or equal to ":"大于或等于"," if the string representation of the value in ":"如果值的字符串表示"," or numeric expression.":"或数字表达。"," keyword.":"关键词。",", including any remainder.":"，包括剩余的。"," satisfies the pattern that is contained in ":"满足包含在","; otherwise, ":"; 否则，"," is divided by ":"被分开","1 if both ":"1如果两者",". ":"。","Required. Any expression.":"必需的。 任何表达。",", or if ":"， 或者如果","The product of ":"产品的产物"," evaluate to 1; otherwise, 0.":"评估为1； 否则，0。","The primitive value of ":"原始价值的"," if both ":"如果两者","The negative value of ":"负值","Required. Any numeric expression.":"必需的。 任何数字表达式。"," typed as object.":"键入为对象。","0 if both ":"0，如果两者","For ":"为了"," are ":"是","Required. Numeric expression. The number of bits to shift the bit pattern. The data type must be ":"必需的。 数字表达。 移动位模式的位数。 数据类型必须是","The integer quotient of ":"整数商"," evaluate to 0; otherwise, 1.":"评估为0； 否则，1。","The remainder after ":"其余的之后"," operations, ":"操作，"," or widen to ":"或扩大到",", which discards any remainder and retains only the integer portion.":"，丢弃剩余的任何剩余部分，仅保留整数部分。","A numeric value that represents the bitwise exclusion (exclusive bitwise disjunction) of two numeric bit patterns. For more information, see Xor Operator.":"代表两个数字位模式的位排除（独家位析取）的数字值。 有关更多信息，请参见XOR操作员。"," if operator overloading is not supported.":"如果不支持操作员过载。","An integral numeric value. The result of shifting the bit pattern. The data type is the same as that of ":"一个整体数值。 移动位模式的结果。 数据类型与"," is ":"是"," for comparison based on a case-insensitive text sort order determined by your system's ":"根据您的系统确定的对案例不敏感的文本排序顺序进行比较","A string representing the concatenation of ":"代表串联的串","The result of the overloaded greater-than operator. ":"超负荷运算符的结果。","The string representation of ":"字符串表示"," value indicating whether or not the string satisfies the pattern. If the value in string satisfies the pattern contained in pattern, result is ":"表示字符串是否满足图案的值。 如果字符串中的值满足图案中包含的模式，则结果是",". For bitwise operations, 1 if ":"。 对于位操作，1如果","The difference between ":"和...之间的不同","The result of the overloaded greater-than or equal-to operator. ":"超负荷或均等操作员的结果。",". If the string does not satisfy the pattern, result is ":"。 如果字符串不满足模式，结果是","The string value corresponding to ":"字符串值对应于"," or numeric value. For a ":"或数字值。 为一个"," is 0; otherwise, 0.":"是0; 否则，0。","The result of the overloaded less-than operator. ":"超负荷运算符的结果。","Required. String variable to modify.":"必需的。 字符串变量要修改。"," comparison, the return value is the logical exclusion (exclusive logical disjunction) of two ":"比较，返回值是两个的逻辑排除（独家逻辑分解）"," to perform a case-insensitive string comparison; otherwise, ":"进行案例不敏感的字符串比较； 否则，","The result of the overloaded less-than or equal-to operator. ":"超载较小或均等操作员的结果。",". If both string and pattern are empty strings, the result is ":"。 如果字符串和图案都是空字符串，则结果是","Required. Location in the ":"必需的。 位置"," values. For bitwise (numeric) operations, the return value is a numeric value that represents the bitwise exclusion (exclusive bitwise disjunction) of two numeric bit patterns. For more information, see Xor Operator.":"值。 对于位（数字）操作，返回值是一个数字值，代表两个数字位模式的位排除（独家位析取）。 有关更多信息，请参见XOR操作员。","The value of ":"的价值","The array to be copied.":"要复制的阵列。","The result of the overloaded not-equal operator. ":"超载非平等运算符的结果。"," evaluate to ":"评估"," parameter to begin overwriting from. The index is 1-based.":"开始覆盖的参数。 该索引是基于1的。",". (The sign of the ":"。 （迹象","The destination array.":"目标数组。","The user-defined operator.":"用户定义的操作员。","Required. Maximum number of characters from the ":"必需的。 来自",". For bitwise operations, 1 if both ":"。 对于位操作，1","The copied array.":"复制的数组。"," is unchanged.)":"不变。）"," parameter to use, starting from the first character.":"从第一个字符开始使用的参数。","The result returned from the user-defined operator.":"结果从用户定义的操作员返回。","The identifier of the string or error message to retrieve.":"字符串或错误消息的标识符要检索。"," are equal; otherwise, ":"相等； 否则，","The result of ":"的结果","Required. String value to overwrite the ":"必需的。 字符串值覆盖",". For bitwise operations, 0 if both ":"。 对于位操作，如果两者都"," is greater than ":"大于"," parameter with.":"参数。"," raised to the power of ":"提高到力量","An array of parameters to replace placeholders in the string or error message.":"一个参数数组，以替换字符串或错误消息中的占位符。"," is less than ":"小于","An integer value that identifies the nature of the error. Visual Basic errors are in the range 0-65535; the range 0-512 is reserved for system errors; the range 513-65535 is available for user-defined errors.":"整数值识别误差的性质。 视觉基本错误在0-65535范围内； 0-512范围用于系统错误； 范围513-65535可用于用户定义的错误。","Required. String to compare with ":"必需的。 与之相比的字符串","Required. Integral numeric expression. The bit pattern to be shifted. The data type must be an integral type (":"必需的。 积分数字表达式。 要移动的位模式。 数据类型必须是积分类型（","A formatted resource string or error message.":"格式化的资源字符串或错误消息。"," is not equal to ":"不等于"," to perform a case-insensitive comparison; otherwise ":"进行案例不敏感的比较； 否则","An ":"一个",". A pointer to the object exposing the property or method.":"。 指向对象暴露属性或方法的指针。",").":"）。"," object.":"目的。",". A parameter array containing the arguments to be passed to the property or method being called.":"。 一个包含要传递给属性或所调用方法的参数的参数数组。"," object to be caught.":"被捕获的对象。","Executes a method on an object, or sets or returns a property on an object.":"在对象上执行方法，或设置或返回对象上的属性。","The line number of the exception.":"异常的行号。","Returns a Boolean value indicating whether an expression can be evaluated as a number.":"返回布尔值，指示表达式是否可以评估为数字。"," to convert to a ":"转换为","Required. A string variable containing a Visual Basic type name.":"必需的。 包含可视基本类型名称的字符串变量。","Required. Date to convert to a ":"必需的。 转换为","Returns a string value containing the system data type name of a variable.":"返回包含变量的系统数据类型名称的字符串值。"," variable. If ":"多变的。 如果","Any ":"任何 "," expression conforming to the pattern-matching conventions described in Like Operator.":"表达符合类似运算符中描述的模式匹配惯例。","Specifies how to compare strings to patterns, according to the ":"指定如何将字符串与图案进行比较"," or any valid numeric expression.":" 或任何有效的数字表达式。",". Can be ":"。 可"," for binary comparison or ":"用于二进制比较或"," or an ":"或一个"," error occurs.":"发生错误。",", you can pass a variable of any data type except a structure.":"，您可以传递除结构之外的任何数据类型的变量。","The numbers contained in a string as a numeric value of appropriate type.":"字符串中包含的数字作为适当类型的数字值。","The integer portion of a number.":"数的整数部分。","Returns a string value containing data type information about a variable.":"返回包含有关变量的数据类型信息的字符串值。"," or any valid numeric expression. If ":"或任何有效的数字表达式。 如果"," enumeration value or a string expression representing the time interval you want to add.":" 枚举值或表示要添加的时间间隔的字符串表达式。","The result of the overloaded equals operator. ":"超载等于操作员的结果。"," contains ":" 包含 ","Required. An enumeration member of type ":"必需的。 枚举类型成员","Optional. A value chosen from the ":"可选的。 从"," is returned.":"退回。"," representing the type of procedure being called. The value of ":"表示被调用的过程类型。 的价值"," enumeration that specifies the first day of the week. If not specified, ":"指定本周第一天的枚举。 如果未指定，","Required. Any valid numeric expression or ":"必需的。 任何有效的数字表达式或"," can be ":"可"," enumeration that specifies the first week of the year. If not specified, ":"指定年度第一周的枚举。 如果未指定，","A string representing the hexadecimal value of a number.":"代表数字的十六进制值的字符串。","Optional. ":"可选的。","A long value specifying the number of time intervals between two ":"一个长的值，指定两个之间的时间间隔数","A string representing the octal value of a number.":"一个代表数字八分值的字符串。"," values.":"值。","Required. An ":"必需的。 一个"," is 0, the result is December of the previous year.  \n  \n If ":"为0，结果是上一年的十二月。 \n  \n  如果"," enumeration value or a string expression representing the part of the date/time value you want to return.":"枚举值或字符串表达式表示您要返回的日期/时间值的一部分。"," containing any valid numeric expression.":"包含任何有效的数字表达式。"," is -1, the result is November of the previous year.  \n  \n If ":"为-1，结果是上一年的11月。 \n  \n  如果","Required. The ":"必需的。 这"," representation of a number.":"数字的表示。"," is 13, the result is January of the following year.":"为13，结果是次年的一月。"," value that you want to evaluate.":"您要评估的价值。","Required. Any valid ":"必需的。 任何有效","An integer value containing the specified component of a given ":"一个包含给定的指定组件的整数值","Required. Integer expression from 1 through 31. However, values outside this range are also accepted. The value of ":"必需的。 整数表达式从1到31。但是，此范围以外的值也被接受。 的价值"," expression, ":"表达，","Required. Integer expression from 1 through 9999. However, values below this range are also accepted. If ":"必需的。 但是，从1到9999的整数表达式。但是，低于此范围的值也被接受。 如果"," is offset by 1 and applied to the first day of the calculated month. In other words, (":"被抵消为1，并应用于计算的月份的第一天。 换句话说， （"," is 0 through 99, it is interpreted as being between 1930 and 2029, as explained in the \"Remarks\" section. If ":"是0到99，它被解释为1930年至2029年之间，如“备注”部分所述。 如果"," - 1) is added to the first of the month. The month and year are recalculated if necessary. The following results illustrate this effect:  \n  \n If ":"-1）添加到本月的第一个。 如有必要，将重新计算该月和年。 以下结果说明了此效果： \n  \n  如果"," variable, or ":"变量，或"," is less than 1, it is subtracted from the current year.":"小于1，从当年减去。"," is 1, the result is the first day of the calculated month.  \n  \n If ":"为1，结果是计算月的第一天。 \n  \n  如果"," value. If ":"价值。 如果","Required. Integer expression from 1 through 12. However, values outside this range are also accepted. The value of ":"必需的。 但是，从1到12的整数表达。但是，此范围以外的值也被接受。 的价值"," is 0, the result is the last day of the previous month.  \n  \n If ":"为0，结果是上个月的最后一天。 \n  \n  如果",", its value must be convertible to ":"，其价值必须可转换为"," is offset by 1 and applied to January of the calculated year. In other words, (":"被抵消为1，并应用于计算年份的一月。 换句话说， （"," is -1, the result is the penultimate day of the previous month.  \n  \n If ":"为-1，结果是上个月的倒数第二天。 \n  \n  如果","An integer value from 1 through 31 representing the day of the month.":"一个从1到31的整数值代表当天的一天。"," - 1) is added to January. The year is recalculated if necessary. The following results illustrate this effect:  \n  \n If ":"-1）添加到一月。 如有必要，将重新计算这一年。 以下结果说明了此效果： \n  \n  如果"," is past the end of the current month, the result is the appropriate day of the following month. For example, if ":"已经超过了本月底，结果是下个月的适当一天。 例如，如果","Returns a string value containing the Visual Basic data type name of a variable.":"返回包含变量的Visual Basic Data类型名称的字符串值。"," is 1, the result is January of the calculated year.  \n  \n If ":"为1，结果是计算年份的一月。 \n  \n  如果"," value from which you want to extract the hour.":"您想从中提取小时的价值。"," is 4 and ":"是4和","Required. Floating-point expression representing the number of intervals you want to add. It can be positive (to get date/time values in the future) or negative (to get date/time values in the past). It can contain a fractional part when ":"需要。 浮点表达式，表示要添加的区间数。 它可以是正数（以获取未来的日期/时间值）或负数（以获取过去的日期/时间值）。 它可以包含一个小数部分，当 ","An object whose type at run time is the requested target type.":"运行时间类型的对象是请求的目标类型。","Required. Integer expression from 0 through 59. However, values outside this range are also accepted. The value of ":"必需的。 从0到59的整数表达式。但是，此范围以外的值也被接受。 的价值","An integer value from 0 through 23 representing the hour of the day.":"从0到23的整数值代表一天中的小时。"," is 31, the result is May 1.":"是31，结果是5月1日。","An object statically typed as the requested generic type.":"静态键入作为请求的通用类型的对象。"," is added to the calculated hour, so a negative value specifies minutes before that hour.":"被添加到计算的小时中，因此负值指定该小时前几分钟。"," value from which you want to extract the minute.":"您想从中提取分钟的价值。"," specifies hours, minutes, or seconds. For other values of ":"指定小时，分钟或秒。 对于其他值","A value that represents the specified year, month, and day, with the time information set to midnight (00:00:00).":"代表指定年度，月和一天的值，将时间信息设置为午夜（00:00:00）。","The error message that corresponds to the most recent run-time error.":"错误消息与最近的运行时错误相对应。"," is added to the calculated minute, so a negative value specifies seconds before that minute.":"被添加到计算的分钟中，因此负值指定该分钟之前的几秒钟。","An integer value from 0 through 59 representing the minute of the hour.":"一个从0到59的整数值代表小时的分钟。",", any fractional part of ":"，任何部分的部分","Required. string expression representing a date/time value from 00:00:00 on January 1 of the year 1 through 23:59:59 on December 31, 9999.":"必需的。 字符串表达式表示9999年12月31日1月1日至23:59:59的00:00:00的日期/时间值。"," value representing a specified hour, minute, and second, with the date information set relative to January 1 of the year 1.":"代表指定小时，分钟和第二的值，其日期信息相对于1年的1月1日。"," is ignored.":"被忽略。"," value from which you want to extract the month.":"您想从中提取月份的价值。","Optional. Any valid error number.":"可选的。 任何有效的错误号码。","Required. A string expression representing a date/time value from 00:00:00 on January 1 of the year 1 through 23:59:59 on December 31, 9999.":"必需的。 一个字符串表达式，代表1月1日的1月1日至9999年12月31日的1月1日至23:59:59的日期/时间值。"," value containing the date information represented by a string, with the time information set to midnight (00:00:00).":"包含字符串表示的日期信息的值，将时间信息设置为午夜（00:00:00）。","Required. An expression representing the date and time to which the interval is to be added. ":"必需的。 表示添加间隔的日期和时间的表达式。","An integer value from 1 through 12 representing the month of the year.":"整数值从1到12个，代表一年中的一个月。","The error message that corresponds to a given error number.":"与给定的错误号相对应的错误消息。"," value from which you want to extract the day.":"您想从中提取一天的价值。"," value containing the time information represented by a string, with the date information set to January 1 of the year 1.":"包含字符串表示的时间信息的值，将日期信息设置为1年1月1日。","Required. The numeric designation of the month, from 1 through 13; 1 indicates January and 12 indicates December. You can use the value 13 with a 13-month calendar. If your system is using a 12-month calendar and ":"必需的。 本月的数字名称，从1到13； 1表示1月，12月12日表示。 您可以使用13个月的日历使用值13。 如果您的系统正在使用12个月的日历，并且","Returns or sets a ":"返回或设置"," itself is not changed in the calling program.":"本身在呼叫程序中没有更改。","Required. A number of type ":"必需的。 多种类型"," is 13, ":"是13"," value for which you want to determine the day of the week.":"您想确定一周中的一天的价值。"," value containing the current time of day according to your system.":"根据您的系统包含一天中的当前时间。"," property, the \"Application-defined or object-defined error\" message is used.":"使用属性，“应用程序定义或对象定义的错误”消息。"," returns an empty string.":"返回一个空字符串。","A value containing a date and time value to which a specified time interval has been added.":"包含已添加指定时间间隔的日期和时间值的值。","An integer value containing a number representing the day of the week.":"一个包含代表一周一天的数字的整数值。","A value representing the number of seconds elapsed since midnight.":"自午夜以来所经过的秒数的值。","Optional. The fully qualified path to the Help file in which help on this error can be found. If unspecified, Visual Basic uses the fully qualified drive, path, and file name of the Visual Basic Help file.":"可选的。 可以找到有关此错误的帮助文件的完全合格的路径。 如果未指定，Visual Basic使用Visual Basic帮助文件的完全合格的驱动器，路径和文件名。","Required. Integer. The numeric designation for the weekday, from 1 through 7; 1 indicates the first day of the week and 7 indicates the last day of the week. The identities of the first and last days depend on the setting of ":"必需的。 整数。 工作日的数字名称，从1到7； 1表示本周的第一天，7表示本周的最后一天。 第一天和最后几天的身份取决于"," to abbreviate the month name; otherwise, ":"缩写该月份的名称； 否则，","Returns or sets a string value representing the current time of day according to your system.":"返回或设置一个字符串值，表示根据您的系统的当前时间。","Required. Floating-point expression representing the number of intervals you want to add. ":"必需的。 浮点表达式表示您要添加的间隔数量。","Optional. The context ID identifying a topic within ":"可选的。 上下文ID在其中识别主题"," value that indicates if the weekday name is to be abbreviated. If omitted, the default is ":"值表示是否要缩写工作日名称。 如果省略，默认值为",". The default is ":"。 默认值为"," value containing the current date according to your system.":"根据您的系统包含当前日期的值。"," that provides help for the error. If omitted, the Visual Basic Help-file context ID for the error corresponding to the ":"这为错误提供了帮助。 如果省略，则为与该错误相对应的视觉基本帮助文件上下文ID",", which means the weekday name is not abbreviated.":"，这意味着工作日的名字没有缩写。","A string value containing the name of the specified month.":"一个包含指定月份名称的字符串值。","The exception representing the error that occurred.":"代表发生错误的异常。"," can be positive (to get date/time values in the future) or negative (to get date/time values in the past). It can contain a fractional part when ":"可以是积极的（将来要获得日期/时间值）或负面（过去获得日期/时间值）。 当它可以包含一个分数时"," property is used, if it exists.":"如果存在，则使用属性。","A string value containing the name of the specified weekday.":"一个包含指定工作日名称的字符串值。"," integer that identifies the nature of the error. Visual Basic errors are in the range 0-65535; the range 0-512 is reserved for system errors; the range 513-65535 is available for user-defined errors. When setting the ":"确定错误性质的整数。 视觉基本错误在0-65535范围内； 0-512范围用于系统错误； 范围513-65535可用于用户定义的错误。 设置"," value from which you want to extract the second.":"您要从中提取第二个值。"," expression containing a descriptive string associated with an error. Read/write.":"包含与错误关联的描述字符串的表达式。 读/写。"," property to your own error code in a class module, you add your error code number to the ":"在类模块中属于您自己的错误代码，您将错误代码编号添加到"," value from which you want to extract the year.":"您想从中提取年度的价值。"," enumeration value or a string expression representing the time interval you want to use as the unit of difference between ":"枚举值或字符串表达式表示您要用作时间间隔","An integer value from 0 through 59 representing the second of the minute.":"一个从0到59的整数值代表分钟的第二个。","The line number of the last executed statement.":"最后执行语句的行号。"," constant. For example, to generate the error number 513, assign ":"持续的。 例如，要生成错误编号513，请分配","An integer value from 1 through 9999 representing the year.":"整数价值从1到9999年，代表年度。","Required. Integer expression from 0 through 23. However, values outside this range are also accepted.":"必需的。 从0到23的整数表达式。但是，此范围以外的值也被接受。","Required. The first date/time value you want to use in the calculation.":"必需的。 您要在计算中使用的第一个日期/时间值。","Returns or sets an ":"返回或设置"," to the ":"到","Returns or sets a string value representing the current date according to your system.":"返回或设置一个字符串值，根据您的系统表示当前日期。","The directory to be copied.":"要复制的目录。"," containing the context ID for a topic in a Help file. Read/write.":"在帮助文件中包含主题的上下文ID。 读/写。"," expression naming the object or application that generated the error. When setting this property for an object, use the form ":"表达式命名生成错误的对象或应用程序。 为对象设置此属性时，请使用表单","The location to which the directory contents should be copied.":"应复制目录内容的位置。","Required. The second date/time value you want to use in the calculation.":"必需的。 您要在计算中使用的第二个日期/时间值。","The current date and time according to your system.":"根据您的系统的当前日期和时间。"," expression containing the fully qualified path to a Help file. Read/write.":"表达式包含通往帮助文件的完全资格的路径。 读/写。"," is not specified, the process ID of the current Visual Basic project is used.":"未指定，使用当前的Visual Basic项目的过程ID。","Name and path of directory.":"目录的名称和路径。","Whether to visually track the operation's progress. Default is ":"是否可以视觉跟踪操作的进度。 默认为","Path of the directory to which the source directory is being moved.":"源目录正在移动到的目录的路径。","A system error code produced by a call to a dynamic-link library (DLL).":"由调用动态链接库（DLL）产生的系统错误代码。","Read-only collection of the path names of subdirectories within the specified directory.":"指定目录中子目录的路径名的仅读取集合。"," expression describing the error. If unspecified, the value in the ":"描述错误的表达式。 如果未指定，则在","Specifies what should be done if the user clicks Cancel during the operation. Default is ":"指定如果用户在操作过程中单击取消应该做什么。 默认为"," if existing directories should be overwritten; otherwise ":"如果应该覆盖现有目录； 否则","Returns or sets a numeric value specifying an error. Read/write.":"返回或设置一个指定错误的数字值。 读/写。","Pattern to match names.":"匹配名称的模式。"," property is examined. If it can be mapped to a Visual Basic run-time error code, the string that would be returned by the ":"检查属性。 如果可以将其映射到视觉基本运行时错误代码，则将返回的字符串","Path of the file to be moved.":"文件的路径要移动。"," to overwrite existing files; otherwise ":"覆盖现有文件； 否则",". Path of directory.":"。 目录的路径。"," expression specifying the name of the object or application that originally generated the error. Read/write.":"表达式指定最初生成错误的对象或应用程序的名称。 读/写。","Path of the directory into which the file should be moved.":"应将文件移动到的目录的路径。"," function is used as the ":"功能用作"," object for the specified path.":"指定路径的对象。",". Default is ":"。 默认为","The file to be opened with the ":"要使用的文件",". First path to be combined.":"。 结合的第一条途径。","Drive to be examined.":"开车要检查。"," property. If there is no Visual Basic error corresponding to the ":"财产。 如果没有视觉基本错误对应于","The file to be copied.":"要复制的文件。"," to read the specified file.":"读取指定的文件。",". Second path to be combined.":"。 第二个路径要组合。","The current directory for file I/O operations.":"文件I/O操作的当前目录。"," object for the specified drive.":"指定驱动器的对象。","Widths of the fields.":"田地的宽度。","The location to which the file should be copied.":"文件应复制到的位置。","A read-only collection of all available drives as ":"所有可用驱动器的仅阅读集合","The combination of the specified paths.":"指定路径的组合。","Delimiters for the fields.":"该领域的分界符。"," object for the specified file.":"指定文件的对象。"," objects.":"对象。"," if existing files should be overwritten; otherwise ":"如果应该覆盖现有文件； 否则","File to be read.":"文件要读。","Boolean. ":"布尔。","Directory to be searched.":"要搜索的目录。"," object that holds the serialized object data about the exception being thrown.":"保存有关抛出异常的序列化对象数据的对象。","Name and location of the directory.":"目录的名称和位置。"," object to read from the file.":"对象从文件中读取。"," releases both managed and unmanaged resources; ":"释放托管和不受管理的资源；","Read-only collection of file names from the specified directory.":"从指定目录中读取文件名的收集。","The encoding to use for the file contents. Default is ASCII.":"用于文件内容的编码。 默认为ASCII。","Directory to be deleted.":"要删除的目录。","Required. Path to be parsed. ":"必需的。 解析路径。"," structure that contains contextual information about the source or destination.":"包含有关源或目的地的上下文信息的结构。","File to be written to.":"要写入的文件。","Specifies what should be done when a directory that is to be deleted contains files or directories. Default is ":"指定要删除的目录包含文件或目录时应该执行的操作。 默认为","The file name from the specified path.":"指定路径的文件名。"," releases only unmanaged resources.":"仅发布非管理资源。"," to append to the contents of the file; ":"附加文件的内容；","A message that describes the error.":"描述错误的消息。","Path to be examined.":"要检查的路径。","Specifies whether to visually track the operation's progress. Default is ":"指定是否在视觉上跟踪操作的进度。 默认为"," to overwrite the contents of the file. Default is ":"覆盖文件的内容。 默认为","The parent path of the provided path.":"提供路径的父路径。","The number of characters to read. Required.":"要读的字符数。 必需的。"," describing the error.":"描述错误。","Specifies whether or not the deleted file should be sent to the Recycle Bin. Default is ":"指定是否应将已删除的文件发送到回收箱。 默认为"," object to write to the specified file.":"对象写入指定文件。"," containing the full path of the temporary file.":"包含临时文件的完整路径。","Specifies whether to throw an exception if the user clicks Cancel.":"如果用户单击取消，则指定是否抛出异常。"," to append to the contents in the file; ":"附加文件中的内容；"," object that is the cause of the current exception. If the ":"是当前异常原因的对象。 如果是","A string that contains the specified number of characters read.":"包含指定数量的字符读取的字符串。","Path of the directory to be moved.":"目录的路径要移动。","Encoding to be used in writing to the file. Default is ASCII.":"编码以书面形式用于文件。 默认为ASCII。","An array of strings that contains field values for the current line.":"包含当前线的字段值的一系列字符串。","Name and path of the file to be deleted.":"要删除的文件的名称和路径。"," parameter is not a null reference (":"参数不是null引用（"," array containing the contents of the file.":"包含文件内容的数组。","Optional. A string expression that specifies a file name, directory or folder name, or drive volume label. A zero-length string (":"可选的。 指定文件名，目录或文件夹名称或驱动器卷标签的字符串表达式。 零长度字符串（","Whether or not the deleted file should be sent to the Recycle Bin. Default is ":"是否应将删除的文件发送到回收箱。 默认为","Name and path of the file to read.":"文件的名称和路径要读取。","The current line from the file or stream.":"文件或流的当前行。",") is returned if ":"如果返回）","Specifies whether or not an exception is thrown when the user cancels the operation. Default is ":"指定用户取消操作时是否抛出异常。 默认为"," in Visual Basic), the current exception is raised in a catch block that handles the inner exception.":"在Visual Basic）中，在处理内部异常的捕获块中提出了当前的异常。"," containing the contents of the file.":"包含文件的内容。","The remaining text from the file or stream.":"来自文件或流的其余文本。","Path of the directory.":"目录的路径。"," is not found.":"找不到。","Character encoding to use in reading the file. Default is UTF-8.":"字符编码用于读取文件。 默认值为UTF-8。"," if the directory exists; otherwise ":"如果存在目录； 否则","The message for the exception.":"例外的消息。","Path and name of directory to be renamed.":"要重命名的目录的路径和名称。","Array of type ":"类型数组","Optional. Enumeration or numeric expression whose value specifies file attributes. If omitted, ":"可选的。 枚举或数字表达式指定文件属性。 如果省略，",". This method also returns ":"。 此方法也返回"," returns files that match ":"返回匹配的文件","New name for directory.":"目录的新名称。","Array of ":"数组","The line number of the malformed line.":"畸形线的线号。"," if the parameter represents the name and path of a file rather than a directory.":"如果参数表示文件的名称和路径，而不是目录。","File to be renamed.":"文件要重命名。"," but have no attributes.":"但是没有属性。","New name of file.":"文件的新名称。","Name and path of the file.":"文件的名称和路径。","A string array that contains all of the comment tokens for the ":"一个字符串数组，其中包含所有注释令牌"," that is the cause of the current exception. If the ":"那是当前例外的原因。 如果是","Returns ":"返回"," that contains any valid file number.":"其中包含任何有效的文件编号。","A string representation of the current exception.":"当前异常的字符串表示。","Path and name of the file to be written to.":"要写入的文件的路径和名称。"," if the file exists; otherwise this method returns ":"如果文件存在； 否则此方法返回","A string array that contains all of the field delimiters for the ":"一个字符串数组，其中包含所有字段定界符","The path to the Application Data directory for the all users.":"所有用户的应用程序数据目录的路径。"," if the parameter represents the path of a directory rather than a file.":"如果参数代表目录而不是文件的路径。","A Boolean value ":"布尔值","Data to be written to the file.":"要写入文件的数据。"," if there is no more data to read; otherwise, ":"如果没有更多的数据要读取； 否则，","The directory to be searched.":"要搜索的目录。"," when the end of a file opened for ":"当文件打开的末尾","The path to the Application Data directory for the current user.":"当前用户的应用程序数据目录的路径。","The search text.":"搜索文字。"," to append to the file contents; ":"附加到文件内容；","The line that caused the most recent ":"造成最新的线"," or sequential ":"或顺序","The path to the Desktop directory.":"桌面目录的路径。"," if the search should be case-sensitive; otherwise ":"如果搜索应该对案例敏感； 否则"," exception.":"例外。"," to overwrite the file contents. Default is ":"覆盖文件内容。 默认为","Whether to include subfolders. Default is ":"是否包括子文件夹。 默认为"," has been reached.":"已达到。","The path to the My Documents directory.":"我的文档目录的路径。","Read-only collection of the names of files containing the specified text.":"只读包含指定文本的文件的名称。","The number of the line that caused the most recent ":"造成最新的行的数量","Text to be written to file.":"要写文件的文字。",". Any valid file number.":"。 任何有效的文件编号。","Pattern to be matched.":"要匹配的模式。"," to overwrite the contents of the file.":"覆盖文件的内容。","An integer array that contains the width of each column in the text file that is being parsed.":"一个整数数组，其中包含正在解析的文本文件中每个列的宽度。","The path to the My Music directory.":"我的音乐目录的路径。","One of the following values:  \n  \n ":"以下值之一：","Required. A string expression that specifies a file name - may include directory or folder, and drive.":"必需的。 指定文件名的字符串表达式 - 可以包括目录或文件夹以及驱动器。","What encoding to use when writing to file.":"写作时要使用的编码。","Optional. Parameter array of 0 or more channels to be closed.":"可选的。 要关闭的0个或多个通道的参数阵列。"," if fields are enclosed in quotation marks; otherwise, ":"如果字段封闭在引号中； 否则，","The path to the My Pictures directory.":"我的图片目录的路径。","Optional. Number of the first record or byte to lock or unlock.":"可选的。 锁定或解锁的第一个记录或字节的数量。","Required. Enumeration specifying the file mode: ":"必需的。 枚举指定文件模式：","The current line number.":"当前行号。","Required. A string expression that specifies the name of the file to be copied. ":"必需的。 字符串表达式指定要复制的文件的名称。",". For more information, see ":"。 有关更多信息，请参阅","The path to the Program Files directory.":"程序文件目录的路径。","Optional. Number of the last record or byte to lock or unlock.":"可选的。 锁定或解锁的最后一个记录或字节的数量。"," .":"。"," may include the directory or folder, and drive, of the source file.":"可以包括源文件的目录或文件夹和驱动器。"," value that indicates whether the file to be parsed is delimited or fixed-width.":"指示要解析的文件的值是界定的还是固定的。","Required. An integer that contains a valid file number.":"必需的。 一个包含有效文件编号的整数。","Required. A string expression that specifies the destination file name. ":"必需的。 指定目标文件名的字符串表达式。","The path to the Programs directory.":"程序目录的路径。","The size, in bytes, of a file opened by using the ":"通过使用该文件打开的文件的大小，字节","Optional. Enumeration specifying the operations permitted on the open file: ":"可选的。 枚举指定开放文件中允许的操作："," if leading and trailing white space should be trimmed from field values; otherwise, ":"如果领先和尾随的白空间应从场值中修剪； 否则，","The path to the Temp directory.":"临时目录的路径。"," may include the directory or folder, and drive, of the destination file.":"可以包括目标文件的目录或文件夹和驱动器。"," function. The ":"功能。 这","Required. A string expression that identifies which directory or folder becomes the new default directory or folder. ":"必需的。 标识哪个目录或文件夹变为新的默认目录或文件夹的字符串表达式。",". The stream to be parsed.":"。 要解析的流。","Required. A string expression that specifies a file name. ":"必需的。 指定文件名的字符串表达式。","Required. A string expression that identifies the directory to be created. The ":"必需的。 标识要创建的目录的字符串表达式。 这"," creates the new directory on the current drive.":"在当前驱动器上创建新目录。"," may include the drive. If no drive is specified, ":"可能包括驱动器。 如果未指定驱动器，",". Defaults to ":". 默认值为 "," may include the directory or folder, and the drive.":"可以包括目录或文件夹以及驱动器。","Optional. Zero or more comma-delimited expressions to write to a file.  \n  \n The ":"可选的。 零或更多逗号限制的表达式写入文件。 \n  \n  这"," argument settings are:  \n  \n ":"参数设置是：","Optional. Enumeration specifying the operations not permitted on the open file by other processes: ":"可选的。 枚举指定其他进程未允许在打开文件上的操作："," value that indicates the date and time a file was created or last modified.":"表示文件创建或最后修改的日期和时间的值。"," changes the default directory or folder on the current drive.":"更改当前驱动器上的默认目录或文件夹。",": File mode is invalid.  \n  \n ":"：文件模式无效。","Required. Any valid file number.":"必需的。 任何有效的文件编号。",", and ":"， 和","Required. String expression that specifies an existing drive. If you supply a zero-length string (\"\"), the current drive does not change. If the ":"必需的。 指定现有驱动器的字符串表达式。 如果您提供零长度字符串（“”），则当前驱动器不会更改。 如果是",": ":"：","Required. Valid variable name into which data is read.":"必需的。 有效的变量名称读取其中的数据。","Optional. Number less than or equal to 32,767 (bytes). For files opened for random access, this value is the record length. For sequential files, this value is the number of characters buffered.":"可选的。 小于或等于32,767（字节）的数字。 对于为随机访问打开的文件，此值是记录长度。 对于顺序文件，此值是被缓冲的字符数。"," argument is a multiple-character string, ":" 参数是一个多字符字符串, ","Required. Valid variable name that contains data written to disk.":"必需的。 有效的变量名称包含写入磁盘的数据。","Optional. Record number (":"可选的。 记录编号 （"," uses only the first letter.":"仅使用首字母。"," does not exist.":" 不存在。"," mode files) at which writing starts.":"模式文件）。"," mode files) or byte number (":"模式文件）或字节号（","Required. A string expression that specifies the existing file name and location. ":"必需的。 指定现有文件名和位置的字符串表达式。","A string representing the current path.":"表示当前路径的字符串。","Optional. Applies only when writing an array. Specifies whether the array is to be treated as dynamic, and whether to write an array descriptor for the string that describes the length.":"可选的。 仅在编写数组时适用。 指定数组是否被视为动态，以及是否为描述长度的字符串编写数组描述符。"," may include the directory, and drive, of the file.":"可以包括文件的目录和驱动器。"," expression that specifies an existing drive. If no drive is specified, or if ":"指定现有驱动器的表达式。 如果未指定驱动器，或者"," mode files) at which reading starts.":" 模式文件）读取开始的位置。","Required. A string expression that specifies the new file name and location. ":"必需的。 指定新文件名和位置的字符串表达式。","Optional. Applies only when writing an array. Specifies whether the array is to be treated as dynamic and whether an array descriptor describing the size and bounds of the array is necessary.":"可选的。 仅在编写数组时适用。 指定数组是否被视为动态，以及是否需要描述数组的大小和边界的数组描述符。"," may include directory and drive of the destination location. The file name specified by ":"可能包括目录和目的地位置的驱动器。 文件名由","Optional. Applies only when writing a string. Specifies whether to write a two-byte descriptor for the string that describes the length. The default is ":"可选的。 仅在编写字符串时适用。 指定是否为描述长度的字符串编写两个字节描述符。 默认值为"," cannot already exist.":"不可能存在。","Optional. Applies only when writing a string. Specifies whether to write a two-byte string length descriptor for the string to the file. The default is ":"可选择的。 仅在写入字符串时适用。 指定是否将字符串的两字节字符串长度描述符写入文件。 默认值为 ","Required. A string expression that identifies the directory or folder to be removed. ":"必需的。 标识要删除的目录或文件夹的字符串表达式。"," is a zero-length string (\"\"), ":" 是一个零长度的字符串(\"\"), ","Required. Numeric expression in the range 0-255, inclusive, which indicates how many characters appear on a line before a new line is started. If ":"必需的。 范围0-255（包含）中的数字表达式，指示在启动新线路之前出现多少个字符。 如果"," returns the path for the current drive.":"返回当前驱动器的路径。"," can include the drive. If no drive is specified, ":" 能包括驱动器。 如果未指定驱动器, "," equals 0, there is no limit to the length of a line. The default value for ":" 等于0，没有限制一条线的长度。 的默认值 ","A string representing the name of a file, directory, or folder that matches a specified pattern or file attribute, or the volume label of a drive.":"表示与指定模式或文件属性匹配的文件、目录或文件夹的名称或驱动器的卷标的字符串。"," removes the directory on the current drive.":" 删除当前驱动器上的目录。"," is 0.":" 为0。"," that contains a valid file number.":"其中包含有效的文件编号。"," expression that contains any valid file number.":" 包含任何有效文件号的表达式。","An integer value that represents the next file number available for use by the ":"一个整数值，代表下一个可以使用的下一个文件编号"," function.":"功能。"," specifying the current read/write position in a file opened by using the ":"在使用该文件中指定当前的读/写入位置","Optional. One or more comma-delimited expressions to write to a file.":"可选择的。 要写入文件的一个或多个逗号分隔表达式。","Required. A string expression that specifies a file, directory, or folder name. ":"必需的。 指定文件，目录或文件夹名称的字符串表达式。"," function, or sets the position for the next read/write operation in a file opened by using the ":" 函数，或使用 ","Required. The initial cost of the asset.":"必需的。 资产的初始成本。","Required. Number in the range 1-2,147,483,647, inclusive, that indicates where the next read/write operation should occur.":"必需的。 范围内的数字1-2,147,483,647（包括），指示下一个读/写操作的何处。"," can include the directory or folder, and the drive.":"可以包括目录或文件夹以及驱动器。","Required. The value of the asset at the end of its useful life.":"必需的。 资产在其有用生活结束时的价值。"," can include directory or folder, and drive.":"可以包括目录或文件夹以及驱动器。","A bitwise combination of the enumeration values.":"枚举值的比重组合。","Required. The length of useful life of the asset.":"需要。 资产的使用寿命长度。","Required. Variable that is assigned the values read from the file - cannot be an array or object variable.":"必需的。 分配的变量从文件中读取的值 - 不能是数组或对象变量。","Required. Constant or numeric expression, whose sum specifies file attributes.":"需要。 常量或数字表达式，其总和指定文件属性。","Required. The period for which asset depreciation is calculated.":"必需的。 计算资产折旧的期限。","Required. Any valid numeric expression specifying the number of characters to read.":"必需的。 任何有效的数字表达式指定要读取的字符数。","Required. The number of spaces to insert before displaying or printing the next expression in a list.":"必需的。 在显示或打印列表中的下一个表达式之前，要插入的空间数量。","A string that contains characters from a file opened in ":"一个字符串，其中包含来自打开的文件中字符的字符串","Optional. The rate at which the balance declines. If omitted, 2 (double-declining method) is assumed.":"可选的。 余额下降的比率。 如果省略，则假定2（双重法方法）。","Used with the ":"与","The depreciation of an asset for a specific time period using the double-declining balance method or some other method you specify.":"使用双期平衡方法或您指定的其他一些方法，在特定时间段内的资产折旧。"," mode. The ":" 模式。 该 "," function to position output.":" 功能来定位输出。"," feature gives you better productivity and performance in file I/O operations than ":"功能使您在文件I/O操作中为您提供更好的生产率和性能"," functions to position output.":"函数到定位输出。","Required. The interest rate per period. For example, if you get a car loan at an annual percentage rate (APR) of 10 percent and make monthly payments, the rate per period is 0.1/12, or 0.0083.":"需要。 期的利率。 例如，如果您以10百分比的年利率（APR）获得汽车贷款并每月付款，则每期费率为0.1/12或0.0083。","Required. A string expression that specifies one or more file names to be deleted. ":"必需的。 字符串表达式指定要删除的一个或多个文件名。","Optional. The column number moved to before displaying or printing the next expression in a list. If omitted, ":"可选的。 列号在显示或打印列表中的下一个表达式之前移动到。 如果省略，","Required. The total number of payment periods in the annuity. For example, if you make monthly payments on a four-year car loan, your loan has a total of 4 x 12 (or 48) payment periods.":"必需的。 年金中的付款期总数。 例如，如果您每月支付四年的汽车贷款付款，则您的贷款总计为4 x 12（或48）个付款期。"," moves the insertion point to the start of the next print zone.":"将插入点移至下一个打印区域的开始。","Reads a single line from an open sequential file and assigns it to a ":"从打开的顺序文件中读取一行，并将其分配给 ","Required. The payment to be made each period. Payments usually contain principal and interest that doesn't change over the life of the annuity.":"必需的。 每个时期要付款。 付款通常包含本金和利息，这些本金和利息不会随着年金的寿命而改变。"," variable.":" 变量。","Optional. The present value (or lump sum) of a series of future payments. For example, when you borrow money to buy a car, the loan amount is the present value to the lender of the monthly car payments you will make. If omitted, 0 is assumed.":"可选的。 一系列未来付款的现值（或一次性）。 例如，当您借钱购买汽车时，贷款金额是您将要支付的每月汽车付款的贷方的现值。 如果省略，则假定为0。","Required. The payment to be made each period. Payments usually contain principal and interest that does not change over the life of the annuity.":"需要。 每期付款。 付款通常包含本金和利息，在年金的生命周期内不会改变。"," file number.":"文件编号。","Optional. The future value or cash balance you want after you have made the final payment. For example, the future value of a loan is $0 because that is its value after the final payment. However, if you want to save $50,000 over 18 years for your child's education, then $50,000 is the future value. If omitted, 0 is assumed.":"可选的。 完成最后付款后，您想要的未来价值或现金余额。 例如，贷款的未来价值为$ 0，因为这是最终付款后其价值。 但是，如果您想为孩子的教育节省18年的$ 50,000，那么50,000美元是未来的价值。 如果省略，则假定为0。","The current read/write position in an open file.":"当前的读/写入位置在打开文件中。","Optional. Object of type ":"可选的。 类型的对象","The number of periods for an annuity based on periodic fixed payments and a fixed interest rate.":"基于定期固定付款和固定利率的年金期间数量。","Required. The discount rate over the length of the period, expressed as a decimal.":"必需的。 期间长度的折现率表示为十进制。","Optional. Number of the only record or byte to lock or unlock.":"可选的。 唯一要锁定或解锁的记录或字节的编号。"," that specifies when payments are due. This argument must be either ":"该指定何时到期。 这个论点必须是","The net present value of an investment based on a series of periodic cash flows (payments and receipts) and a discount rate.":"一系列定期现金流（付款和收据）和折现率的投资的净现值。",". The dimension for which the lowest possible subscript is to be returned. Use 1 for the first dimension, 2 for the second, and so on. If ":"。 将返回最低下标的尺寸。 使用1用于第一个维度，第二个维度为2，依此类推。 如果","Required. The total number of payment periods in the annuity. For example, if you make monthly payments on a four-year car loan, your loan has a total of 4 × 12 (or 48) payment periods.":"必需的。 年金中的付款期总数。 例如，如果您每月支付四年的汽车贷款付款，则您的贷款总计为4×12（或48）个付款期。"," is omitted, 1 is assumed.":"省略了，假定为1。"," if payments are due at the end of the payment period, or ":"如果付款期结束时付款，或",". The lowest value the subscript for the specified dimension can contain. ":"。 指定维度的下标可以包含的最低值。"," always returns 0 as long as ":"总是返回0"," if payments are due at the beginning of the period. If omitted, ":"如果在此期间开始付款。 如果省略，","Required. The present value (or lump sum) that a series of payments to be paid in the future is worth now. For example, when you borrow money to buy a car, the loan amount is the present value to the lender of the monthly car payments you will make.":"需要。 未来要支付的一系列付款的现值（或一次性付款）现在是值得的。 例如，当你借钱买车时，贷款金额是你每月要付的汽车贷款的现值。"," has been initialized, even if it has no elements, for example if it is a zero-length string. If ":"即使没有元素，也已经初始化了它，例如它是零长一根字符串。 如果","Optional. The future value or cash balance you want after you have made the final payment. For example, the future value of a loan is $0 because that is its value after the final payment. However, if you want to save $50,000 during 18 years for your child's education, then $50,000 is the future value. If omitted, 0 is assumed.":"可选的。 完成最后付款后，您想要的未来价值或现金余额。 例如，贷款的未来价值为$ 0，因为这是最终付款后其价值。 但是，如果您想在18年内节省50,000美元的教育，那么50,000美元是未来的价值。 如果省略，则假定为0。"," throws an ":"抛出"," is assumed.":"假设。","The payment for an annuity based on periodic, fixed payments and a fixed interest rate.":"基于定期，固定付款和固定利率的年金付款。","Required. A whole number in the range 0-15.":"必需的。 范围0-15的整数。","Required. The current value of a series of future payments or receipts. For example, when you borrow money to buy a car, the loan amount is the present value to the lender of the monthly car payments you will make.":"必需的。 一系列未来付款或收据的当前价值。 例如，当您借钱购买汽车时，贷款金额是您将要支付的每月汽车付款的贷方的现值。","The future value of an annuity based on periodic, fixed payments and a fixed interest rate.":"年金的未来价值基于定期，固定付款和固定利率。","Returns an ":"返回","The principal payment for a given period of an annuity based on periodic fixed payments and a fixed interest rate.":"根据定期固定付款和固定利率，给定年金的本金付款。","Required. The total number of payment periods in the annuity. For example, if you make monthly payments on a four-year car loan, your loan has 4 x 12 (or 48) payment periods.":"必需的。 年金中的付款期总数。 例如，如果您每月支付四年的汽车贷款付款，则您的贷款有4 x 12（或48）个付款期。","Required. The payment period in the range 1 through ":"需要。 付款期在1至1范围内 ","Required. The payment to be made each period. Payments usually contain principal and interest that does not change during the life of the annuity.":"必需的。 每个时期要付款。 付款通常包含本金和利息在年金生活中不会改变的本金和利息。","Optional. The future value or cash balance you want after you make the final payment. For example, the future value of a loan is $0 because that is its value after the final payment. However, if you want to save $50,000 over 18 years for your child's education, then $50,000 is the future value. If omitted, 0 is assumed.":"可选的。 完成最终付款后，您想要的未来价值或现金余额。 例如，贷款的未来价值为$ 0，因为这是最终付款后其价值。 但是，如果您想为孩子的教育节省18年的$ 50,000，那么50,000美元是未来的价值。 如果省略，则假定为0。","Required. The present value, or value today, of a series of future payments or receipts. For example, when you borrow money to buy a car, the loan amount is the present value to the lender of the monthly car payments you will make.":"必需的。 今天的一系列未来付款或收据的现值或价值。 例如，当您借钱购买汽车时，贷款金额是您将要支付的每月汽车付款的贷方的现值。","The present value of an annuity based on periodic, fixed payments to be paid in the future and a fixed interest rate.":"年金的现值基于定期，将来要支付的固定付款和固定利率。"," value representing the RGB color code corresponding to the specified color number.":" 表示与指定颜色编号对应的RGB颜色代码的值。","Required. The total number of payment periods in the annuity. For example, if you make monthly payments on a four-year car loan, your loan has a total of 4 * 12 (or 48) payment periods.":"必需的。 年金中的付款期总数。 例如，如果您每月支付为期四年的汽车贷款，则您的贷款总计为4 * 12（或48）个付款期。"," in the range 0-255, inclusive, that represents the intensity of the red component of the color.":"在包含在内的0-255范围内，代表颜色的红色分量的强度。","Optional. The future value or cash balance you want after you've made the final payment. For example, the future value of a loan is $0 because that's its value after the final payment. However, if you want to save $50,000 over 18 years for your child's education, then $50,000 is the future value. If omitted, 0 is assumed.":"可选的。 完成最后付款后，您想要的未来价值或现金余额。 例如，贷款的未来价值为$ 0，因为这是最终付款后的价值。 但是，如果您想为孩子的教育节省18年的$ 50,000，那么50,000美元是未来的价值。 如果省略，则假定为0。","Optional. The value you estimate is returned by ":"可选的。 您估计的价值由"," in the range 0-255, inclusive, that represents the intensity of the green component of the color.":"在包含在内的0-255范围内，代表颜色的绿色组件的强度。","The interest rate per period for an annuity.":"年金的每期利率。","The interest payment for a given period of an annuity based on periodic, fixed payments and a fixed interest rate.":"基于定期，固定付款和固定利率的给定年金的利息支付。","Required. The length of the useful life of the asset.":"必需的。 资产使用寿命的长度。","Required. Array of ":"必需的。 数组"," specifying cash flow values. The array must contain at least one negative value (a payment) and one positive value (a receipt).":"指定现金流量值。 该数组必须至少包含一个负值（付款）和一个正值（收据）。"," in the range 0-255, inclusive, that represents the intensity of the blue component of the color.":" 在0-255范围内，包括表示颜色的蓝色分量的强度。","Optional. Object specifying value you estimate will be returned by ":"可选的。 指定您估计值的对象将由"," value representing an RGB color value from a set of red, green and blue color components.":"从一组红色，绿色和蓝色组件中代表RGB颜色值的值。","The straight-line depreciation of an asset for a single period.":"资产在一个时期内的直线折旧.",". If omitted, ":"。 如果省略，"," variable containing a Visual Basic type name.":"包含视觉基本类型名称的变量。","The sum-of-years digits depreciation of an asset for a specified period.":"年度数字数字在指定期间的资产折旧。"," value containing the system data type name of a variable.":"包含变量的系统数据类型名称的值。"," is 0.1 (10 percent).":"为0.1（10％）。"," value containing data-type information about a variable.":"包含有关变量的数据类型信息的值。","Returns an integer indicating the line number of the last executed statement. Read-only.":"返回一个整数，指示最后执行的语句的行号。 只读。","Required. Array of any data type. The array in which you want to find the highest possible subscript of a dimension.":"必需的。 任何数据类型的数组。 您想找到的尺寸最高下标。","Contains information about run-time errors.":"包含有关运行时错误的信息。","The internal rate of return for a series of periodic cash flows (payments and receipts).":"一系列定期现金流（付款和收据）的内部收益率。",". The dimension for which the highest possible subscript is to be returned. Use 1 for the first dimension, 2 for the second, and so on. If ":"。 返回最高的下标的维度。 使用1用于第一个维度，第二个维度为2，依此类推。 如果","Returns a ":"返回a"," specifying cash-flow values. The array must contain at least one negative value (a payment) and one positive value (a receipt).":"指定现金流量值。 该数组必须至少包含一个负值（付款）和一个正值（收据）。",". The highest value the subscript for the specified dimension can contain. If ":"。 指定维度的下标可以包含的最高值。 如果"," value indicating whether a variable points to an array.":"值指示变量是否指向数组。"," has only one element, ":"只有一个元素，"," value indicating whether an expression represents a valid ":"表示表达是否表示有效的值","Required. The interest rate paid as the cost of financing.":"必需的。 利率作为融资成本支付。"," returns 0. If ":"返回0.如果"," value indicating whether an expression evaluates to the ":"表示表达式是否评估的值","Required. The interest rate received on gains from cash reinvestment.":"必需的。 从现金再投资中获得的利率获得的利率。"," has no elements, for example if it is a zero-length string, ":"没有元素，例如，如果它是零长度字符串，"," value indicating whether an expression is an exception type.":"值表示表达是否是异常类型。","The modified internal rate of return for a series of periodic cash flows (payments and receipts).":"一系列定期现金流量（付款和收据）的内部收益率修改了。"," returns -1.":"返回-1。"," value indicating whether an expression has no object assigned to it.":"表示表达式是否没有分配的对象的值。"," value containing the data type classification of a variable.":"包含变量的数据类型分类的值。"," value indicating whether an expression can be evaluated as a number.":"值表明表达式是否可以评估为数字。"," data type, to a list of ":"数据类型，列表"," variable containing a type name used by the common language runtime.":"变量包含通用语言运行时使用的类型名称。"," value containing the Visual Basic data type name of a variable.":"包含变量的可视基本数据类型名称的值。"," value indicating whether an expression evaluates to a reference type.":"表示表达式是否评估参考类型的值。"," specifying the Win32 process ID number assigned to this process. You can use the ID returned by the ":"指定分配给此过程的WIN32进程ID编号。 您可以使用ID","Required. Array of any data type. The array in which you want to find the lowest possible subscript of a dimension.":"必需的。 任何数据类型的数组。 您想要找到尺寸的最低下标。"," variables or expressions separated by commas, or to a single-dimensional array of ":" 用逗号分隔的变量或表达式，或到 ",", provided it is not zero.":"，只要它不是零。","  \n  \n [2|2] Required. ":"[2 | 2]必需。"," elements.":"元素。"," expression specifying the title in the title bar of the application you want to activate. You can use the title assigned to the application when it was launched.":"表达式在要激活的应用程序标题栏中指定标题。 启动时，您可以使用分配给该应用程序的标题。",". The name of the application providing the object.  \n  \n [3|1] ":"。 提供对象的应用程序的名称。 \n  \n  [3 | 1]","Selects and returns a value from a list of arguments.":"从参数列表中选择并返回值。",". Numeric expression that results in a value between 1 and the number of elements passed in the ":"。 数字表达式导致值1和传递的元素数量之间的值","  \n  \n [3|2] Required. ":"[3 | 2]必需。"," argument.":"争论。",". The type or class of object to create.":"。 要创建的对象类型或类别。"," parameter array. You can supply either a single variable or an expression that evaluates to the ":"参数阵列。 您可以提供一个评估的单个变量或表达式","The argument portion of the command line used to start Visual Basic or an executable program developed with Visual Basic.  \n  \n The ":"命令行的参数部分，用于启动Visual Basic或使用Visual Basic开发的可执行程序。  \n  \n 该 "," feature provides greater productivity and performance than the ":"功能提供了比","A reference to an object provided by a COM component.":"对COM组件提供的对象的引用。"," function. For more information, see ":"功能。 有关更多信息，请参阅"," expression containing the name of the application or project whose key setting is requested.":"包含请求密钥设置的应用程序或项目名称的表达式。"," uses -1, which means there is no timeout and ":" 使用-1，这意味着没有超时和 ",". The program ID of the object to create.":"。 要创建对象的程序ID。"," does not return until the program finishes. Therefore, if you omit ":"直到程序完成后才返回。 因此，如果您省略",". The name of the network server where the object will be created. If ":"。 将创建对象的网络服务器的名称。 如果"," or set it to -1, it is possible that ":"或将其设置为-1，有可能"," expression containing the name of the section in which the key setting is found.":" 包含在其中找到密钥设置的部分的名称的表达式。"," might never return control to your program.":"可能永远不会返回您的程序。"," expression containing the name of the key setting to return.":"表达式包含要返回的密钥设置的名称。","An integer containing the program's process ID if it is still running. 0 if the program already finished executing.":"如果程序ID仍在运行，则包含程序ID。 0如果程序已经完成执行。","Required. A string expression that specifies a file. ":"需要。 指定文件的字符串表达式。 ","Optional. Expression containing the value to return if no value is set in the ":"可选的。 表达式包含值返回的值，如果未在"," parameter array. Must have an even number of elements. You can supply a list of ":"参数阵列。 必须具有均匀数量的元素。 您可以提供一个清单"," setting. If omitted, ":"环境。 如果省略，",". Indicates whether to look for byte order marks at the beginning of the file. Default is ":"。 指示是否在文件开头查找字节订单标记。 默认为","The length of a file in bytes.":"字节中的文件长度。"," variables or expressions separated by commas, or a single-dimensional array of ":"变量或表达式由逗号分隔，或单维数组"," is assumed to be a zero-length string (\"\").":"假定为零长度字符串（“”）。","Required. Any valid file number. Use the ":"必需的。 任何有效的文件编号。 使用",". Indicates whether to leave ":"。 指示是否离开","A key setting value from an application's entry in the Windows registry.  \n  \n The ":"来自Windows注册表中应用程序的条目的键设置值。 \n  \n  这",". The expression you want to evaluate.":"。 您要评估的表达。"," function to obtain the next available file number.":"功能以获取下一个可用的文件编号。"," open when the ":"打开",". Returned if ":"。 如果返回"," is omitted, the ":"被省略了，"," evaluates to ":"评估"," setting determines the type of comparison.":"设置确定比较的类型。"," object is closed. Default is ":"对象已关闭。 默认为","Returns one of two objects, depending on the evaluation of an expression.":"返回两个对象之一，具体取决于表达式的评估。","Required. String expression being searched.":"必需的。 搜索字符串表达式。"," is an empty string (\"\"), the local computer is used.":" 为空字符串(\"\")，则使用本地计算机。","Required ":"必需的","Required. String expression being searched for.":"必需的。 搜索字符串表达式。","Creates and returns a reference to a COM object. ":"创建并返回对COM对象的引用。"," expression displayed as the message in the dialog box. The maximum length of ":"表达式显示为对话框中的消息。 最大长度",". The ":". 该 ","Optional. Numeric expression setting the one-based starting position for each search, starting from the left side of the string. If ":"可选的。 数字表达式从字符串的左侧开始设置每个搜索的一个基于一个基于的启动位置。 如果"," cannot be used to create instances of classes in Visual Basic unless those classes are explicitly exposed as COM components.":"除非这些类被明确公开为COM组件，否则不能用于在Visual Basic中创建类的实例。"," is approximately 1024 characters, depending on the width of the characters used. If ":"约为1024个字符，具体取决于使用的字符宽度。 如果"," stream to be parsed.":"流进行解析。"," expression containing the name of the application or project to which the section or key setting applies.":"包含应用程序或密钥设置的应用程序或项目名称的表达式。"," is omitted then -1 is used, meaning the search begins at the last character position. Search then proceeds from right to left.":"然后省略-1使用，这意味着搜索从最后一个字符的位置开始。 然后搜索从右到左进行。"," consists of more than one line, you can separate the lines using a carriage return character (":"由多个行组成，您可以使用托架返回字符分开行（"," expression containing the name of the section from which the key setting is being deleted. If only ":"表达式包含删除关键设置的部分的名称。 要是","Optional. Numeric value indicating the kind of comparison to use when evaluating substrings. If omitted, a binary comparison is performed. See Settings for values.":"可选的。 数值值表示评估子字符串时使用的比较类型。 如果省略，进行二进制比较。 有关值，请参见设置。",". The complete path of the file to be parsed.":"。 文件的完整路径要解析。"," are provided, the specified section is deleted along with all related key settings.":"提供了指定部分与所有相关的关键设置一起删除。","Required. One-dimensional array containing substrings to be joined.":"必需的。 一维阵列包含要连接的子字符串。","A string that consists of all the characters starting from the specified position in the string.":"一个由从字符串中指定的位置开始的所有字符组成的字符串。"," expression containing the name of the key setting being deleted.":"包含删除密钥设置名称的表达式。","13":"13","Optional. Any string, used to separate the substrings in the returned string. If omitted, the space character (\" \") is used. If ":"可选的。 任何用于分离返回字符串中的子字符串的字符串。 如果省略，则使用空间字符（“”）。 如果"," is one based.":"是一个基础。","Required. Expression that evaluates either a string containing the name of an environment variable, or an integer corresponding to the numeric order of an environment string in the environment-string table.":"必需的。 评估包含环境变量名称的字符串或与环境弦表中环境字符串的数字顺序相对应的整数。","), a line feed character (":"），线供稿字符（"," is a zero-length string (\"\") or ":"是零长度字符串（“”）或"," expression. Number of characters to return. If omitted or if there are fewer than ":"表达。 返回的字符数。 如果省略或少于","The string associated with an operating-system environment variable.":"与操作系统环境变量关联的字符串。","10":"10",", all items in the list are concatenated with no delimiters.":"，列表中的所有项目均不定义。"," characters in the text (including the character at position ":"文本中的字符（包括位置的字符"," expression containing the name of the application or project whose key settings are requested.":"包含请求关键设置的应用程序或项目名称的表达式。","), or a carriage return/line feed combination (":"），或托架返回/线饲料组合（","A string created by joining a number of substrings contained in an array.":"通过连接数组中包含的许多子字符串创建的字符串。"," expression containing the name of the section whose key settings are requested. ":"表达式包含请求其关键设置的部分的名称。"," & ":"和","A string or character converted to lowercase.":"字符串或字符转换为小写。"," returns an object that contains a two-dimensional array of strings. The strings contain all the key settings in the specified section, plus their corresponding values.":"返回包含二维字符串的对象。 字符串包含指定部分中的所有关键设置，以及它们的相应值。","), all characters from the start position to the end of the string are returned.":")，返回从开始位置到字符串末尾的所有字符。",") between each line.":"）每行之间。"," expression from which the leftmost characters are returned.":"返回最左边字符的表达式。","A list of key settings and their respective values (originally created with ":"关键设置及其各自值的列表（最初是用","A string that consists of the specified number of characters starting from the specified position in the string.":"由从字符串中指定的位置开始的指定数量字符组成的字符串。"," expression displayed in the title bar of the dialog box. If you omit ":"表达式显示在对话框的标题栏中。 如果您省略",") from an application's entry in the Windows registry.  \n  \n Using the ":"）从Windows注册表中的应用程序的条目中。 \n  \n  使用"," expression. Numeric expression indicating how many characters to return. If 0, a zero-length string (\"\") is returned. If greater than or equal to the number of characters in ":"表达。 数字表达式表示要返回多少个字符。 如果0，则返回零长度字符串（“”）。 如果大于或等于字符的数量","Required. String expression containing substring to replace.":"必需的。 字符串表达式包含substring替换。",", the application name is placed in the title bar.":"，应用程序名称放在标题栏中。"," feature gives you greater productivity and performance in registry operations than ":"功能使您在注册表操作中的生产率和表现要比",", the entire string is returned.":"，返回整个字符串。",". The full path and name of the file containing the object to retrieve. If ":"。 包含要检索对象的文件的完整路径和名称。 如果","A string containing a specified number of characters from the left side of a string.":"一个字符串，其中包含字符串左侧的指定数量字符。"," is omitted, ":"被省略了，","Any valid ":"任何有效"," is required.":"是必须的。"," expression or variable name. If ":"表达式或可变名称。 如果","Required. Substring being searched for.":"需要。 正在搜索的子字符串。"," function returns the size as it will be written to the file by the ":"函数返回大小，因为它将写入文件","Required if ":"如果需要 ","An integer containing either the number of characters in a string or the nominal number of bytes required to store a variable.":"一个包含字符串中字符数的整数或存储变量所需的标称字节数。"," is not supplied. ":"不提供。"," expression. Name of string variable.":"表达。 字符串变量的名称。",". A string representing the class of the object. The ":"。 代表对象类的字符串。 这","Required. Replacement substring.":"需要。 替换子字符串。"," argument has the following syntax and parts:  \n  \n ":"参数具有以下语法和部分：","Optional. Position within ":"可选的。 位置","  \n  \n [1|1] Parameter  \n  \n [1|2] Description  \n  \n [2|1] ":"[1 | 1]参数 \n  \n  [1 | 2]描述 \n  \n  [2 | 1]"," that starts a substring used for replacement. The return value of ":"这开始了用于替换的子字符串。 返回值的"," expression. Length of returned string.":" 表达。 返回字符串的长度。"," is a string that begins at ":"是一个开始的字符串","A left-aligned string containing the specified string adjusted to the specified length.":"左对准字符串，其中包含调整到指定长度的指定字符串。",", with appropriate substitutions. If omitted, 1 is assumed.":"，有适当的替代。 如果省略，则假定为1。","A string containing a copy of a specified string with no leading spaces (":"一个包含没有领先空间的指定字符串副本的字符串（","Optional. Number of substring substitutions to perform. If omitted, the default value is -1, which means \"make all possible substitutions.\"":"可选的。 要执行的基因替代数。 如果省略，默认值为-1，则意味着“使所有可能的替换”。","), no trailing spaces (":"），没有落后的空间（","Optional. Numeric value indicating the kind of comparison to use when evaluating substrings. See Settings for values.":"可选的。 数值值表示评估子字符串时使用的比较类型。 有关值，请参见设置。","), or no leading or trailing spaces (":"），或没有前导或尾随空格（","One of the following values.\n          ":"以下值之一。\n          "," expression from which characters are returned.":"返回字符的表达。"," expression from which the rightmost characters are returned.":"返回最右字符的表达式。"," expression. Starting position of the characters to return. If ":"表达。 角色返回的开始位置。 如果",". Numeric expression indicating how many characters to return. If 0, a zero-length string (\"\") is returned. If greater than or equal to the number of characters in ":"。 数字表达式表示要返回多少个字符。 如果0，则返回零长度字符串（“”）。 如果大于或等于字符的数量"," is greater than the number of characters in ":"大于字符的数量","A string containing a specified number of characters from the right side of a string.":"一个字符串，该字符串从字符串的右侧包含指定数量的字符。"," function returns a zero-length string (\"\"). ":"函数返回零长度字符串（“”）。","A right-aligned string containing the specified string adjusted to the specified length.":"一个右对齐的字符串，其中包含调整到指定长度的指定字符串。"," expression. The number of spaces you want in the string.":"表达。 您在字符串中想要的空间数量。"," value corresponding to the first expression in the list that is ":"对应于列表中第一个表达式的值",". Initializes the ":"。 初始化"," expression displayed in the text box as the default response if no other input is provided. If you omit ":" 如果未提供其他输入，则在文本框中显示为默认响应的表达式。 如果省略 "," property. The compiler generates accessor properties for classes that derive from this type.":"财产。 编译器生成了从这种类型的类生成访问属性。",", the displayed text box is empty.":"，显示的文本框是空的。"," property. Specifies the method in the class that creates the type's instances.":"财产。 指定创建类型实例的类中的方法。","Optional. Numeric expression that specifies, in twips, the distance of the left edge of the dialog box from the left edge of the screen. If you omit ":"可选的。 数字表达式指定对话框左边缘与屏幕左边缘的左边缘的距离。 如果您省略"," property. Specifies the method in the class that disposes of the type's instances.":"财产。 指定同类处理类型实例的方法。",", the dialog box is centered horizontally.":"，对话框水平为中心。"," property. Specifies the name of the property that returns the default instance of the class.":"财产。 指定返回类的默认实例的属性名称。","Optional. Numeric expression that specifies, in twips, the distance of the upper edge of the dialog box from the top of the screen. If you omit ":"可选的。 数字表达式指定对话框上边缘与屏幕顶部的上边缘的距离。 如果您省略","Specifies the method in the class that creates the type's instances.":"指定创建类型实例的类中的方法。",", the dialog box is positioned vertically approximately one-third of the way down the screen.":"，对话框垂直放置约三分之一的位置。","Specifies the name of the property that returns the default instance of the class.":"指定返回类的默认实例的属性名称。","Displays a prompt in a dialog box, waits for the user to input text or click a button, and then returns a string containing the contents of the text box.":"在对话框中显示一个提示符，等待用户输入文本或单击按钮，然后返回包含文本框内容的字符串。","Specifies the method in the class that disposes of the type's instances.":"指定同类处理类型实例的方法。","), or a carriage return/linefeed character combination (":"），或托架返回/线喂养字符组合（","Specifies the name of the type for which the compiler generates accessor properties.":"指定编译器生成访问者属性的类型的名称。","Optional. Numeric expression that is the sum of values specifying the number and type of buttons to display, the icon style to use, the identity of the default button, and the modality of the message box. If you omit ":"可选的。 数字表达式是指定要显示的按钮的数量和类型的值的总和，使用的图标样式，默认按钮的身份以及消息框的模态。 如果您省略"," expression. If ":"表达。 如果",", the default value is zero.":"，默认值为零。"," expression, only the first character of the string is used for input. If ":"表达式，仅将字符串的第一个字符用于输入。 如果","One of the following values:\n          ":"以下值之一："," or contains no characters, an ":"或不包含字符，一个",". Whole number that you want to locate within one of the calculated ranges.":"。 您要在一个计算的范围内定位的整数。","The character code corresponding to a character.":"字符代码与字符相对应。",". Whole number that indicates the start of the set of calculated ranges. ":"。 表示一组计算范围的开始的整数。"," expression representing the ":"表示表示"," cannot be less than 0.":"不能小于0。",", or character code, for the character.":"或字符代码，为角色。",". Whole number that indicates the end of the set of calculated ranges. ":"。 指示计算范围集的结束的整数。"," cannot be less than or equal to ":"不能小于或等于","The character associated with the specified character code.":"与指定字符代码关联的字符。",". Whole number that indicates the size of each range calculated between ":"。 整个数字指示每个范围的大小计算","Required. One-dimensional array of strings to be searched.":"必需的。 一维字符串要搜索。"," cannot be less than 1.":"不能小于1。","Required. String to search for.":"必需的。 搜索的字符串。","A string representing the calculated range that contains a number.":"代表包含数字的计算范围的字符串。"," value indicating whether to return substrings that include or exclude ":"表示是否返回包含或排除的子字符串的值"," expression containing the name of the application or project to which the setting applies.":"表达式包含应用程序应用的应用程序或项目的名称。",", the ":"， 这"," expression containing the name of the section in which the key setting is being saved.":"表达式包含保存关键设置的部分的名称。"," function returns the subset of the array that contains ":"函数返回包含数组的子集"," expression containing the name of the key setting being saved.":"表达式包含要保存的密钥设置的名称。"," as a substring. If ":"作为子字符串。 如果","Required. Expression containing the value to which ":"必需的。 表达式包含所在的值"," function returns the subset of the array that does not contain ":"函数返回不包含的数组的子集"," is being set.":"正在设置。"," as a substring.":"作为子字符串。",". Name of the program to execute, together with any required arguments and command-line switches. ":"。 执行程序的名称以及任何必需的参数和命令行交换机。","Optional. Numeric value indicating the kind of string comparison to use. See \"Settings\" for values.":"可选的。 数值值表示使用的字符串比较类型。 有关值，请参见“设置”。"," can also include the drive and the directory path or folder.  \n If you do not know the path to the program, you can use the ":"还可以包括驱动器和目录路径或文件夹。 \n  如果您不知道该程序的路径，则可以使用","A zero-based array containing a subset of a ":"一个基于零的数组，该数组包含一个子集"," to locate it. For example, you can call ":"找到它。 例如，您可以致电"," array based on specified filter criteria.":"基于指定过滤器标准的数组。",", which returns the full path of every file named ":"，返回每个名称的文件的完整路径","Required. Any valid expression.":"必需的。 任何有效的表达。"," anywhere on drive C:\\.":"驱动器上的任何地方C：\\。","Optional. A valid named or user-defined format ":"可选的。 有效的命名或用户定义格式",". A value chosen from the ":"。 从","A string formatted according to instructions contained in a format ":"根据格式中包含的说明进行格式格式的字符串"," specifying the style of the window in which the program is to run. If ":"指定程序要运行的窗口的样式。 如果","Required. Expression to be formatted.":"必需的。 表达式要格式化。"," uses ":"用途","Optional. Numeric value indicating how many places are displayed to the right of the decimal. Default value is -1, which indicates that the computer's regional settings are used.":"可选的。 数值值指示在小数的右侧显示了多少位。 默认值为-1，指示使用计算机的区域设置。",", which starts the program minimized and with focus.":"，这开始了该程序最小化并以重点为单位。"," enumeration that indicates whether or not a leading zero is displayed for fractional values. See \"Remarks\" for values.":"指示是否针对分数值显示领先零的枚举。 有关价值观，请参见“备注”。",". A value indicating whether the ":"。 指示是否表示是否"," enumeration that indicates whether or not to place negative values within parentheses. See \"Remarks\" for values.":"表明是否将负值放置在括号内的枚举。 有关价值观，请参见“备注”。"," function should wait for completion of the program. If ":"功能应等待完成程序的完成。 如果"," enumeration that indicates whether or not numbers are grouped using the group delimiter specified in the computer's regional settings. See \"Remarks\" for values.":"指示是否使用计算机区域设置中指定的组定界符对数字进行分组的枚举。 有关价值观，请参见“备注”。",". The number of milliseconds to wait for completion if ":"。 如果","An expression formatted as a currency value using the currency symbol defined in the system control panel.":"使用系统控制面板中定义的货币符号格式为货币值的表达式。"," expression to be formatted.":"表达式要格式化。","Optional. Numeric value that indicates the date/time format used. If omitted, ":"可选的。 表示所使用的日期/时间格式的数字值。 如果省略，","A string expression representing a date/time value.":"表示日期/时间值的字符串表达式。","Optional. Numeric value indicating how many places are displayed to the right of the decimal. The default value is -1, which indicates that the computer's regional settings are used.":"可选的。 数值值指示在小数的右侧显示了多少位。 默认值为-1，指示使用计算机的区域设置。","A string consisting of the specified number of spaces.":"由指定数量的空格组成的字符串。"," constant that indicates whether a leading 0 is displayed for fractional values. See \"Settings\" for values.":"常数指示是否针对分数值显示领先0。 有关值，请参见“设置”。"," expression containing substrings and delimiters.":"表达式包含子字符串和定界符。"," constant that indicates whether to place negative values within parentheses. See \"Settings\" for values.":"常数表示是否将负值放置在括号内。 有关值，请参见“设置”。"," constant that indicates whether or not numbers are grouped using the group delimiter specified in the locale settings. See \"Settings\" for values.":"常数指示是否使用本地设置中指定的组定界符分组数字。 有关值，请参见“设置”。","An expression formatted as a number.":"表达式格式为数字。","Optional. Numeric value indicating how many places to the right of the decimal are displayed. Default value is -1, which indicates that the locale settings are used.":"可选的。 数值值指示显示小数右侧的位置有多少位。 默认值为-1，指示使用该语言环境设置。"," constant that indicates whether or not a leading zero displays for fractional values. See \"Settings\" for values.":"常数指示分数值是否为分数值显示零显示。 有关值，请参见“设置”。"," constant that indicates whether or not to place negative values within parentheses. See \"Settings\" for values.":"常数表示是否在括号内放置负值。 有关值，请参见“设置”。","An expression formatted as a percentage (that is, multiplied by 100) with a trailing % character.":"表达式格式为一个百分比（即乘以100）和尾随％字符。"," expression. The (1-based) index of the character in ":"表达。 字符的（基于1的）索引"," to be returned.":"要返回。"," value representing the character from the specified index in the supplied string.":"从提供的字符串中指定的索引代表字符的值。","Optional. Numeric expression that sets the starting position for each search. If omitted, search begins at the first character position. The start index is 1-based.":"可选的。 数字表达式设置每个搜索的起始位置。 如果省略，搜索将在第一个字符位置开始。 开始索引是1个基于1的。"," expression being searched.":"表达式正在搜索。"," expression sought.":"表达寻求。","Optional. Specifies the type of string comparison. If ":"可选的。 指定字符串比较的类型。 如果"}