{"The string that is the value of the current ":"是当前值的字符串","The number of base characters, surrogate pairs, and combining character sequences in this ":"基本字符的数量，替代对以及在此组合字符序列的数量","An array that consists of a single element for which the value is always the current era.":"一个由单个元素组成的数组，该元素始终是当前时代。"," parameter and starts from the text element index specified by the ":"参数，并从文本元素索引开始"," class, which is equivalent to the first moment of January 1, 1912 C.E. in the Gregorian calendar.":"班级，相当于1912年1月1日在格里高利日历中的第一刻。","An array that consists of a single element having a value that is always the current era.":"一个由单个元素组成的数组，其值始终是当前时代。"," class, which is equivalent to the first moment of February 18, 1912 C.E. in the Gregorian calendar.":"班级，相当于1912年2月18日在格里高利日历中的第一时刻。"," if the enumerator has passed the end of the string.":"如果枚举者已通过了字符串的末端。"," class, which is equivalent to the last moment of February 10, 2051 C.E. in the Gregorian calendar.":" 类，这相当于公历2051年2月10日C.E.的最后时刻。","An object containing the current text element in the string.":"字符串中包含当前文本元素的对象。","The index of the text element that the enumerator is currently positioned over.":"枚举者当前位于文本元素的索引。","A new string containing the current text element in the string being read.":"包含正在读取的字符串中的当前文本元素的新字符串。","The specified character converted to lowercase.":"指定的字符转换为小写。"," if the enumerator was successfully advanced to the next text element; ":"如果枚举者成功地推进了下一个文本元素；","The character to convert to lowercase.":"转换为小写的角色。"," represents the same writing system as the current ":"代表与当前相同的写作系统","The string to convert to title case.":"转换为标题案例的字符串。","The specified string converted to lowercase.":"指定的字符串转换为小写。","The specified string converted to title case.":"指定的字符串转换为标题案例。","The string to convert to lowercase.":"转换为小写的字符串。","The specified string converted to uppercase.":"指定的字符串转换为大写。","The specified character converted to uppercase.":"指定的字符转换为大写。","The character to convert to uppercase.":"转换为大写的字符。","The EBCDIC code page used by the writing system represented by the current ":"编写系统使用的EBCDIC代码页面由当前表示","The ANSI code page used by the writing system represented by the current ":"当前表示的写作系统使用的ANSI代码页","A number that identifies the culture from which the current ":"一个数字，用于标识当前所在的区域性 ","The string that separates items in a list.":"将列表中的项目分开的字符串。","The string to convert to uppercase.":"转换为大写的字符串。","The Macintosh code page used by the writing system represented by the current ":"当前表示的写作系统使用的Macintosh代码页","The OEM code page used by the writing system represented by the current ":"编写系统使用的OEM代码页面由当前表示"," if text flows from right to left; otherwise, ":"如果文本从右向左流动； 否则，"," object was created.":"创建了对象。","The date to which to add months. The ":"增加几个月的日期。 这","The date yielded by adding the number of years specified by the ":"通过添加由","A 1-based positive integer that represents the week of the year that includes the date in the ":"一个基于1的正整数，代表一年中的一周，其中包括日期","The date yielded by adding the number of months specified by the ":"通过添加由","An integer from 1 through 30 that represents the day of the month specified by the ":"一个从1到30的整数，代表由","The date value to read. The ":"要读取的日期值。 这"," class supports only dates from 04/30/1900 00.00.00 (Gregorian date) through 11/16/2077 23:59:59 (Gregorian date).":"课程仅支持日期为04/30/1900 00.00.00（Gregorian Date）至11/16/2077 23:59:59（Gregorian Date）。","The date to which to add years. The ":"增加数年的日期。 这","An integer from 1 through 355 that represents the day of the year specified by the ":"从1到355的整数，表示由 "," value that represents the day of the week specified by the ":" 表示由 ","Always returns the ":"总是返回","The number of days in the specified month in the specified year and era. The return value is 29 in a common year and 30 in a leap year.":"指定年度和时代指定月份的天数。 回报价值在普通年中为29，在leap年中为30。","An integer from 1 through 12 that represents a month.":"一个代表一个月的1到12个整数。","An integer that represents the year specified by the ":"代表由","The date value to read.":"要读取的日期值。"," class does not support leap months.":"课程不支持Leap月。","An integer from 0 through 23 that represents an hour.":"一个从0到23的整数，表示一个小时。","A 2-digit year from 0 through 99, or a 4-digit Um Al Qura calendar year from 1318 through 1450.":"从0到99的2位年份，或者是1318年至1450年的4位数字的Um Qura日历年。","An integer from 1 through 30 that represents a day.":"一个代表一天的1到30的整数。","A 16-element byte array containing values with which to initialize the GUID.":"一个16个元素字节阵列，其中包含可以初始化GUID的值。","An array that consists of a single element having a value that is ":"一个由一个具有值为值的单个元素组成的数组","An integer from 1 through 12 that represents the month in the date specified by the ":"一个从1到12的整数，代表由"," class does not support leap days.":"课程不支持Leap Days。","An integer from 0 through 59 that represents a minute.":"从0到59的整数，表示一分钟。","The first 4 bytes of the GUID.":"GUID的前4个字节。","Always 12.":"总是12。"," class, which is equivalent to the last moment of November 16, 2077 C.E. in the Gregorian calendar.":" 类，这相当于公历2077年11月16日C.E.的最后时刻。","An integer from 1 through 29 that represents a day.":"从1到29的整数代表一天。","The remaining 8 bytes of the GUID.":"GUID的其余8个字节。","A new GUID object.":"一个新的GUID对象。"," class, which is equivalent to the first moment of April 30, 1900 C.E. in the Gregorian calendar.":"班级，相当于1900年4月30日在格里高利日历中的第一时刻。","A read-only span containing the bytes representing the GUID. The span must be exactly 16 bytes long.":"仅读取的跨度包含代表GUID的字节。 跨度必须完全16个字节。","An integer from 0 through 59 that represents a second.":"从0到59的整数，表示秒。","The next 2 bytes of the GUID.":"GUID的接下来的2个字节。","A read-only span of characters representing one of the following specifiers that indicates the exact format to use when interpreting ":"仅读取字符的跨度跨度代表以下指示符之一，该指示器指示解释时要使用的确切格式","An integer from 0 through 999 that represents a millisecond.":"一个从0到999的整数代表毫秒。","A string that contains a GUID in one of the following formats (\"d\" represents a hexadecimal digit whose case is ignored):  \n  \n 32 contiguous hexadecimal digits:  \n  \n dddddddddddddddddddddddddddddddd  \n  \n -or-  \n  \n Groups of 8, 4, 4, 4, and 12 hexadecimal digits with hyphens between the groups. The entire GUID can optionally be enclosed in matching braces or parentheses:  \n  \n dddddddd-dddd-dddd-dddd-dddddddddddd  \n  \n -or-  \n  \n {dddddddd-dddd-dddd-dddd-dddddddddddd}  \n  \n -or-  \n  \n (dddddddd-dddd-dddd-dddd-dddddddddddd)  \n  \n -or-  \n  \n Groups of 8, 4, and 4 hexadecimal digits, and a subset of eight groups of 2 hexadecimal digits, with each group prefixed by \"0x\" or \"0X\", and separated by commas. The entire GUID, as well as the subset, is enclosed in matching braces:  \n  \n {0xdddddddd, 0xdddd, 0xdddd,{0xdd,0xdd,0xdd,0xdd,0xdd,0xdd,0xdd,0xdd}}  \n  \n All braces, commas, and \"0x\" prefixes are required. All embedded spaces are ignored. All leading zeros in a group are ignored.  \n  \n The hexadecimal digits shown in a group are the maximum number of meaningful hexadecimal digits that can appear in that group. You can specify from 1 to the number of hexadecimal digits shown for a group. The specified digits are assumed to be the low-order digits of the group.":"以下格式之一中包含GUID的字符串（“ D”代表忽略案例的十六进制数字）：\n  \n 32连续的十六进制数字：\n  \n DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\n  \n -或者-\n  \n 两组之间有连字符的8、4、4、4和12个十六进制数字的组。可以选择将整个GUID包含在匹配的括号或括号中：\n  \n DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\n  \n -或者-\n  \n {DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD}\n  \n -或者-\n  \n （DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD）\n  \n -或者-\n  \n 8、4和4个十六进制数字的组，以及八组的2个十六进制数字的子集，每组由“ 0x”或“ 0x”前缀，并由逗号隔开。整个GUID以及子集都包含在匹配的括号中：\n  \n {0xddddddd，0xddd，0xddd，{0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd}}}}}\n  \n 需要所有括号，逗号和“ 0x”前缀。所有嵌入式空间都被忽略。一组中的所有领先零都被忽略。\n  \n 一组中显示的十六进制数字是该组中可能出现的有意义的十六进制数字的数量。您可以从1到一个组显示的十六进制数字指定。假定指定的数字是组的低阶数字。","A read-only span containing the bytes representing a GUID.":"包含表示GUID的字节的只读跨度。","The next byte of the GUID.":"GUID的下一个字节。","A 16-element byte array.":"16个元素字节阵列。"," that has the same value as this instance; otherwise, ":"具有与此实例相同的值； 否则，","A structure that contains the value that was parsed.":"包含解析值的结构。",": \"N\", \"D\", \"B\", \"P\", or \"X\".":"：“ n”，“ d”，“ b”，“ p”或“ x”。","A single format specifier that indicates how to format the value of this ":"单个格式说明符，指示如何格式化该值的值",", formatted by using the \"D\" format specifier as follows:  \n  \n ":"，通过使用“ D”格式指定符格式如下：","A read-only span containing the characters representing the GUID to convert.":"仅读取的跨度包含代表转换GUID的字符。","When this method returns, the GUID as a span of characters.":"当此方法返回时，GUID作为字符的跨度。","The GUID to convert.":"转换的GUID。"," parameter can be \"N\", \"D\", \"B\", \"P\", or \"X\". If ":"参数可以为“ n”，“ d”，“ b”，“ p”或“ x”。 如果","A read-only span containing the character representing one of the following specifiers that indicates the exact format to use when interpreting ":"仅读取的跨度包含代表以下指示符之一的字符，该字符指示解释时要使用的确切格式","One of the following specifiers that indicates the exact format to use when interpreting ":"以下说明符之一，指示解释时要使用的确切格式","  \n  \n where the value of the GUID is represented as a series of lowercase hexadecimal digits in groups of 8, 4, 4, 4, and 12 digits and separated by hyphens. An example of a return value is \"382c74c3-721d-4f34-80e5-57657b6cbc27\". To convert the hexadecimal digits from a through f to uppercase, call the ":"如果GUID的值表示为一系列小写的十六进制数字，则为8、4、4、4和12位数字，并由连字符分开。 返回值的一个示例是“ 382C74C3-721D-4F34-80E5-57657B6CBC27”。 要将十六进制的数字从A到F转换为大写，请致电"," instance to contain the parsed value. If the method returns ":"实例包含解析值。 如果方法返回"," or an empty string (\"\"), \"D\" is used.":"或使用一个空字符串（“”），“ D”。"," if the formatting operation was successful; ":"如果格式操作成功；"," contains a valid ":"包含有效",". If the method returns ":"。 如果方法返回"," method on the returned string.":"返回字符串的方法。","A string containing the GUID to convert.":"一个包含转换GUID的字符串。",", represented as a series of lowercase hexadecimal digits in the specified format.":"，以指定格式为一系列小写的十六进制数字。","A span containing the characters representing the GUID to convert.":"包含代表转换GUID的字符的跨度。",", zero if this is equal to ":"，如果等于"," if the parse operation was successful; otherwise, ":" 如果解析操作成功；否则, ","When this method returns, the GUID as a span of bytes.":"当此方法返回时，GUID作为字节的跨度。"," is a number.\n        \n        -or-\n        \n        Zero if this instance is equal to ":"是一个数字。 \n        \n         -或者- \n        \n         如果此实例等于"," if the specified value is finite (zero, subnormal or normal); otherwise, ":"如果指定的值是有限的（零，下正常或正常）； 否则，"," if the GUID is successfully written to the specified span; ":"如果GUID已成功写入指定的跨度；",", or a value greater than zero if this is greater than ":"，或一个大于零的值，如果大于"," evaluates to not a number ":"评估是没有数字的",", or this instance and ":"，或此实例和 ","A half-precision floating-point number to compare.":"一个半精度的浮点数要进行比较。","\n        A value less than zero if this instance is less than ":"值小于零，如果此实例小于"," if negative; ":"如果负面；",", or this instance is not a number (NaN) and ":"，或此实例不是数字（NAN）和"," are both not a number (NaN), ":"都是数字（nan），","A value less than zero if this is less than ":"值小于零，如果小于"," is normal; ":"是正常的;"," representation of the specified half-precision floating point ":"指定的半精度浮点的表示",", if the conversion succeeded, or a default ":"，如果转换成功或默认",".\n        \n        -or-\n        \n        A value greater than zero if this instance is greater than ":"。 \n        \n         -或者- \n        \n         如果此实例大于"," is subnormal; ":"是亚正常；","The single-precision floating point value to convert to ":"单精度的浮点值转换为"," value if the conversion failed. The conversion fails if the ":"值如果转换失败。 转换失败，如果"," representation of the specified single-precision floating point ":"指定的单精度浮点的表示","The double-precision floating point value to convert to ":"双精度浮点值转换为",", or this instance is a number and ":"，或此实例是一个数字，"," parameter is not a number in a valid format. If ":" 参数不是有效格式的数字。 如果 "," representation of the specified double-precision floating point ":"指定的双精度浮点的表示","Converts the string representation of a number to its half-precision floating-point number equivalent. A return value indicates whether the conversion succeeded or failed.":"将数字的字符串表示形式转换为其半精度浮点数等效。 返回值表示转换是成功还是失败。"," is not a number (NaN), or ":"不是数字（nan），或",", result is ":"，结果是","A half-precision floating point number to compare to this instance.":"与此实例进行比较的半精度浮点数。","A half-precision floating-point number equivalent to the numeric value or symbol specified in ":"半精度的浮点数等于数字值或指定的符号",". This parameter is passed uninitialized; any value originally supplied in result will be overwritten.":"。 该参数通过非初始化； 最初提供的结果的任何值都将被覆盖。","The half-precision floating point value to convert to ":"要转换为的半精度浮点值 "," floating-point number.":"浮点数。"," if the formatting was successful, otherwise, ":"如果格式成功，否则，"," if the parse was successful; otherwise, ":"如果解析成功； 否则，","A read-only span that contains a number to convert.":"仅读取跨度包含要转换的数字。"," was converted successfully, ":" 成功转换, "," to use to calculate the hash code.\nThis value can be a null reference (Nothing in Visual Basic), which will use the default equality comparer for ":"用于计算哈希代码。 \n 此值可以是null引用（在Visual Basic中没有任何内容），它将使用默认的平等比较来"," or is not a number in a valid format. If is a valid number less than ":"或不是有效格式的数字。 如果有效数字小于","When this method returns, contains half-precision floating-point number equivalent to the numeric value or symbol contained in ":"当此方法返回时，包含半精度的浮点数，等同于数字值或包含的符号","The span to add.":"要添加的跨度。",". If is a valid number greater than ":"。 如果有效数字大于","5.9604645E-08":"5.96004645E-08","The fourth value to combine into the hash code.":"合并到哈希代码中的第四个值。","The hash code that represents the single value.":"表示单个值的哈希代码。","The eighth value to combine into the hash code.":"将组合到哈希代码中的第八值。","The hash code that represents the four values.":"表示四个值的哈希代码。","65504":"65504","The first value to combine into the hash code.":"组合到哈希代码中的第一个值。","The hash code that represents the eight values.":"表示八个值的哈希代码。","The fifth value to combine into the hash code.":"将组合到哈希代码中的第五个值。","Ignored.":"被忽略。","-65504":"-65504","The second value to combine into the hash code.":"第二个要合并到哈希代码中的值。","The hash code that represents the five values.":"表示五个值的哈希代码。","This method will always throw a ":"这种方法将永远抛出","The hash code that represents the two values.":"表示两个值的哈希代码。","NaN.":"在。","The calculated hash code.":"计算出的哈希代码。","The sixth value to combine into the hash code.":"将第六个值合并到哈希码中。","-Infinity.":"-无穷。","A user-defined object that qualifies or contains information about an asynchronous operation.":"符合或包含有关异步操作的信息的用户定义对象。","The third value to combine into the hash code.":"将组合到哈希代码中的第三个值。","The hash code that represents the six values.":"表示六个值的哈希代码。","Infinity.":"无穷。","The hash code that represents the three values.":"表示三个值的哈希代码。"," that is used to wait for an asynchronous operation to complete.":"这用于等待异步操作完成。","The value to add to the hash code.":"添加到哈希代码的值。","The seventh value to combine into the hash code.":"将第七个值合并到哈希码中。"," if the operation is complete; otherwise, ":"如果操作完成； 否则，"," if the asynchronous operation completed synchronously; otherwise, ":"如果异步操作同步完成； 否则，"," instance equivalent to the value of this instance.":"实例等于此实例的值。","The hash code that represents the seven values.":"表示七个值的哈希代码。","A value that indicates the relative order of the objects being compared. The return value has these meanings:  \n  \n ":"一个表示要比较对象的相对顺序的值。 回报值具有这些含义："," to which the value of this instance is converted.":"转换此实例的值。"," number equivalent to the value of this instance.":"数字等于此实例的值。","An object that supplies format information about the current instance.":"提供有关当前实例的格式信息的对象。"," instance of type ":"类型的实例","The enumerated constant that is the ":"枚举常数是","A double-precision floating-point number equivalent to the value of this instance.":"双精度的浮点数等于此实例的值。",", formatted as specified by ":"，按照指定的格式"," of the class or value type that implements this interface.":"实现此接口的类或值类型的类型。","An 16-bit signed integer equivalent to the value of this instance.":"16位签名的整数等效于此实例的值。"," whose value is equivalent to the value of this instance.":"其值等于此实例的值。","An object that specifies the type of format object to return.":"指定要返回的格式对象类型的对象。"," interface implementation that supplies culture-specific formatting information.":"提供特定文化格式信息的界面实现。"," implementation can supply that type of object; otherwise, ":"实施可以提供该类型的对象； 否则，","An 32-bit signed integer equivalent to the value of this instance.":"一个32位签名的整数等同于此实例的值。","An 16-bit unsigned integer equivalent to the value of this instance.":"一个16位的无符号整数等同于此实例的值。","The format to use.  \n  \n -or-  \n  \n A null reference (":"要使用的格式。 \n  \n  -或者- \n  \n  null引用（","A Boolean value equivalent to the value of this instance.":"布尔值等同于此实例的值。","The provider to use to format the value.  \n  \n -or-  \n  \n A null reference (":"用于格式化值的提供商。 \n  \n  -或者- \n  \n  null引用（","An 32-bit unsigned integer equivalent to the value of this instance.":"一个32位的无符号整数等同于此实例的值。","An 64-bit signed integer equivalent to the value of this instance.":"一个64位签名的整数等同于此实例的值。","An 8-bit unsigned integer equivalent to the value of this instance.":"一个8位的无符号整数等效于此实例的值。","An 64-bit unsigned integer equivalent to the value of this instance.":"一个64位的无符号整数等同于此实例的值。","The index value. It has to be greater or equal than zero.":"索引值。 它必须大于或等于零。","A Unicode character equivalent to the value of this instance.":"一个等同于此实例的值的Unicode字符。","An 8-bit signed integer equivalent to the value of this instance.":"相当于此实例值的8位有符号整数。","A boolean indicating if the index is from the start (":"布尔值指示该索引是否从开始（","A format string containing formatting specifications.":"包含格式规格的格式字符串。",") or from the end (":"）或从末端（","A single-precision floating-point number equivalent to the value of this instance.":"单精度的浮点数等于此实例的值。","An object to format.":"格式的对象。","A 16-bit signed integer equivalent to the number specified in ":"一个16位签名的整数等同于指定的数字"," implementation that provides information about the format of the returned value.":"提供有关返回值格式的信息。",") of a collection.":"）系列。","A new pointer that reflects the subtraction of ":"反映出减法的新指针","When this method returns, contains the 64-bit signed integer value equivalent of the number contained in ":"当此方法返回时，包含64位签名的整数值等同于包含的数字"," if the current Index object is equal to ":"如果当前索引对象等于","A 16-bit signed integer equivalent to the number contained in ":"一个16位签名的整数等同于包含的数字"," and is equal to the current instance; ":"并且等于当前实例；","A read-only span of characters containing a number to convert.":"只读字符的跨度跨度，其中包含要转换的数字。","The string representation of the value of this instance, consisting of a minus sign if the value is negative, and a sequence of digits ranging from 0 to 9 with no leading zeroes.":"该实例值的字符串表示，如果值为负，则由减去符号组成，而数字序列范围为0到9，没有领先的零。","A pointer or handle contained in a 32-bit signed integer.":"32位签名整数中包含的指针或手柄。","The index value from the end of a collection.":"索引值从集合的末尾。"," that supplies culture-specific formatting information.":" 它提供特定于区域性的格式信息。","A signed native integer equivalent to the number contained in ":"签名的本机整数等效于包含的数字","A pointer or handle contained in a 64-bit signed integer.":"64位签名整数中包含的指针或手柄。","The Index value.":"索引值。","A span containing the characters representing the number to convert. The span is interpreted using the style specified by ":"包含代表要转换数字的字符的跨度。 使用由","A 32-bit signed integer equal to the value of this instance.":"一个32位签名的整数等于此实例的值。","A pointer to an unspecified type.":"指向未指定类型的指针。","When this method returns, contains the 16-bit signed integer value equivalent to the number contained in ":"当此方法返回时，包含16位签名的整数值等于","A 64-bit signed integer equal to the value of this instance.":"一个64位签名的整数等于此实例的值。","The pointer to add the offset to.":"将偏移量添加到的指针。","; that is, a pointer to memory containing data of an unspecified type.":"; 也就是说，包含未指定类型的数据的内存指针。",", is not in a format compliant with ":"，不符合格式","A 32-bit signed integer equivalent to the number specified in ":"一个32位签名的整数等同于指定的数字","A new pointer that reflects the addition of ":"一个反映添加的新指针","A signed native integer to compare.":"一个签名的本地整数进行比较。","A 32-bit signed integer equivalent to the number contained in ":"一个32位签名的整数等同于包含的数字","A value that indicates the relative order of the objects being compared. The return value has these meanings:   \n ":"一个表示要比较对象的相对顺序的值。 回报值具有这些含义：","An object that provides information about the format of the returned value.":"提供有关返回值格式的信息。","The first pointer or handle to compare.":"比较的第一个指针或手柄。","A span containing the characters that represent the number to convert. The span is interpreted using the style specified by ":"包含代表要转换数字的字符的跨度。 使用由","The second pointer or handle to compare.":"第二个指针或手柄进行比较。","When this method returns, contains the 32-bit signed integer value equivalent of the number contained in ":"当此方法返回时，包含32位签名的整数值等同于包含的数字","A span containing the characters that represent the number to convert.":"包含代表要转换数字的字符的跨度。"," initialized to ":"初始化"," is an instance of an ":"是一个实例","The pointer or handle to convert.":"指针或句柄要转换。","A 64-bit signed integer equivalent to the number specified in ":"一个64位签名的整数等同于指定的数字","The contents of ":"内容的内容","A 64-bit signed integer equivalent to the number contained in ":"一个64位签名的整数等同于包含的数字"," or empty, is not of the correct format, or represents a number less than ":"或空的，不是正确的格式，或代表小于"," does not equal ":"不等于","The pointer to subtract the offset from.":"从中减去偏移的指针。","The size of a pointer or handle in this process, measured in bytes. The value of this property is 4 in a 32-bit process, and 8 in a 64-bit process. You can define the process type by setting the ":"在此过程中，指针或手柄的大小，以字节测量。 该属性的价值在32位过程中为4，在64位过程中为8。 您可以通过设置","The total number of characters read into the buffer. This might be less than the number of characters requested if that many characters are not currently available, or it might be zero if the end of the stream is reached.":"字符总数读取到缓冲区中。 这可能小于如果当前没有许多字符的字符数量，或者如果达到流的末尾，则可能为零。","A span of characters. When this method returns, the contents of this region are replaced by the characters read from the current source.":"一个字符。 当此方法返回时，该区域的内容被当前源读取的字符代替。","A 32-bit integer in compressed format.":"一个32位整数，以压缩格式。","The number that is read from this binary reader instance.":"从此二进制读取器实例中读取的数字。"," if the byte is nonzero; otherwise, ":"如果字节为非零； 否则，","The next byte read from the current stream.":"下一个字节从当前流读取。","The number of bytes to read. This value must be 0 or a non-negative number or an exception will occur.":"要读取的字节数。 此值必须为0或非负数或异常。","A byte array containing data read from the underlying stream. This might be less than the number of bytes requested if the end of the stream is reached.":"一个字节阵列，其中包含从基础流读取的数据。 如果到达流的末尾，这可能小于请求的字节数。","A character read from the current stream.":"角色从当前流读取。","A character array containing data read from the underlying stream. This might be less than the number of characters requested if the end of the stream is reached.":"字符数组，其中包含从基础流读取的数据。 如果到达流的末尾，这可能小于要求的字符数量。"," switch when you compile your code with the C# and Visual Basic compilers.":" 使用C#和Visual Basic编译器编译代码时进行切换。","The structure to contain the parsed value. If the method returns ":"包含解析值的结构。 如果方法返回","A decimal value read from the current stream.":"从当前流中读取的十进制值。","The error code (HRESULT) value associated with the exception.":"与异常关联的错误代码（hresult）值。","An 8-byte floating point value read from the current stream.":"从当前流读取8字节浮点值。","The structure that will contain the parsed value. If the method returns ":"将包含解析值的结构。 如果方法返回","The object that contains the serialized data.":"包含序列化数据的对象。","A 2-byte floating point value read from the current stream.":"从当前流读取2字节的浮点值。","The stream that contains the serialized data.":"包含序列化数据的流。","A signed byte read from the current stream.":"从当前流读取的签名字节。","A string that describes the exception.":"描述异常的字符串。","A 2-byte signed integer read from the current stream.":"一个2字节签名的整数从当前流读取。","A 4-byte floating point value read from the current stream.":"从当前流读取4字节浮点值。","The input stream.":"输入流。","The string being read.":"字符串正在读取。","A 4-byte signed integer read from the current stream.":"一个4字节签名的整数从当前流读取。","The character encoding to use.":"使用编码的字符。","A 2-byte unsigned integer read from this stream.":"一个2字节的未签名整数从此流中读取。","An 8-byte signed integer read from the current stream.":"从当前流中读取的8字节有符号整数。","The number of bytes to be read.":"要读取的字节数。","A field of ":"一个领域","A 4-byte unsigned integer read from this stream.":"从该流中读取的4字节无符号整数。","The next available character, or -1 if no more characters are available or the stream does not support seeking.":"下一个可用的字符，或-1，如果没有更多字符，或者流不支持寻求。","An 8-byte unsigned integer read from this stream.":"一个8字节的未签名整数从此流中读取。"," indicating the reference point from which the new position is to be obtained.":"指示要获得新位置的参考点。","The position with the current stream.":"具有当前流的位置。","The next character from the input stream, or -1 if no characters are currently available.":"输入流的下一个字符，如果当前没有字符，则为-1。","The underlying stream associated with the ":"与"," value to write (0 or 1).":"写入（0或1）。","The starting point in the buffer at which to begin reading into the buffer.":"缓冲区开始读取缓冲区的起点。","A byte offset relative to ":"字节相对于","The number of bytes read into ":"字节的数量读取为","The unsigned byte to write.":"未签名的字节写。","The two-byte signed integer to write.":"两个字节签名的整数要写。","A byte array containing the data to write.":"一个字节阵列包含要编写的数据。",". This might be less than the number of bytes requested if that many bytes are not available, or it might be zero if the end of the stream is reached.":"。 如果不可用，则可能小于所请求的字节数，或者如果到达流的末尾，则可能为零。","The four-byte signed integer to write.":"四字节签名的整数要写。","The number of characters to read.":"要读的字符数。","The index of the first byte to read from ":"第一个字节的索引","The eight-byte signed integer to write.":"八字节签名的整数要写。","The four-byte unsigned integer to write.":"四字节的未签名整数要写。"," and to write to the stream.":"并写入流。","The span of bytes to write.":"字节的跨度要编写。","The number of bytes to read from ":"从中读取的字节数","A span of chars to write.":"写作的跨度。","The eight-byte unsigned integer to write.":"八字节的未签名整数要写。","The signed byte to write.":"签名的字节写。","The non-surrogate, Unicode character to write.":"要编写的非旋转，Unicode字符。","The four-byte floating-point value to write.":"要编写的四字节浮点值。","The 32-bit integer to be written.":"要编写的32位整数。","A character array containing the data to write.":"一个包含要编写数据的字符数组。","The current stream.":"当前流。","The two-byte unsigned integer to write.":"要写入的两字节无符号整数。","The buffer size in bytes.":"缓冲区大小在字节中。","The index of the first character to read from ":"要从中读取的第一个字符的索引 ","The total number of bytes read into ":"字节的总数已读取","The buffer to read the data into.":"缓冲区将数据读取。","The number of characters to read from ":"从中阅读的字符数",". This can be less than the number of bytes requested if that many bytes are not currently available, or 0 if the end of the stream has been reached before any data can be read.":"。 如果当前没有许多字节，则可能小于所请求的字节数，或者如果在可以读取任何数据之前已达到流的末尾。","A task that represents the asynchronous read operation. The value of the ":"代表异步读取操作的任务。 价值"," at which to begin writing data read from the stream.":"在其中开始写数据从流中读取。","The decimal value to write.":"编写的小数值。"," parameter contains the total number of bytes read into the buffer. The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"参数包含读取到缓冲区的字节总数。 如果当前可用的字节数小于请求的数字，则结果值可能小于请求的字节数，如果达到了流的末尾，则可以为0（零）。","An optional asynchronous callback, to be called when the read is complete.":"可选的异步回调，当读取完成后应调用。","The eight-byte floating-point value to write.":"要编写的八字节浮点值。","The byte cast to an ":"字节铸","The two-byte floating-point value to write.":"要编写的两个字节浮点值。","An object that represents the asynchronous read, which could still be pending.":"代表异步读取的对象，仍然可以待处理。",", or -1 if reading from the end of the stream.":"，或-1如果从流的末端读取。","An integer indicating the desired length of the current buffered stream in bytes.":"一个整数，指示字节中当前缓冲流的所需长度。","The method to be called when the asynchronous write operation is completed.":"当异步写操作完成时要调用的方法。"," indicating the reference point from which to obtain the new position.":"指示从中获得新位置的参考点。","The offset in the buffer at which to begin copying bytes to the current buffered stream.":"缓冲区中开始将字节复制到当前缓冲流的偏移量。","An object that references the asynchronous write which could still be pending.":"引用可能仍在挂起的异步写作的对象。","The number of bytes to be written to the current buffered stream.":"要写入当前缓冲流的字节数。","The new position within the current buffered stream.":"当前缓冲流中的新位置。","The stream to which the contents of the current buffered stream will be copied.":"将复制当前缓冲流的内容的流。","A region of memory. This method copies the contents of this region to the current buffered stream.":"记忆区域。 该方法将该区域的内容复制到当前缓冲流。","The size, in bytes, of the buffer. This value must be greater than zero. The default sizer is 81920.":"缓冲区的大小，字节。 该值必须大于零。 默认的Sizer为81920。","The search string to match against the names of file-system entries in ":"搜索字符串与文件系统条目的名称匹配","A byte to write to the stream.":"一个字节写入流。","The reference to the pending asynchronous request to wait for.":"提到未决异步请求等待的请求。","The search string to match against the names of subdirectories in ":"搜索字符串与子目录的名称匹配","An integer representing the buffer size in bytes.":"代表字节中缓冲区大小的整数。","The number of bytes read from the stream, between 0 (zero) and the number of bytes you requested. Streams only return 0 only at the end of the stream, otherwise, they should block until at least 1 byte is available.":"从流读取的字节数，在0（零）和您请求的字节数之间。 流仅在流的末尾返回0，否则，它们应阻止至少1个字节。",". This parameter can contain a combination of valid literal and wildcard characters, but it doesn't support regular expressions.":"。 该参数可以包含有效的文字和通配符的组合，但不支持正则表达式。","The byte offset in the buffer at which to begin reading bytes.":"在缓冲区中开始读取字节的字节偏移。"," if the stream is closed or was opened with write-only access.":"如果流关闭或使用仅写入访问打开。",", that match the specified search pattern and the specified enumeration options.":"，匹配指定的搜索模式和指定的枚举选项。","One of the enumeration values that specifies whether the search operation should include all subdirectories or only the current directory.":"指定搜索操作是否应包括所有子目录或仅当前目录的枚举值之一。"," if the stream is closed or if the stream was constructed from an operating system handle such as a pipe or output to the console.":"如果流关闭或从操作系统手柄（例如管道或输出到控制台输出）构造的流。","An array of the full names (including paths) of the subdirectories that match the specified criteria, or an empty array if no directories are found.":"如果找不到目录，则符合指定条件的子目录的全名（包括路径）的数组（包括路径）。"," if the stream is closed or was opened with read-only access.":"如果流关闭或使用仅阅读访问打开。","The search string to match against file-system entries in ":"搜索字符串与文件系统条目匹配","The path of a file or directory.":"文件或目录的路径。","One of the enumeration values  that specifies whether the search operation should include only the current directory or should include all subdirectories. The default value is ":"指定搜索操作是否仅包括当前目录或应包括所有子目录的枚举值之一。 默认值是","The stream length in bytes.":"流长度为字节。","A format specification that governs how the current ":"一种格式规范，用于控制当前的 ","A string that contains the volume information, root information, or both for the specified path.":"包含卷信息，根信息或指定路径的字符串。","The position within the current stream.":"当前流中的位置。"," and that match the specified search pattern and option.":"并且与指定的搜索模式和选项匹配。"," object is converted.":"对象已转换。","The length of the collection that the Index will be used with. Must be a positive value.":"索引的藏品长度将与。 必须是一个积极的价值。","An array of the full names (including paths) for the files in the specified directory, or an empty array if no files are found.":"指定目录中文件的全名（包括路径）的数组，如果找不到文件，则为空数组。","The underlying stream instance.":"基础流实例。"," refers to an existing directory; ":"指现有目录；","The offset.":"偏移。","The string representation of the value of the current ":"当前值的字符串表示","An array of the full names (including paths) for the files in the specified directory that match the specified search pattern, or an empty array if no files are found.":"完整名称（包括路径）的数组（包括匹配指定搜索模式的指定目录中的文件），或者如果找不到文件，则为空数组。"," if the directory does not exist or an error occurs when trying to determine if the specified directory exists.":"如果目录不存在或试图确定指定目录是否存在时发生错误。","An Index representing the integer.":"代表整数的索引。","The directory to create.":"创建目录。","An array of the full names (including paths) for the files in the specified directory that match the specified search pattern and enumeration options, or an empty array if no files are found.":"与指定的搜索模式和枚举选项匹配指定目录中文件的全名（包括路径）的数组，如果找不到文件，则为空数组。","an ":"一个","The span where this instance's value formatted as a span of characters should be written.":"应写入此实例的值格式化为字符范围的范围。","An object that represents the directory at the specified path. This object is returned regardless of whether a directory at the specified path already exists.":"在指定路径上表示目录的对象。 无论是否已经存在指定路径上的目录，返回该对象。","The path of the directory.":"目录的路径。"," that points beyond the last element.":"这点超出了最后一个元素。","An array of the full names (including paths) for the files in the specified directory that match the specified search pattern and option, or an empty array if no files are found.":"指定目录中与指定搜索模式和选项匹配的文件的全名（包括路径）数组，如果找不到文件，则为空数组。","The path where the symbolic link should be created.":"应创建符号链接的路径。","A structure that is set to the creation date and time for the specified directory. This value is expressed in local time.":"设置为指定目录的创建日期和时间的结构。 此值在当地表达。","When this method returns, contains the number of characters that were written in ":"当此方法返回时，包含写入的字符数"," if the Index is from the end; otherwise, ":"如果索引是从末端开始的； 否则，","An array of the names of files and subdirectories in the specified directory, or an empty array if no files or subdirectories are found.":"指定目录中的文件和子目录名称的数组，如果找不到文件或子目录，则为空数组。","A structure that is set to the creation date and time for the specified directory. This value is expressed in UTC time.":"设置为指定目录的创建日期和时间的结构。 此值在UTC时间表示。","An instance that points to the first element of a collection.":"指向集合的第一个元素的实例。","The target directory of the symbolic link.":"符号链接的目标目录。","The characters that represent a standard or custom format string that defines the acceptable format for ":"代表标准或自定义格式字符串的字符，该字符串定义可接受格式的字符字符串","The index value.":"索引值。","A string that contains the absolute path of the current working directory, and does not end with a backslash (\\).":"包含当前工作目录的绝对路径的字符串，并且不会以后斜切（\\）结束。","A read-only span of characters containing a number to convert. The string is interpreted using the style specified by ":"只读字符的跨度跨度，其中包含要转换的数字。 使用由","The search string to match against the names of file and directories in ":"与文件名和目录名匹配的搜索字符串 "," instance that wraps the newly created directory symbolic link.":"包装新创建的目录符号链接的实例。","An integer to compare.":"比较的整数。","An array of file names and directory names that match the specified search criteria, or an empty array if no files or directories are found.":"匹配指定搜索条件的文件名和目录名称的数组，如果找不到文件或目录，则为空数组。","An array of the full names (including paths) of subdirectories in the specified path, or an empty array if no directories are found.":"指定路径中的子目录的全名（包括路径）的数组，如果找不到目录，则为空数组。","When this method returns, contains the signed native integer value equivalent of the number contained in ":"当此方法返回时，包含签名的本机整数值等同于包含的数字","The name of the empty directory to remove. This directory must be writable and empty.":"空目录的名称要删除。 该目录必须是可写的和空的。","An array of file names and directory names that match the specified search pattern and enumeration options, or an empty array if no files or directories are found.":"匹配指定搜索模式和枚举选项的文件名和目录名称的数组，如果找不到文件或目录，则为空数组。","An array of the full names (including paths) of the subdirectories that match the search pattern in the specified directory, or an empty array if no directories are found.":"符合指定目录中搜索模式的子目录的全名（包括路径）的数组，如果找不到目录，则为空数组。"," parameter is empty, is not of the correct format, or represents a number less than ":"参数为空，不是正确的格式，或者表示一个小于","The search string to match against the names of files and directories in ":"搜索字符串与文件和目录的名称匹配"," is not a link.":" 不是链接。","An array of the full names (including paths) of the subdirectories that match the search pattern and enumeration options in the specified directory, or an empty array if no directories are found.":"符合指定目录中搜索模式和枚举选项的子目录的全名（包括路径）的数组，如果找不到目录，则为空数组。","An array of file the file names and directory names that match the specified search criteria, or an empty array if no files or directories are found.":"文件数组匹配指定搜索条件的文件名和目录名称，或者如果找不到文件或目录，则为空数组。","When this method returns, contains the signed native integer equivalent of the number contained in ":"当此方法返回时，包含签名的本机整数等同于包含的数字","The file or directory for which to set the creation date and time information.":"用于设置创建日期和时间信息的文件或目录。","The file or directory for which to obtain access date and time information.":"获取访问日期和时间信息的文件或目录。","An enumerable collection of directories in the current directory.":"当前目录中的目录集合。","The date and time the file or directory was last written to. This value is expressed in local time.":"文件或目录的日期和时间最后写给。 此值在当地表达。","The search string to match against the names of directories and files.  This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"搜索字符串与目录和文件的名称匹配。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。","The name of the directory to remove.":"要删除的目录的名称。","The search string to match against the names of directories.  This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"搜索字符串与目录的名称匹配。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。"," to remove directories, subdirectories, and files in ":"删除目录，子目录和文件","The date and time the directory or file was created. This value is expressed in local time.":"创建目录或文件的日期和时间。 此值在当地表达。","A structure that is set to the date and time the specified file or directory was last accessed. This value is expressed in local time.":"设置为上次访问指定文件或目录的日期和时间的结构。 此值以本地时间表示。","An enumerable collection of directories that matches ":"符合目录的列举集合"," objects matching the search criteria.":" 匹配搜索条件的对象。","The search string to match against the names of directories. This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"搜索字符串与目录的名称匹配。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。","A structure that is set to the date and time the specified file or directory was last accessed. This value is expressed in UTC time.":"最后访问指定文件或目录的日期和时间的结构。 此值在UTC时间表示。","The relative or absolute path to the directory to search. This string is not case-sensitive.":"搜索目录的相对或绝对路径。 该字符串不适合大小写。","The path to which the current working directory is set.":"设置当前工作目录的路径。","The search string to match against the names of directories and files. This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"搜索字符串与目录和文件的名称匹配。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。","One of the enumeration values that specifies whether the search operation should include only the current directory or all subdirectories. The default value is ":"指定搜索操作是否仅包括当前目录还是所有子目录的枚举值之一。 默认值是","The file or directory for which to obtain modification date and time information.":"获取修改日期和时间信息的文件或目录。","The file or directory for which to set the access date and time information.":"用于设置访问日期和时间信息的文件或目录。","An enumerable collection of the full names (including paths) for the directories in the directory specified by ":"全名（包括路径）的目录中指定目录的全名（包括路径）的集合"," objects matching ":"对象匹配","An enumerable collection of the files in the current directory.":"当前目录中的文件集合。","A structure that is set to the date and time the specified file or directory was last written to. This value is expressed in local time.":"最后写入指定文件或目录的日期和时间的结构。 此值在当地表达。","An object that contains the value to set for the access date and time of ":"一个包含为访问日期和时间设置值的对象","An array of file system entries that match the search criteria.":"匹配搜索条件的文件系统条目数组。","The search string to match against the names of directories in ":"搜索字符串与目录名称匹配","The search string to match against the names of files.  This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"搜索字符串与文件的名称匹配。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。","A structure that is set to the date and time the specified file or directory was last written to. This value is expressed in UTC time.":"最后写入指定文件或目录的日期和时间的结构。 此值在UTC时间表示。",". This value is expressed in local time.":"。 此值在当地表达。",".  This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。","The name and path to which to move this directory. The destination cannot be another disk volume or a directory with the identical name. It can be an existing directory to which you want to add this directory as a subdirectory.":"移动此目录的名称和路径。 目的地不能是其他磁盘卷或具有相同名称的目录。 它可以是您要添加此目录作为子目录的现有目录。","An enumerable collection of files that matches ":"符合匹配的文件集合","The logical drives on this computer.":"这台计算机上的逻辑驱动器。","An object that  contains the value to set for the access date and time of ":"一个包含为访问日期和时间设置值的对象"," and that match the specified search pattern.":"并且与指定的搜索模式匹配。","The original path that was passed by the user.":"用户通过的原始路径。","The search string to match against the names of files. This parameter can contain a combination of valid literal path and wildcard (* and ?) characters, but it doesn't support regular expressions.":"搜索字符串与文件的名称匹配。 该参数可以包含有效的文字路径和通配符（*和？）字符的组合，但不支持正则表达式。",". This value is expressed in UTC time.":"。 此值在UTC时间表示。","The path for which to retrieve the parent directory.":"检索父目录的路径。"," if the directory exists; otherwise, ":"如果存在目录； 否则，","An object that describes the search and enumeration configuration to use.":"描述要使用的搜索和枚举配置的对象。","An enumerable collection of file system information in the current directory.":"当前目录中的文件系统信息集合。","The date and time the directory was last written to. This value is expressed in local time.":"目录最后写的日期和时间。 此值在当地表达。","The parent directory, or ":"父目录或","The directory name.":"目录名称。","The date and time the directory was last written to. This value is expressed in UTC time.":"目录最后写的日期和时间。 此值在UTC时间表示。"," and that match the specified search pattern and enumeration options.":"并且与指定的搜索模式和枚举选项匹配。"," is the root directory, including the root of a UNC server or share name.":"是根目录，包括UNC服务器或共享名称的根目录。"," if the path is null or if the file path denotes a root (such as \\, C:\\, or \\\\server\\share).":"如果路径为null或文件路径表示root（例如\\，c：\\或\\\\ server \\ share）。","An enumerable collection of file system information objects that matches ":"匹配的文件系统信息对象的枚举集合","A string specifying the path on which to create the ":"指定要创建的路径的字符串","One of the enumeration values that specifies whether the search operation should include only the current directory or should include all subdirectories. The default value is ":"指定搜索操作是否仅包括当前目录或应包括所有子目录的枚举值之一。 默认值是","An object that represents the root of the directory.":"代表目录根的对象。","The path of the file or directory to move.":"文件或目录移动的路径。"," matching ":"匹配"," that describes the error. The content of ":"描述了错误。 内容的内容","The specified path. This cannot be a different disk volume or Universal Naming Convention (UNC) name.":"指定的路径。 这不能是不同的磁盘卷或通用命名约定（UNC）名称。"," is a file, then ":"是一个文件，然后"," and that match the specified search pattern and search option.":"并且与指定的搜索模式和搜索选项匹配。","One of the enumeration values that specifies whether the search operation should include only the current directory or all subdirectories.":"指定搜索操作是否仅包括当前目录还是所有子目录的枚举值之一。","The last directory specified in ":"指定的最后一个目录","A string that describes the error. The content of ":"描述错误的字符串。 内容的内容","An enumerable collection of the full names (including paths) for the files in the directory specified by ":"全名（包括路径）的集合（包括路径），用于指定的目录中的文件"," must also be a file name.":"也必须是文件名。","An array of strongly typed ":"一系列强烈键入"," to delete this directory, its subdirectories, and all files; otherwise, ":"要删除此目录，其子目录和所有文件； 否则，","The search string to match against the names of files in ":"搜索字符串与文件名称匹配","The value of this instance as a ":"此实例的价值为","The path of the directory link.":"目录链接的路径。"," objects that match ":"匹配的对象","The creation time for the entry.":"入口的创建时间。","A string representing the full path.":"一个代表完整路径的字符串。","An enumerable collection of file-system entries in the directory specified by ":"枚举的文件系统条目集合在指定的目录中"," entries.":"条目。"," to follow links to the final target; ":"遵循指向最终目标的链接；","The attributes for this entry.":"此条目的属性。","A reference to the file system entry that will be evaluated with the predicate condition.":"对文件系统条目的引用，该条目将通过谓词条件进行评估。","The full path of this entry's directory.":"该条目目录的完整路径。"," to return the special directory entries \".\" and \"..\"; otherwise, ":"返回特殊目录条目“”。 和 ”..”; 否则，"," to return the immediate next link.":"返回即时的下一个链接。"," if the predicate condition is met; otherwise, ":"如果满足谓词条件； 否则，","The file to be opened for writing.":"要打开的文件。","An instance of the type that this delegate encapsulates.":"该委托封装的类型的实例。","The file to append the lines to. The file is created if it doesn't already exist.":"将行附加到的文件。 如果文件尚不存在，则创建该文件。","This entry's file name.":"此条目的文件名。"," instance if ":"实例如果"," that writes to the specified file using UTF-8 encoding.":"使用UTF-8编码将其写入指定文件。"," if the entry is a directory; otherwise, ":"如果条目是目录； 否则，","The directory to search in.":"搜索目录。","The lines to append to the file.":"要附加到文件的行。"," if the file has the hidden attribute; otherwise, ":"如果文件具有隐藏属性； 否则，","A path that describes a file to decrypt.":"描述要解密的文件的路径。"," exists, independently if the target exists or not. ":"存在，是否存在目标。","A task that represents the asynchronous append operation.":"代表异步附加操作的任务。","The last access time in UTC.":"UTC的最后一次访问时间。","Enumeration options to use.":"枚举选项要使用。"," structure set to the date and time that the specified file or directory was last accessed. This value is expressed in UTC time.":"结构设置为最后访问指定文件或目录的日期和时间。 此值在UTC时间表示。","The name of the file to be deleted. Wildcard characters are not supported.":"要删除的文件的名称。 不支持通配符角色。","The last write time in UTC.":"UTC的最后一个写入时间。","The file to append the specified string to.":"将指定字符串附加到的文件。","The file length in bytes.":"文件长度为字节。","The file or directory for which to obtain write date and time information.":"获取写入日期和时间信息的文件或目录。","A path that describes a file to encrypt.":"描述要加密的文件的路径。","The native error code.":"本机错误代码。","The string to append to the file.":"插入文件的字符串。","The original root directory.":"原始根目录。"," structure set to the date and time that the specified file or directory was last written to. This value is expressed in local time.":"结构设置为最后写入指定文件或目录的日期和时间。 此值在当地表达。"," to continue; ":"接着说;","The path to the file to append to.":"文件附加的路径。","The file to check.":"要检查的文件。"," structure set to the date and time that the specified file or directory was last written to. This value is expressed in UTC time.":"结构设置为最后写入指定文件或目录的日期和时间。 此值在UTC时间表示。"," to throw the default exception for the given error.":"为给定错误提出默认例外。","The root directory.":"根目录。"," if the caller has the required permissions and ":"如果呼叫者拥有所需的权限，并且","The name of the file to move. Can include a relative or absolute path.":"要移动的文件的名称。 可以包括相对或绝对路径。","A stream writer that appends UTF-8 encoded text to the specified file or to a new file.":"将UTF-8编码文本附加到指定文件或新文件的流动作者。"," if the end of the enumerator has been passed.":"如果枚举者的结尾已经通过。","The path of the directory where the enumeration will be performed.":"将执行枚举的目录路径。"," contains the name of an existing file; otherwise, ":"包含现有文件的名称； 否则，","The directory path as a read-only span.":"目录路径是仅读取的跨度。","The new path and name for the file.":"文件的新路径和名称。","A delegate method for transforming raw find data into a result.":"将原始数据转换为结果的委托方法。","The file to copy.":"要复制的文件。",", an invalid path, or a zero-length string. If the caller does not have sufficient permissions to read the specified file, no exception is thrown and the method returns ":"，无效的路径或零长度字符串。 如果呼叫者没有足够的权限读取指定文件，则无例外，方法返回"," to overwrite the destination file if it already exists; ":"如果目标文件已经存在，则覆盖该目标文件；","A file system entry reference.":"文件系统条目参考。","The path and name of the file to create.":"要创建的文件的路径和名称。"," regardless of the existence of ":"不管存在","An object describing the enumeration options.":"描述枚举选项的对象。"," if the specified file system entry should be included in the results; otherwise, ":"如果指定的文件系统条目应包含在结果中； 否则，","The file to open.":"要打开的文件。","The path to the file.":"文件的路径。","An enumerator instance.":"枚举实例。"," that provides read/write access to the file specified in ":"提供了对指定文件的读/写访问"," if the specified directory entry should be recursed into; otherwise, ":"如果应将指定的目录条目归还到； 否则，"," value that specifies whether a file is created if one does not exist, and determines whether the contents of existing files are retained or overwritten.":"如果不存在，则指定是否创建文件的值，并确定是否保留或覆盖现有文件的内容。","The include predicate.":"包括谓词。"," of the file on the path.":"路径上的文件。","The result type from the current entry.":"当前条目的结果类型。"," with the specified buffer size that provides read/write access to the file specified in ":"具有指定的缓冲区大小，可提供对指定文件的读/写入访问","The recurse predicate.":"反复谓词。"," opened in the specified mode and path, with read/write access and not shared.":"在指定的模式和路径上打开，并使用读/写入访问，而不是共享。","The file or directory for which to obtain creation date and time information.":"获取创建日期和时间信息的文件或目录。","The currently visited element.":"当前访问的元素。"," values that describes how to create or overwrite the file.":"描述如何创建或覆盖文件的值。"," value that specifies the operations that can be performed on the file.":"指定可以在文件上执行的操作的值。","The currently visited object.":"当前访问的对象。","A string array containing all lines of the file.":"一个包含文件的所有行的字符串数组。"," structure set to the creation date and time for the specified file or directory. This value is expressed in local time.":"结构设置为指定文件或目录的创建日期和时间。 此值在当地表达。","A new file with the specified buffer size.":"带有指定缓冲区大小的新文件。"," structure set to the creation date and time for the specified file or directory. This value is expressed in UTC time.":"结构设置为指定文件或目录的创建日期和时间。 此值在UTC时间表示。","An unshared ":"一个未共享的","The expression to match with.":"与之匹配的表达式。","The encoding applied to the contents of the file.":"编码应用于文件内容。","The path of the target to which the symbolic link points.":"符号链路点的目标路径。"," structure set to the date and time that the specified file or directory was last accessed. This value is expressed in local time.":"结构设置为最后访问指定文件或目录的日期和时间。 此值在当地表达。","A task that represents the asynchronous read operation, which wraps the string array containing all lines of the file.":"代表异步读取操作的任务，它包含包含文件的所有行的字符串数组。"," that provides access to the specified file, with the specified mode and access.":"提供了指定模式和访问权限的指定文件的访问。",". If the file exists and ":"。 如果文件存在，并且","The name to check against the expression.":"对表达式进行检查的名称。"," instance that wraps the newly created file symbolic link.":"包装新创建的文件符号链接的实例。","A string containing all the text in the file.":"一个包含文件中所有文本的字符串。"," value specifying the type of access other threads have to the file.":"指定其他线程对文件的访问类型的值。",", an ":"， 一个"," to ignore case (default); ":"忽略案例（默认）;"," on the specified path, having the specified mode with read, write, or read/write access and the specified sharing option.":"在指定的路径上，具有带有读取，写或读取/写入访问的指定模式以及指定的共享选项。","A string containing all text in the file.":"一个包含文件中所有文本的字符串。","A new file.":"一个新文件。"," if the match should be case-sensitive.":"如果比赛应该对案例敏感。","The path of the file to open.":"文件打开的路径。","A task that represents the asynchronous read operation, which wraps the string containing all text in the file.":"代表异步读取操作的任务，该任务包含包含文件中所有文本的字符串。"," if the given expression matches the given name; otherwise, ":"如果给定的表达式与给定名称匹配； 否则，"," containing the name of the file with the invalid image, or a null reference if no file name was passed to the constructor for the current instance.":"使用无效的图像包含文件的名称，如果没有将文件名传递给当前实例的构造函数，则包含null引用。","The path to move the file to, which can specify a different file name.":"将文件移至的路径可以指定其他文件名。","The file to read.":"要读取的文件。","An object that describes optional ":"描述可选的对象","The expression to match with, such as \"*.foo\".":"与“*.foo”之类的表达式。","A string containing errors reported by the assembly cache.":"一个包含组件缓存报告的错误的字符串。"," constant specifying the mode (for example, ":"常量指定模式（例如，"," parameters to use.":"要使用的参数。"," to ignore case (default), ":"忽略案例（默认），"," instance that wraps the opened file.":"包装打开的文件的实例。",") in which to open the file.":"）打开文件。","All the lines of the file, or the lines that are the result of a query.":"文件的所有行，或作为查询结果的行。","An object that holds the serialized object data about the exception being thrown.":"持有有关抛出异常的序列化对象数据的对象。","The expression to translate.":"表达式翻译。","A file opened in the specified mode, with read/write access and unshared.":"在指定模式下打开的文件，并带有读/写访问并取消设置。","A relative or absolute path for the file that the current ":"当前文件的相对或绝对路径","An object that contains contextual information about the source or destination.":"包含有关源或目的地的上下文信息的对象。","The encoding that is applied to the contents of the file.":"应用于文件内容的编码。","A string with the translated Win32 expression.":"带有翻译的Win32表达式的弦。","A description of the error. The content of ":"错误的描述。 内容的内容"," instance will encapsulate.":"实例将封装。"," constant specifying whether to open the file with ":"不断指定是否打开文件"," file access.":"文件访问。","One of the enumeration values that determines how to open or create the file. The default value is ":"确定如何打开或创建文件的枚举值之一。 默认值是","The attributes to skip.":"跳过的属性。","The name of a file that replaces the file specified by ":"替换由指定文件的文件的名称","A description of the error, or ":"错误的描述，或","A bitwise combination of the enumeration values that determines how the file can be accessed. The default value is ":"枚举值的位组合，该值决定了如何访问文件。 默认值是"," object opened in the specified mode and access, and unshared.":"对象以指定模式和访问权限打开，并取消设置。","The buffer size.":"缓冲区大小。"," to use a system-supplied message with the given ":"使用给定的系统提供的消息","The name of the file being replaced.":"被替换的文件的名称。",". The content of ":"。 内容的内容"," constant specifying the type of access other ":"常量指定访问类型的其他类型"," to skip innacessible files or directories; otherwise, ":"跳过无法访问的文件或目录； 否则，"," should be understood by humans. The caller of this constructor must ensure that this string has been localized for the current system culture.":"人类应该理解。 该构造函数的呼叫者必须确保该字符串已定位为当前系统文化。"," object opened with the specified mode, access, and sharing options.":"使用指定模式，访问和共享选项打开对象。","The name of the backup file.":"备份文件的名称。","The object that contains contextual information about the source or destination.":"包含有关源或目的地的上下文信息的对象。"," that wraps the opened file.":"这包含打开的文件。","One of the enumeration values that indicates the case matching behavior.":"指示大小写匹配行为的枚举值之一。"," to ignore merge errors (such as attributes and access control lists (ACLs)) from the replaced file to the replacement file; otherwise, ":"忽略合并错误（例如属性和访问控制列表（ACL）），从替换文件到替换文件； 否则，","A bitwise combination of the enumeration values that determines how the file will be shared by processes. The default value is ":"枚举值的比重组合确定了如何通过进程共享文件的方式。 默认值是","The fully qualified name of this exception and possibly the error message, the name of the inner exception, and the stack trace.":"此异常的完全限定名称以及可能的错误消息、内部异常的名称和堆栈跟踪。","A new read-only ":"新的只读","One of the enumeration values that indicates the match type.":"指示匹配类型的枚举值之一。","The path of the file link.":"文件链接的路径。","The name of the file, or ":"文件的名称，或","The initial allocation size in bytes for the file. A positive value is effective only when a regular file is being created, overwritten, or replaced.\n            Negative values are not allowed. In other cases (including the default 0 value), it's ignored.":"文件的初始分配大小（以字节为单位）。 只有在创建、复盖或替换常规文件时，正值才有效。\n            不允许使用负值。 在其他情况下（包括默认的0值），它被忽略。"," with UTF8 encoding.":"使用UTF8编码。","A number that represents the maximum directory depth to recurse while enumerating. The default value is ":"代表枚举时重复出现的最大目录深度的数字。 默认值是","The file for which to set the creation date and time information.":"设置创建日期和时间信息的文件。"," if no file name was passed to the constructor for this instance.":"如果没有将文件名传递给此实例的构造函数。","A write-only unshared ":"一个只写的毫无用处"," containing the value to set for the creation date and time of ":"包含为创建日期和时间设置的值","The errors reported by the assembly cache.":"组件缓存报告的错误。","The file to be opened for reading.":"要打开的文件进行读取。","The file for which to set the access date and time information.":"设置访问日期和时间信息的文件。"," object for a new or existing file.":"新文件或现有文件的对象。"," to recurse into subdirectories; otherwise, ":"反复进入子目录； 否则，","A file handle for the file that the current ":"当前文件的文件句柄"," on the specified path.":"在指定的路径上。","A bitwise combination of the enumeration values that specifies additional file options.":"指定其他文件选项的枚举值的位组合。"," containing the value to set for the last access date and time of ":"包含在最后一个访问日期和时间设置的值","A bitwise combination of the enumeration values that sets the ":"枚举值的位组合","The name of a file to replace with the current file.":"用当前文件替换的文件的名称。"," object on the specified path with ":"指定路径上的对象","The file for which to set the date and time information.":"设置日期和时间信息的文件。"," properties of the ":"属性","The name of a file with which to create a backup of the file described by the ":"文件的名称，以创建由该文件备份的备份","The method to be called when the asynchronous read operation is completed.":"异步读操作完成时要调用的方法。"," containing the value to set for the last write date and time of ":"包含要设置的值的值的最后写日期和时间"," object that encapsulates information about the file described by the ":"对象封装有关文件所描述的文件的信息"," access.":" 访问。"," constant that sets the ":"设定的常数","An object that references the asynchronous read.":"引用异步读取的对象。"," to ignore merge errors (such as attributes and ACLs) from the replaced file to the replacement file; otherwise ":"忽略从替换文件替换文件的合并错误（例如属性和ACL）； 否则","The file to write to.":"要写入的文件。","The file to open for reading.":"要打开的文件。","A string representing the path.":"表示路径的字符串。"," value greater than 0 indicating the buffer size. The default buffer size is 4096.":"值大于0表示缓冲区大小。 默认缓冲区大小为4096。","An object that references the asynchronous write.":"引用异步写入的对象。","The bytes to write to the file.":"字节写入文件。","A byte array containing the contents of the file.":"包含文件内容的字节数组。","A file handle for the file that this ":"该文件的文件句柄"," object representing the parent directory of this file.":"代表此文件的父目录的对象。","A task that represents the asynchronous read operation, which wraps the byte array containing the contents of the file.":"代表异步读取操作的任务，该操作包裹包含文件内容的字节数组。","The lines to write to the file.":"写入文件的行。","The stream to which the contents of the current file stream will be copied.":"将复制当前文件流的内容的流。"," if the handle was opened asynchronously (that is, in overlapped I/O mode); otherwise, ":"如果将手柄异步打开（即以I/O模式重叠）； 否则，","The string array to write to the file.":"字符串数组以写入文件。","The number of bytes read from the stream, between 0 and the number of bytes you requested. Streams only return 0 at the end of the stream, otherwise, they should block until at least 1 byte is available.":"从流读取的字节数，0和您要求的字节数之间。 流在流的末尾返回0，否则，它们应阻止至少1个字节。","One of the enumeration values of the ":"枚举值之一","A string representing the directory's full path.":"代表目录的完整路径的字符串。"," if the file exists; ":"如果文件存在；"," object that represents the character encoding applied to the string array.":"代表应用于字符串数组的字符编码的对象。"," if the file handle will be owned by this ":"如果文件句柄将由此所有","The pending asynchronous I/O request.":"未决的异步I/O请求。"," enum.":"枚举。"," if the file does not exist or if the file is a directory.":"如果文件不存在或文件是目录。","One of the enumeration values that determines how to open or create the file.":"确定如何打开或创建文件的枚举值之一。","The string to write to the file.":"要写入文件的字符串。","The beginning of the range to lock. The value of this parameter must be equal to or greater than zero (0).":"锁定范围的开始。 该参数的值必须等于或大于零（0）。"," if the current file is read only; otherwise, ":"如果仅读取当前文件； 否则，","A non-negative number that represents the initial allocation size in bytes for the file.":"一个非负数，代表文件的初始分配大小。","A bitwise combination of the enumeration values that determines how the file can be accessed by the ":"枚举值的位组合，该值决定了如何访问文件的方式","The encoding to apply to the string.":"编码适用于字符串。","The range to be locked.":"要锁定的范围。","The size of the current file in bytes.":"当前文件的大小在字节中。"," object. This also determines the values returned by the ":"目的。 这也确定了由","The total number of bytes read into the buffer. This might be less than the number of bytes requested if that number of bytes are not currently available, or zero if the end of the stream is reached.":"字节的总数读取到缓冲区中。 如果目前不可用的字节数，则可能小于请求的字节数，或者如果达到流的末尾，则零。","The path of the symbolic link target.":"符号链接目标的路径。","The fully qualified name of the new file, or the relative file name. Do not end the path with the directory separator character.":"新文件的完全合格名称或相对文件名。 请勿使用目录分离器字符结束路径。","The name of the file.":"文件的名称。"," specifies a disk file.":"指定磁盘文件。"," instance if the link exists, independently if the target exists or not; ":"实例如果存在链接，则独立地存在目标；","The name of the new file to copy to.":"要复制的新文件的名称。","A region of memory. When this method returns, the contents of this region are replaced by the bytes read from the current file stream.":"内存的区域。 当此方法返回时，此区域的内容将被从当前文件流中读取的字节替换。"," containing the name of the file that was not loaded.":"包含未加载的文件的名称。","A new file with a fully qualified path.":"具有完全合格路径的新文件。","A bitwise combination of the enumeration values that determines how the file will be shared by processes.":"枚举值的按位组合，用于确定进程将如何共享文件。"," if this file or directory is not a link.":"如果此文件或目录不是链接。"," to allow an existing file to be overwritten; otherwise, ":"允许现有文件被覆盖； 否则，","A string containing the fully qualified name of this exception, and possibly the error message, the name of the inner exception, and the stack trace, depending on which ":"一个包含此异常的完全合格名称的字符串，可能是错误消息，内部异常的名称以及堆栈跟踪，具体取决于哪个","A task that represents the asynchronous read operation and wraps the total number of bytes read into the buffer. The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"表示异步读取操作并将读取的总字节数包装到缓冲区中的任务。 如果当前可用的字节数小于请求的字节数，则结果值可以小于请求的字节数，如果已到达流的末尾，则结果值可以为0（零）。","A new file, or an overwrite of an existing file if ":"一个新文件，或者如果现有文件覆盖","A string with the original path.":"带有原始路径的字符串。"," constructor is used.":"使用构造函数。","Specifies whether to use asynchronous I/O or synchronous I/O. However, note that the underlying operating system might not support asynchronous I/O, so when specifying ":"指定是使用异步I/O还是同步I/O。但是，请注意，底层操作系统可能不支持异步I/O，因此在指定时 ","The byte, cast to an ":"字节，铸造"," of the current ":"电流"," at which to begin writing data read from the memory stream.":"在其中开始编写从内存流读取的数据。",", the handle might be opened synchronously depending on the platform. When opened asynchronously, the ":"，根据平台，手柄可以同步打开。 当异步打开时","The path information to modify.":"要修改的路径信息。",", or -1 if the end of the stream has been reached.":"，或-1如果到达流的末端。","The creation date and time of the current ":"当前的创建日期和时间"," that represents the asynchronous read, which could still be pending.":"这代表了异步读取，这仍然可能正在待处理。","The point relative to ":"相对于"," methods perform better on large reads or writes, but they might be much slower for small reads or writes. If the application is designed to take advantage of asynchronous I/O, set the ":"方法在大型读取或写入方面的表现更好，但是对于小读或写入可能会慢得多。 如果该应用程序设计用于利用异步I/O，请设置","The creation date and time in UTC format of the current ":"当前的UTC格式的创建日期和时间","The new extension (with or without a leading period). Specify ":"新扩展（有或没有领先时期）。 指定"," from which to begin writing.":"从中开始写作。"," to remove an existing extension from ":"从中删除现有的扩展"," parameter to ":"参数为"," from which to begin seeking.":"从中开始寻求。"," if the file or directory exists; otherwise, ":"如果存在文件或目录； 否则，","An optional asynchronous callback, to be called when the write is complete.":"可选的异步回调，当写入完成后，要调用。","The modified path information.  \n  \n On Windows-based desktop platforms, if ":"修改后的路径信息。 \n  \n  在基于Windows的桌面平台上",". Using asynchronous I/O correctly can speed up applications by as much as a factor of 10, but using it without redesigning the application for asynchronous I/O can decrease performance by as much as a factor of 10.":"。 正确使用异步I/O可以正确加快应用程序的速度高达10倍，但是在不重新设计异步I/O应用的情况下使用它可以将性能降低多达10倍。"," that represents the asynchronous write, which could still be pending.":"这代表了异步写作，这仍然可能正在待处理。"," extension.":"扩大。","The beginning of the range to unlock.":"解锁范围的开始。"," or an empty string (\"\"), the path information is returned unmodified. If ":"或一个空字符串（“”），返回路径信息未修改。 如果","The characters after the last directory separator character in ":"最后一个目录分隔符角色之后的字符","A string containing the full path.":"包含完整路径的字符串。","The range to be unlocked.":"要解锁的范围。","The stream to which the contents of the current memory stream will be copied.":"将复制当前内存流的内容的流。",", the returned string contains the specified path with its extension removed. If ":"，返回的字符串包含指定的路径，其扩展名已删除。 如果","The number of bytes read from the memory stream, between zero (0) and the number of bytes you requested. Returns zero (0) only at the end of the memory stream, otherwise, it should block until at least one byte is available.":"从内存流读取的字节数，零（0）和您请求的字节数。 仅在内存流的末尾返回零（0），否则，它应阻止至少一个字节。","The path string from which to obtain the file name and extension.":"从中获取文件名和扩展名的路径字符串。","The time that the current file or directory was last accessed.":"最后访问当前文件或目录的时间。","A region of memory. This method copies the contents of this region to the current file stream.":"记忆区域。 此方法将该区域的内容复制到当前文件流。"," has no extension, and ":"没有扩展，并且",". If the last character of ":"。 如果是最后一个角色","The byte array from which this stream was created, or the underlying array if a byte array was not provided to the ":"创建此流的字节数组，或者如果未提供字节数组，则基础阵列","The UTC time that the current file or directory was last accessed.":"最后访问当前文件或目录的UTC时间。"," if the stream is closed or if the ":"如果流关闭或",", the returned path string contains ":"，返回的路径字符串包含"," is a directory or volume separator character, this method returns ":"是目录或音量分离器字符，此方法返回"," constructor during construction of the current instance.":"当前实例构建过程中的构造函数。","The time the current file was last written.":"当前文件最后写的时间。"," was constructed from an operating-system handle such as a pipe or output to the console.":"是由操作系统的手柄（例如管道或输出）构建的。"," - 1) replaced by the characters read from the current stream.":" -  1）被当前流读取的字符所取代。"," appended to the end of ":"附加到结束","The UTC time when the current file was last written to.":"当前文件最后写入的UTC时间。","The operating system file handle for the file encapsulated by this ":"此文件封装的文件的操作系统文件句柄"," at which to begin storing data from the current stream.":"从当前流开始存储数据。","The first path to combine.":"结合的第一个途径。","A read-only span that contains the path from which to obtain the file name without the extension.":"仅读取跨度，其中包含可以从无需扩展名的文件名中获取文件名的路径。","A string that is the name of the parent directory, the name of the last directory in the hierarchy, or the name of a file, including the file name extension.":"一个是父目录的名称，层次结构中的最后一个目录的名称或文件的名称，包括文件名扩展名。"," object, or -1 if the ":"对象，或-1如果","The total number of bytes written into the buffer. This can be less than the number of bytes requested if that number of bytes are not currently available, or zero if the end of the stream is reached before any bytes are read.":"写入缓冲区的字节总数。 如果该字节数当前不可用，则可能小于所请求的字节数，或者如果在读取任何字节之前到达流的末尾，则零。","The second path to combine.":"第二个组合路径。","The data for serializing or deserializing the object.":"用于序列化或应对对象的数据。","The characters in the read-only span returned by ":"仅读取的跨度中的字符由","The total number of bytes read into the buffer. This can be less than the number of bytes allocated in the buffer if that many bytes are not currently available, or zero (0) if the end of the memory stream has been reached.":"字节的总数读取到缓冲区中。 如果目前尚不可用，则可能小于缓冲区中分配的字节数，如果达到了内存流的末尾，则零（0）。"," has been closed.":"已被关闭。","The combined paths. If one of the specified paths is a zero-length string, this method returns the other path. If ":"组合路径。 如果指定的路径之一是零长度字符串，则此方法返回另一个路径。 如果",", minus the last period (.) and all characters following it.":"，减去最后一个时期（。）以及关注它的所有字符。","The source and destination for the object.":"对象的源和目的地。"," property contains the total number of bytes read into the ":"属性包含读取的字节总数"," was opened asynchronously; otherwise, ":"异步打开； 否则，","The path of the file.":"文件的路径。"," contains an absolute path, this method returns ":"包含一个绝对路径，此方法返回","An integer identifying the error that has occurred.":"识别发生错误的整数。","A long value representing the length of the stream in bytes.":"一个长的值表示字节中流的长度。",". The result value can be less than the number of bytes allocated in ":"。 结果值可以小于分配的字节数","The third path to combine.":"第三个组合路径。","The string returned by ":"返回的字符串","Matches using '*' and '?' wildcards.":"使用'*'和'？'匹配匹配项 通配符。"," if that many bytes are not currently available, or it can be 0 (zero) if the end of the memory stream has been reached.":"如果当前没有许多字节，则如果已达到内存流的末尾，则可以为0（零）。","A string that is the absolute path of the file.":"字符串是文件的绝对路径。","The combined paths.":"组合路径。","The byte cast to a ":"字节铸","Match using Win32 DOS style matching semantics.":"使用Win32 DOS样式匹配语义匹配。","The current position of this stream.":"该流的当前位置。","The file or directory for which to obtain absolute path information.":"获取绝对路径信息的文件或目录。","The fourth path to combine.":"联合的第四条路径。","An object that represents the operating system file handle for the file that the current ":"代表当前文件的操作系统文件句柄的对象","The fully qualified location of ":"完全合格的位置","The array of unsigned bytes from which to create the current stream.":"未签名字节的数组来创建当前流。","The new position within the stream. This is relative to the ":"流中的新位置。 这是相关的",", such as \"C:\\MyFile.txt\".":"，例如“ c：\\ myfile.txt”。","An array of parts of the path.":"路径的一部分。"," enum flags.":"枚举标志。","The array of unsigned bytes from which to create this stream.":"从中创建此流的无符号字节的数组。"," parameter, and can be positive or negative.":"参数，可能是正面的或负的。","A relative path to concatenate to ":"连续的相对路径","The path to analyze.":"分析的路径。","A non-negative number that represents the buffer size used by ":"一个非负数，代表使用的缓冲区大小","The setting of the ":"设置",", which acts as the seek reference point.":"，它充当寻求参考点。","The beginning of a fully qualified path.":"完全合格的道路的开始。"," if the path ends in a directory separator; otherwise, ":"如果路径在目录分离器中结束； 否则，"," for buffering.":"用于缓冲。","The new position within the stream, calculated by combining the initial reference point and the offset.":"流中的新位置，通过组合初始参考点和偏移来计算。"," property, which determines whether the stream supports writing.":"属性，确定流是否支持写作。","The absolute path.":"绝对路径。","The path to retrieve the directory information from.":"从中检索目录信息的路径。"," if the characters that follow the last directory separator character or volume separator in the path include a period (\".\") followed by one or more characters; otherwise, ":"如果跟随路径中最后一个目录分隔符或卷分隔符的字符包括一个（“。”），然后是一个或多个字符； 否则，","The value at which to set the length.":"设置长度的值。","An array containing the characters that are not allowed in file names.":"一个包含文件名中不允许的字符的数组。","The index into ":"索引进入"," if the characters that follow the last directory separator (\\ or /) or volume separator (:) in the path include a period (.) followed by one or more characters; otherwise, ":"如果遵循最后一个目录分隔符（\\ or /）或音量分隔符（:)在路径中的字符包括一个（。），然后是一个或多个字符； 否则，","Directory information for ":"目录信息","A new byte array.":"一个新的字节阵列。","An array containing the characters that are not allowed in path names.":"一个包含路径名中不允许的字符的数组。"," at which the stream begins.":"该流开始。","A read-only span of characters containing the path from which to obtain root directory information.":"仅读取字符的跨度，其中包含从中获得根目录信息的路径。","A file path.":"文件路径。",", the byte array segment from which this stream was created; when this method returns ":"，创建此流的字节数组段； 当此方法返回时",", or an empty span if ":"，或一个空的跨度","The length of the stream in bytes.":"字节中的流长度。","A read-only span of characters containing the root directory of ":"只读字符，包含的根目录",", an empty span, or a root (such as \\, C:, or \\\\server\\share).":"，一个空跨度或根（例如\\，c：，c：,, \\\\ server \\ share）。"," if the path is fixed to a specific drive or UNC path; ":"如果路径固定在特定驱动器或UNC路径上；",", this parameter is set to ":"，此参数设置为",", which returns the unsigned byte array from which the stream was created; otherwise, ":"，它返回创建流的无符号字节数组； 否则，"," denotes a root directory or is null. Returns ":"表示根目录或为null。 返回"," if the path is relative to the current drive or working directory.":"如果路径相对于当前驱动器或工作目录。"," if the buffer is exposable; otherwise, ":"如果缓冲区可暴露； 否则，","A string containing the path from which to obtain root directory information.":"一个包含从中获取根目录信息的路径的字符串。","The initial size of the internal array in bytes.":"字节内部数组的初始大小。"," does not contain directory information.":"不包含目录信息。"," contains a root; otherwise, ":"包含根； 否则，","The root directory of ":"根目录的根目录","The byte to write.":"字节写。","The minimum buffer size, in number of 16-bit characters.":"最小缓冲区大小，16位字符的数量。","A character span that contains the first path to join.":"字符跨度包含第一个连接路径。","The file path from which to get the extension.":"获取扩展名的文件路径。"," if it is rooted.\n\n -or-\n \n":"如果扎根。 \n\n  -或者-","The stream to write this memory stream to.":"流将此内存流写入。","An integer representing the next character to be read, or -1 if there are no characters to be read or if the stream does not support seeking.":"代表要读取的下一个字符的整数，或者-1如果没有字符要读取或流不支持寻求。"," if the stream is open.":"如果流打开。","A character span that contains the second path to join.":"字符跨度包含第二个路径。"," does not contain root directory information.\n\n -or-\n \n":"不包含根目录信息。 \n\n  -或者-","The extension of the specified path (including the period, \".\"), or ":"指定路径的扩展（包括时期，“。”）或","The next character from the input stream represented as an ":"输入流的下一个字符表示为"," if the stream supports writing; otherwise, ":"如果流支持写作； 否则，","A character span that contains the third path to join.":"字符跨度包含第三个路径。"," does not have extension information.":"没有扩展信息。"," or is effectively empty.":"或有效为空。","The length of the usable portion of the buffer for the stream.":"该流的缓冲区的可用部分的长度。","The concatenated path.":"串联路径。"," object, or -1 if no more characters are available.":"对象，或-1如果没有更多字符可用。","The path string from which to get the extension.":"从中获取扩展名的路径字符串。","A random folder name or file name.":"随机文件夹名称或文件名。","A character span that contains the fourth path to join.":"字符跨度包含连接的第四条路径。","The current position within the stream.":"流中的当前位置。","The source path the result should be relative to. This path is always considered to be a directory.":"源路径结果应与之相关。 该路径始终被认为是目录。","When this method returns, contains the specified character array with the values between ":"当此方法返回时，包含指定的字符数组","The extension of the specified path (including the period \".\"), or ":"指定路径的扩展（包括期间“。”）或","The first path to join.":"加入的第一个途径。"," if an encoding was not specified.":"如果未指定编码。","The destination path.":"目标路径。",") replaced by the characters read from the current source.":"）由从当前源读取的字符代替。","The second path to join.":"加入的第二个途径。","The relative path, or ":"相对路径，或"," does not have extension information, ":"没有扩展信息，","The string to which the ":"弦","The number of characters that have been read, or 0 if at the end of the stream and no data was read. The number will be less than or equal to the ":"已读取的字符数量，如果在流的末尾且没有读取数据，则为0。 该数字将小于或等于","The third path to join.":"加入的第三条途径。"," if the paths don't share the same root.":"如果路径没有共享相同的根。","The fourth path to join.":"加入的第四条途径。"," parameter, depending on whether the data is available within the stream.":"参数，取决于数据是否可用。"," should be initialized.":"应该初始化。","A read-only span that contains the path from which to obtain the file name and extension.":"仅读取跨度，其中包含从中获得文件名和扩展名的路径。","The full path of the temporary file.":"临时文件的完整路径。","An array of paths.":"一系列路径。","When this method returns, contains the specified span of characters replaced by the characters read from the current source.":"当此方法返回时，包含由当前源读取的字符代替的字符的指定跨度。","An integer representing the next character to be read, or -1 if no more characters are available or the stream does not support seeking.":"代表要读取的下一个字符的整数，或者-1如果没有更多字符或流不支持寻求的字符。","The path to the temporary folder, ending with a  ":"临时文件夹的路径，以","The path to trim.":"修剪的路径。"," length, depending on whether the data is available within the stream.":"长度，取决于数据是否可用。","The next character from the underlying string, or -1 if no more characters are available.":"基础字符串的下一个字符或-1，如果没有更多字符可用。","The path to search for an extension.":"搜索扩展的途径。"," - 1) replaced by the characters read from the current source.":" -  1）被当前源读取的字符所取代。"," without any trailing directory separators.":"没有任何尾随目录分离器。","The starting index in the buffer.":"缓冲区中的起始索引。","The maximum number of characters to read. If the end of the stream is reached before the specified number of characters is written into the buffer, the current method returns.":"最多要读的字符数。 如果在将指定数量的字符写入缓冲区中之前到达流的末端，则当前方法返回。","A character span to hold the concatenated path.":"字符跨度以保持串联路径。","The total number of characters read into the buffer. This can be less than the number of characters requested if that many characters are not currently available, or zero if the end of the underlying string has been reached.":"字符总数读取到缓冲区中。 如果目前没有许多字符，则可能小于所请求的字符数，或者如果达到了基础字符串的末尾，则零。"," parameter contains the total number of characters read into the buffer. The result value can be less than the number of characters requested if the number of characters currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"参数包含读取到缓冲区的字符总数。 如果当前可用的字符数小于请求的数字，则结果值可能小于请求的字符数，也可以小于所请求的数字，或者如果达到流的末尾，则可以为0（零）。","When the method returns, a value that indicates the number of characters written to the ":"当方法返回时，一个指示写入字符数的值","When this method returns, contains the characters read from the current source. If the total number of characters read is zero, the span remains unmodified.":"当此方法返回时，包含从当前源读取的字符。 如果读取的字符总数为零，则跨度保持不变。"," if the concatenation operation is successful; otherwise, ":"如果串联操作成功； 否则，","When this method returns, contains the specified memory block of characters replaced by the characters read from the current source.":"当此方法返回时，包含由当前源读取的字符代替的字符的指定内存块。","The total number of characters read into the buffer.":"字符总数读取到缓冲区中。","The file handle.":"文件处理。","A value task that represents the asynchronous read operation. The value of the type parameter of the value task contains the number of characters that have been read, or 0 if at the end of the stream and no data was read. The number will be less than or equal to the ":"代表异步读取操作的价值任务。 值任务的类型参数的值包含已读取的字符数，或者在流的末尾且没有读取数据。 该数字将小于或等于","The maximum number of characters to read. If the end of the string is reached before the specified number of characters is written into the buffer, the method returns.":"最多要读的字符数。 如果在将指定数量的字符写入缓冲区中之前到达字符串的末端，则方法返回。","A long value representing the length of the file in bytes.":"长度表示字节中的文件长度。","The number of characters that have been read. The number will be less than or equal to ":"已读取的字符数量。 该数字将小于或等于"," parameter contains the total number of bytes read into the buffer. The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the string has been reached.":"参数包含读取到缓冲区的字节总数。 如果当前可用的字节数小于请求的数字，则结果值可能小于请求的字节数，或者如果达到字符串的末尾，则可以为0（零）。","A list of memory buffers. When this method returns, the contents of the buffers are replaced by the bytes read from the file.":"内存缓冲区列表。 当此方法返回时，缓冲区的内容被文件读取的字节替换。","When this method returns, contains the characters read from the current source.":"当此方法返回时，包含从当前源读取的字符。",", depending on whether all input characters have been read.":"，取决于是否已读取所有输入字符。"," parameter contains the total number of characters read into the buffer.":"参数包含读取到缓冲区的字符总数。","The file position to read from.":"要读取的文件位置。","The number of characters that have been read. The number will be less than or equal to the ":"已读取的字符数量。 该数字将小于或等于","A task representing the asynchronous read operation. The value of the ":"代表异步读取操作的任务。 价值"," length, depending on whether all input characters have been read.":"长度，取决于是否已读取所有输入字符。","The total number of bytes read into the buffers. This can be less than the number of bytes allocated in the buffers if that many bytes are not currently available, or zero (0) if the end of the file has been reached.":"字节的总数读取为缓冲区。 如果目前尚不可用，则可能小于缓冲区中分配的字节数，如果达到文件的末尾，则零（0）。","The maximum number of characters to read. If the end of the stream is reached before the specified number of characters is written into the buffer, the method returns.":"最多要读的字符数。 如果在将指定数量的字符写入缓冲区中之前到达流的末端，则方法返回。","The next line from the current string, or ":"来自当前字符串的下一行，或","A region of memory. When this method returns, the contents of this region are replaced by the bytes read from the file.":"记忆区域。 当此方法返回时，该区域的内容被文件中读取的字节替换。","A value task that represents the asynchronous read operation. The value of the type parameter of the value task contains the total number of characters read into the buffer. The result value can be less than the number of characters requested if the number of characters currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"代表异步读取操作的价值任务。 值任务的类型参数的值包含读取到缓冲区的字符总数。 如果当前可用的字符数小于请求的数字，则结果值可能小于请求的字符数，也可以小于所请求的数字，或者如果达到流的末尾，则可以为0（零）。","The total number of bytes read into the buffer. This can be less than the number of bytes allocated in the buffer if that many bytes are not currently available, or zero (0) if the end of the file has been reached.":"字节的总数读取到缓冲区中。 如果目前尚不可用，则可能小于缓冲区中分配的字节数，如果达到文件的末尾，则零（0）。"," if the end of the string is reached.":"如果达到字符串的末端。","The next line from the input stream, or ":"输入流的下一行，或"," parameter contains the next line from the string reader, or is ":"参数包含来自字符串读取器的下一行，或IS","A list of memory buffers. When this method returns, the contents of these buffers are replaced by the bytes read from the file.":"内存缓冲区列表。 当此方法返回时，这些缓冲区的内容将被文件读取的字节替换。"," if the end of the input stream is reached.":"如果到达输入流的末端。"," parameter contains the next line from the stream, or is ":"参数包含来自流的下一行，或","The content from the current position to the end of the underlying string.":"从当前位置到基础字符串末端的内容。","A list of memory buffers. This method copies the contents of these buffers to the file.":"内存缓冲区列表。 此方法将这些缓冲区的内容复制到文件中。"," parameter contains a string with the characters from the current position to the end of the string.":"参数包含一个带有从当前位置到字符串末端的字符的字符串。"," if all the characters have been read.":"如果所有字符都已阅读。","The file position to write to.":"要写入的文件位置。","The rest of the stream as a string, from the current position to the end. If the current position is at the end of the stream, returns an empty string (\"\").":"从当前位置到末端，该流的其余部分作为字符串。 如果当前位置位于流的末端，请返回一个空字符串（“”）。"," object that controls formatting.":"控制格式的对象。","A region of memory. This method copies the contents of this region to the file.":"记忆区域。 此方法将该区域的内容复制到文件。","The string containing the characters written to the current ":"包含写入当前字符的字符串"," parameter contains a string with the characters from the current position to the end of the stream.":"参数包含一个带有从当前位置到流末端的字符的字符串。","A task representing the asynchronous completion of the write operation.":"代表写操作的异步完成的任务。","The position in the buffer at which to start reading data.":"缓冲区开始读取数据的位置。","The underlying stream.":"基础流。","A reference to the allocated ":"对分配的参考","The current character encoding used by the current reader. The value can be different after the first call to any ":"当前读者使用的当前字符编码。 在第一次调用任何人之后，该值可能会有所不同","A span of chars to write to the string.":"写入字符串的字符跨度。","The number of bytes read from the stream, between zero (0) and the number of bytes you requested. Streams return zero (0) only at the end of the stream, otherwise, they should block until at least one byte is available.":"从流读取的字节数，零（0）和您请求的字节数之间。 流仅在流的末端返回零（0），否则，它们应阻止至少一个字节。"," method of ":"的方法","An array of bytes. When this method returns, the buffer contains the specified byte array with the values between ":"一系列字节。 当此方法返回时，缓冲区包含指定的字节数组",", since encoding autodetection is not done until the first call to a ":"，由于编码自动检测直到第一次调用"," if the current stream position is at the end of the stream; otherwise ":"如果当前的流位置位于流的末端； 否则"," at which to begin storing the data read from the current stream.":"在其中开始存储从当前流读取的数据。","The maximum number of bytes to be read from the current stream.":"从当前流读取的最大字节数。","The buffer size, in bytes.":"缓冲区大小，字节。","The total number of bytes read into the buffer. This can be less than the number of bytes requested if that many bytes are not currently available, or zero (0) if the end of the stream has been reached.":"字节的总数读取到缓冲区中。 如果当前不可用的字节不可用，则可能小于所请求的字节数，或者如果到达流的末尾，则零（0）。","The complete file path to write to. ":"完整的文件路径写入。","A byte offset relative to the ":"一个字节相对于"," can be a file name.":"可以是文件名。"," indicating the reference point used to obtain the new position.":"指示用于获得新位置的参考点。","The complete file path to write to.":"完整的文件路径写入。"," to append data to the file; ":"将数据附加到文件中；","The new position within the current stream.":"当前流中的新位置。"," to overwrite the file. If the specified file does not exist, this parameter has no effect, and the constructor creates a new file.":"覆盖文件。 如果不存在指定的文件，则该参数没有效果，并且构造函数将创建一个新文件。","A thread-safe ":"线程安全","The array \"buffer\" argument passed to the reading or writing method.":"数组“缓冲区”参数传递给读取或写作方法。","The character to write to the stream.":"写入流的角色。","A character array containing the data to write. If ":"一个包含要编写数据的字符数组。 如果","The integer \"offset\" argument passed to the reading or writing method.":"整数“偏移”参数传递给读取或写作方法。",", nothing is written.":"，什么都没有写。","The integer \"count\" argument passed to the reading or writing method.":"整数“计数”参数传递给读取或写作方法。","A character array that contains the data to write.":"字符数组包含要编写的数据。"," \"destination\" argument passed to the copy method.":"“目标”参数传递给复制方法。","The character position in the buffer at which to start reading data.":"在缓冲区中开始读取数据的角色位置。","The integer \"bufferSize\" argument passed to the copy method.":"整数“缓冲”参数传递给复制方法。","The maximum number of characters to write.":"要写的最大字符数。","An array of bytes. This method copies ":"一系列字节。 此方法复制","The character span to write.":"要写的字符跨度。"," bytes from ":"字节来自"," to the current stream.":"到当前流。","The string to write to the stream. If ":"要写入流的字符串。 如果"," is null, nothing is written.":"是无效的，什么也没写。","The number of bytes to be written to the current stream.":"要写入当前流的字节数。"," if the stream supports reading; otherwise, ":"如果流支持阅读； 否则，","The object to format and write.":"格式和写入的对象。"," if the stream supports seeking; otherwise, ":"如果溪流支持寻求； 否则，","The first object to format and write.":"格式和写入的第一个对象。","A value that determines whether the current stream can time out.":"确定当前流是否可以超时的值。","A value, in milliseconds, that determines how long the stream will attempt to read before timing out.":"以毫秒为单位的值决定了流在计时之前尝试阅读多长时间的值。","The second object to format and write.":"格式和写入的第二个对象。","The third object to format and write.":"格式和写入的第三个对象。","A value, in milliseconds, that determines how long the stream will attempt to write before timing out.":"以毫秒为单位的值决定了流在计时之前尝试写入多长时间。","An object array that contains zero or more objects to format and write.":"一个包含零或更多对象的对象数组进行格式和写入。","The stream to be read.":"要读的流。","Indicates whether to look for byte order marks at the beginning of the file.":"指示是否在文件开头查找字节订单标记。","The character position in the buffer at which to begin reading data.":"在缓冲区中开始读取数据的角色位置。","The minimum buffer size.":"最小缓冲尺寸。","The character memory region to write to the stream.":"字符存储区域要写入流。","The stream to read.":"读的流。","The character span to write to the stream.":"写入流的字符跨度。"," to look for byte order marks at the beginning of the file; otherwise, ":"在文件开头寻找字节订单标记； 否则，","The string to write. If ":"要写的字符串。 如果","The complete file path to be read.":"完整的文件路径要读取。",", only the line terminator is written.":"，只写线终结者。","An object that specifies the configuration options for the underlying ":"一个指定基础配置选项的对象","The string to write. If the value is ":"要写的字符串。 如果值为",", only a line terminator is written.":"，只写了一个线终结者。"," to force ":"强迫"," to flush its buffer; otherwise, ":"冲洗缓冲液； 否则，","The stream this ":"流这个"," is writing to.":"正在写信。"," specified in the constructor for the current instance, or ":"在当前实例的构造函数中指定，或"}