{" that is the highlight color of a 3-D element.":"这就是3-D元素的亮点。"," that is the dark shadow color of a 3-D element.":"那就是3-D元素的深色阴影颜色。"," that is the face color of a 3-D element.":"那就是3-D元素的面部颜色。"," that is the color of the application workspace.":"这就是应用程序工作空间的颜色。"," that is the shadow color of a 3-D element.":"那就是3-D元素的阴影颜色。"," that is the light color of a 3-D element.":"那就是3-D元素的浅色。"," that is the color of the desktop.":"那就是桌面的颜色。"," that is the lightest color in the color gradient of an inactive window's title bar.":"那是不活动窗口标题栏的颜色梯度中最轻的颜色。"," that is the color of text in a 3-D element.":"这就是3-D元素中文本的颜色。"," that is the lightest color in the color gradient of an active window's title bar.":"这是活动窗口标题栏的颜色梯度中最轻的颜色。"," that is the color of dimmed text.":"那就是昏暗文本的颜色。"," that is the color of an inactive window's border.":"那就是一个不活动的窗口的颜色。"," that is the color used to designate a hot-tracked item.":"那是用于指定热跟踪物品的颜色。"," that is the color of the background of selected items.":"那就是所选项目背景的颜色。"," that is the color of the background of an inactive window's title bar.":"那就是不活动窗口标题栏的背景的颜色。"," that is the color of the text of selected items.":"那就是所选项目文本的颜色。"," that is the color of the background of a ToolTip.":"那就是工具提示背景的颜色。"," that is the color of the text in an inactive window's title bar.":"这就是文本的颜色，在不活动的窗口的标题栏中。"," that is the color used to highlight menu items when the menu appears as a flat menu.":"当菜单以平面菜单出现时，这就是用于突出显示菜单项的颜色。"," that is the color of a menu's background.":"那就是菜单背景的颜色。"," that is the color of the background of a scroll bar.":"那就是滚动条的背景的颜色。"," that is the color of the text of a ToolTip.":"那就是工具提示文本的颜色。"," that is the color of a menu's text.":"那就是菜单文本的颜色。"," that is the color of the background of a menu bar.":"那就是菜单栏背景的颜色。","The tag class for this tag.":"此标签的标签类。"," that is the color of the background in the client area of a window.":"这就是窗口客户端区域中背景的颜色。"," that is the color of a window frame.":" 那是窗框的颜色。","One of the enumeration values that specifies the semantic type for this tag.":"指定此标签的语义类型的枚举值之一。"," for a constructed tag, ":"对于构造的标签，","The numeric value for this tag.":"此标签的数值。"," that is the color of the text in the client area of a window.":"这就是窗口客户端区域中文本的颜色。"," values, but whose ":"值，但谁","A tag with the same ":"一个标签"," for a primitive tag.":"用于原始标签。","The decoded tag.":"解码标签。","The number of bytes required for the BER-encoding of this tag.":"该标签的ber编码所需的字节数。","The read only byte sequence whose beginning is a BER-encoded tag.":"其开头为BER编码标记的只读字节序列。","The number of bytes written to ":"写入的字节数","The start of where the encoded tag should be written.":"应写入编码标签的开始。","When this method returns, contains the number of bytes that contributed to the encoded tag. This parameter is treated as uninitialized.":"当此方法返回时，包含对编码标签贡献的字节数。 该参数被视为非初始化。"," has the same values for ":"具有相同的值"," is not an ":"不是"," has the same ":"有相同的","A text representation of this tag suitable for debugging.":"适合调试的标签的文本表示形式。","Tag to test for equality.":"标签以测试平等。","Object to test for value equality.":"对象测试值平等。","Tag to test for concept equality.":"标签以测试概念平等。"," as this tag, ":"作为此标签，","When this method returns, contains the number of bytes that contributed to the encoded tag, 0 on failure. This parameter is treated as uninitialized.":"当此方法返回时，包含对编码标签贡献的字节数，在失败上为0。 该参数被视为非初始化。"," on success, 0 on failure.":"成功，0失败。","The buffer containing encoded data.":"包含编码数据的缓冲区。","The tag to check for before reading, or ":"阅读前要检查的标签，或"," have the same BER encoding, ":"具有相同的ber编码，"," < ":"<"," if a tag was correctly decoded; otherwise, ":"如果标签正确解码； 否则，"," for the default tag (Universal 3).":"对于默认标签（通用3）。","The encoding constraints to use when interpreting the data.":"解释数据时要使用的编码约束。","(), ":"（），，","Receives the value from ":"从"," have a different BER encoding, ":"有不同的编码，","An array containing the contents of the Bit String value.":"包含位字符串值内容的数组。","The exception that is the cause of the current exception.":"例外是当前异常的原因。",".\n              This parameter is treated as uninitialized.":"。 \n               该参数被视为非初始化。","The decoded value.":"解码值。","On success, receives the number of bits in the last byte which were reported as \"unused\" by the writer.\n               This parameter is treated as uninitialized.":"成功时，收到了最后一个字节中作者“未使用”的位置的数量。 \n                该参数被视为非初始化。","When this method returns, the number of bytes in the content payload (which may be 0).\n              This parameter is treated as uninitialized.":"当此方法返回时，内容有效载荷中的字节数（可能为0）。 \n               该参数被视为非初始化。"," for the default tag (Universal 1).":"对于默认标签（通用1）。"," for the default tag (Universal 10).":"对于默认标签（通用10）。","One of the enumeration values which represents the value type to process.":"代表要处理的值类型的枚举值之一。","When this method returns, the total number of bytes for the encoded value.\n               This parameter is treated as uninitialized.":"当此方法返回时，编码值的字节总数。 \n                该参数被视为非初始化。","When this method returns, the total number of bytes for the encoded value.\n              This parameter is treated as uninitialized.":"当此方法返回时，编码值的字节总数。 \n               该参数被视为非初始化。"," for the default tag (Universal 24).":"对于默认标签（通用24）。"," for the universal tag that is appropriate to the requested encoding type.":"对于适合要求的编码类型的通用标签。","The slice of the buffer containing the bytes of the Enumerated value, in signed big-endian form.":"缓冲区的切片，包含枚举值的字节，以带符号的大端形式。","The tag identifying the content.":"标记内容的标签。","The bits from the encoded value.":"来自编码值的位。"," for the default tag (Universal 2).":"对于默认标签（通用2）。","When this method returns, the offset of the content payload relative to the start of ":"当此方法返回时，内容有效载荷相对于开始的偏移","Type object representing the destination type.":"代表目标类型的对象类型。","The NamedBitList value converted to a ":"命名列表的值转换为","The decoded object identifier, in dotted-decimal notation.":"解码的对象标识符，用虚线符号表示法。","When this method returns, the number of bytes in the content payload (which may be 0).\n               This parameter is treated as uninitialized.":"当此方法返回时，内容有效载荷中的字节数（可能为0）。 \n                该参数被视为非初始化。"," for the default tag (Universal 5).":"对于默认标签（通用5）。","The Enumerated value converted to a ":"枚举值转换为","The decoded numeric value.":"解码的数字值。"," for the default tag (Universal 4).":"对于默认标签（通用4）。"," for the default tag (Universal 16).":"对于默认标签（通用16）。"," for the default tag (Universal 6).":"对于默认标签（通用6）。"," for the default tag (Universal 17).":"对于默认标签（通用17）。","The slice of the buffer containing the bytes of the Integer value, in signed big-endian form.":"包含整数值字节的缓冲区的切片，以签名的大型形式。","An array containing the contents of the Octet String value.":"一个包含八位位字符串值内容的数组。","The largest year to represent with this value.\n               The default value, 2049, represents the 1950-2049 range for X.509 certificates.":"代表此价值的最大一年。 \n                默认值2049代表X.509证书的1950-2049范围。"," to always accept the data in the order it is presented, ":"始终以呈现的顺序接受数据，",".\n               This parameter is treated as uninitialized.":"。 \n                该参数被视为非初始化。"," and the reader does not advance.":"而且读者不会前进。","The buffer in which to write.":"写作的缓冲区。"," to verify that the data is sorted correctly when the encoding rules say sorting was required (CER and DER).":"为了验证当需要编码规则说排序时正确排序数据（CER和DER）。","When this method returns, the tag identifying the content.\n              This parameter is treated as uninitialized.":"当此方法返回时，标签识别内容。 \n               该参数被视为非初始化。"," is large enough to receive the value of the Bit String; otherwise, ":" 大到足以接收位串的值；否则, "," if the character string value has a primitive encoding; otherwise, ":"如果字符字符串值具有原始编码； 否则，","When this method returns, the total number of bytes written to ":"当此方法返回时，字节的总数写入"," represents a valid structural encoding for the specified encoding rules; otherwise, ":"代表指定的编码规则的有效结构编码； 否则，","The tag to check for before reading.":"阅读前要检查的标签。","When this method returns, the number of chars written to ":"当此方法返回时，将字符的数量写入","The decoded tag value.":"解码的标签值。","On success, receives a slice of the input buffer that corresponds to the value of the Octet String.\n               This parameter is treated as uninitialized.":"在成功时，接收与八位字节字符串的值相对应的输入缓冲区的切片。\n               此参数被视为未初始化。","On success, receives the interpreted numeric value.\n               This parameter is treated as uninitialized.":"成功后，接收解释的数值。\n               此参数被视为未初始化。","On success, receives the number of bytes written to ":"在成功时，接收写入的字节数 ","On success, receives the number of bits in the last byte which were reported as \"unused\" by the writer.":"成功时，收到了最后一个字节中作者“未使用”的位置的数量。"," if the Octet String value has a primitive encoding; otherwise, ":"如果八位位字符串值具有原始编码； 否则，"," if the Integer represents value is between ":"如果整数表示值"," and advances the reader if ":" 并推进读者，如果 "," is large enough to receive the value of the unprocessed character string; otherwise, ":"足够大，可以接收未加工的字符串的值； 否则，","A copy of the value in a newly allocated, precisely sized, array.":"在新分配的，精确的大小，数组中的值副本。",", inclusive; otherwise, ":"， 包括的; 否则，","The data to read.":"要读取的数据。"," had sufficient length to receive the value, otherwise ":"有足够的长度接收该值，否则","A new reader positioned at the first value in the sequence (or with ":"在序列中以第一个值定位的新读者（或",", inclusive; otherwise ":"， 包括的; 否则","One of the enumeration values representing the value type to process.":"代表要处理的值类型的枚举值之一。","The encoding constraints for the reader.":"读者的编码约束。"," is large enough to receive the value of the Octet String; otherwise, ":"足够大，可以接收八位位字符串的值； 否则，"," is returned and the reader advances.":"退回并读者进步。"," view of the next encoded value.":"下一个编码值的视图。"," == ":" == ","On success, receives a ":"成功，收到","On success, receives a slice of the input buffer that corresponds to the value of the Bit String.\n               This parameter is treated as uninitialized.":"在成功时，接收与位串的值相对应的输入缓冲区的切片。\n               此参数被视为未初始化。","The bytes of the Enumerated value, in signed big-endian form.":"枚举价值的字节，以签名的大型形式。"," over the original data corresponding to the value of the BIT STRING.":"在与位字符串值相对应的原始数据上。","Additional options for the reader.":"阅读器的附加选项。","A new reader positioned at the first value in the set-of (or with ":"一个新的读者，位于第一个值的位置（或"," and advances the reader if the BIT STRING value had a primitive encoding, ":"如果位字符串值具有原始编码，则会推进读者"," if the Bit String value has a primitive encoding and all of the bits reported as unused are set to 0; otherwise, ":"如果位字符串值具有原始编码，并且报告为未使用的所有位均设置为0； 否则，","The largest year to represent with this value.":"代表此价值的最大一年。","The bytes of the contents octets of the next encoded value.":"下一个编码值的内容八位字节的字节。","The bytes of the Integer value, in signed big-endian form.":"整数值的字节，以签名的大型形式。","The bytes of the next encoded value.":"下一个编码值的字节。"," over the original data corresponding to the value of the OCTET STRING.":"超过对应于八位位字符串值的原始数据。"," and does not advance the reader if it had a constructed encoding.":" 并且不推进读者，如果它有一个构造的编码。","The object identifier value in a dotted decimal format string.":"对象标识符值以虚线小数格式字符串。"," for the default tag (Universal 23).":" 为默认标记（通用23）。"," over the original data corresponding to the value of the character string.":"在与字符串值相对应的原始数据上。"," and advances the reader if the OCTET STRING value had a primitive encoding, ":"并推进读者，如果八位位字符串值具有原始编码，"," if the encode succeeded, ":"如果编码成功，","The writer to receive the value.":"作者接收价值。","On success, receives the number of chars written to ":"成功，收到写信给的字符数量"," is too small.":"太小。"," and advances the reader if the character string value had a primitive encoding, ":"并推进读者，如果字符字符串值具有原始编码，"," if there is more data available for the reader to process; otherwise, ":"如果有更多数据可供读者处理； 否则，","A precisely-sized array containing the encoded value.":"包含编码值的精确数组。","On success, receives the decoded value.":"成功，收到解码值。","The number of trailing bits which are not semantic.":"不是语义的尾随钻头的数量。","The integer value to write, in signed big-endian byte order.":"以签名的大型字节顺序写的整数值。","The encoding rules in use by this reader.":"该读者使用的编码规则。"," and does not advance the reader if the value is not between ":"如果值不在之间，则不会推动读者","The instance to compare encoded values against.":"比较编码值的实例。"," if the reader should not validate that a Set or Set-Of value is sorted correctly for the current encoding rules; otherwise ":"如果读者不应验证当前编码规则正确排序的集值或集值； 否则"," if the pending encoded data is identical to ":"如果待处理的编码数据与","One of the enumeration values representing the encoding to use.":"表示要使用的编码的枚举值之一。"," to leave the stream object open after disposing the ":"在处置流程后将流对象打开",".\n              The default is ":"。 \n               默认值为","The encoded value to compare against.":"与之比较的编码值。","The integer value to write, in unsigned big-endian byte order.":"要写入的整数值，以无符号大端字节顺序。","The stream to compress or decompress.":"流以压缩或解压缩。","The string to write.":"要写的字符串。","The number of bytes that would be written by ":"由","The boxed enumeration value to write.":"盒装枚举值要写。","The bits to write.":"写的碎片。","The largest year to represent with a UtcTime value. The default is 2049.":"用UtcTime值表示的最大年份。 默认值为2049。","The byte array to read the data into.":"字节阵列将数据读取。","The tag to write, or ":"写的标签，或","The enumeration value to write.":"要写的枚举价值。","The encoding constraints for the writer.":"作者的编码约束。"," to treat the fractional seconds in ":" 处理分数秒 ","A disposable value which will automatically call ":"一次可自动调用的一次性价值","An  object that represents the asynchronous read operation, which could still be pending.":"代表异步读取操作的对象，仍然可以待处理。","The object identifier to write.":"要编写的对象标识符。"," as 0 even if a non-zero value is present.":"AS 0即使存在非零值。",", or -1 if at the end of the stream.":"，或-1如果在流的末端。","The maximum valid year for ":"最大的有效年份","The buffer to write data from.":"从中写入数据的缓冲区。","The size, in bytes, of the buffer. This value must be greater than zero. The default size is 81920.":"缓冲区的大小（以字节为单位）。 此值必须大于零。 默认大小为81920。"," at which to begin writing.":"开始写作。","A region of memory. This method copies the contents of this region to the current Deflate stream.":"记忆区域。 该方法将该区域的内容复制到当前气流流。",", after conversion to UTC.\n              For the X.509 Time.utcTime range of 1950-2049, pass ":"，转换为UTC后。 \n               对于X.509 Time.1950-2049的电时间范围","A task that represents the asynchronous copy operation.":"代表异步复制操作的任务。"," to begin writing from.":"开始写作。","A reference to the outstanding asynchronous I/O request.":"引用未偿还的异步I/O请求。"," from which to begin copying bytes to the Deflate stream.":"从中开始将字节复制到气门流。","An optional asynchronous callback to be called when the write operation is complete.":"写操作完成时要调用的可选异步回调。","The stream to which the contents of the current Deflate stream will be copied.":"当前气流流的内容将被复制到所在的流中。","The region of memory to write data from.":"记忆区域以从中写入数据。","The number of bytes that were read into the byte array.":"读取到字节数组中的字节数。","The encoding rules in use by this writer.":"此编写器正在使用的编码规则。","The size of the buffer. This value must be greater than zero. The default size is 81920.":"缓冲区的大小。 该值必须大于零。 默认大小为81920。","An  object that represents the asynchronous write operation, which could still be pending.":"代表异步写操作的对象，仍然可以待处理。",", and the underlying stream is opened and supports reading; otherwise, ":"，并打开了基础流并支持阅读； 否则，"," at which to begin writing data from the Deflate stream.":"在其中开始从Deflate流编写数据。","The stream to write the compressed data to.":"流将压缩数据写入。","The stream to which the contents of the current GZip stream will be copied.":"当前GZIP流的内容将被复制到所在的流中。"," to finish writing the archive and release unmanaged and managed resources; ":"撰写档案并释放未管理和托管资源；"," from which to begin copying bytes to the GZip stream.":" 从中开始将字节复制到GZip流。",". The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the Deflate stream has been reached.":"。 如果当前可用的字节数小于请求的数字，则结果值可以小于所请求的字节数，也可以小于所请求的数字，或者如果达到温度流的末尾，则可以为0（零）。","The stream the compressed or decompressed data is written to.":"流将压缩或解压缩数据写入流。"," at which to begin writing data from the GZip stream.":"在其中开始从GZIP流编写数据。","A path, relative to the root of the archive, that identifies the entry to retrieve.":"相对于存档的根，可以识别检索的条目。","A task that represents the asynchronous read operation, which wraps the total number of bytes read into the buffer. The result value can be less than the number of bytes allocated in the buffer if that many bytes are not currently available, or it can be 0 (zero) if the end of the Deflate stream has been reached.":"代表异步读取操作的任务，该任务将读取到缓冲区的字节总数包裹。 结果值可能小于缓冲区中分配的字节数量，如果当前不可用的字节，则可以少，如果达到了放气流的末端，则可以为0（零）。","The stream that contains the archive to be read.":"包含要读取的存档的流。","The buffer containing data to write to the current stream.":"包含数据写入当前流的缓冲区。",". The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the GZip stream has been reached.":"。 如果当前可用的字节数小于请求的数字，则结果值可以小于所请求的字节数，或者如果达到GZIP流的末尾，则可以为0（零）。","A wrapper for the specified entry in the archive; ":"档案中指定条目的包装器；","The zip archive that the entry belongs to, or ":"该条目属于或","The input or output stream.":"输入或输出流。","A task that represents the asynchronous read operation, which wraps the total number of bytes read into the buffer. The result value can be less than the number of bytes allocated in the buffer if that many bytes are not currently available, or it can be 0 (zero) if the end of the GZip stream has been reached.":"代表异步读取操作的任务，该任务将读取到缓冲区的字节总数包裹。 结果值可能小于缓冲区中分配的字节数量，如果当前不可用的字节，则可以少，或者如果达到GZIP流的末尾，则可以为0（零）。","The unsigned byte cast to an ":"未签名的字节铸"," if the entry does not exist in the archive.":"如果存档中不存在该条目。"," if the entry has been deleted.":"如果输入已删除。","One of the enumeration values that indicates whether the zip archive is used to read, create, or update entries.":"枚举值之一，指示ZIP档案是用于读取，创建或更新条目的。","The collection of entries that are currently in the zip archive.":"当前在邮政编码中的条目集合。","A region of memory. This method copies the contents of this region to the current GZip stream.":"记忆区域。 该方法将该区域的内容复制到当前的GZIP流。","The byte offset in array at which to begin reading data from the stream.":"字节偏移阵列中以开始从流中读取数据。","The compressed size of the entry in the zip archive.":"拉链存档中条目的压缩大小。","The encoding to use when reading or writing entry names in this archive. Specify a value for this parameter only when an encoding is required for interoperability with zip archive tools and libraries that do not support UTF-8 encoding for entry names.":"在此存档中读取或编写条目名称时使用的编码。 仅当与不支持不支持输入名称编码UTF-8编码的ZIP存档工具和库的互操作性需要编码时，才能指定此参数的值。","The span to read the data into.":"将数据读取的跨度。"," at the root of the archive; ":"在档案的根源；","One of the enumeration values that describes the type of action (read, create, or update) the zip archive can perform on entries.":"枚举值之一描述了ZIP存档可以在条目上执行的操作类型（读取，创建或更新）。","An unsigned integer (4 bytes) representing the CRC-32 field.":"一个无符号整数（4个字节），代表CRC-32字段。","A path, relative to the root of the archive, that specifies the name of the entry to be created.":"相对于存档的根，指定要创建的条目的名称。","The number of bytes that were read into the byte span.":"读取到字节跨度的字节数。","The stream that represents the contents of the entry.":"表示条目内容的流。"," to include only the contents of the directory.":"仅包括目录的内容。","An empty entry in the zip archive.":"拉链存档中的空入口。","The external attributes written by the application when this entry was written. It is both host OS and application dependent.":"编写本条目时，应用程序编写的外部属性。 它既是主机OS又是应用程序依赖性。","A task that represents the asynchronous completion of the operation.":"代表操作的异步完成的任务。","The relative path of the entry, which is the value stored in the ":"条目的相对路径，即存储在","The path to the archive that is to be extracted.":"要提取的档案的路径。","One of the enumeration values that indicates whether to emphasize speed or compression effectiveness when creating the entry.":"枚举值之一指示在创建条目时是否强调速度或压缩效率。","The relative path of the entry in the zip archive.":"拉链存档中条目的相对路径。","The zip archive to extract files from.":"zip存档以从中提取文件。","The byte span to read the data into.":"字节跨度以读取数据。","The path to the directory in which to place the extracted files, specified as a relative or absolute path. A relative path is interpreted as relative to the current working directory.":"将提取的文件（指定为相对或绝对路径指定的）目录的路径。 相对路径被解释为相对于当前工作目录。","The last time the entry in the zip archive was changed.":"上一次更改邮政编码的条目。","One of the enumeration values that describes how to create or overwrite the file.":"描述如何创建或覆盖文件的枚举值之一。","The path to the directory to place the extracted files in. You can specify either a relative or an absolute path. A relative path is interpreted as relative to the current working directory.":"将提取的文件放入目录的路径。您可以指定亲戚或绝对路径。 相对路径被解释为相对于当前工作目录。","The path on the file system to the archive that is to be extracted.":"要提取的文件系统的文件系统上的路径。","The uncompressed size of the entry in the zip archive.":"拉链存档中的条目的未压缩大小。","An object that determines the access control and audit security for the file.":"确定文件访问控制和审核安全性的对象。","Not supported.":"不支持。"," to extract.":"提取。","The path to the destination directory on the file system.":"文件系统上的目标目录的路径。","The path to the destination directory on the file system. The path can be relative or absolute. A relative path is interpreted as relative to the current working directory.":"文件系统上的目标目录的路径。 该路径可以是相对的或绝对的。 相对路径被解释为相对于当前工作目录。","The file name of the entry in the zip archive.":"邮政编码中的条目的文件名。","This method is not supported and always throws a ":"此方法不支持，并且始终抛出","A file stream for the newly created file.":"新创建的文件的文件流。"," to overwrite existing files; ":"覆盖现有文件；"," to overwrite files; ":"覆盖文件；","An object that determines the access control and audit security for the directory.":"确定目录的访问控制和审核安全性的对象。","The byte offset in buffer to begin writing from.":"Buffer中的字节偏移开始写作。","The encoding to use when reading entry names in this ":"在此阅读条目名称时使用的编码","The stream to which compressed data is written.":"编写压缩数据的流。","The zip archive entry to extract a file from.":"zip存档条目以从中提取文件。","The path of the directory to create.":"目录创建的路径。","The path to the archive to open, specified as a relative or absolute path. A relative path is interpreted as relative to the current working directory.":"档案打开的路径，指定为相对或绝对路径。 相对路径被解释为相对于当前工作目录。","The stream to which compressed data is written or from which decompressed data is read.":"写入压缩数据或从中读取解压缩数据的流。","The byte to write to the stream.":"字节写入流。","The path of the file to create from the contents of the entry. You can  specify either a relative or an absolute path. A relative path is interpreted as relative to the current working directory.":"文件从条目的内容创建的路径。 您可以指定亲戚或绝对路径。 相对路径被解释为相对于当前工作目录。","One of the enumeration values that specifies the actions which are allowed on the entries in the opened archive.":"指定打开档案中条目中允许的操作的枚举值之一。","The stream to which the contents of the current stream will be copied.":"当前流的内容将被复制到所在的流。","A directory information object representing either a created directory with the provided security properties, or the existing directory.":"代表具有提供的安全属性或现有目录的创建目录的目录信息对象。","The path of the file to create from the contents of the entry. You can specify either a relative or an absolute path. A relative path is interpreted as relative to the current working directory.":"文件从条目的内容创建的路径。 您可以指定亲戚或绝对路径。 相对路径被解释为相对于当前工作目录。"," if the stream supports reading; ":"如果流支持阅读；","The size of the buffer. This value must be greater than zero.":"缓冲区的大小。 该值必须大于零。","The opened zip archive.":"打开的拉链档案。","The existing directory from which to obtain the security information.":"获得安全信息的现有目录。"," to overwrite an existing file that has the same name as the destination file; otherwise, ":"覆盖具有与目标文件相同名称的现有文件； 否则，"," if the stream supports seeking; ":"如果溪流支持寻求；","The size, in bytes, of the buffer. This value must be greater than zero.":"缓冲区的大小，字节。 该值必须大于零。","One of the enumeration values that specifies the actions that are allowed on the entries in the opened archive.":"指定打开档案中条目中允许的操作的枚举值之一。","The security descriptors of all the access control sections of the directory.":"目录的所有访问控制部分的安全描述符。","A directory that does not exist yet that will be created by the method.":"该方法还不存在的目录。","The token to monitor for cancellation requests.":"代币监视取消请求。"," if the stream supports writing; ":"如果流支持写作；","An existing directory from which to obtain the security information.":"获得安全信息的现有目录。","The zip archive to add the file to.":"zip存档将文件添加到。","The access control and audit security for the directory.":"目录的访问控制和审计安全性。","A task that represents the completion of the disposal operation.":"代表处理操作完成的任务。","This property is not supported and always throws a ":"该属性不支持，并始终抛出","The desired access control sections to retrieve.":"所需的访问控制部分要检索。","A file that does not exist yet that will be created by the method.":"该方法还不存在的文件。","The path to the file to be archived. You can specify either a relative or an absolute path. A relative path is interpreted as relative to the current working directory.":"文件归档的路径。 您可以指定亲戚或绝对路径。 相对路径被解释为相对于当前工作目录。","An existing directory.":"现有目录。","The path to the directory to be archived, specified as a relative or absolute path. A relative path is interpreted as relative to the current working directory.":"要归档目录的路径，指定为相对或绝对路径。 相对路径被解释为相对于当前工作目录。","The security descriptors of the specified access control sections of the directory.":"目录的指定访问控制部分的安全描述符。","One of the enumeration values that specifies how the operating system should open a file.":"指定操作系统应如何打开文件的枚举值之一。","The security information to apply to the directory.":"适用于目录的安全信息。","The name of the entry to create in the zip archive.":"在ZIP档案中创建的条目的名称。","An existing file.":"现有文件。","The file from which to obtain the security information.":"获取安全信息的文件。","The path of the archive to be created, specified as a relative or absolute path. A relative path is interpreted as relative to the current working directory.":"要创建的存档路径，指定为相对或绝对路径。 相对路径被解释为相对于当前工作目录。","One of the enumeration values that defines the access rights to use when creating access and audit rules.":"定义访问权限时，创建访问和审核规则时使用访问权利的枚举值之一。","A wrapper for the new entry in the zip archive.":"邮政编码中新条目的包装纸。","The security information to apply to the file.":"适用于文件的安全信息。","The security descriptors of all the access control sections of the file.":"文件的所有访问控制部分的安全描述符。"," to include the directory name from ":"包含来自的目录名称","The audit rule to add.":"要添加的审核规则。","The security descriptor to be associated with the new ":"与新的安全描述符","The modification to apply to the DACL.":"适用于DACL的修改。","One of the enumeration values for controlling the kind of access other file stream objects can have to the same file.":"用于控制其他文件流对象对同一文件的访问类型的枚举值之一。","An existing file from which to obtain the security information.":"从中获取安全信息的现有文件。","The access rule to modify.":"访问规则要修改。","The identity to which the audit rule applies.  It must be an object that can be cast as a ":"审计规则适用的身份。 它必须是一个可以施放为一个的对象","The identity to which the access rule applies.  It must be an object that can be cast as a ":"访问规则适用的身份。 它必须是一个可以施放为一个的对象","The desired access control sections to retrieve from the file.":"所需的访问控制部分要从文件中检索。","The number of bytes buffered for reads and writes to the file.":"用于读取并写入文件的字节数。"," if the DACL is successfully modified; otherwise, ":"如果DACL成功修改； 否则，","The location of a file to create a ":"文件的位置来创建一个","The security descriptors of the specified access control sections of the file.":"文件的指定访问控制部分的安全描述符。","The access mask of this rule. The access mask is a 32-bit collection of anonymous bits, the meaning of which is defined by the individual integrators.":"此规则的访问面具。 访问掩码是一个32位的匿名位集合，其含义由单个集成商定义。"," object that encapsulates a reference to a user account.":"封装引用用户帐户的对象。","The modification to apply to the SACL.":"适用于SACL的修改。"," object that represents a new access control rule for the specified user, with the specified access rights, access control, and flags.":"代表指定用户的新访问控制规则，具有指定访问权限，访问控制和标志的对象。","true if this rule is inherited from a parent container.":"如果此规则是从父容器继承的，则为true。"," values that specifies the type of operation associated with the access rule.":"指定与访问规则关联的操作类型的值。","The audit rule to modify.":"审核规则要修改。"," if this rule is inherited from a parent container.":"如果此规则是从父容器继承的。"," object that represents an access control list (ACL) permission to add to a file or directory.":"代表访问控制列表（ACL）权限添加到文件或目录的对象。","Specifies the inheritance properties of the access rule.":"指定访问规则的继承属性。"," values that specifies whether to allow or deny the operation.":"指定允许还是拒绝操作的值。","Specifies whether inherited access rules are automatically propagated. The propagation flags are ignored if ":"指定是否自动传播继承的访问规则。 如果"," object that represents an audit rule to add to a file or directory.":"代表要添加到文件或目录的审核规则的对象。","Specifies the inheritance properties of the audit rule.":"指定审核规则的继承属性。"," if the SACL is successfully modified; otherwise, ":" 如果SACL被成功修改；否则, "," values that specifies how access masks are propagated to child objects.":"指定访问掩码如何传播到子对象的值。"," is set to ":"被设定为"," values that specifies the type of auditing to perform.":"指定要执行的审核类型的值。","Specifies whether inherited audit rules are automatically propagated. The propagation flags are ignored if ":"指定是否自动传播继承的审计规则。 如果","The access rule to remove.":"访问规则要删除。"," values that specifies how Access Control Entries (ACEs) are propagated to child objects.":"指定访问控制条目（ACE）传播到子对象的值。","Specifies the valid access control type.":"指定有效的访问控制类型。","Specifies the conditions for which the rule is audited.":"指定审核规则的条件。"," object representing the specified audit rule for the specified user.":"代表指定用户指定的审核规则的对象。"," if the access rule was successfully removed; otherwise, ":"如果访问规则成功删除； 否则，","The identity of the class of objects to which the new access rule applies.":"新访问规则适用的对象类的身份。"," object that represents an access control list (ACL) permission to remove from a file or directory.":"代表访问控制列表（ACL）权限的对象可以从文件或目录中删除。","The name of a user account.":"用户帐户的名称。","The audit rule to remove.":"审核规则要删除。","The identity of the class of objects to which the new audit rule applies.":"新审核规则适用的对象类的身份。"," if the access rule was removed; otherwise, ":"如果访问规则被删除； 否则，","The identity of the class of child objects which can inherit the new access rule.":"可以继承新访问规则的子对象类别的身份。"," flags associated with the current ":"与电流关联的标志"," if the audit rule was successfully removed; otherwise, ":"如果成功删除了审计规则； 否则，"," object that specifies a user whose access control list (ACL) permissions should be removed from a file or directory.":"指定其访问控制列表（ACL）权限的用户应从文件或目录中删除。","The identity of the class of child objects which can inherit the new audit rule.":"可以继承新的审核规则的子对象类别的身份。"," values that specifies the type of operation associated with the audit rule.":"指定与审核规则关联的操作类型的值。"," object that this method creates.":"此方法创建的对象。"," object that represents an audit rule to remove from a file or directory.":"代表从文件或目录中删除的审核规则的对象。","The access rule to reset.":"重置的访问规则。"," to include access rules explicitly set for the object.":"包括为对象明确设置访问规则。","The access rule to add.":"访问规则要添加。"," values that specifies when to perform auditing.":"指定何时执行审计的值。","The access rule to set.":"要设置的访问规则。"," if the audit rule was removed; otherwise, ":"如果删除了审计规则； 否则，"," to include inherited access rules.":"包括继承的访问规则。","The destination (see ":"目的地（请参阅"," object that represents a user account.":"代表用户帐户的对象。","The audit rule to set.":"要设置的审核规则。",") for this serialization.":"）为此序列化。"," object that specifies a user whose audit rules should be removed from a file or directory.":"指定应从文件或目录中删除审核规则的用户的对象。","The security identifier for which to retrieve access rules. This must be an object that can be cast as a ":"检索访问规则的安全标识符。 这必须是一个可以施放为一个的对象","An integer that specifies an access type.":"一个指定访问类型的整数。","The location of a directory to create a ":"目录的位置以创建一个","The collection of access rules associated with the specified ":"与指定的访问规则的收集"," object from.":"对象来自。"," object that represents an access control list (ACL) permission to set for a file or directory.":"代表访问控制列表（ACL）权限的对象设置文件或目录。"," if the access rule is inherited; otherwise, ":"如果访问规则继承； 否则，","The name of the drive.":"驱动器的名称。"," object that represents an audit rule to set for a file or directory.":"代表为文件或目录设置的审核规则的对象。"," values that specifies the type of access control list (ACL) information to retrieve.":"指定要检索的访问控制列表（ACL）信息类型的值。"," to include audit rules explicitly set for the object.":"包括为对象明确设置审核规则。","The amount of free space available on the drive, in bytes.":"驱动器上可用的自由空间，字节。","A valid drive path or drive letter. This can be either uppercase or lowercase, 'a' to 'z'. A null value is not valid.":"有效的驱动路径或驱动器字母。 这可以是大写或小写，“ a”至'z'。 零值无效。"," values that specifies how to propagate access masks to child objects.":"指定如何传播访问子对象对象的值。"," to include inherited audit rules.":"包括继承的审计规则。"," values, which represents the kind of change detected in the file system.":"值，代表文件系统中检测到的更改类型。"," that represents the logical drives on a computer.":"这代表了计算机上的逻辑驱动器。","The name of the file system on the specified drive.":"指定驱动器上文件系统的名称。","The security identifier for which to retrieve audit rules. This must be an object that can be cast as a ":"用于检索审核规则的安全标识符。 这必须是一个可以施放为一个的对象"," values that specifies how to propagate Access Control Entries (ACEs) to child objects.":"指定如何将访问控制条目（ACE）传播到子对象的值。","The root directory of the affected file or directory.":"受影响文件或目录的根目录。","The object to populate with data.":"用数据填充的对象。","The collection of audit rules associated with the specified ":"与指定相关的审计规则的集合","The name of the affected file or directory.":"受影响的文件或目录的名称。","One of the enumeration values that specifies a drive type.":"指定驱动器类型的枚举值之一。"," that you can choose from the list of ":"您可以从列表中选择"," values that specifies whether access is allowed or denied.":" 指定允许还是拒绝访问的值。"," values. The default is the bitwise OR combination of ":"值。 默认值是位或组合"," values that represents the kind of change detected in the file system.":"代表文件系统中检测到的更改的值。"," for the calling application. ":"用于调用申请。"," if the drive is ready; ":"如果驱动器准备就绪；","The name of the file to copy.":"要复制的文件的名称。","The path to monitor. The default is an empty string (\"\").":"监视路径。 默认值是一个空字符串（“”）。"," if the drive is not ready.":"如果驱动器还没有准备好。"," lets the ":"让","The name of the destination file. This cannot be a directory or an existing file.":"目标文件的名称。 这不能是目录或现有文件。","The path of the affected file or directory.":"受影响的文件或目录的路径。"," that represents the object used to marshal the event handler calls issued as a result of a directory change. The default is ":"这代表用于围载事件处理程序调用的对象，该对象是由于目录更改而发出的。 默认值为","An object that contains the root directory of the drive.":"包含驱动器根目录的对象。","The name of the destination file. This cannot be a directory.":"目标文件的名称。 这不能是目录。"," object choose the evidence.":"对象选择证据。","The directory to monitor, in standard or Universal Naming Convention (UNC) notation.":"在标准或通用命名公约（UNC）符号中监视的目录。","The information required to serialize the ":"序列化所需的信息"," if the destination file can be overwritten; otherwise, ":"如果目标文件可以被覆盖； 否则，","The type of files to watch. For example, \"*.txt\" watches for changes to all text files.":"要观看的文件类型。 例如，“*.txt”手表为所有文本文件更改。","The total free space available on a drive, in bytes.":"驱动器上可用的总可用空间，以字节为单位。"," present in the domain of the calling application. ":"存在在调用应用程序的域中。","The relative path of the directory to create within the isolated storage scope.":"目录在隔离存储范围内创建的目录的相对路径。","The total size of the drive, in bytes.":"驱动器的总尺寸，字节。","The source and destination of the serialized stream associated with the ":"序列化流的源和目标与 "," to watch for.":"注意。"," present in the assembly of the calling application. ":" 存在于调用应用程序的程序集中。 ","The message to be given for the exception.":"例外的消息。","The relative path of the file to create.":"要创建的文件的相对路径。","The volume label.":"的卷标。"," that contains specific information on the change that occurred.":"其中包含有关发生的变化的特定信息。"," that represents the ":"代表","The inner exception.":"内的异常。","The time (in milliseconds) to wait before timing out.":"时间（以毫秒为单位）等待时间。"," object that contains the serialized object data about the exception being thrown.":"包含有关抛出异常的序列化对象数据的对象。"," identity.":"身份。","A new isolated storage file.":"新的隔离存储文件。","The available free space for isolated storage, in bytes.":"可用的可隔离存储空间，字节。","The old name of the affected file or directory.":"受影响的文件或目录的旧名称。"," if the component is enabled; otherwise, ":"如果启用了组件； 否则，","The relative path of the directory to delete within the isolated storage scope.":"目录在隔离存储范围内删除目录的相对路径。"," object that contains contextual information about the source or destination of the exception being thrown.":"包含有关要抛出的异常的源或目的地的上下文信息的对象。","The previous fully qualified path of the affected file or directory.":"受影响的文件或目录的先前完全合格的路径。","The relative path of the file to delete within the isolated storage scope.":"在隔离存储范围内删除文件的相对路径。",". If you are using the component on a designer in Visual Studio 2005, the default is ":"。 如果您在Visual Studio 2005中的设计师上使用了组件，则默认值为"," object that describes the error. The caller of this constructor is required to ensure that this string has been localized for the current system culture.":"描述错误的对象。 需要该构造函数的呼叫者，以确保该字符串已定位为当前系统文化。","The number of storage units currently used within the isolated storage scope.":"当前在隔离存储范围内使用的存储单元数量。","The path to test.":"测试路径。","The previous name of the affected file or directory.":"受影响文件或目录的先前名称。","The filter string. The default is \"*.*\" (Watches all files.)":"过滤器字符串。 默认值为“*。*”（观看所有文件。）"," that represents the error that occurred.":"这表示发生的错误。","The maximum amount of isolated storage space in bytes. Derived classes can return different units of value.":"字节中的最大隔离存储空间数量。 派生类可以返回不同的价值单位。"," refers to an existing directory in the isolated store and is not ":"指隔离商店中的现有目录，不是","The name of the file or directory that changed.":"更改的文件或目录的名称。","The limit of isolated storage space, in bytes.":"隔离存储空间的极限，字节。","A search pattern. Both single-character (\"?\") and multi-character (\"*\") wildcards are supported.":"搜索模式。 支持单字符（“？”）和多字符（“*”）通配符。","A filter collection.":"过滤器收集。","The path and file name to test.":"要测试的路径和文件名。","The original name of the file or directory that was renamed.":"更名的文件或目录的原始名称。"," if you want to monitor subdirectories; otherwise, ":"如果要监视子目录； 否则，"," values specifying the scope used to isolate the store.":"指定用于隔离商店的范围的值。","An array of the relative paths of directories in the isolated storage scope that match ":"匹配的隔离存储范围中目录的相对路径的数组"," refers to an existing file in the isolated store and is not ":"指隔离商店中的现有文件，不是"," method timed out; otherwise, ":"定时的方法； 否则，","The internal buffer size in bytes. The default is 8192 (8 KB).":"内部缓冲区大小在字节中。 默认值为8192（8 kb）。","The default implementation returns the '\\' (backslash) character.":"默认实现返回“ \\'（BackSlash）字符。","The path to the file or directory for which to obtain creation date and time information.":"获取创建日期和时间信息的文件或目录的路径。",". A zero-length array specifies that there are no directories that match.":"。 零长度数组指定没有匹配的目录。","The creation date and time for the specified file or directory. This value is expressed in local time.":"指定文件或目录的创建日期和时间。 此值在当地表达。","A normalized object that represents the instance on which this method was called. This instance can be a string, stream, or any serializable object.":"代表调用此方法的实例的归一化对象。 此实例可以是字符串，流或任何可序列化对象。","The default implementation returns the '.' (period) character.":"默认实现返回“。” （周期）字符。","The name of the file to move.":"要移动的文件的名称。","Represents the ":"代表","The requested new quota size, in bytes, for the user to approve.":"请求的新配额大小在字节中供用户批准。","The used amount of isolated storage space, in bytes.":"使用的隔离存储空间的使用量，字节。","An array of relative paths of directories at the root of the isolated store. A zero-length array specifies that there are no directories at the root.":"隔离存储根目录的相对路径数组。 零长度数组指定根目录没有目录。","The type of ":"类型"," for which to return isolated stores. ":"为此返回孤立的商店。","The starting position of the range to lock. The value of this parameter must be equal to or greater than 0 (zero).":"锁定范围的起始位置。 该参数的值必须等于或大于0（零）。","The path to the new location for the file. If a file name is included, the moved file will have that name.":"文件的新位置的路径。 如果包含文件名，则移动的文件将具有该名称。","The maximum size, in bytes, to allocate to the memory-mapped file. Specify 0 to set the capacity to the size of ":"在字节中的最大大小分配给内存映射文件。 指定0将容量设置为大小","The name of the memory-mapped file to open.":"要打开的内存映射文件的名称。","The number of bytes to lock.":"要锁定的字节数。"," are the only ":"是唯一的","The relative path of the file within the isolated store.":"隔离商店中文件的相对路径。","The offset in the buffer at which to begin writing.":"缓冲区开始写作的偏移。","One of the enumeration values that specifies the type of access allowed to the memory-mapped file.  \n  \n This parameter can't be set to ":"指定允许的访问类型的枚举值之一。 \n  \n  此参数不能设置为"," combinations supported.":"支持组合。","One of the enumeration values that specifies the access rights to apply to the memory-mapped file.":"指定要应用于内存映射文件的访问权限的枚举值之一。","One of the enumeration values that specifies how to open the file.":"指定如何打开文件的枚举值之一。","One of the enumeration values that specifies whether a handle to the memory-mapped file can be inherited by a child process. The default is ":"指定是否可以通过子进程继承的枚举值之一。 默认值为","The total number of bytes read into the ":"字节的总数读为","Enumerator for the ":"枚举","A file that is opened in the specified mode, with read/write access, and is unshared.":"在指定模式下打开的文件，并带有读/写访问，并且没有共享。","The handle to the memory-mapped file.":"内存映射文件的句柄。","A value that indicates whether to close the source file stream when the ":"指示是否关闭源文件流的值"," stores within the specified isolated storage scope.":"在指定的隔离存储范围内存储。",". This can be less than the number of bytes requested if that many bytes are not currently available, or zero if the end of the stream is reached.":"。 如果当前不可用的字节不可用，则可能小于所请求的字节数，或者如果达到流的末尾，则零。","The number of bytes between the starting position of this view and the beginning of the memory-mapped file.":"此视图的启动位置与内存映射文件的开头之间的字节数。","An array of relative paths of files at the root of the isolated store.  A zero-length array specifies that there are no files at the root.":"隔离商店根部的文件的相对路径数组。 零长度数组指定根部没有文件。","One of the enumeration values that specifies whether the file will be opened with read, write, or read/write access.":"枚举值之一，用于指定是使用读、写还是读/写访问权限打开文件。"," is disposed.":"被处置。","A task that represents the asynchronous read operation. It wraps the total number of bytes read into the ":"表示异步读取操作的任务。 它包装的总字节数读入 ","A wrapper for the operating system's handle to the view of the file.":"操作系统的手柄的包装器。","A file that is opened in the specified mode and access, and is unshared.":"在指定模式和访问中打开的文件，并没有共享。","A memory-mapped file that has the specified characteristics.":"具有指定特征的内存映射文件。","The desired length of the current stream in bytes.":"当前流的所需长度在字节中。","An array of relative paths of files in the isolated storage scope that match ":"匹配的隔离存储范围中文件的相对路径数组","The 8-bit unsigned integer value read from the isolated storage file.":"从隔离的存储文件中读取8位无符号整数值。","One of the enumeration values that specifies how to open or create the file.":"指定如何打开或创建文件的枚举值之一。","The path to file to map.":"要映射的文件路径。","One of the enumeration values that determines the direction of the pipe. Anonymous pipes are unidirectional, so direction cannot be set to ":"确定管道方向的枚举值之一。 匿名管道是单向的，因此无法将方向设置为","The new position of the ":"新位置",". A zero-length array specifies that there are no files that match.":". 零长度数组指定没有匹配的文件。","A bitwise combination of enumeration values that specify the type of access other ":"枚举值的位组合，指定其他访问类型","A memory-mapped file.":"内存映射的文件。","The path to the file or directory for which to obtain last access date and time information.":"获取最后访问日期和时间信息的文件或目录的路径。","The new position in the ":"新位置","One of the enumeration values that determines whether the underlying handle can be inherited by child processes.":"确定基础句柄是否可由子进程继承的枚举值之一。"," objects have to this file.":"对象必须对此文件。","The path to the file to map.":"文件映射的路径。","The date and time that the specified file or directory was last accessed. This value is expressed in local time.":"最后访问指定文件或目录的日期和时间。 此值在当地表达。","The new length of the ":"新的长度","Access mode; must be ":"访问模式； 一定是","The size of the buffer. This value must be greater than or equal to 0.":"缓冲区的大小。 该值必须大于或等于0。","A file that is opened in the specified mode and access, and with the specified sharing options.":"在指定模式和访问中打开的文件，并带有指定的共享选项。","The starting position of the range to unlock. The value of this parameter must be equal to or greater than 0 (zero).":"解锁范围的起始位置。 该参数的值必须等于或大于0（零）。","The path to the file or directory for which to obtain last write date and time information.":"获取最后写日期和时间信息的文件或目录的路径。","A memory-mapped file that has the specified access mode.":"具有指定访问模式的内存映射文件。","The total number of bytes of storage currently in use within the isolated storage scope.":"当前在隔离存储范围内使用的存储的字节总数。","An object that determines the access control and audit security for the pipe.":"确定管道的访问控制和审核安全性的对象。","The date and time that the specified file or directory was last written to. This value is expressed in local time.":"指定文件或目录的日期和时间最后写给。 此值在当地表达。","The number of bytes to unlock.":"要解锁的字节数。","A memory-mapped file that has the specified name and access mode.":"具有指定名称和访问模式的内存映射文件。","The limit of isolated storage space in bytes.":"字节中隔离存储空间的极限。","A new anonymous pipe server stream instance.":"一个新的匿名管服务器流实例。","The byte array from which to copy bytes to the current isolated storage file stream.":"将字节复制到当前隔离存储文件流的字节数组。","An object corresponding to the isolated storage scope based on the calling code's application identity.":"基于调用代码的应用程序身份对应于隔离存储范围的对象。","The used isolated storage space, in bytes.":"使用的隔离存储空间，字节。","Access mode; can be any of the ":"访问模式；可以是 "," from which to begin.":"从中开始。","An object corresponding to the isolated storage scope based on the calling code's assembly identity.":"基于调用代码的汇编身份对应于隔离存储范围的对象。","The name of the pipe.":"管子的名称。","The relative path of the file within isolated storage.":"隔离存储中文件的相对路径。","One of the enumeration values that determines the direction of the pipe.":"确定管道方向的枚举值之一。","The read-only byte span from which to copy bytes to the current isolated storage file stream.":"将字节复制到当前隔离存储文件流的仅读取字节跨度。"," enumeration values except ":"枚举值除外","The maximum number of server instances that share the same name. You can pass ":"共享同名的服务器实例的最大数量。 你可以通过","An object corresponding to the ":"对应于"," buffer size.":"缓冲区大小。","The read-only byte memory from which to copy bytes to the current isolated storage file stream.":"将字节复制到当前隔离存储文件流的仅读取字节内存。","The maximum size, in bytes, to allocate to the memory-mapped file. Specify 0 to set the capacity to the size of the file on disk.":"在字节中的最大大小分配给内存映射文件。 指定0将容量设置为磁盘上的文件大小。"," for this value.":"为此值。","The byte value to write to the isolated storage file.":"字节值写入孤立的存储文件。",", based on a combination of the application domain identity and the assembly identity.":"，基于应用域身份和装配身份的组合。","One of the enumeration values that specifies the type of access allowed to the memory-mapped file.":"指定允许的访问类型的枚举值之一。"," in which to open the ":"在其中打开","The maximum size, in bytes, to allocate to the memory-mapped file.":"在字节中的最大大小分配给内存映射文件。","An object that contains evidence for the application identity.":"包含应用程序身份证据的对象。","One of the enumeration values that determines the transmission mode of the pipe.":"确定管道传输模式的枚举值之一。"," if an ":"如果"," at which to begin reading.":"开始阅读。","One of the enumeration values that determines how to open or create the pipe.":"确定如何打开或创建管道的枚举值之一。","A memory-mapped file that has the specified name and capacity.":"具有指定名称和容量的内存映射文件。"," object can be read; otherwise, ":"可以读取对象； 否则，","The method to call when the asynchronous read operation is completed. This parameter is optional.":"当异步读取操作完成时，要调用的方法。 此参数是可选的。","An object that represents the parameters.":"代表参数的对象。","One of the enumeration values that specifies the type of access allowed to the memory-mapped file. The default is ":"指定允许的访问类型的枚举值之一。 默认值为","The input buffer size.":"输入缓冲区大小。","An object that contains evidence for the application domain identity.":"包含应用域身份证据的对象。"," object supports seek operations; otherwise, ":"对象支持寻求操作； 否则，","The status of the asynchronous read.":"异步读取的状态。","A bitwise combination of enumeration values that specifies memory allocation options for the memory-mapped file.":"枚举值的位组合，指定内存映射文件的内存分配选项。","The output buffer size.":"输出缓冲区大小。","An object that contains evidence for the code assembly identity.":"包含代码组件身份证据的对象。"," object that represents the asynchronous read, which is possibly still pending. This ":"代表异步读取的对象，可能仍在待处理。 这个","A value that specifies whether a handle to the memory-mapped file can be inherited by a child process. The default is ":"指定是否可以通过子进程继承内存映射文件的句柄的值。 默认值为"," object can be written; otherwise, ":"可以写入对象； 否则，","One of the enumeration values that specifies the access rights of the pipe.":"指定管道访问权利的枚举值之一。","An object that contains the application identity.":"包含应用程序身份的对象。"," must be passed to this stream's ":"必须传递给这个流的","The name of the memory-mapped file.":"内存映射文件的名称。","The file handle for the file that the current ":"当前文件的文件处理"," that you can chose from the list of ":"您可以从列表中选择","A new named pipe server stream instance.":"一个新的命名管服务器流实例。"," method to determine how many bytes were read. This can be done either by the same code that called ":"确定读取多少个字节的方法。 这可以通过称为的代码来完成","A memory-mapped file that has the specified name and size.":"具有指定名称和大小的内存映射文件。"," object encapsulates.":"对象封装。","The isolated storage file that corresponds to the isolated storage scope based on the calling code's application identity.":"基于调用代码的应用程序标识对应于隔离存储范围的隔离存储文件。"," or in a callback passed to ":"或在回调中传递给"," object supports asynchronous access; otherwise, ":"对象支持异步访问； 否则，","A bitwise combination of values that indicate the memory allocation options to apply to the file.":"值的值组合，指示将内存分配选项应用于文件。","The name of the user account.":"用户帐户的名称。","The length of the ":"长度","The requested size, in bytes.":"请求的大小，字节。","A randomly accessible block of memory.":"随机访问的内存块。","The method to call when the asynchronous write operation is completed. This parameter is optional.":"当异步写操作完成时，要调用的方法。 此参数是可选的。","The existing pipe stream from which to obtain the security information.":"从中获取安全信息的现有管道流。"," object in bytes.":"字节中的对象。"," if the new quota is accepted; otherwise, ":"如果接受新配额； 否则，","The byte at which to start the view.":"启动视图的字节。","The status of the asynchronous write.":"异步写的状态。","The current position of this ":"当前的位置","The security descriptors of all the access control sections of the pipe stream.":"管道流的所有访问控制部分的安全描述符。","The size of the view. Specify 0 (zero) to create a view that starts at ":"视图的大小。 指定0（零）以创建从","The name of the directory to move.":"要移动的目录的名称。"," that represents the asynchronous write, which is possibly still pending. This ":"这代表了异步写作，这可能仍在等待中。 这个"," object that represents the operating system file handle for the file that the current ":"表示当前文件的文件的对象"," and ends approximately at the end of the memory-mapped file.":"并大约在内存映射文件的末尾结束。","The path to the new location for ":"通往新位置的路径","An existing pipe stream.":"现有的管道流。"," method to ensure that the write is complete, then frees resources appropriately. This can be done either by the same code that called ":"确保写入完成的方法，然后适当地释放资源。 这可以通过称为的代码来完成"," if the handle is not valid; otherwise, ":"如果手柄无效； 否则，","A stream of memory.":"记忆流。",". This cannot be the path to an existing directory.":"。 这不能是通往现有目录的途径。","The pending asynchronous request.":"未决的异步请求。","The security information to apply to the pipe stream.":"安全信息适用于管道流。","The file stream of the existing file.":"现有文件的文件流。","The number of bytes read from the stream, between zero and the number of requested bytes. Streams will only return zero at the end of the stream. Otherwise, they will block until at least one byte is available.":"从流读取的字节数，零和请求的字节数之间。 流在流的末尾只返回零。 否则，它们将阻止至少一个字节。","The handle of the securable object that the current ":"当前安全对象的句柄 ","A name to assign to the memory-mapped file, or ":"将分配给内存映射文件的名称，或","A stream of memory that has the specified offset and size.":"具有指定偏移量和大小的内存流。","The pending asynchronous I/O request to end.":"未决的异步I/O请求结束。","The identity that the access rule applies to. It must be an object that can be cast as a ":"访问规则应用的标识。 它必须是一个可以转换为 "," that you do not intend to share across processes.":"您不打算在流程上共享。"," object is associated with.":"对象与之关联。"," to flush all intermediate file buffers; otherwise, ":"冲洗所有中间文件缓冲区； 否则，","A stream of memory that has the specified characteristics.":"具有指定特征的内存流。"," if this rule is inherited from a parent container; otherwise, ":"如果此规则是从父容器继承的； 否则，","A positive value greater than 0 that indicates the input buffer size.":"正值大于0表示输入缓冲区大小的正值。","The name of the securable object that the current ":"当前的可靠对象的名称","A memory-mapped file that has the specified name.":"具有指定名称的内存映射文件。","A positive value greater than 0 that indicates the output buffer size.":"正值大于0表示输出缓冲区大小的正值。",". This can be less than the number of bytes allocated in ":". 这可以小于分配的字节数 "," values that specifies the inheritance properties of the access rule.":"指定访问规则的继承属性的值。","The method to call when a client connects to the ":"客户连接到","An array of arguments of the dynamic operation.":"动态操作的一系列参数。"," if the operation is successful; otherwise, ":"如果操作成功； 否则，"," if that many bytes are not currently available, or zero (0) if the end of the stream has been reached.":"如果当前没有许多字节，或者零（0）如果已达到流的末尾。"," values that specifies whether inherited access rules are automatically propagated. The propagation flags are ignored if ":"指定继承的访问规则是否会自动传播的值。 如果","A user-provided object that distinguishes this particular asynchronous request from other requests.":"用户提供的对象，将此特定异步请求与其他请求区分开。","The rule to set.":"设置的规则。"," if this rule is inherited from a parent container; otherwise, false.":"如果此规则是从父容器继承的； 否则，错误。"," representing the result of the binding.":"代表结合的结果。","A task that represents the asynchronous read operation. The value of its ":"代表异步读取操作的任务。 其价值"," values that specifies the valid access control type.":"指定有效访问控制类型的值。","An object that references the asynchronous request.":"引用异步请求的对象。","The target of the dynamic binary operation.":"动态二进制操作的目标。","The type of the securable object that is associated with the current ":"与当前关联的可靠对象的类型"," property contains the total number of bytes read into the buffer. The result value can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"属性包含读取到缓冲区的字节总数。 如果当前可用的字节数小于请求的数字，则结果值可能小于请求的字节数，如果达到了流的末尾，则可以为0（零）。","The arguments of the dynamic create operation.":"动态创建操作的参数。","The right hand side operand of the dynamic binary operation.":"动态二进制操作的右侧操作数。","The user name of the client on the other end of the pipe.":"管道另一端的客户端的用户名。","The type of the object that is associated with the access rules of the current ":"与当前的访问规则关联的对象的类型"," property contains the total number of bytes read into the buffer. The result value can be less than the number of bytes allocated in the buffer if that many bytes are not currently available, or it can be 0 (zero) if the end of the stream has been reached.":"属性包含读取到缓冲区的字节总数。 结果值可能小于缓冲区中分配的字节数量，如果当前不可用的字节，则如果达到流的末尾，则可能为0（零）。","The target of the dynamic delete index operation.":"动态删除索引操作的目标。","The binding result if the binding fails, or null.":"结合结果如果结合失败或null。","The delegate that specifies a method to call.":"指定呼叫方法的委托。","The byte, cast to ":"字节，铸造","The type of the object that is associated with the audit rules of the current ":"与当前的审核规则关联的对象的类型","An array of arguments of the dynamic delete index operation.":"动态删除索引操作的一系列参数。"," object representing the kind of binary operation.":"代表二进制操作的对象。",", or -1 indicates the end of the stream (the pipe has been closed).":"，或-1表示流的末端（管道已关闭）。"," object that represents the pre-existing handle to use.":"代表要使用的句柄的对象。","A task that represents the asynchronous wait operation.":"代表异步等待操作的任务。","The arguments of the dynamic delete index operation.":"动态删除索引操作的参数。","The result type of the operation.":"操作的结果类型。"," to prevent reliable release (not recommended).":"为了防止可靠的释放（不建议）。"," values that indicates the direction of the pipe object.":"表示管道对象方向的值。","The point, relative to ":"相对于","One of the enumeration values that determines the direction of the pipe.  \n  \n Anonymous pipes can only be in one direction, so ":"确定管道方向的枚举值之一。 \n  \n  匿名管只能朝一个方向","The name of the member to delete.":"删除成员的名称。","The list of ":"列表"," cannot be set to ":"无法设置","A positive ":"积极",", to begin seeking from.":"，开始寻求。","Is true if the name should be matched ignoring case; false otherwise.":"如果应该匹配忽略案例的名称，则为真实； 否则为错误。"," instances from which to combine restrictions.":"结合限制的实例。","A safe handle for the pipe that this ":"这是一个安全的手柄"," value greater than or equal to 0 that indicates the buffer size.":"大于或等于指示缓冲尺寸的0的值。","The new set of binding restrictions.":"新的绑定限制集。","The target of the dynamic delete member operation.":"动态删除成员操作的目标。","Specifies the beginning, the end, or the current position as a reference point for ":"指定开始，结束或当前位置作为参考点"," object will encapsulate.":"对象将封装。"," values that indicates the transmission mode of the pipe object.":"表示管道对象的传输模式的值。","The expression representing the restrictions.":"表示限制的表达。",", using a value of type ":"，使用类型的值","An array of arguments of the dynamic delete member operation.":"动态删除成员操作的一系列参数。","The buffer to read data into.":"缓冲区读取数据。","The new binding restrictions.":"新的约束限制。","A string that represents the pipe handle.":"代表管道手柄的字符串。","The method to call when the asynchronous read operation is completed.":"当异步读取操作完成时，要调用的方法。","The new position in the stream.":"流中的新位置。"," if the string comparison should ignore case; otherwise, ":"如果字符串比较应忽略案例； 否则，","The expression to test.":"测试的表达式。"," supported by the current pipe.":"由当前管道支撑。","The new length of the stream.":"流的新长度。","The expression representing this ":"代表这一点的表达","The buffer that contains data to write to the pipe.":"包含数据写入管道的缓冲区。"," object that references the asynchronous read.":" 引用异步读取的对象。","A safe handle for the ":"安全的手柄","The exact object instance to test.":"要测试的确切对象实例。"," during the dynamic binding process.":"在动态结合过程中。","The maximum number of bytes to write to the current stream.":"写入当前流的最大字节数。","The exact type to test.":"确切的测试类型。","A region of memory. This method copies the contents of this region to the current stream.":"记忆区域。 该方法将该区域的内容复制到当前流。","One of the enumeration values that determines whether the underlying handle can be inherited by child processes. Must be set to either ":"确定是否可以通过子过程继承的枚举值之一。 必须设置为任何一个","The buffer that contains the data to write to the current stream.":"包含要写入当前流的数据的缓冲区。","The set of binding restrictions under which the binding is valid.":"绑定有效的绑定限制集。"," from which to begin copying bytes to the stream.":"从中开始将字节复制到流。","The set of restrictions with which to merge the current binding restrictions.":"合并当前绑定限制的一组限制集。","A string that represents the connected ":"代表连接的字符串","The runtime value represented by the ":"由","The expression tree representing the restrictions.":"表示限制的表达树。"," if the stream supports read operations; otherwise, ":"如果流支持读取操作； 否则，"," that represents the details of the dynamic operation.":"这代表了动态操作的细节。"," object's handle.":"对象的句柄。"," if the stream supports write operations; otherwise, ":"如果流支持写操作； 否则，","The number of arguments.":"参数数量。"," at which to begin copying bytes to the current stream.":" 开始将字节复制到当前流。"," representing the right hand side of the binary operation.":" 表示二进制操作的右手边。","A handle for the ":"一个手柄","An integer value that represents the inbound buffer size, in bytes.":"代表入站缓冲区大小的整数值，字节。","The method to call when the asynchronous write operation is completed.":"当异步写操作完成时，要调用的方法。","The argument names.":"参数名称。"," object was opened asynchronously; otherwise, ":"物体是异步打开的； 否则，"," instances - arguments to the create instance operation.":"实例 - 对创建实例操作的参数。"," object that is currently connected to the ":"当前连接到的对象"," object that references the asynchronous write operation.":"引用异步写操作的对象。"," to compare with the current instance.":"与当前实例进行比较。"," object is connected; otherwise, ":"对象已连接； 否则，","The reading mode for the ":"阅读模式","The reference to the pending asynchronous request.":"对未决异步请求的引用。"," instances - indexes for the delete index operation.":" 实例-删除索引操作的索引。"," that is supported by the current pipe.":"这是由当前管道支持的。"," if a handle to the ":"如果把手的手柄"," if the specified instance is equal to the current one otherwise, ":"如果指定的实例等于当前一个，则","The number of bytes that were read. A return value of 0 indicates the end of the stream (the pipe has been closed).":"读取的字节数。 返回值为0表示流的末端（管道已关闭）。"," instances - indexes for the get index operation.":"实例 -  GET索引操作的索引。"," to indicate that the handle was opened asynchronously; otherwise, ":"表明手柄是异步打开的； 否则，"," to indicate that the pipe is connected; otherwise, ":"表示管道已连接； 否则，","The read-only collection of argument names.":"参数名称的仅读取集合。"," object is exposed; otherwise, ":"物体暴露； 否则，"," instances - arguments to the invoke operation.":"实例 - 对调用操作的争论。","A task that represent the asynchronous flush operation.":"表示异步刷新操作的任务。","The name of the remote computer to connect to, or \".\" to specify the local computer.":"远程计算机的名称要连接到或“”。 指定本地计算机。"," instances - arguments to the invoke member operation.":"实例 - 对调用成员操作的论点。","Is true if the conversion should consider explicit conversions; otherwise, false.":"如果转换应考虑明确的转换，则为真实； 否则，错误。"," if there are no more characters to read in the message; otherwise, ":"如果没有更多字符可以阅读消息； 否则，"," object of the pipe to initialize.":"管道初始化的对象。","The target of the dynamic convert operation.":"动态转换操作的目标。","0 in all cases.":"0在所有情况下。"," instances - indexes for the set index operation.":"实例 - 设置索引操作的索引。","One of the enumeration values that determines the security impersonation level.":"确定安全模拟级别的枚举值之一。","The outbound buffer size, in bytes.":"出站缓冲区大小，字节。"," to expose the handle; otherwise, ":"露出手柄； 否则，","An array of arguments of the dynamic convert operation.":"动态转换操作的一系列参数。"," representing the value for the set index operation.":"表示设定索引操作的值。","One of the enumeration values that determines whether the underlying handle will be inheritable by child processes.":"枚举值之一决定了基础手柄是否可以通过子过程继承。","When this method returns, contains the specified byte array with the values between ":"当此方法返回时，包含指定的字节数组","The binding result to use if binding fails, or null.":"如果结合失败或null，则使用的结合结果。"," values that indicates how the ":"表示如何"," representing the value for the set member operation.":"表示设置成员操作的值。","The number of milliseconds to wait for the server to respond before the connection times out.":"在连接时间之前等待服务器响应的毫秒数。"," and (":"和 （"," object reads from the pipe.":"对象从管道中读取。"," + ":"+","The object to get a meta-object for.":"要获得元对象的对象。"," if there is an explicit conversion; otherwise, ":"如果有明确的转换； 否则，","A task that represents the asynchronous connect operation.":"代表异步连接操作的任务。"," - 1) replaced by the bytes read from the current source.":" -  1）由从当前源读取的字节替换。"," object for the pipe that is encapsulated by the current ":"电流封装的管道的对象"," object representing the result type of the operation.":"代表操作结果类型的对象。","If the given object implements ":"如果给定的对象实现 "," values that indicates the transmission mode supported by the current pipe.":"表示当前管道支持的传输模式的值。","The number of server instances that share the same pipe name.":"共享相同管道名称的服务器实例数。","The byte offset in the ":"字节偏移"," and is not a remote object from outside the current AppDomain, returns the object's specific meta-object returned by ":"并且不是当前AppDomain之外的远程对象，而是返回对象的特定元对象。"," array at which the bytes that are read will be placed.":"将放置读取字节的数组。"," of the runtime value or null.":"运行时值或null。","The target of the dynamic operation.":"动操作的目标。"," object that represents the type to convert to.":" 表示要转换为的类型的对象。","The runtime value represented by this ":"以此为代表的运行时值",". Otherwise a plain new meta-object with no restrictions is created and returned.":"。 否则，将创建并返回没有限制的普通新元观察。"," for implicit conversion.":"用于隐式转换。","The signature of the arguments at the call site.":"呼叫网站上的论点的签名。","The total number of bytes that are read into ":"被读入的总字节数 ","An array of arguments to the dynamic operation.":"动态操作的一系列参数。","The list of dynamic member names.":"动态成员名称列表。","The target of the dynamic create operation.":"动态创建操作的目标。","The result of the type conversion operation.":"类型转换操作的结果。","The expression representing the ":"表示代表",". This might be less than the number of bytes requested if that number of bytes is not currently available, or 0 if the end of the stream is reached.":"。 如果目前不可用的字节数，则可能小于所请求的字节数，或者如果达到流的末尾，则需要0。","Provides information about the initialization operation.":"提供有关初始化操作的信息。"," has the runtime value; otherwise, ":"具有运行时值； 否则，","An array of arguments of the dynamic create operation.":"动态创建操作的参数数组。"," instances that represent the parameters of the call site in the binding process.":" 在绑定过程中表示调用站点的参数的实例。","The arguments that are passed to the object during initialization. For example, for the ":"初始化期间传递给对象的参数。 例如，对于","The value to set to the object that has the specified index. For example, for the ":"设置为具有指定索引的对象的值。 例如，对于"," if runtime value is available, a type of the ":"如果有运行时值可用，则","A LabelTarget used to return the result of the dynamic binding.":"用于返回动态结合结果的babeltarget。","The target of the dynamic set member operation.":"动态设置成员操作的目标。"," is equal to 10.":"等于10。"," operation, where ":"操作，哪里","An Expression that performs tests on the dynamic operation arguments, and performs the dynamic operation if the tests are valid. If the tests fail on subsequent occurrences of the dynamic operation, Bind will be called again to produce a new ":"在动态操作参数上执行测试的表达式，如果测试有效，则执行动态操作。 如果测试因随后发生的动态操作而失败，则将再次调用bind，以产生新的","The set of binding restrictions.":"一组约束限制。","An array of arguments of the dynamic set member operation.":"动态集成员操作的一系列参数。"," property provides the name of the member to which the value is being assigned. For example, for the statement ":"属性提供了分配值的成员的名称。 例如，对于语句"," is the type derived from the ":"是从"," for the new argument types.":"对于新的参数类型。","The value to set to the member.":"设置为会员的值。"," that represents the expression to execute if the test is ":"如果测试为，则表示要执行的表达式","The value to set to the member. For example, for ":"设置为会员的值。 例如，对于"," is equal to 100.":"等于100。"," property of the resulting expression; any type is allowed.":"结果表达的属性； 任何类型都可以。","The result of the initialization.":"初始化的结果。"," class, the ":"班级，","The target of the dynamic unary operation.":"动态单操作的目标。","The update expression.":"更新表达式。","Provides information about the deletion.":"提供有关删除的信息。"," is \"Test\".":"是“测试”。"," that represents the test of the conditional operation.":" 表示条件操作的测试。","The binding result in case the binding fails, or null.":"结合结果在结合失败或无效的情况下。","A sequence that contains dynamic member names.":"包含动态成员名称的序列。"," equal to the value of the represented expression.":"等于表示表达式的值。","The indexes to be deleted.":"要删除的索引。","Provides information about the unary operation. The ":"提供有关一元运算的信息。 该 "," that represents the source file.":"代表源文件。"," that represents the unary operation kind.":"这代表了一般操作。","The expression that represents ":"代表的表达","Provides information about the operation.":"提供有关操作的信息。"," returns \"Negate\".":"返回“否定”。","The number of the end column of the code that was used to generate the wrapped expression.":"用于生成包装表达式的代码的末端列的数量。"," to dispatch to the dynamic virtual methods.":"派遣动态虚拟方法。","The visitor to visit this node with.":"访问此节点的访客。","The number of the end line of the code that was used to generate the wrapped expression.":"用于生成包装表达式的代码的端行数。","The indexes that are used in the operation. For example, for the ":"操作中使用的索引。 例如，对于","The result of the unary operation.":"单一操作的结果。","The result of visiting this node.":"访问此节点的结果。","An object of the ":"一个对象"," operation in C# (":"在C＃中操作（","The reduced expression.":"降低的表达。","Provides information about the binary operation. The ":"提供有关二进制操作的信息。 这"," is derived from the ":"是从","The expression that represents the MetaObject to dispatch to the Dynamic virtual methods.":"代表元主体派遣到动态虚拟方法的表达式。"," is for clearing a sequence point; otherwise, ":" 是用于清除一个序列点；否则, "," property returns an ":"属性返回"," property of the result.":"结果的属性。","The object of the ":"一个对象"," object. For example, for the ":"目的。 例如，对于"," is equal to 3.":"等于3。"," that represents this expression.":"这代表了这个表达。","The target of the dynamic get index operation.":"动态获取索引操作的目标。","This expression if no children are changed or an expression with the updated children.":"如果没有改变孩子或与更新后的孩子一起表达，则此表达方式。"," statement, where ":"声明，哪里","The result of the index operation.":"索引操作的结果。","The number of the start column of the code that was used to generate the wrapped expression.":"用于生成包装表达式的代码的开始列的数量。","An array of arguments of the dynamic get index operation.":"动态索引操作的一系列参数。"," are derived from the ":"是从"," if the expression tree node can be reduced; otherwise, ":"如果可以减少表达树节点； 否则，",", the run-time binder of the language determines the behavior. (In most cases, a run-time exception is thrown.)":"，该语言的运行时活页夹决定了行为。 （在大多数情况下，抛出了运行时例外。）","The arguments of the dynamic get index operation.":"动态获取索引操作的参数。"," that represents a type conversion function.":"这代表类型的转换函数。","The number of the start line of the code that was used to generate the wrapped expression.":"用于生成包装表达式的代码起始行的编号。"," class, ":" 班级, "," if the node represents a lifted call; otherwise, ":"如果该节点代表一个升起的呼叫； 否则，","Provides information about the object that called the dynamic operation. The ":"提供有关称为动态操作的对象的信息。 这","The name of the member to obtain.":"要获得的成员名称。","The runtime binder for the dynamic operation.":"动态操作的运行时粘合剂。","The right operand for the binary operation. For example, for the ":"二进制操作的正确操作数。 例如，对于","The target of the dynamic get member operation.":"动态获取成员操作的目标。"," property provides the name of the member on which the dynamic operation is performed. For example, for the ":"属性提供了执行动态操作的成员的名称。 例如，对于"," if the operator's return type is lifted to a nullable type; otherwise, ":"如果将操作员的返回类型提升为无效类型； 否则，","The result of the binary operation.":"二进制操作的结果。","The result type of the dynamic expression.":"动态表达式的结果类型。"," that represents the left operand of the binary operation.":"这代表了二进制操作的左操作数。"," returns \"SampleProperty\". The ":"返回“ sampleproperty”。 这","An array of arguments of the dynamic get member operation.":"动态获取成员操作的一系列参数。",". If this method returns ":"。 如果此方法返回","The arguments to the dynamic operation.":"动态操作的参数。"," that represents the implementing method.":"这代表实施方法。"," if case is ignored; otherwise, ":"如果忽略了情况； 否则，"," property specifies whether the member name is case-sensitive.":"属性指定成员名称是否对病例敏感。",", the run-time binder of the language determines the behavior. (In most cases, a language-specific run-time exception is thrown.)":"，该语言的运行时活页夹决定了行为。 （在大多数情况下，引发了特定语言的运行时异常。）"," that has ":"具有","The result of the get operation. For example, if the method is called for a property, you can assign the property value to ":"获取操作的结果。 例如，如果调用该方法的属性，则可以将属性值分配给"," that represents the right operand of the binary operation.":" 表示二进制操作的正确操作数。","The expression tree representation of the runtime value.":"运行时值的表达式树表示形式。","Provides information about the conversion operation. The ":"提供有关转换操作的信息。 该 "," equal to ":"等于","Provides information about the invoke operation.":"提供有关调用操作的信息。"," to bind this object.":"绑定此对象。","This expression if no children changed, or an expression with the updated children.":"此表达式（如果没有更改子项），或具有更新子项的表达式。"," property provides the type to which the object must be converted. For example, for the statement ":"属性提供必须转换对象的类型。 例如，对于语句",",  and has the ":"，并且有","The arguments that are passed to the object during the invoke operation. For example, for the ":"在调用操作期间传递给对象的参数。 例如，对于"," if this get member operation should invoke properties when they perform the get operation; otherwise, ":"如果此获取成员操作在执行GET操作时应调用属性； 否则，","The read-only collection containing all the expressions in this block.":"仅读取集合包含此块中的所有表达式。"," in C# (":"在C＃（"," set to the specified values.":"设置为指定的值。","The result of the object invocation.":"对象调用的结果。","The target of the dynamic invoke operation.":"动态调用操作的目标。"," of the expression.":"表达。","The first argument to the dynamic operation.":"动态操作的第一个参数。"," in Visual Basic), where ":"在Visual Basic中），其中","An array of arguments of the dynamic invoke operation.":"动态调用操作的一系列参数。",", the run-time binder of the language determines the behavior. (In most cases, a language-specific run-time exception is thrown.":"，该语言的运行时活页夹决定了行为。 （在大多数情况下，会引发特定语言的运行时异常。","The second argument to the dynamic operation.":"动态操作的第二个论点。"," object representing the last expression in this block.":"代表此块中最后一个表达式的对象。"," is an instance of the class derived from the ":"是从","The arguments of the dynamic invoke operation.":"动态调用操作的参数。","Provides information about the dynamic operation. The ":"提供有关动态操作的信息。 这",", and has the ":"，并且有"," that represents the static type of the expression.":"这代表了表达式的静态类型。"," property provides the name of the member on which the dynamic operation is performed. For example, for the statement ":"属性提供了执行动态操作的成员的名称。 例如，对于语句"," returns the ":" 返回 ","The third argument to the dynamic operation.":"动态操作的第三个参数。","true if the name should be matched ignoring case; false otherwise.":"如果应该匹配忽略案例的名称，则为正确； 否则为错误。","The read-only collection containing all the variables defined in this block.":"仅读取集合包含此块中定义的所有变量。"," type. The ":"类型。 这","The target of the dynamic invoke member operation.":"动态调用成员操作的目标。","The fourth argument to the dynamic operation.":"动态操作的第四个论点。",", where ":"，在哪里 "," that represents the current ":"代表电流"," property provides information about the kind of conversion that occurs. It returns ":"属性提供有关发生的转换类型的信息。 它返回","An array of arguments of the dynamic invoke member operation.":"动态调用成员操作的一系列参数。","The type of the delegate used by the ":"由"," object representing the catch body.":"代表捕获身体的对象。"," returns \"SampleMethod\". The ":"返回“ SampleMethod”。 这"," for explicit conversion and ":"用于明确的转换和","The arguments of the dynamic invoke member operation.":"动态调用成员操作的参数。"," object representing the body of the ":"代表身体的物体","The arguments that are passed to the object member during the invoke operation. For example, for the statement ":"在调用操作期间传递给对象成员的参数。 例如，对于语句","The argument to the dynamic operation.":"动态操作的论点。","The target of the dynamic set index operation.":"动态集索引操作的目标。","A textual representation of the ":"的文字表示","The result of the member invocation.":"会员调用的结果。","The index of the argument.":"论点的索引。"," filter.":"筛选。","An array of arguments of the dynamic set index operation.":"动态集索引操作的一系列参数。"," that represents an instance method that adds an element to a collection.":"这代表了一个实例方法，该方法将元素添加到集合中。","The arguments.":"论点。"," object representing the type of ":"代表类型的对象","The arguments of the dynamic set index operation.":"动态集索引操作的参数。"," objects that represent the arguments for a method that adds an element to a collection.":"表示将元素添加到集合的方法的参数的对象。",", the rewritten expression.":"，重写的表达。"," this handler catches.":"这个处理程序抓住了。","The value to set to the collection.":"设置为集合的值。","The read-only collections containing the arguments to the dynamic operation.":"包含参数到动态操作的仅读取集合。"," to set as the node type.":"设置为节点类型。"," object representing a reference to the ":"代表参考的对象"," to set the ":"设置",", which determines the run-time behavior of the dynamic site.":"，这决定了动态站点的运行时行为。"," object caught by this handler.":"该处理程序捕获的对象。"," object representing the type of the delegate used by the ":"代表代表的对象"," property equal to.":"属性等于。"," that has the ":"那有","The expression to visit.":"访问的表达。",", the modified expression, if it or any subexpression is modified; otherwise, returns the original expression.":"，修改的表达式（如果它或任何子表达）被修改； 否则，返回原始表达式。"," property equal to ":" 财产等于 "," properties set to the specified values.":"设置为指定值的属性。","An expression that represents the multidimensional array.":"表示多维阵列的表达式。"," containing expressions used to index the array.":"包含用于索引数组的表达式。","An expression representing the array to index.":"表示索引阵列的表达式。","An array that contains expressions used to index the array.":"一个包含用于索引数组的表达式的数组。"," objects to use to populate the ":"用于填充的对象"," instances - indexes for the array index operation.":"实例 - 数组索引操作的索引。"," that represents a property accessor method.":"这代表属性登录法。"," property set to the ":"属性设置为"," that represents the property accessed in ":"代表访问的属性",", and the ":"，和"," property set to ":"属性设置为","The expressions in the block.":"块中的表达式。","The variables in the block.":"块中的变量。","The first expression in the block.":"块中的第一个表达式。","The second expression in the block.":"块中的第二个表达式。","The third expression in the block.":"块中的第三个表达式。","The fourth expression in the block.":"块中的第四个表达式。","The fifth expression in the block.":"块中的第五个表达式。","The result type of the block.":"块的结果类型。"," will jump to.":"会跳到。"," with ":"和"," equal to Break, the ":"等于休息，",", and a null value to be passed to the target label upon jumping.":"，并在跳跃时将其传递给目标标签。","The value that will be passed to the associated label upon jumping.":"跳跃时将传递给关联标签的值。"," to be passed to the target label upon jumping.":"跳跃后将传递给目标标签。"," that specifies the instance for an instance method call (pass ":"指定实例方法调用的实例（通过"," in Visual Basic) method).":"在Visual Basic）方法中）。"," property equal to (pass ":"属性等于（通过"," that specifies the instance for an instance call. (pass null for a static (Shared in Visual Basic) method).":"这指定了实例调用的实例。 （通过静态（在Visual Basic）方法中传递NULL）。"," that represents the target method.":"这代表目标方法。"," that represents the first argument.":"这代表了第一个参数。"," that represents the second argument.":"这代表了第二个论点。"," that represents the third argument.":" 这代表了第三个论点。"," property value will be searched for a specific method.":"属性值将被搜索特定方法。","The name of the method.":"该方法的名称。"," objects that specify the type parameters of the generic method. This argument should be null when methodName specifies a non-generic method.":"指定通用方法的类型参数的对象。 当方法名称指定非生成方法时，该参数应为null。"," objects that represents the arguments to the method.":"代表该方法的参数的对象。"," set to the ":"设置为"," that represents the specified instance method, and ":"代表指定的实例方法，以及"," set to the specified arguments.":"设置为指定的参数。"," that represents the call arguments.":"这代表了呼叫论点。"," that represents the fourth argument.":"这代表了第四个论点。"," that represents the fifth argument.":"这代表了第五个论点。"," that represents a ":"代表"," in Visual Basic) method to set the ":" 在Visual Basic中）方法来设置 ","The type that contains the specified ":"包含指定的类型"}