{"The associated key, or ":"关联的键，或","The value to look up in the dictionary.":"在字典中查找的价值。","The key to look up the value for.":"查找值的关键。","The associated value, or ":"关联的值，或"," if no key exists.":"如果没有钥匙。"," if no value exists.":"如果没有价值。","An object to use as the key to associate the value with.":"将其用作关键的对象将值与值相关联。","The component instance the event is connected to.":"事件已连接到的组件实例。","The value to store.":"存储的价值。","The event to create a name for.":"为创建名称的事件。","The recommended name for the event-handler method for this event.":"此事件的事件处理方法的推荐名称。","The event to get the compatible event-handler methods for.":"为获取兼容事件处理程序方法的事件。","A collection of strings.":"弦乐集。"," if the property does not represent an event.":"如果属性不代表事件。","The property that represents an event.":"代表事件的属性。"," objects that describe the event set.":"描述事件集的对象。"," for the event that the property represents, or ":"对于财产代表的事件或"," that describes the event.":"描述事件。","The events to convert to properties.":"转换为属性的事件。","The component that the event is connected to.":"事件连接到的组件。","The line number to place the caret on.":"将销售的行号放在。","The event to convert.":"要转换的事件。","The extender provider to add.":"要添加的扩展提供商。"," if the code is displayed; otherwise, ":"如果显示代码； 否则，"," that lists the active extender providers. If there are no providers, an empty array is returned.":"这列出了主动扩展提供商。 如果没有提供商，则返回一个空数组。","The event to display.":"要显示的事件。","The name of the attribute to add.":"要添加的属性的名称。","The extender provider to remove.":"扩展器提供商要删除。","The newly created ":"新创建的","The type of the keyword, from the enumeration ":"关键字的类型，来自枚举","The value of the attribute.":"属性的值。","The value of the attribute to remove.":"删除属性的值。","The name of the attribute to remove.":"要删除的属性名称。","The keyword of the Help topic to display.":"帮助主题的关键字要显示。"," to search. Searching begins with this component.":"寻找。 搜索始于此组件。","The priority type of the subcontext to add.":"要添加的子膜的优先类型。"," for which to retrieve the inheritance attribute.":"为其检索继承属性。","The local context ":"本地环境","The URL of the Help topic to display.":"帮助主题显示的URL。"," to add components to.":"将组件添加到。"," associated with the command ID, or ":"与命令ID相关联或"," that describes the level of inheritance of the specified component.":"描述了指定组件的继承级别。"," of the command to search for and execute.":"搜索和执行的命令。"," if no command is found.":"如果找不到命令。"," for the shortcut menu to show.":"为了显示快捷菜单。","The object to retrieve the parent component for.":"检索父组件的对象。","The object to return the name of.":"返回名称的对象。"," if the command was found and invoked successfully; otherwise, ":"如果找到并成功调用了命令； 否则，","An object the specified name refers to, or ":"指定名称是指的对象，或","The x-coordinate at which to display the menu, in screen coordinates.":"在屏幕坐标中显示菜单的X坐标。","The base ":"基地","The name of the object referenced, or ":"引用对象的名称，或","An array of all available objects of the specified type.":"指定类型的所有可用对象的数组。"," if no reference is found.":"如果找不到参考。","The y-coordinate at which to display the menu, in screen coordinates.":"在屏幕坐标中显示菜单的Y坐标。"," that contains the specified object, or ":"包含指定对象或"," if the object reference is not valid.":"如果对象引用无效。"," of the resource for which to retrieve a resource reader.":"检索资源读取器的资源。","An array of all objects with references available to the ":"所有对象的数组，并具有可用的引用"," if no parent component exists.":"如果不存在父部分。"," that contains the designer verbs that are currently available.":"其中包含当前可用的设计器动词。"," interface that contains the resources for the culture, or ":"包含文化资源的界面，或","The name of the component to return a reference to.":"返回引用的组件的名称。","The type of object to return references to instances of.":"返回引用对实例的对象的类型。","An array of supported ":"一系列支持"," of the resource for which to create a resource writer.":"创建资源作者的资源。"," if no resources for the culture exist.":"如果不存在该文化的资源。","The collection of components to select.":"要选择的组件集合。","The number of selected objects.":"选定对象的数量。"," interface for the specified culture.":"指定文化的界面。","The component to test.":"要测试的组件。","An instance of the service type to add. This object must implement or inherit from the type indicated by the ":"要添加的服务类型的实例。 此对象必须从","A value from the ":"来自"," that indicates a particular view technology.":"这表明特定的视图技术。","The type of service to add.":"要添加的服务类型。","The type of service to remove.":"要删除的服务类型。","An object that represents the view for this designer.":"代表该设计师视图的对象。"," enumeration. The default is ":"枚举。 默认值为"," if the component is part of the user's current selection; otherwise, ":"如果组件是用户当前选择的一部分； 否则，",", containing the collection of ":"，包含集合","A callback object that is used to create the service. This allows a service to be declared as available, but delays the creation of the object until the service is requested.":"用于创建服务的回调对象。 这允许将服务声明为可用，但延迟了对象的创建，直到请求服务为止。"," representing the parent designer, or ":"代表家长设计师或","The object that is currently the primary selected object.":"当前是主要选择对象的对象。"," child objects of the current designer.":"当前设计师的子对象。","A collection that represents the current set of components that are selected.":"代表当前选择的组件集的集合。"," to promote this request to any parent service containers; otherwise, ":"将此请求推广到任何父母服务容器； 否则，","The component to filter the attributes of.":"要过滤属性的组件。"," if the filter service must query again.":"如果过滤器服务必须再次查询。","The component to filter properties for.":"要过滤属性的组件。","Indicates whether types from all referenced assemblies should be checked.":"指示是否应检查所有引用的组件中的类型。"," if no assembly can be located.":"如果没有组件可以找到。","A dictionary of attributes that can be modified.":"可以修改的属性字典。","The component to filter events for.":"要过滤事件的组件。","A dictionary of properties that can be modified.":"可以修改的属性字典。","A collection of types that match the criteria specified by ":"一系列符合标准的类型集合"," if this method should throw an exception if the assembly cannot be located; otherwise, ":"如果该方法不能找到组件，则应抛出异常； 否则，","A dictionary of events that can be modified.":"可以修改的事件的字典。"," if the set of filtered attributes is to be cached; ":"如果要缓存一组过滤属性；"," if the set of filtered properties is to be cached; ":"如果要缓存一组过滤的属性；","The name of the assembly to retrieve.":"要检索的大会的名称。",", and this method returns ":"，此方法返回"," if the set of filtered events is to be cached; ":"如果要缓存一组过滤事件；","The name of the assembly.":"大会的名称。","The base type to match. Can be ":"匹配的基本类型。 可","An instance of the requested assembly, or ":"请求的大会的实例，或"," if the assembly cannot be located.":"如果不能找到组件。","The unique command ID that links this menu command to the environment's menu.":"将此菜单命令链接到环境菜单的唯一命令ID。","The path to the file from which the assembly was loaded.":"加载组件的文件的路径。"," containing the public properties of the ":"包含公共特性","The object to which ":"对象","The container to which ":"容器","An optional argument for use by the command.":"命令使用的可选参数。","The name of the type. If the type name is not a fully qualified name that indicates an assembly, this service will search its internal set of referenced assemblies.":"类型的名称。 如果类型名称不是指示一个组件的完全资格的名称，则此服务将搜索其内部参考组件集。"," if the item is supported, which is the default; otherwise, ":"如果支持该项目，则默认值为默认值； 否则，"," is attached.":"被附上。","A string containing the value of the ":"一个包含值的字符串"," to guarantee that the deserialization will only work if applied to an object of the same type.":"保证只有应用于同一类型的对象时，避难所才能起作用。"," if the item is visible; otherwise, ":"如果该项目可见； 否则，"," that corresponds to the specified name, or ":"对应于指定名称，或"," property appended with the names of any flags that are set, separated by pipe bars (|). These flag properties include ":"属性附加了设置的任何标志的名称，由管道栏（|）隔开。 这些标志属性包括"," specifying the member to serialize.":"指定成员序列化。","A new created serialization store.":"一个新的创建序列化商店。"," to indicate that the default property values should be applied.":"指示应应用默认属性值。"," if the item is checked; otherwise, ":"如果检查项目； 否则，"," if no type can be found.":"如果找不到类型。"," to deserialize.":"值得注意。","The member to serialize.":"成员序列化。"," associated with the menu command.":"与菜单命令相关联。"," from which the store will be loaded.":"商店将被加载。","A collection of objects created according to the stored state.":"根据存储状态创建的对象集合。"," to ignore case when searching for types; otherwise, ":"在搜索类型时忽略案例； 否则，","A context object to append to the stack.":"上下文对象将其附加到堆栈中。"," if the item is enabled; otherwise, ":"如果该项目已启用； 否则，"," to which the state of ":"对哪个状态"," that indicates the assembly to reference.":"这表明要参考的组件。"," to which ":"到底","An integer containing a mixture of status flags that reflect the state of this menu item.":"一个包含状态标志的混合物的整数，这些标志反映了此菜单项的状态。","The object removed from the stack; ":"从堆栈中取出的对象；","The event to raise when the user selects the menu item or toolbar button.":"当用户选择菜单项或工具栏按钮时，该事件要筹集。"," will be written.":"会写。","The current object on the stack, or ":"堆栈上的当前对象，或"," objects will be added.":"将添加对象。"," if no objects are on the stack.":"如果没有对象在堆栈上。","The name of the serialization provider type.":"序列化提供商类型的名称。","The object to serialize.":"序列化的对象。"," if no objects were pushed.":"如果没有推动物体。"," if the designer loader can reload the design document when errors are detected; otherwise, ":"如果检测到错误时，设计器装载机可以重新加载设计文档； 否则，"," of the serialization provider.":"序列化提供商。","The context object to push onto the stack.":"上下文对象将其推入堆栈。"," will be serialized.":"将被序列化。","The level of the object to retrieve on the stack. Level 0 is the top of the stack, level 1 is the next down, and so on. This level must be 0 or greater. If level is greater than the number of levels on the stack, it returns ":"在堆栈上检索的对象的级别。 级别0是堆栈的顶部，第1级是下一个下降，依此类推。 此级别必须为0或更高。 如果级别大于堆栈上的级别数量，则返回"," if the designer loader will ignore errors when it reloads; otherwise, ":"如果设计器加载器重新加载时会忽略错误； 否则，","A string containing the name of the provider.":"包含提供商名称的字符串。","The data type to create.":"要创建的数据类型。","The object on the stack at the specified level, or ":"指定级别的堆栈上的对象，或","An instance of the object with the given name, or ":"带有给定名称的对象的实例，或","The loader host through which this loader loads components.":"该加载器加载组件的装载机主机。"," if the load of the designer is successful; ":"如果设计师的负载成功；","The arguments to pass to the constructor for this type.":"将这种类型的构造函数传递给构造函数。"," if no object exists at that level.":"如果在该级别上没有对象。"," if no object by that name can be found.":"如果找不到该名称的对象。"," if errors prevented the load from finishing.":"如果错误阻止了负载完成。"," if the loader is currently loading a document; otherwise, ":"如果加载程序当前正在加载文档； 否则，","A type to retrieve from the context stack.":"从上下文堆栈检索的类型。","The name of the object. This name can be used to access the object later through ":"对象的名称。 此名称可用于以后通过","The object to retrieve the name for.":"检索名称的对象。","The fully qualified name of the base class of the document that this designer is designing.":"该设计师正在设计的文档的基类的完全合格的名称。","A collection of errors that occurred during the load, if any. If no errors occurred, pass either an empty collection or ":"如果有的话，在加载期间发生的错误集合。 如果没有发生错误，请通过一个空收集或","The first object on the stack that inherits from or implements the specified type, or ":"堆栈上继承或实施指定类型或实施的第一个对象，或"," is passed, the object is still created but cannot be accessed by name.":"通过，该对象仍然是创建的，但无法通过名称访问。","The name of the object, or ":"对象的名称，或"," if the reload request is accepted, or ":"如果接受重载请求，或"," if the designer is successfully loaded; otherwise, ":"如果设计师成功加载； 否则，",", this object is added to the design container. The object must implement ":"，将此对象添加到设计容器中。 对象必须实现"," if no object on the stack implements the type.":"如果堆栈上没有对象实现该类型。"," if the loader does not allow the reload.":"如果加载程序不允许重新加载。"," if the object is unnamed.":"如果对象未命名。","A collection containing the errors encountered during load, if any. If no errors were encountered, pass either an empty collection or ":"包含加载过程中遇到的错误的集合（如果有）。 如果没有遇到错误，请通过一个空的集合或"," for this to have any effect.":"为此产生任何效果。"," if no appropriate serializer can be located.":"如果没有适当的序列化器。","The serialization provider to add.":"要添加的序列化提供商。","The type of the object to get the serializer for.":"获取序列化器的对象的类型。","The name to give the instance.":"给出实例的名称。","The newly created object instance.":"新创建的对象实例。","The fully qualified name of the type to load.":"加载类型的完全合格名称。","An instance of a serializer of the type requested, or ":"所请求类型的序列化器的实例，或","The name of the object to retrieve.":"要检索的对象的名称。","The type of the serializer to retrieve.":"要检索的序列化器的类型。","An instance of the type, or ":"类型的实例，或"," that stores data.":"存储数据。","A unique name for the data type.":"数据类型的唯一名称。"," if the request cannot be satisfied.":"如果无法满足请求。","An instance of the requested serializer, or ":"请求的序列化器的实例，或"," if the type cannot be loaded.":"如果不能加载类型。"," containing the properties to be serialized.":"包含要序列化的属性。","The name to validate.":"要验证的名称。","An object consisting of serialized data.":"由序列化数据组成的对象。"," or an empty collection if there are no arguments. The collection can also consist of other instances of ":"或一个空的集合，如果没有参数。 该集合还可以包括其他实例","The provider to remove. This object must have been added using ":"提供商要删除。 必须使用此对象添加","The serialization manager requesting the serializer.":"请求序列化器的序列化管理器。"," of objects rebuilt from the specified serialization data object.":"从指定的序列化数据对象重建对象。"," if the name is valid; otherwise, ":"如果名称有效； 否则，","The error to report. This information object can be of any object type. If it is an exception, the message of the exception is extracted and reported to the user. If it is any other type, ":"报告的错误。 此信息对象可以是任何对象类型。 如果是例外，则提取异常的消息并将其报告给用户。 如果是其他类型，"," if the specified information completely describes the instance; otherwise, ":"如果指定的信息完全描述了实例； 否则，","An instance of the current serializer of the specified type. This can be ":"指定类型的当前序列化器的实例。 这可以","A collection of objects to serialize.":"序列化对象的集合。"," is called to display the information to the user.":"被调用以向用户显示信息。","The object this instance descriptor describes.":"该实例描述符描述的对象。","An object that contains the serialized state of the specified collection of objects.":"包含指定对象集合的串行状态的对象。"," if no serializer of the specified type exists.":"如果没有指定类型的序列化器。","The member information for the descriptor. This can be a ":"描述符的成员信息。 这可以是","The object instance to name.":"命名的对象实例。"," of arguments that can be used to create the object.":"可用于创建对象的参数。","The data type of the object to serialize.":"对象的数据类型要序列化。","The container where the new object is added.":"添加新对象的容器。",". If this is a ":"。 如果这是"," structure that is to the left of the equality operator.":"相等运算符左侧的结构。","The data type of the serializer to create.":"要创建的序列化器的数据类型。"," if the instance is completely described; otherwise, ":"如果实例被完全描述； 否则，",", it must represent a ":"，必须代表","The data type of the object that receives the name.":"接收名称的对象的数据类型。"," if a relationship between the given two objects is supported; otherwise, ":"如果支持给定两个对象之间的关系； 否则，"," structure that is to the right of the equality operator.":"平等操作员右侧的结构。"," member.":"成员。"," that describes the instance that this object is associated with.":"描述了此对象与之关联的实例。","The name of the type of the serializer.":"序列化器类型的名称。","The source relationship. This is the left-hand side of a relationship assignment.":"源关系。 这是关系分配的左侧。","This operator returns ":"该操作员返回","The object that owns ":"拥有的对象","The collection of arguments to pass to the member. This parameter can be ":"参数的收集要传递给会员。 此参数可以是","The current relationship associated with ":"当前的关系与","An object containing a unique ID for this attribute type.":"包含此属性类型的唯一ID的对象。","The member which is to be related to ":"与之相关的成员"," if the two ":"如果两个"," if there is no relationship.":"如果没有关系。","The service specified by ":"该服务指定由","The stream to which the store will be serialized.":"商店将被序列化的流。"," to test.":"去测试。"," structures are equal; otherwise, ":"结构相等； 否则，"," if the service could not be created.":"如果无法创建服务。","The owner of a source relationship.":"源关系的所有者。"," that contains errors that occurred during serialization or deserialization.":"其中包含在序列化或避免时发生的错误。"," if the specified value is valid for this object; otherwise, ":"如果指定值对此对象有效； 否则，","The object to get a type description provider for.":"获取类型说明提供商的对象。"," structure that is to the left of the inequality operator.":"不平等操作员左侧的结构。","The member of a source relationship.":"来源关系的成员。","A parent service provider.":"父母服务提供商。"," that corresponds with ":"与之对应"," for sorting the enumeration values.":"用于对枚举值进行排序。"," structure that is to the right of the inequality operator.":"不平等操作员右侧的结构。"," structure encapsulating the relationship between a source and target object, or ":"结构封装源对象和目标对象之间的关系，或","A callback object that can create the service. This allows a service to be declared as available, but delays creation of the object until the service is requested.":"可以创建服务的回调对象。 这允许将服务声明为可用，但是延迟了对象的创建，直到请求服务。","The type to get a type description provider for.":"获取类型说明提供商的类型。","The type of the enumerator this converter is associated with.":"该转换器与枚举器的类型相关联。","The name to resolve.":"要解决的名称。"," if this service should be added to any parent service containers; otherwise, ":"如果应将此服务添加到任何父母服务容器中； 否则，"," structures are different; otherwise, ":"结构不同； 否则，","The value that the ":"价值"," that specifies the possible values for the enumeration.":"这指定了枚举的可能值。","An instance of the service to add. This object must implement or inherit from the type indicated by the ":"要添加的服务实例。 此对象必须从","The name of the object to resolve.":"要解决的对象的名称。"," if this relationship is equal to the ":"如果这种关系等于"," property will be set against.":"属性将被设置为反对。"," that contains the name of the event and its attributes.":"其中包含事件的名称及其属性。"," is in the process of being disposed of; otherwise, ":"正在处置； 否则，","The object that the name is associated with.":"名称与之关联的对象。"," relationship; otherwise, ":"关系; 否则，","An Object to compare with this instance or a null reference (":"与此实例或null引用进行比较的对象（","The type of service to retrieve.":"要检索的服务类型。"," that has the name of the member and its attributes.":"它具有成员的名称及其属性。","The name of the base type of the serializer. A class can include multiple serializers as they all have different base types.":"序列化器的基本类型的名称。 一个类可以包括多个序列化，因为它们都有不同的基本类型。","The member that is passed in to the ":"传递给","An instance of the service if it could be found, or ":"如果可以找到该服务的实例，或者"," array with the attributes you want to add to this event description.":"带有要添加到此事件描述的属性的数组。"," if this serializer supports dynamic reloading of the document; otherwise, ":"如果该序列化器支持文档的动态重新加载； 否则，"," if it could not be found.":"如果找不到。","The name of the event.":"活动的名称。","The name of the base type of the serializer. A class can include multiple serializers, as they all have different base types.":"序列化器的基本类型的名称。 一个类可以包括多个序列化器，因为它们都有不同的基本类型。"," if this service should be removed from any parent service containers; otherwise, ":"如果应从任何父母服务容器中删除此服务； 否则，"," that contains the event attributes.":"其中包含事件属性。",", if this instance is equal to the ":"，如果此实例等于 ","The base type of the serializer. A class can include multiple serializers as they all have different base types.":"序列化器的基本类型。 一个类可以包括多个序列化，因为它们都有不同的基本类型。","The owning object that is passed in to the ":"传递给 ","A component that provides events to the delegate.":"向委托提供事件的组件。"," value; otherwise, ":"价值; 否则，","The source relationship.":"源关系。"," if the root serializer supports reloading; otherwise, ":"如果根序列化器支持重新加载； 否则，","A delegate that represents the method that handles the event.":"代表处理事件的方法的委托。"," if this component should be shown at design time, or ":"如果应在设计时间显示此组件，或者","The default services.":"默认服务。","A relationship to ":"与","The name of the base type of the serializer.":"序列化器的基本类型的名称。","The component that the delegate is bound to.":"委托绑定的组成部分。"," if no relationship exists.":"如果没有关系。","The delegate to unbind from the component.":"与组件解脱的代表。","The relationship to set into the source.":"设置为源的关系。"," if it shouldn't.":" 如果不应该的话。","The service container that requested the creation of the service.":"请求创建服务的服务容器。"," if the event delegate is multicast; otherwise, ":" 如果事件委托是多播的；否则, "," objects in this collection.":"此集合中的对象。"," that represents the type of enumeration to associate with this enumeration converter.":"这代表了与此枚举转换器关联的枚举类型。","The type of service to create.":"要创建的服务类型。","An array of strings describing the order in which to sort the ":"一系列字符串，描述了分类的顺序"," that represents the type of component the event is bound to.":" 它表示事件绑定到的组件的类型。"," that holds a standard set of valid values, or ":"拥有一组标准的有效值，或"," to use to sort the ":"用于排序"," that provides the events for this collection.":" 它提供了此集合的事件。"," that represents the type of delegate for the event.":"这代表了事件的委托类型。"," is an exhaustive list of possible values; ":"是详尽的可能值列表；"," objects in the collection.":"集合中的对象。"," to add to the indexes used for searching.":" 添加到用于搜索的索引中。","The number of event descriptors in the collection.":"集合中的事件描述符数。"," if other values are possible.":"如果其他值是可能的。","The object to which the property belongs.":"属性所属的对象。"," to specify a read-only collection; otherwise, ":" 指定只读集合；否则, "," if you can update the items in the list; otherwise, ":" 如果您可以更新列表中的项目;否则, ","The dispatch identifier.":"调度标识符。"," for ":" 为 ","The zero-based index number of the ":"的从零开始的索引号 "," to get or set.":"获得或设置。","The component to get the default event for.":"要获得默认事件的组件。","The position of the ":"的位置 "," if you can add items to the list using ":" 如果您可以使用以下方法将项目添加到列表中 "," if access to the collection is synchronized; otherwise, ":"如果访问该集合的访问已同步； 否则，"," that represents ":"代表"," within the collection.":"在集合中。",", passed by reference, that represents whether the property was retrieved.":"，通过引用传递，表示是否检索了属性。"," that specifies the type of object to get the properties for.":"这指定了要获取属性的对象类型。","'s default event.":"的默认事件。"," encapsulating the property that is being provided.":"封装所提供的属性。","The component to get the default property for.":"获取默认属性的组件。"," if you can remove items from the list; otherwise, ":" 如果您可以从列表中删除项目;否则, "," that is providing the property.":"这是提供属性的。"," to find within the collection.":" 在集合中找到。","The value of the property that has the specified dispatch identifier.":"具有指定调度标识符的属性的值。"," describing the type of object that can receive the property.":"描述可以接收属性的对象的类型。"," if the collection contains the ":"如果该集合包含","The name of the property.":"属性的名称。","A formatter context.":"格式化上下文。","'s default property.":"的默认属性。"," parameter given; otherwise, ":" 参数给定；否则, ","The value of the property that has the specified name.":"具有指定名称的属性的值。"," containing the sorts to apply to the data source.":" 包含要应用于数据源的排序。","The component to get the editor for.":"获取编辑器的组件。","The converted object.":"转换后的对象。","The string used to filter items out in the item collection returned by the data source.":"用数据源返回的项目集合中的项目过滤的字符串。","The name of the event to get from the collection.":"要从集合中获取的事件的名称。","The default value for the ":"默认值"," currently applied to the data source.":"当前应用于数据源。"," containing the attributes for this object.":" 包含此对象的属性。"," if the data source supports advanced sorting; otherwise, ":"如果数据源支持高级排序； 否则，","The class name of the object, or ":"对象的类名称，或"," if you want to ignore the case of the event; otherwise, ":" 如果要忽略事件的大小写；否则, "," if the class does not have a name.":"如果班级没有名字。"," if the event has been completely handled; otherwise, ":" 如果事件已完全处理;否则, ","The base type of the editor for ":"编辑器的基本类型 "," with the specified name, or ":"带有指定的名称，或"," if the data source supports filtering; otherwise, ":" 如果数据源支持过滤；否则, ","The editor for ":"编辑"," if the object does not have a name.":" 如果对象没有名称。","The component to get events for.":"获取事件的组件。"," if this object does not have properties.":" 如果此对象没有属性。","A collection of event descriptors for ":"事件描述符的集合"," if the event does not exist.":" 如果事件不存在。","The index of the item that was previously added to the collection.":"先前添加到集合中的项的索引。"," that is the converter for this object, or ":" 这是该对象的转换器，或 "," that represents the editor for this object.":" 它表示此对象的编辑器。"," if there is no ":"如果没有","The attributes used to filter events.":"用于过滤事件的属性。","An enumerator that implements ":"实现的枚举器 ","The index of the given ":"给定的索引","The component to get attributes for.":"获取属性的组件。","The component to get the name of.":"获取名称的组件。"," of the specified type that is the editor for this object, or ":" 作为此对象编辑器的指定类型，或 "," for this object.":" 对于这个对象。","The index within the collection in which to insert the ":"要在其中插入的集合中的索引 "," if the editor cannot be found.":"如果找不到编辑器。","A collection of attributes for ":"属性的集合 ","The name of ":"的名称 ","The component to get the class name for.":"获取类名的组件。"," that represents the default event for this object, or ":" 表示此对象的默认事件，或 ","A comparer to use to sort the ":"一个比较器，用于对 "," that represents the events for this component instance.":" 它表示此组件实例的事件。"," if this object does not have events.":"如果此对象没有事件。","The attributes used to filter properties.":"用于筛选属性的属性。"," that is used as a filter.":"该用作过滤器。","The name of the class that corresponds with ":"与之对应的类的名称 ","The language service that is calling the builder.":"调用构建器的语言服务。"," that represents the default property for this object, or ":" 表示此对象的默认属性，或 ","A collection of property descriptors for ":"属性描述符的集合 "," that represents the filtered events for this component instance.":" 它表示此组件实例的筛选事件。"," if an installer does not exist.":"如果不存在安装程序。","The component to get the ":"组件来获得 ","The expression being edited.":"正在编辑的表达式。"," that represents the properties for this component instance.":" 表示此组件实例的属性。"," if the value should be replaced with ":"如果应替换值"," objects to find in the collection as bindable. This can be ":" 要在集合中查找的对象为可绑定的。 这可以是 ","The context information.":"的上下文信息。"," that represents the filtered properties for this component instance.":"这代表了此组件实例的过滤属性。"," for.":" 为。"," that represents the properties on each item used to bind data.":"这代表用于绑定数据的每个项目上的属性。"," (if the user cancels, for example).":" （如果用户取消，例如）。","The specified type.":"指定的类型。"," objects, for which the list name is returned. This can be ":" 返回列表名称的对象。 这可以是 ","An instance of the specified type or ":"指定类型的实例或"," that represents the original exception.":" 表示原始异常。"," that represents the property whose owner is to be found.":" 它代表要找到其所有者的财产。","A localized name.":"本地化名称。"," that represents the type to create.":"这代表要创建的类型。","The name of the list.":"列表的名称。","The specified text.":"指定的文本。"," that represents the owner of the specified property.":" 表示指定属性的所有者。"," that can be bound to a data source from the object.":" 它可以绑定到来自对象的数据源。","An error message indicating what is wrong with this object. The default is an empty string (\"\").":"指示此对象出了什么问题的错误消息。 默认值是一个空字符串（“”）。"," that specifies when you can use the licensed instance.":" 这指定了何时可以使用许可实例。"," object raises ":" 对象引发 "," if the collection is a collection of ":" 如果集合是 "," events when one of its property values changes; otherwise, ":"当其属性值之一变化时，事件； 否则，","The name of the property whose error message to get.":"要获取其错误消息的属性的名称。"," that owns the nested container.":"拥有嵌套容器。","An instance of the specified type.":"指定类型的实例。"," that represents the arguments for the type.":"这代表了类型的参数。","The error message for the property. The default is an empty string (\"\").":"属性的错误消息。 默认值为空字符串(\"\")。"," to indicate the component has completed initialization; otherwise, ":" 以指示组件已完成初始化；否则, ","An instance of the specified type with the given array of arguments.":"带有给定参数数组的指定类型的实例。"," to receive the extender properties.":"接收扩展属性。"," to find a valid license for.":"找到有效的许可证。"," if the given type is licensed; otherwise, ":"如果给定类型已获得许可； 否则，"," if this object can be changed; otherwise, ":" 如果此对象可以更改;否则, "," that represents the type of object that requests the ":"代表请求的对象类型"," if this object can provide extender properties to the specified object; otherwise, ":" 如果此对象可以为指定对象提供扩展器属性；否则, "," with the set of objects for this ":"与此对象集"," if a valid license can be granted; otherwise, ":"如果可以授予有效的许可； 否则，"," that represents the type of object that requests the license.":"这表示请求许可证的对象类型。","The object whose current context you want to lock.":"要锁定其当前上下文的对象。","An object of the specified type or a type derived from the specified type.":"指定类型的对象或从指定类型得出的类型。"," if there is no container or if the ":" 如果没有容器或如果 ","The object whose current context you want to unlock.":"您要解锁其当前上下文的对象。"," that is a valid license, or ":"那是有效的许可，或"," does not use outside objects.":"不使用外部对象。"," if a valid license cannot be granted.":"如果无法授予有效的许可。","The object that invokes the method on the ":"调用方法的对象"," if a valid ":"如果有效"," of the specified type or a type derived from the specified type.":" 指定类型或从指定类型派生的类型。","A valid ":"一个有效的"," can be granted; otherwise, ":"可以授予； 否则，"," if there is no object responsible for the call.":" 如果没有对象负责调用。","The index of the item that was added, changed, or removed.":"已添加，更改或删除的项目的索引。"," that describes the given context item; otherwise, ":"描述给定上下文项目； 否则，"," responsible for the call.":"负责电话。"," that specifies when you can use the licensed object.":" 指定何时可以使用许可对象。","The index of the item that was added or changed.":"添加或更改的项目的索引。"," interface that represents the component's container, or ":" 表示组件容器的接口，或 "," values, as specified in the ":" 值，如 "," describing the item.":" 描述项目。"," if the component does not have a site.":" 如果组件没有站点。"," that specifies where you can use the licensed object.":" 这指定了您可以在哪里使用许可对象。"," interface that represents the site of the component.":"代表组件站点的接口。","The new index of the item that was moved.":"移动的项目的新索引。","The old index of the item that was moved.":"移动物品的旧索引。"," that represents the component requesting the license.":" 表示请求许可证的组件。"," that represents the input mask.":" 表示输入掩码。","An object that is requesting the license.":"请求许可证的对象。"," should be thrown when the component cannot be granted a license; otherwise, ":"当不能授予组件许可证时，应抛出； 否则，","The index of the affected by the change.":"变化所影响的指数。"," to restrict input to ASCII-compatible characters; otherwise ":"将输入限制为兼容ASCII兼容的字符； 否则","The fully qualified name of the license provider class.":"许可证提供商类的完全合格名称。","The old index of the moved item.":"移动物品的旧索引。"," to allow the entire Unicode set.":"允许整个Unicode设置。"," that represents the type of the license provider class.":"这代表了许可提供商类的类型。"," that represents the type of the license provider. The default value is ":"这代表了许可证提供商的类型。 默认值是"," affected by the change.":"受变化的影响。"," that will be displayed for characters entered into a password string.":"该字符将显示为输入密码字符串的字符。","The object type to return the key.":"返回键的对象类型。"," that describes the property by which the data source is sorted.":"描述了数据源被排序的属性。","A confirmation that the ":"确认"," associated with this ":"与此相关联"," to allow the prompt character as input; otherwise ":" 以允许所述提示字符作为输入；否则 ","The array of ":"阵列"," that is used to set region-sensitive separator characters.":"这用于设置区域敏感的分离器字符。"," parameter is licensed.":"参数已获得许可。"," objects to be contained in the collection.":"集合中包含的对象。"," that represents the component requesting the ":"代表要求的组件"," value that specifies whether the prompt character should be allowed as a valid input character.":"指定是否应允许提示字符作为有效输入字符的值。","An object that requests the ":"请求的对象"," that will be displayed as a placeholder for user input.":"这将显示为用户输入的占位符。","The destination array for the items copied from the collection.":"从集合中复制的项目的目的地阵列。"," should be thrown when a component cannot be granted a license; otherwise, ":"当不能授予组件许可证时，应抛出； 否则，"," value to be appended to the formatted string.":"值将附加到格式化的字符串上。",". If this method cannot find a valid ":"。 如果此方法找不到有效的","The index of the destination array at which copying begins.":"复制开始的目标阵列的索引。"," or a valid ":"或有效"," if the input character was added successfully; otherwise ":"如果成功添加了输入字符； 否则","The item to add to the collection.":"要添加到集合的项目。"," parameter, it returns ":"参数，它返回"," to get or set in the collection.":"获取或设置在集合中。","The zero-based position in the formatted string where the attempt was made to add the character. An output parameter.":"试图添加角色的格式字符串中的基于零的位置。 输出参数。"," to check.":"去检查。"," that succinctly describes the result of the operation. An output parameter.":"这简洁地描述了操作的结果。 输出参数。","The item to insert into the collection.":"要插入集合的项目。"," if the key is a valid ":"如果密钥是有效的"," containing character values to be appended to the formatted string.":"包含要附加到格式的字符串的字符值。","The item to remove from the collection.":"从集合中删除的项目。"," for the specified type; otherwise, ":"对于指定类型； 否则，"," if all the characters from the input string were added successfully; otherwise ":"如果成功添加了输入字符串中的所有字符； 否则"," with the specified index.":"带有指定的索引。"," if the list is bindable; otherwise, ":"如果列表是可以约束的； 否则，"," to indicate that no characters were added.":"表示没有添加字符。","The current instance of the ":"当前实例"," that indicates whether the list is bindable.":"这表明列表是否可以约束。"," object this method creates, cast as an object.":"对象此方法创建，将其作为对象。"," to get in the collection.":"进入该系列。","The zero-based position in the formatted string to start the search.":"格式字符串中的基于零的位置以启动搜索。","The object to test equality with.":"使用平等的对象。","The name of the property to be used for the display name.":"用于显示名称的属性名称。"," indicating the search direction; either ":"指示搜索方向； 任何一个"," if the object passed is equal to this ":"如果通过对象等于此"," to search forward or ":"向前搜索或"," is set to the default value; otherwise, ":"设置为默认值； 否则，","The name of the property to be used as the source for values.":"该属性的名称被用作值的来源。"," to search backward.":"向后搜索。"," value indicating the type of change.":"值表示更改的类型。","The name of the property to be used for lookups.":"用于查找的属性名称。","If successful, an ":"如果成功，","The data source property for the component to which the ":"组件的数据源属性"," that was added, removed, or changed.":"添加，删除或更改。"," if it represents failure.":"如果代表失败。"," representing the zero-based position of the first assigned editable position encountered; otherwise ":"表示遇到的第一个分配可编辑位置的基于零的位置； 否则","The name of the display member property for the component to which the ":"显示为组件的显示成员属性的名称"," to be inserted.":"被插入。","The zero-based position in the formatted string where the search starts.":"搜索开始的格式字符串中基于零的位置。","The name of the lookup member for the component to which the ":"查找成员的名称是该组件的","The zero-based position in the formatted string to insert the character.":"格式字符串中的基于零的位置以插入字符。","The zero-based position in the formatted string where the search ends.":"搜索结束的格式字符串中基于零的位置。","The name of the value member property for the component to which the ":"该组件的价值成员属性的名称"," if the insertion was successful; otherwise, ":"如果插入成功； 否则，"," representing the zero-based position of the first editable position encountered; otherwise ":"代表遇到第一个可编辑位置的基于零的位置； 否则"," that represents the type of service you want.":"这代表了您想要的服务类型。","If the method is successful, the last position where a character was inserted; otherwise, the first position where the insertion failed. An output parameter.":"如果该方法成功，则是插入角色的最后一个位置； 否则，插入失败的第一个位置。 输出参数。"," that represents the implementer of the ":"这代表了"," representing the zero-based position of the first literal position encountered; otherwise ":"表示遇到的第一个字面位置的基于零的位置； 否则"," that succinctly describes the result of the insertion operation. An output parameter.":"这简洁地描述了插入操作的结果。 输出参数。",", if any.  \n  \n ":"，如果有的话。"," representing the zero-based position of the first unassigned editable position encountered; otherwise ":"代表遇到第一个未分配可编辑位置的基于零的位置； 否则","The zero-based position in the formatted string to insert the input string.":"格式字符串中的基于零的位置以插入输入字符串。"," value typically obtained as an output parameter from a previous operation.":"值通常是从上一个操作中获得的输出参数。","An object implementing the ":"实现的对象","The zero-based position in the mask to test.":"在面罩中基于零的位置进行测试。"," that succinctly describes the result of the set operation. An output parameter.":"这简洁地描述了设定操作的结果。 输出参数。"," value represents a success; otherwise, ":"价值代表成功； 否则，"," if the specified position in the formatted string is editable and has not been assigned to yet; otherwise ":"如果格式字符串中的指定位置是可编辑的，尚未分配； 否则","The formatted ":"格式化"," that represents the default password character.":"这代表默认密码字符。"," if the specified position in the formatted string is editable; otherwise ":"如果格式字符串中的指定位置是可编辑的； 否则"," that includes prompts and mask literals.":"其中包括提示和面具文字。"," containing the number of editable positions in the formatted string.":"包含格式字符串中的可编辑位置的数量。"," value to test.":"测试值。"," that includes all the assigned character values.":"其中包括所有分配的字符值。"," that supports enumeration over the editable positions in the formatted string.":"这支持在格式的字符串中的可编辑位置上的枚举。"," if the specified character contains a valid input value; otherwise ":"如果指定的字符包含有效的输入值； 否则"," to return the actual editable characters; otherwise, ":"返回实际的可编辑字符； 否则，"," if literals are included; otherwise, ":"如果包括文字； 否则，"," if the specified character contains a valid mask value; otherwise ":"如果指定的字符包含有效的掩码值； 否则"," to indicate that the ":"表明"," if the prompt character is used to represent the positions where no user input was provided; otherwise, ":"如果提示字符用于表示未提供用户输入的位置； 否则，"," if the specified character contains a valid password value; otherwise ":"如果指定的字符包含有效的密码值； 否则"," property is to be honored.":"财产将受到尊敬。","A value representing the largest invalid index, as determined by the provider implementation. For example, if the lowest valid index is 0, this property will return -1.":"由提供商实施确定的代表最大无效索引的值。 例如，如果最低有效索引为0，则此属性将返回-1。"," if the character was successfully removed; otherwise, ":"如果角色成功删除； 否则，"," if the input string is to be treated as a password string; otherwise, ":"如果要将输入字符串视为密码字符串； 否则，"," that includes literals, prompts, and optionally password characters.":"其中包括文字，提示和可选的密码字符。","A zero-based index of the element to retrieve.":"基于零的元素索引要检索。","The zero-based position in the formatted string where the character was actually removed. An output parameter.":"在格式的字符串中，基于零的位置实际删除了字符。 输出参数。"," to include prompt characters in the return string; otherwise, ":"在返回字符串中包括提示字符； 否则，"," at the specified position in the formatted string.":"在格式的字符串中的指定位置。","The zero-based position of the assigned character to remove.":"分配的字符的基于零的位置要删除。"," to include literal characters in the return string; otherwise, ":"在返回字符串中包括字面字符； 否则，","If at least one input character has been assigned to the mask, an ":"如果至少一个输入字符已分配给蒙版","The zero-based index of the first assigned character to remove.":"要删除的第一个分配字符的基于零的索引。"," that includes all the assigned character values and optionally includes literals and prompts.":"其中包括所有分配的字符值，并选择包括文字和提示。","The zero-based index of the last assigned character to remove.":"最后分配的字符的基于零的索引要删除。"," containing the index of rightmost assigned position; otherwise, if no position has been assigned, ":"包含最右边的位置的索引； 否则，如果未分配职位，"," to return literal characters in the return string; otherwise, ":"在返回字符串中返回字面字符； 否则，","If successful, the zero-based position in the formatted string of where the characters were actually removed; otherwise, the first position where the operation failed. An output parameter.":"如果成功，则基于零的位置在字符的格式字符串中实际删除了； 否则，操作失败的第一个位置。 输出参数。"," containing the number of positions in the mask, excluding characters that modify mask input.":"包含蒙版中的位置数量，不包括修改掩码输入的字符。","The zero-based position in the formatted string where the output begins.":"在格式的字符串中基于零的位置，输出开始。"," containing the full mask.":"包含完整的面具。"," value that replaces the existing value.":"替代现有值的值。","The number of characters to return.":"要返回的字符数。"," if all required input has been entered into the mask; otherwise, ":"如果所有必需的输入已输入掩模； 否则，","The full name of the component in this site.":"此站点中组件的全名。"," that represents the type of component.":"这代表组件的类型。","The zero-based position to search for the first editable character to replace.":"基于零的位置，以搜索第一个可编辑的字符替换。"," that indicates the level of inheritance to set this attribute to.":"这表明将此属性设置为继承级别。","If successful, a substring of the formatted ":"如果成功，格式的底带"," if all required and optional inputs have been entered; otherwise, ":"如果输入了所有必需的和可选的输入； 否则，"," with the license key.":"使用许可证密钥。","The object to test.":"测试的对象。"," if the character was successfully replaced; otherwise, ":"如果角色成功替换； 否则，",", which includes all the assigned character values and optionally includes literals, prompts, and password characters; otherwise the ":"，其中包括所有分配的字符值，并选择包括文字，提示和密码字符； 否则"," if the object is the same; otherwise, ":"如果对象相同； 否则，"," for the specified type. This method returns ":"对于指定类型。 此方法返回"," value used as the password character.":"值用作密码字符。"," stored in this attribute.":"存储在此属性中。","The zero-based position in the formatted string where the replacement starts.":"替换开始的格式字符串中基于零的位置。"," unless you override it.":"除非您覆盖它。",", which includes all the assigned character values and optionally includes literals and prompts; otherwise the ":"，其中包括所有分配的字符值，并选择包括文字和提示； 否则","The name of a ":"一个名称"," if the service cannot be found.":"如果找不到服务。","The zero-based position in the formatted string where the replacement ends.":"替换结束的格式字符串中的基于零的位置。","The character used to prompt the user for input. The default is an underscore (_).":"用于提示用户输入的字符。 默认值是下划线（_）。",", which includes literals, prompts, and optionally password characters; otherwise the ":"，其中包括文字，提示和可选的密码字符； 否则"," that represents the installer for the component this attribute is bound to. This class must implement ":"这代表该属性已绑定到组件的安装程序。 该课程必须实施"," that represents the component associated with the license key.":"这表示与许可证密钥关联的组件。"," that represents the type of installer associated with this attribute, or ":"代表与此属性关联的安装程序的类型，或"," if the prompt character entered as input causes the current editable position in the mask to be reset; otherwise, ":"如果提示字符以输入的形式输入，则将掩模中的当前可编辑位置重置； 否则，",", which includes all the assigned character values; otherwise the ":"，其中包括所有分配的字符值； 否则","If successful, the zero-based position in the formatted string where the last character was actually replaced; otherwise, the first position where the operation failed. An output parameter.":"如果成功，则在格式化的字符串中基于零的位置实际上更换了最后一个字符； 否则，操作失败的第一个位置。 输出参数。"," to save for the type of component.":"保存组件类型。","The name of the method to find.":"查找方法的名称。"," to indicate that the prompt character is to be processed as a normal input character. The default is ":"为了表明及时字符应作为正常输入字符处理。 默认值为"," values that specifies when you can use a license. The default is ":"指定何时可以使用许可证的值。 默认值为"," that succinctly describes the result of the replacement operation. An output parameter.":"这简洁地描述了替换操作的结果。 输出参数。","The position in the mask to test the input character against.":"掩模中的位置以测试输入字符。","An array of parameters for the method, used to choose between overloaded methods.":"该方法的一系列参数，用于在超载方法之间进行选择。"," that represents the type of component that was not granted a license.":"这代表未获得许可的组件类型。"," if the space input character causes the current editable position in the mask to be reset; otherwise, ":"如果空间输入字符导致掩模中的当前可编辑位置重置； 否则，","The instance of the component that was not granted a license.":"未获得许可的组件的实例。"," if the specified character is valid for the specified position; otherwise, ":"如果指定的字符对指定位置有效； 否则，"," value used to replace the existing editable characters.":"用于替换现有的可编辑字符的值。","The type to return for the method.":"该方法返回的类型。","The exception message to display.":"要显示的异常消息。"," to indicate that it is to be processed as a normal input character. The default is ":"表明将其作为正常输入字符处理。 默认值为"," if the specified character would be escaped at the specified position; otherwise, ":"如果指定的角色将在指定位置逃脱； 否则，"," if all the characters were successfully replaced; otherwise, ":"如果所有角色都成功地替换了； 否则，"," that represents the method, or ":"代表方法，或"," that specifies the type of array for which to get properties.":"这指定了要获得属性的数组的类型。"," to allow literals to be added back; otherwise, ":"允许添加文字； 否则，"," if the specified string represents valid input; otherwise, ":"如果指定的字符串表示有效输入； 否则，"," should be called to find the properties of this object; otherwise, ":"应该调用以找到此对象的属性； 否则，"," value used to set the formatted string.":"用于设置格式的字符串的值。"," to not allow the user to overwrite literal characters. The default is ":"不允许用户覆盖文字字符。 默认值为"," if the method is not found.":"如果找不到方法。"," that owns this nested container.":"它拥有这个嵌套的容器。","Whether to restrict search to public methods.":"是否将搜索限制为公共方法。"," if all the characters were successfully set; otherwise, ":"如果所有角色都成功设置了； 否则，"," that contains the name of the member and its attributes.":"其中包含成员的名称及其属性。","If successful, the zero-based position of the last character actually tested; otherwise, the first position where the test failed. An output parameter.":"如果成功，则实际测试了最后一个字符的零位置； 否则，测试失败的第一个位置。 输出参数。"," of the invocation target.":"调用目标。"," objects with the attributes you want to add to the member.":"带有要添加到成员的属性的对象。"," that implements the requested service, or ":"实施请求的服务或","If successful, the zero-based position in the formatted string where the last character was actually set; otherwise, the first position where the operation failed. An output parameter.":"如果成功，则实际设置了最后一个字符的格式字符串中的零位置； 否则，操作失败的第一个位置。 输出参数。"," that succinctly describes the result of the test operation. An output parameter.":"这简洁地描述了测试操作的结果。 输出参数。","The potential invocation target.":"潜在的调用目标。","The name of the owning component.":"拥有组件的名称。","The name of the member.":"成员的名字。","A collection of property descriptor.":"属性描述符的集合。"," if the user can enter ":"如果用户可以输入","The object to be used during member invocations.":"会员调用期间要使用的对象。","The specified nullable type.":"指定的无效类型。"," that contains the member attributes.":"其中包含成员属性。"," into the control; otherwise, ":"进入控制； 否则，"," that represents the type you want to convert to.":"这表示您要转换为的类型。"," to use as a filter.":"用作过滤器。"," representing the type of component this ":"代表组件的类型"," attributes.":"属性。"," if only ASCII is accepted; ":"如果仅接受ASCII；"," is bound to. For example, if this ":"一定会。 例如，如果这个"," to use as the current culture.":"用作当前文化。"," with the properties that match the specified attributes.":"与指定属性匹配的属性。","The object to compare to the current instance.":"与当前实例进行比较的对象。"," describes a property, this parameter should be the class that the property is declared on.":"描述属性，此参数应为属性所在的类。"," can accept any arbitrary Unicode character. The default is ":"可以接受任何任意的Unicode字符。 默认值为"," of new property values.":"新的属性值。","A component to get the properties for.":"获取属性的组件。","An instance of the object to call.":"要调用的对象的实例。"," if equivalent; otherwise, ":"如果等效； 否则，"," containing the number of editable character positions in the input mask that have already been assigned a character value in the formatted string.":"包含在格式字符串中已分配的输入蒙版中可编辑字符位置的数量。"," representing the given ":"代表给定"," with the properties for the specified component.":"带有指定组件的属性。","An instance of the component to invoke. This method returns a visual designer when the property is attached to a visual designer.":"要调用的组件的实例。 当该属性附加到视觉设计器上时，此方法将返回视觉设计师。"," containing the number of editable character positions that not yet been assigned a character value.":"包含尚未分配字符值的可编辑字符位置的数量。"," that lists the attributes in the parent class. Initially, this is empty.":"这列出了父类中的属性。 最初，这是空的。"," if the object cannot be created. This method always returns ":"如果无法创建对象。 此方法总是返回","The component for which you want to find a site.":"您想找到网站的组件。"," with the properties that match the specified attributes for the specified component.":"与指定组件的指定属性匹配的属性。"," containing the culture information associated with the input mask.":"包含与输入掩码相关的文化信息。","The component that contains the method.":"包含该方法的组件。","The base type of editor, which is used to differentiate between multiple editors that a property supports.":"编辑器的基本类型，用于区分属性支持的多个编辑器。","The site of the component, or ":"组件的站点，或"," if changing a property on this object requires a call to ":"如果更改此对象上的属性需要调用"," if the property is read-only; otherwise, ":"如果属性是只读的； 否则，"," that represents the type of the property.":"这代表属性的类型。"," to create a new value; otherwise, ":"创建一个新值； 否则，"," if a site does not exist.":"如果不存在站点。","An instance of the requested editor type, or ":"请求的编辑类型的实例，或","An object to compare to this instance, or ":"与此实例进行比较的对象，或"," enumeration values that specifies whether this property should be serialized.":"指定该属性是否应序列化的枚举值。"," refers to the same ":"指的是"," if an editor cannot be found.":"如果找不到编辑器。"," that contains the attributes of this member.":"其中包含该成员的属性。"," that provides a format context that can be used to extract additional information about the environment from which this converter is invoked. This parameter or properties of this parameter can be ":"这提供了一种格式上下文，可用于提取有关调用此转换器的环境的其他信息。 此参数的此参数或属性可以是"," if value change notifications may originate from outside the property descriptor; otherwise, ":"如果价值更改通知可能起源于属性描述符外部； 否则，","The hash code for this object.":"此对象的哈希代码。"," should be called to find a common set of values the object supports; otherwise, ":"应该调用以找到对象支持的共同值； 否则，"," that provides the attributes for this member, or an empty collection if there are no attributes in the ":"如果没有属性，则可以提供此成员的属性，或一个空集合","An array of fully qualified type names of the types to create for tabs on the Properties window.":"在属性窗口上为选项卡创建的类型的完全合格类型名称的数组。"," that provides the properties for this collection.":"这提供了此集合的属性。"," to test for validity.":"测试有效性。"," that should be used during invocation of members.":"应在调用会员期间使用。","The scope of each tab. If the scope is ":"每个选项卡的范围。 如果范围是","The name of the category to which the member belongs. If there is no ":"成员所属类别的名称。 如果没有"," that represents the nullable type.":"这代表了无效的类型。",", specifies that the collection cannot be modified.":"，指定该集合无法修改。","The assembly-qualified name of the type to retrieve.":"要检索的类型的组装合格名称。"," that represents the underlying type.":"这代表了基础类型。","The types of tabs to create.":"要创建的选项卡的类型。"," that was added to the collection.":"该收藏夹添加了。",", the category name is set to the default category, ":"，类别名称设置为默认类别，"," that matches the given type name, or ":"与给定类型名称匹配，或","An array of types indicating the types of tabs that this attribute uses.":"一系列类型，指示此属性使用的选项卡的类型。"," that represents the underlying type converter.":"这代表了基础类型的转换器。","The description of the member. If there is no ":"成员的描述。 如果没有"," if the collection contains the given ":"如果该集合包含给定的","The names of the tab classes that this attribute uses.":"此属性使用的标签类的名称。"," if a match cannot be found.":"如果找不到比赛。"," to indicate that the property should be shown as password text; otherwise, ":"指示该属性应显示为密码文本； 否则，"," objects to copy elements of the collection to.":"将集合元素复制到的对象。",", the property value is set to the default, which is an empty string (\"\").":"，属性值设置为默认值，即一个空字符串（“”）。","The component with the property for which to retrieve the value.":"具有检索值的属性的组件。"," objects that indicate the scopes of the tabs.":"表示标签范围的对象。"," parameter at which copying begins.":"复制开始的参数。"," if this member should be set only at design time; ":"如果仅在设计时间设置此成员；"," if the property should be shown as password text; otherwise, ":"如果应将属性显示为密码文本； 否则，","The value of a property for a given component.":"给定组件的属性值。","The name of the property extending to an object of the specified type.":"属性的名称扩展到指定类型的对象。"," to return from the collection.":"从收藏中返回。"," that contains the name of the property and its attributes.":"其中包含属性及其属性的名称。"," if the member can be set during run time.":"如果可以在运行时间设置成员。","The component for which to retrieve event handlers.":"检索事件处理程序的组件。"," if you want to ignore the case of the property name; otherwise, ":"如果您想忽略属性名称的情况； 否则，","The name of the data type this property can extend.":"该属性可以扩展的数据类型的名称。"," containing the name of the member and its attributes.":"包含成员的名称及其属性。","The name to display for the member.":"为会员显示的名称。"," if the property does not exist.":"如果该属性不存在。","A combined multicast event handler, or ":"组合的多播事件处理程序，或"," of the data type of the object that can receive the property.":"可以接收属性的对象的数据类型。"," if the member is browsable; otherwise, ":"如果成员可以浏览； 否则，"," array containing the attributes you want to associate with the property.":"包含要与属性关联的属性的数组。"," if no event handlers are currently assigned to ":"如果当前没有事件处理程序分配给"," to return the index of.":"返回索引。",". If there is no ":"。 如果没有"," that contains the property attributes.":"其中包含属性属性。","The name of a property that this class provides.":"此类提供的属性名称。","The object that raises the event.":"提高事件的对象。",", the property value is set to the default, which is ":"，属性值设置为默认值","The index at which to add the ":"添加的索引","The component to add the handler for.":"添加处理程序的组件。"," if the property this attribute is bound to can be used as an application setting; otherwise, ":"如果属性限制为属性，则可以用作应用程序设置； 否则，","The component to remove the handler for.":"要删除处理程序的组件。","The hash code for the name of the member.":"成员名称的哈希代码。"," parameter to the collection.":"集合的参数。","The delegate to add as a listener.":"代表添加为听众。"," that represents the type to associate with this reference converter.":"这表示要与此参考转换器关联的类型。"," is passed, the current culture is assumed.":"通过，假定当前的文化。","The delegate to remove as a listener.":"代表以侦听器的身份删除。"," that contains the sorted ":"包含排序"," that specifies the culture used to represent the font.":"这指定了用来代表字体的文化。","The component with the property value that is to be reset to the default value.":"具有重置为默认值的属性值的组件。","The component to test for reset capability.":"测试重置能力的组件。"," to convert the value parameter to.":"将值参数转换为。","The item to locate in the collection.":"要在集合中找到的项目。"," if resetting the component changes its value; otherwise, ":"如果重置组件会更改其值； 否则，"," that provides an additional context.":"这提供了附加的上下文。"," matches the proper path format; otherwise, ":"匹配适当的路径格式； 否则，","The component with the property value that is to be set.":"具有要设置的属性值的组件。"," if the item is found in the collection; otherwise, ":"如果在集合中找到该项目； 否则，","A new instance of the type.":"该类型的新实例。","The value to check.":"要检查的值。"," to create a toolbox item attribute for a default type; ":"为默认类型创建工具箱项目属性；","The component with the property to be examined for persistence.":"具有要持久性的属性的组件。"," if found in the list, otherwise -1.":"如果在列表中找到，则可以-1。","The object to compare to this ":"与此相比的对象"," to associate no default toolbox item support for this attribute.":"要关联此属性的默认工具箱项目支持。"," if the value is allowed and can be added to the standard values collection; ":"如果允许该值并可以添加到标准值集合中；"," if the property should be persisted; otherwise, ":"如果该财产应持续存在； 否则，"," if the values are equivalent; otherwise, ":"如果值等效； 否则，","The number of property descriptors in the collection.":"集合中的属性描述符数量。"," that represents the type of component this property is bound to. When the ":"这表示该属性与之绑定的组件类型。 当。。。的时候","The names of the type of the toolbox item and of the assembly that contains the type.":"工具箱项目的类型和包含类型的汇编的名称。"," if the value cannot be added to the standard values collection.":"如果该值无法添加到标准值集合中。","The component with the property that is to be examined for persistence.":"具有持久性的属性的组成部分。"," if access to the collection is synchronized (thread safe); otherwise, ":"如果访问该集合的访问已同步（线程安全）； 否则，"," methods are invoked, the object specified might be an instance of this type.":"调用方法，指定的对象可能是此类型的实例。","The component that changed.":"更改的组件。","The type of the toolbox item.":"工具箱项目的类型。","The element with the specified key.":"带有指定键的元素。"," if the value of the property can persist; otherwise, ":"如果财产的价值可以持续存在； 否则，"," that is used to convert the ":"用于转换","The fully qualified type name of the current toolbox item.":"当前工具箱项目的完全合格的类型名称。"," that changed.":"那改变了。"," that represents the type of component to which this property binds.":"这表示该属性绑定的组件类型的类型。","The zero-based index of the item to get or set.":"要获取或设置的项目的零索引。"," if the property is read-only; ":"如果属性是只读的；"," of this property.":"这个属性。","The filter string for the toolbox item.":"工具箱项目的过滤字符串。","The component that changed its properties, events, or extenders, or ":"更改其属性，事件或扩展程序的组件，或","The assembly qualified name of the type of tab to create. For an example of this format convention, see ":"要创建的标签类型的汇编合格名称。 有关此格式约定的示例，请参见"," indicating the type of the filter.":"指示过滤器的类型。"," if the member is marked with the ":"如果成员标记"," if all components of the same type have changed.":"如果相同类型的所有组件都已更改。"," that represents the objects to put into the collection.":"这代表要放入集合的对象。"," that indicates the scope of this tab. If the scope is ":"这表示此选项卡的范围。 如果范围是"," that changed its properties or events.":"这改变了其属性或事件。"," that represents the array to copy to.":"这代表要复制的数组。"," set to ":"调成","The object to test for a matching filter string.":"测试匹配过滤器字符串的对象。",", it is shown only for components with the corresponding ":"，仅显示具有相应的组件"," that contains the component or ":"包含组件或","The number of objects in the collection.":"集合中的对象数。"," is compatible with the type description and its chain of type description providers; otherwise, ":"与类型说明及其类型描述提供商兼容； 否则，",". If it is ":"。 如果是"," if the specified object has a matching filter string; otherwise, ":"如果指定的对象具有匹配的过滤器字符串； 否则，","The parent type description provider.":"父类型说明提供商。"," if an installer should be invoked during installation of an assembly; otherwise, ":"如果在安装组件期间应调用安装程序； 否则，",", it is shown for all components on the document.":"，显示文档上的所有组件。","A string that represents the current object.":"表示当前对象的字符串。","An instance of the target component.":"目标组件的实例。","An optional service provider.":"可选服务提供商。"," to specify that a property is appropriate to bind settings to; otherwise, ":"指定属性适合将设置绑定到； 否则，","The type of tab to create.":"要创建的选项卡的类型。","The type of object to create. This parameter is never ":"要创建对象的类型。 此参数永远不会"," objects to add to the component's class.":"对象添加到组件的类中。"," that indicates the type of the filter.":"这表示过滤器的类型。"," if the property is appropriate to bind settings to; otherwise, ":"如果属性适合将设置绑定到； 否则，","An optional array of types that represent the parameter types to be passed to the object's constructor. This array can be ":"一个可选的类型数组，代表要传递给对象构造函数的参数类型。 这个数组可以是"," that was used to add the specified attributes.":"它用于添加指定的属性。","The type ID for this attribute. All ":"此属性的类型ID。 全部"," to use.":"使用。"," to compare to this instance, or ":" 与此实例进行比较，或 "," or of zero length.":"或零长度。"," of the target component.":"目标组件的。"," objects with the same filter string return the same type ID.":"具有相同过滤器字符串的对象返回相同的类型ID。"," instances are equal; otherwise, ":"实例相等； 否则，","The editor base type to add the editor table for. If a table already exists for this type, this method will do nothing.":"编辑基础类型添加编辑表。 如果此类型已经存在表，则此方法无能为力。","A string containing the machine name to check.":"一个包含用于检查的机器名称的字符串。","An optional array of parameter values to pass to the object's constructor.":"可选的参数值数组将传递到对象的构造函数。","A component to get the events for.":"获得事件的组件。"," that represents the converted text.":"这代表转换后的文本。","The primary ":"首要的","The substitute ":"替代品"," matches the proper machine name format; otherwise, ":"匹配适当的机器名称格式； 否则，","The secondary ":"次要","The text representation of the object to convert.":"对象转换对象的文本表示。"," with the events for this component.":"与此组件的事件有关。"," to convert the ":"转换","A string containing the path to check.":"一个包含检查路径的字符串。","The object for which to get the cache.":"获得缓存的对象。"," that you can use as a filter.":"您可以用作过滤器。"," that specifies the component to associate with the designer.":"这指定了要与设计师关联的组件。"," if the provided object supports caching; otherwise, ":"如果提供的对象支持缓存； 否则，"," with the events that match the specified attributes for this component.":"与此组件的指定属性匹配的事件。"," that represents the type of designer to create.":"这代表了要创建的设计师的类型。"," parameter to.":" 参数到。","The object for which to get the extended type descriptor.":"获取扩展类型描述符的对象。"," to find the name for.":"找到名称。"," that is an instance of the designer for the component, or ":"这是组件设计人员的实例，或"," that represents a dictionary of new property values.":" 它表示新属性值的字典。","The fully qualified name of the specified component, or ":"指定组件的完全合格名称，或"," if no designer can be found.":"如果找不到设计师。"," that can provide extended metadata for the object.":"可以为物体提供扩展的元数据。"," if the component has no name.":"如果组件没有名称。"," to convert, or ":"转换，或","The object to get extender providers for.":"获取扩展提供商的对象。","The type of the component for which to create the new event.":"为创建新事件的组件的类型。"," with the events that match the specified attributes for the specified component.":"与指定组件的指定属性匹配的事件。","An array of extender providers for ":"一系列扩展提供商"," if the object is not available.":"如果对象不可用。"," to not consider custom type description information; otherwise, ":"不考虑自定义类型说明信息； 否则，","The existing event information.":"现有的事件信息。","The new attributes.":"新属性。"," with the properties for a specified component.":"带有指定组件的属性。","The specified component.":"指定的组件。"," that represents the exception to throw when a conversion cannot be performed.":"这表示无法执行转换时投掷的例外。"," that represents the component to get properties for.":"这代表要获得属性的组件。"," that has merged the specified metadata attributes with the existing metadata attributes.":"这将指定的元数据属性与现有的元数据属性合并。"," that represents the type the conversion was trying to convert to.":"这代表转换试图转换的类型。","The name of the specified component.":"指定组件的名称。","The type of the component the event lives on.":"活动所生活的组件类型。"," with the properties for a specified type of component.":"带有指定类型组件类型的属性。","The type of the delegate that handles the event.":"处理事件的代表的类型。","An instance of the type (should not be ":"类型的实例（不应该是","The object to test for validity.":"测试有效性的对象。"," with the properties that match the specified attributes for this type of component.":"与此类型组件的指定属性匹配的属性。","The attributes for this event.":"此事件的属性。"," that has the properties to sort.":"这具有要排序的属性。"," that is bound to a type.":"这与一种类型绑定。","The type of reflection for this ":"这种反射的类型 "," associated with the specified component.":"与指定的组件相关联。","The service provider that provides a ":"提供的服务提供商","An array of names in the order you want the properties to appear in the collection.":"您希望这些属性出现在集合中的顺序中的名称数组。","The type of object for which to retrieve the ":"检索物体的类型"," associated with the specified type.":"与指定类型相关联。"," service. This parameter can be ":"服务。 此参数可以是"," that contains the sorted properties.":"其中包含排序的属性。"," of object to create.":"要创建的对象。"," for the specified object.":"对于指定的对象。"," that represents the type of component to which this property descriptor binds.":"这表示该属性描述符绑定的组件类型的类型。","An instance of the type. Can be ":"类型的实例。 可以是 ","An optional array of parameter types to be passed to the object's constructor. This parameter can be ":"可选的参数类型的数组将传递给对象的构造函数。 此参数可以是"," that represents the data type for this property.":"这代表此属性的数据类型。"," of the specified class.":"指定的类。"," or an array of zero length.":"或零长度的阵列。","The type to convert to its runtime equivalent.":"要转换为其运行时等效的类型。"," array with the attributes to associate with the property.":"具有与属性关联的属性的数组。"," that represents the runtime equivalent of ":"这代表了运行时等效的","An optional array of parameter values to pass to the object's constructor. If not ":"可选的参数值数组将传递到对象的构造函数。 如果不","A component for which the properties or events have changed.":"属性或事件已更改的组件。"," if resetting the component changes the value of the component; otherwise, ":"如果重置组件会更改组件的值； 否则，",", the number of elements must be the same as ":"，元素的数量必须与"," if no instance was passed to the ":"如果没有实例传递给"," that represents the assembly to refresh. Each ":"这代表了刷新的组装。 每个","The component with the property value to be reset.":"具有重置属性值的组件。","An instance of the substitute data type if an associated ":"替代数据类型的实例如果关联"," in this assembly will be refreshed.":"在这个大会中将刷新。"," that can provide metadata for the type.":"可以为类型提供元数据。"," of the component that the property is a member of.":"属性是成员的组件。","The existing property descriptor.":"现有的属性描述符。"," that represents the module to refresh. Each ":"这代表了刷新的模块。 每个","The type of object for which to retrieve the type descriptor.":"检索类型描述符的对象类型。"," in this module will be refreshed.":"在此模块中将刷新。","The new attributes for this property.":"此属性的新属性。","The type to test for compatibility.":"测试兼容性的类型。"," in an association.":"在协会中。"," that has the specified metadata attributes merged with the existing metadata attributes.":"具有指定的元数据属性与现有元数据属性合并。"," that contains the descriptors to sort.":"其中包含要排序的描述符。"," of the property.":"财产。"," that is bound to the specified type and that has the specified metadata attributes merged with the existing metadata attributes.":"该绑定到指定类型，并且具有与现有元数据属性合并的指定元数据属性。"," instance representing the COM type information provider.":"代表COM类型信息提供商的实例。","The primary object of the association.":"协会的主要对象。"," of the COM object represented by this component, or ":"该组件代表的com对象或","An instance of the secondary type that has been associated with the primary object if an association exists; otherwise, ":"如果存在关联，则与主要对象关联的次级类型的实例； 否则，"," for non-COM objects.":"对于非com对象。"," that represents a custom type description provider for all interface types.":"这代表了所有接口类型的自定义类型说明提供商。"," if no specified association exists.":"如果没有指定的关联。","The array of type ":"类型数组","The component for which you want to get attributes.":"您要获得属性的组件。"," to use as the available types.":"用作可用类型。"," containing the attributes for the component. If ":"包含组件的属性。 如果"," of the source object.":"源对象。",", this method returns an empty collection.":"，此方法返回一个空集合。"," to use a baseline set of attributes from the custom type descriptor if ":"使用自定义类型描述符中的基线属性集","An object that provides contextual information.":"提供上下文信息的对象。"," with the attributes for the component. If the component is ":"具有组件的属性。 如果组件是","The type of the object to be converted.":"要转换的对象的类型。"," with the attributes for the type of the component. If the component is ":"具有组件类型的属性。 如果组件是"," for which you want the class name.":"您想要班级名称。"," if this converter can convert sourceType to a ":"如果此转换器可以将源型转换为"," containing the name of the class for the specified component.":"包含指定组件的类名称。","The target type for the conversion.":"转换的目标类型。"," to consider custom type description information; otherwise, ":"考虑自定义类型说明信息； 否则，"," if the converter can convert an object to the given destination type; otherwise, ":"如果转换器可以将对象转换为给定的目标类型； 否则，"," containing the name of the class for the specified component type.":"包含指定组件类型的类名称。","The culture to use for the conversion.":"用于转换的文化。"," containing the name of the specified component, or ":"包含指定组件的名称，或","The value to convert to a ":"转换为"," if there is no component name.":"如果没有组件名称。","The name of the class for the specified component, or ":"指定组件的类名称，或"," converted to a ":"转换为a","The culture that supplies formatting information for the conversion.":"为转换提供格式信息的文化。","A component to get the converter for.":"要获取转换器的组件。","The value to be converted.":"要转换的值。"," for the specified component.":"对于指定的组件。","The type to convert the value parameter to.":"将值参数转换为的类型。"," for the specified type.":"对于指定类型。","An object that represents the converted value.":"表示转换值的对象。","The component to get the event for.":"获得事件的组件。","The message to display to the end user.":"向最终用户显示的消息。"," with the default event, or ":"与默认事件或","The Help file to display if the user requests help.":"如果用户请求有帮助，请显示帮助文件。"," if there are no events.":"如果没有事件。","The Help topic to display if the user requests help.":"如果用户请求有帮助，请显示帮助主题。"," with the default property, or ":"使用默认属性，或","Stores the data that was being used to serialize or deserialize the object that the ":"存储用于序列化或应对对象的数据"," was serializing or deserializing.":"正在序列化或挑剔。"," that represents the class to get the property for.":"这代表了获得属性的班级。","Describes the source and destination of the stream that generated the exception, as well as a means for serialization to retain that context and an additional caller-defined context.":"描述生成异常的流的源和目的地，以及序列化保留该上下文和附加呼叫者定义上下文的手段。"," that represents the base type of the editor you want to find.":"这代表了您想要找到的编辑器的基本类型。","An instance of the editor that can be cast to the specified editor type, or ":"可以施放到指定编辑器类型的编辑器的实例，或","The Help topic associated with the warning.":"与警告相关的帮助主题。"," if no editor of the requested type can be found.":"如果找不到请求类型的编辑。","The Help file associated with the warning.":"与警告相关的帮助文件。","A flag indicating whether custom type description information should be considered.":"指示是否应考虑自定义类型信息信息的标志。"," that provides a format context. You can use this object to get additional information about the environment from which this converter is being invoked.":"这提供了格式上下文。 您可以使用此对象获取有关调用此转换器的环境的其他信息。"," that represents the base type of the editor you are trying to find.":"这代表了您要找到的编辑器的基本类型。","The type from which you want to convert.":"您要转换的类型。","An instance of the editor object that can be cast to the given base type, or ":"可以施放给给定的基本类型的编辑对象的实例，或"," that specifies the culture to represent the color.":"这指定了代表颜色的文化。"," representing the converted value.":"表示转换值。"}