{" objects that represent the arguments to the method.":"代表该方法的参数的对象。"," in Visual Basic) method.":"在Visual Basic）方法中。"," that represents the specified ":"代表指定的"," property set to the specified arguments.":"属性设置为指定参数。"," this ":"这个","The body of the catch statement.":"捕获声明的身体。","The body of the ":"身体"," in Visual Basic) method, and the ":"在Visual Basic）方法中，"," representing a reference to the ":" 表示对 "," for clearing a sequence point.":"用于清除序列。"," property set to the specified value.":"属性设置为指定值。"," will handle.":"会处理。"," equal to Continue, the ":"等于继续","The start line of this ":"这的起点","The end line of this ":"终点线","The end column of this ":"最终列",". Must be greater than 0.":"。 必须大于0。"," to decrement.":"减少。",". Must be greater or equal than the start line.":"。 必须大于或相等的起点。"," that represents the decremented expression.":" 表示递减表达式。","The start column of this ":"开始的开始列",". If the end line is the same as the start line, it must be greater or equal than the start column. In any case, must be greater than 0.":". 如果结束行与开始行相同，则必须大于或等于开始列。 在任何情况下，必须大于0。"," property equal to. For ":"属性等于。 为了"," property to.":"财产为。"," objects to set the ":"对象设置"," property set to the specified type.":"属性设置为指定类型。"," must be ":"一定是"," contains a field named ":"包含一个名为的字段"," and has the ":"并有"," in Visual Basic), ":"在Visual Basic中），",". This can be null for static fields.":"。 对于静态字段来说，这可能是无效的。"," to set ":" 要设置 "," that represents the field denoted by ":"代表表示的字段"," that contains the field.":"其中包含字段。","The name of a field to be accessed.":"要访问的字段的名称。","An array of up to sixteen ":"长达16个阵列","The containing object of the field. This can be null for static fields.":"包含字段的对象。 对于静态字段来说，这可能是无效的。"," delegate type.":" 委托类型。"," objects that specify the type arguments for the ":"指定类型参数的对象","The field to be accessed.":"要访问的字段。"," delegate that has the specified type arguments.":"具有指定类型参数的委托。"," property set to the specified value, the ":"属性设置为指定值，","The delegate type.":"委托类型。","The type of a ":"一种类型","The type arguments of the delegate.":"代表的类型参数。"," properties set to the specified values. The type of the resulting ":"设置为指定值的属性。 结果的类型","An array of one to seventeen ":"一个到十七的阵列",", properties set to the specified values. The ":"，属性设置为指定值。 该 "," that represents the incremented expression.":"这代表了增量表达式。"," that represents the delegate or lambda expression to be applied.":"这代表要应用的代表或lambda表达式。"," to increment.":"增加。"," equal to Goto, the ":"等于goto，"," property is set to default expression and the type of the resulting ":"属性设置为默认表达式和结果的类型"," to evaluate.":"评估。"," that represents the delegate or lambda expression to be applied to.":"这代表要应用的代表或lambda表达式。"," without a default value.":"没有默认值。"," property set to the specified value, and a null value to be passed to the target label upon jumping.":"属性设置为指定的值，并在跳跃时传递给目标标签的空值。"," returned by this method is ":"通过此方法返回的是"," which this ":"这是"," when the label is reached through regular control flow.":"当通过常规控制流达到标签时。"," objects that represent the arguments that the delegate or lambda expression is applied to.":"代表代表或lambda表达式应用的论点的对象。","The name for the lambda. Used for emitting debug information.":"Lambda的名字。 用于发出调试信息。","The type of value that is passed when jumping to the label.":"跳到标签时传递的值类型。"," will be associated with.":"将与之关联。"," that indicates if tail call optimization will be applied when compiling the created expression.":"这表明在编译创建表达式时是否会应用尾部调用优化。"," that applies the specified delegate or lambda expression to the provided arguments.":"这将指定的代表或lambda表达式应用于提供的参数。","The name of the lambda. Used for generating debugging info.":"Lambda的名字。 用于生成调试信息。"," with the given default value.":"带有给定的默认值。"," property equal to Lambda and the ":"等于Lambda的财产和"," that represents an instance method named \"Add\" (case insensitive), that adds an element to a collection.":"这代表了一个名为“ add”（情况不敏感）的实例方法，该方法将元素添加到集合中。","The name of the label.":"标签的名称。","The name of the lambda. Used for generating debugging information.":"Lambda的名字。 用于生成调试信息。"," representing the delegate signature for the lambda.":" 表示lambda的委托签名。"," that represents a field or property to set the ":"代表一个字段或属性来设置","The continue target used by the loop body.":"循环主体使用的继续目标。","An array that contains ":"一个包含的数组"," that represents an instance method that takes one argument, that adds an element to a collection.":"这代表了一个实例方法，该方法将一个参数添加到集合中。"," that represents a delegate signature for the lambda.":"这代表了Lambda的代表签名。"," populated with the elements of ":"填充的元素"," that specifies the type of binary operation.":"这指定了二进制操作的类型。"," that results from calling the appropriate factory method.":"这是由于调用适当的工厂方法而导致的。","The body of the loop.":"循环的身体。","An object that represents a lambda expression which has the ":"代表具有lambda表达式的对象","The object to which the property belongs. It should be null if the property is ":"属性所属的对象。 如果财产为"," that represents the left operand.":"这代表左操作数。"," that specifies the implementing method.":"指定实现方法。"," that describes the field or property to be accessed.":"描述要访问的字段或属性。"," that represents the right operand.":"这代表正确的操作数。"," that represents a type conversion function. This parameter is used only if ":"这代表类型的转换函数。 仅在"," representing the property to index.":"代表索引属性。","The break target used by the loop body.":"循环体所使用的中断目标。","The result type of the try expression. If null, body and all handlers must have identical type.":"尝试表达式的结果类型。 如果无效，则身体和所有处理程序必须具有相同的类型。","The body of the fault block. Pass null if the try block has no fault block associated with it.":"断层块的主体。 如果尝试块没有与之关联的故障块，则通过NULL。"," or compound assignment.":"或复合分配。"," in Visual Basic) that contains the arguments that will be used to index the property.":"在Visual Basic）中包含将用于索引属性的参数。","The body of the try block.":"尝试块的身体。"," that specifies the type to be converted to (pass ":"指定要转换为的类型（通过","The body of the finally block. Pass null if the try block has no finally block associated with it.":"最后块的身体。 如果尝试块最终没有与之关联的块，则通过NULL。"," that represents the object that the member belongs to. This can be null for static members.":"这代表了成员所属的对象。 对于静态成员来说，这可能是无效的。","s representing the catch statements to be associated with the try block.":"S表示与Try块关联的捕获语句。"," if not applicable).":"如果不适用）。"," that represents the element type of the array.":"这代表数组的元素类型。"," that represents the property to index.":"这代表了索引的属性。"," that specifies the type of unary operation.":"这指定了一元操作的类型。","The containing object of the property. This can be null for static properties.":"包含属性的对象。 对于静态属性，这可能是无效的。"," objects that are used to index the property.":"用于索引属性的对象。"," that has a constructor that takes no arguments.":"那有一个没有争论的构造函数。","The type of the parameter or variable.":"参数或变量的类型。"," that represents the operand.":"代表操作数。"," that contains the property.":"其中包含属性。"," that represents the constructor without parameters for the specified type.":"这代表没有参数的构造函数。"," contains a property named ":"包含一个命名的属性",". This can be ":"。 这可以","The property to be accessed.":"要访问的属性。","The value to be tested against each case.":"每种情况下要测试的值。"," equal to.":"等于。"," node with the specified name and type.":" 具有指定名称和类型的节点。"," for static properties.":"用于静态特性。"," contains a property or field named ":"包含一个名称的属性或字段","The result of the switch if ":"开关的结果","The name of the parameter or variable, used for debugging or printing purpose only.":"参数或变量的名称仅用于调试或打印目的。"," properties set to the specified value.":"设置为指定值的属性。","The name of a property to be accessed.":"要访问的属性的名称。"," does not match any of the cases.":"不匹配任何情况。","The name of a property or field to be accessed.":"要访问的属性或字段的名称。"," to apply the operations on.":"应用操作。"," that represents the exception.":"这代表例外。","The set of cases for this switch expression.":"此开关表达式的一组情况。"," that represents the property denoted by ":"代表由"," that represents the property or field denoted by ":"代表由"," that represents the resultant expression.":"这代表了结果表达。","The name of the indexer.":"索引器的名称。","The array of zero or more ":"零或更多的数组 "," property equal to. This can be null for static properties.":"属性等于。 对于静态属性，这可能是无效的。"," that represents a rethrowing of an exception.":"这代表了例外的复合。","The equality comparison method to use.":"的相等性比较方法来使用。"," expressions representing the catch statements to be associated with the try block.":"表示与TRY块关联的捕获语句的表达式。","When this method returns, contains the generic System.Action delegate type that has specific type arguments. Contains null if there is no generic System.Action delegate that matches the ":"当此方法返回时，包含具有特定类型参数的Action委托类型。 如果没有通用系统，则包含null。","The body of the finally block.":"最后块的身体。","The object to which the property belongs. If the property is static/shared, it must be null.":"属性所属的对象。 如果该属性是静态/共享的，则必须为null。"," equal to Return, the ":"等于返回，"," if generic System.Action delegate type was created for specific ":"如果为特定的特定系统创建了一般系统。","The result type of the switch.":"开关的结果类型。","The body of the fault block.":"断层块的主体。","A delegate that represents the compiled lambda expression described by the ":"代表代表由"," properties are set to the specified values.":"属性设置为指定值。","An array of Type objects that specify the type arguments for the System.Func delegate type.":"一个类型对象的数组，该数组为System.func委托类型指定类型参数。","An array of Type objects that specify the type arguments for the System.Action delegate type.":"一个类型对象的数组，该数组指定系统的类型参数。Action委托类型。","Debugging information generator used by the compiler to mark sequence points and annotate local variables.":"编译器使用的调试信息生成器标记序列点并注释局部变量。","When this method returns, contains the generic System.Func delegate type that has specific type arguments. Contains null if there is no generic System.Func delegate that matches the ":"当此方法返回时，包含具有特定类型参数的FUNC委托类型。 如果没有通用系统，则包含null.func委托","The body of the case.":"案件的身体。"," to unbox.":"到Unbox。","The modified node list, if any of the elements were modified; otherwise, returns the original node list.":"修改后的节点列表，如果修改了任何元素； 否则，返回原始节点列表。","A delegate containing the compiled version of the lambda.":"包含lambda的编译版本的代表。"," if generic System.Func delegate type was created for specific ":"如果为特定的特定系统创建了通用系统。","The test values of the case.":"情况的测试值。"," for which the ":"为此","The name of the calling method; used to report to report a better error message.":"调用方法的名称； 用于报告报告更好的错误消息。","The expressions to visit.":"访问的表达。","The name of the parameter or variable. This name is used for debugging or printing purpose only.":"参数或变量的名称。 此名称仅用于调试或打印目的。","The number of arguments to the expression tree node as ":"表达树节点的参数数为","The name of the calling method; used to report a better error message.":"调用方法的名称； 用于报告更好的错误消息。","The expression being visited, or an expression which should replace it in the tree.":"被访问的表达式或应在树中替换它的表达式。"," property is equal to ":"财产等于","The modified expression list, if any one of the elements were modified; otherwise, returns the original expression list.":"修改后的表达式列表，如果修改了任何一个元素； 否则，返回原始表达式列表。","The modified expression collection, if any expression was modified; otherwise, returns the original expression collection.":"修改的表达收集，如果任何表达式进行了修改； 否则，将返回原始表达收集。","The CallSite for the DynamicExpression's polymorphic inline cache.":"DynamiceCpression多态性内联缓存的呼吁。"," and for which the ":"而"," if the node can be reduced; otherwise, ":"如果可以减少节点； 否则，","The modified expression, if it or any subexpression was modified; otherwise, returns the original expression.":"修改的表达式（如果它或任何子表达）被修改； 否则，返回原始表达式。","The arguments used to replace this node.":"用于替换此节点的参数。"," object representing the kind of the \"go to\" expression.":"代表“转到”表达式的对象。","The nodes to visit.":"节点要访问。","A delegate of type ":"类型的代表","The rewritten node, but if no changes were made, then returns the same node.":"重写节点，但是如果没有进行更改，则返回相同的节点。"," object representing the target label for this node.":"代表此节点的目标标签的对象。","The argument at index, throwing if index is out of bounds, as ":"索引处的参数，如果索引超出边界，则抛出 "," that represents the compiled lambda expression described by the ":"代表了由","A delegate that visits a single element, optionally replacing it with a new element.":"访问单个元素的委托，可选地用新元素代替。"," objects which represent the arguments that the delegate is applied to.":"代表代表应用的论点的对象。","The delegate type used by the CallSite.":"呼叫者使用的委托类型。"," object representing the value passed to the target or null.":" 表示传递给目标或null的值的对象。"," to indicate that the expression should be compiled to an interpreted form, if it is available; ":"指示该表达式应将其编译成解释的形式，如果可用；","The read-only collection containing the arguments that will be used to index the property or array.":"仅读取集合包含将用于索引属性或数组的参数。"," to indicate that the expression should be compiled to an interpreted form, if it's available; otherwise, ":"指示该表达式应将其编译成解释的形式，如果可用的话； 否则，","The argument at index.":"索引的论点。"," that represents the delegate to be applied.":"这代表要应用的代表。"," that is the body of the loop.":"那是循环的主体。"," for the property if the expression represents an indexed property, otherwise null.":"对于该属性，如果该表达式表示索引属性，则为null。","The Expression object representing the value of the ":"表示对象表示值"," that represents the field or property to be accessed.":"这代表要访问的字段或属性。"," that represents the body of the lambda expression.":" 表示lambda表达式的主体。"," that is used by the loop body as a break statement target.":"循环主体将其用作断裂语句目标。"," representing the object to index.":"代表索引对象。"," which this label is associated with.":"该标签与之关联。"," objects which describe how to initialize the members.":"描述如何初始化成员的对象。","The name of the lambda expression.":"lambda表达的名称。","The number of arguments to the expression tree node as  ":"表达树节点的参数数为"," that is used by the loop body as a continue statement target.":"循环机构将其用作继续陈述目标。"," object representing the type of the value that is passed when jumping to the label or ":"对象表示跳到标签或"," that represents the constructor call.":"这代表构造函数调用。"," objects that represent the parameters of the lambda expression.":"表示Lambda表达式参数的对象。"," objects which represent either the bounds of the array or the initialization values.":"代表数组边界或初始化值的对象。"," that represents the value to assign to the field or property.":"这代表分配给字段或属性的值。"," objects to initialize a collection member with.":"对象将收集成员初始化。"," object representing the type of the lambda expression.":"代表lambda表达式类型的对象。","The argument at index, throwing if index is out of bounds.":"索引的论点，如果索引不超出界限。"," that discriminates the type of binding that is represented.":"这区分了表示的结合类型。"," objects that describe how to initialize the members of the member.":"描述如何初始化成员成员的对象。"," if no value should be passed.":" 如果不应传递任何值。"," if the lambda expression will be compiled with the tail call optimization; otherwise, ":"如果将lambda表达式通过尾声优化编译； 否则，"," objects that represent the arguments to the constructor.":"代表构造函数的参数的对象。"," that represents a field or property to be initialized.":"这代表要初始化的字段或属性。"," that represents the called constructor.":"这代表了所谓的构造函数。"," objects which represent the elements that are used to initialize the collection.":"代表用于初始化集合的元素的对象。"," that contains the compiled version of the lambda expression.":"其中包含lambda表达式的编译版本。"," objects which represent the arguments to the called method.":"将参数表示为调用方法的对象。"," that represents the field or property to be initialized.":"这代表要初始化的字段或属性。"," that represents the call to the constructor of a collection type.":"这代表了收集类型的构造函数的调用。"," objects that represent the members that can retrieve the values of the fields that were initialized with constructor arguments.":"表示可以检索用构造函数初始化的字段值的成员的对象。","The read-only collection containing parameters that will be provided the runtime access.":"只读集合包含将提供运行时访问的参数。"," that represents the called method.":"这代表了所谓的方法。"," that represents the containing object of the field or property.":"这代表了字段或属性的包含对象。","The number of arguments to the expression tree node.":"表达树节点的参数数。"," if a node can be reduced; otherwise, ":"如果可以减少节点； 否则，"," object that represents the body of the case block.":"代表外壳块的主体的对象。"," that represents the receiving object of the method.":"这代表了该方法的接收对象。"," that contains the name of the parameter.":"其中包含参数的名称。","The arguments for the binder.":"活页夹的论点。","Collection to copy elements from.":"收集以复制元素。","A function that returns the initial accumulator value.":"返回初始累加器值的函数。"," that represents the operand of the unary operation.":"这代表了单一操作的操作数。","The read-only collection of the values for this case block.":"该情况块的仅读取值。","A new delegate which replaces the CallSite Target.":"一个替代呼叫目标的新代表。","Initial capacity.":"初始容量。","The collection of ":"集合"," that represents the type of the element(s) that are returned when the expression tree associated with this object is executed.":"代表当执行与此对象关联的表达树时返回的元素的类型。","A sequence whose elements to apply the predicate to.":"一个序列，其元素将谓词应用于。","The target delegate to be added to the cache.":"目标委托将添加到缓存中。","the object to locate in the ":"要定位在"," object representing the equality comparison method.":"代表平等比较方法的对象。"," that is associated with this instance of ":"与此实例有关","An item to search for.":"一个要搜索的项目。"," object representing the test for the switch.":"代表开关测试的对象。"," if every element of the source sequence passes the test in the specified predicate, or if the sequence is empty; otherwise, ":" 如果源序列的每个元素都通过指定谓词中的测试，或者如果序列为空；否则, "," object representing a label that can be used to trigger the binding update.":" 表示可用于触发绑定更新的标签的对象。"," that is associated with this data source.":"这与此数据源相关。","The document type's unique identifier.":"文档类型的唯一标识符。","The sequence to check for emptiness.":"检查空虚的序列。"," if the input ":"如果输入","The index of the first occurrence of an item.":"第一次出现项目的索引。","An expression tree that represents a LINQ query.":"表示LINQ查询的表达式树。"," if the source sequence contains any elements; otherwise, ":"如果源序列包含任何元素； 否则，","The zero-based index at which item should be inserted.":"基于零的索引应插入哪个项目。"," is internally used by DLR and should not be displayed on the language code's stack. Otherwise, ":"由DLR内部使用，不应显示在语言代码的堆栈上。 否则，","The string representing the source file name.":"表示源文件名的字符串。","A sequence to whose elements the predicate will be applied.":"将应用其元素的序列。"," that can evaluate the query represented by the specified expression tree.":"可以评估指定表达树表示的查询。","The language's unique identifier.":"该语言的唯一标识符。","A PDB symbol generator.":"PDB符号发生器。"," if item was successfully removed from the ":"如果项目成功地从","The value that results from executing the specified query.":"执行指定查询而产生的值。"," if any elements in the source sequence pass the test in the specified predicate; otherwise, ":"如果源序列中的任何元素通过指定谓词中的测试； 否则，","The lambda expression that is generated.":"生成的lambda表达式。","; otherwise, false. This method also returns false if item is not found in the original ":"; 否则，错误。 如果在原始内容中找不到项目，此方法还会返回false","The language vendor's unique identifier.":"语言供应商的唯一标识符。","The call site delegate type.":"呼叫网站委托类型。","The sequence to cast as ":"铸造的序列"," representing the body of the try block.":"代表尝试块的身体。","The capacity of this ":"这个能力","The call site binder.":"呼叫站点活页夹。","The offset within MSIL code at which to mark the sequence point.":"MSIL代码中标记序列点的偏移。","The input sequence typed as ":"输入序列键入为"," representing the fault block.":"表示故障块。","The new call site.":"新的呼叫网站。","Debug information that corresponds to the sequence point.":"与序列相对应的调试信息。","An enumerator that iterates through the sequence.":"通过序列迭代的枚举者。","The input sequence.":"输入序列。"," object responsible for binding dynamic operations.":"负责绑定动态操作的对象。"," representing the finally block.":"代表最后一个块。","A sequence to aggregate over.":"汇总的序列。","Specifies, in a prefix traversal of a type's construction, which ":"指定在类型结构的前缀遍历中","The source sequence which will maintain the original ordering in the subsequent query operators.":"将在后续查询运算符中维护原始订购的源序列。"," expressions associated with the try block.":"与尝试块相关的表达式。","The binder responsible for the runtime binding of the dynamic operations at this call site.":"负责该呼叫站点动态操作的运行时绑定的活页夹。","An accumulator function to be invoked on each element.":"每个元素都调用的累加器函数。","The source as a ParallelQuery to bind to ParallelEnumerable extension methods.":"源作为与平行可行的扩展方法结合的平行线。"," occurrences are meant to be treated as a dynamically dispatched type.":"出现旨在将其视为动态调度类型。","A partitioner over the input sequence.":"输入序列的分区器。","An accumulator function to be invoked on each element in a partition.":"分区中每个元素都调用的累加器函数。","The new instance of dynamic call site.":"动态呼叫站点的新实例。"," as a ParallelQuery to bind to ParallelEnumerable extension methods.":"作为与平行可行的扩展方法结合的平行线。"," that represents the expression operand of a type test operation.":"这代表类型测试操作的表达操作数。"," occurrences that are meant to be treated as a dynamically dispatched type.":"被视为动态调度类型的出现。","The number of run-time variables.":"运行时变量的数量。"," that represents the type operand of a type test operation.":"这代表类型测试操作的类型操作数。","The update delegate.":"更新委托。","The source as a ":"来源作为一个","An accumulator function to be invoked on the yielded accumulator result from each partition.":"每个分区的累积累加器结果都将累加器函数。"," to convert to an ":"转换为"," to bind to ParallelEnumerable extension methods.":"与平行可容纳的扩展方法结合。","The zero-based index of the run-time variable whose value is to be returned.":"将返回值的运行时变量的基于零的索引。","A function to transform the final accumulator value into the result value.":"将最终累加器值转换为结果值的函数。","The CallSite the bind is being performed for.":"绑定正在执行的呼叫。"," if the source sequence contains an element that has the specified value; otherwise, ":"如果源序列包含具有指定值的元素； 否则，","The value of the run-time variable.":"运行时变量的值。","The source as an ":"来源作为","An empty sequence whose type argument is ":"一个空的序列，其类型参数为","The transformed final accumulator value.":"转换的最终累加器值。","A sequence of groups that are sorted descending according to ":"一系列根据根据"," to bind to sequential extension methods.":"结合顺序扩展方法。","An equality comparer to compare values.":"比较值的平等比较。","A sequence whose elements that are not also in ":"一个不在中的元素的序列","A function to extract the join key from each element of the second sequence.":"从第二个序列的每个元素中提取联接键的函数。"," that contains elements to sort.":"其中包含要排序的元素。"," will be returned.":"将退还。","The source sequence with arbitrary order.":"具有任意顺序的源序列。","A sequence that contains elements to be counted.":"一个包含要计算的元素的序列。","A function to create a result element from an element from the first sequence and a collection of matching elements from the second sequence.":"从第一个序列创建元素的结果元素的函数，以及第二个序列的匹配元素集合。","A sequence whose elements that also occur in the first sequence will cause those elements to be removed from the returned sequence.":"在第一个序列中也出现的元素的序列将导致这些元素从返回的序列中删除。","A function to map each source element to an element in an ":"将每个源元素映射到一个元素的功能","The number of elements in the input sequence.":"输入序列中的元素数量。","A sequence that has elements of type ":"具有类型元素的序列","A sequence of values that are used to calculate an average.":"一系列用于计算平均值的值。","A function to map each source element to an element in an IGrouping.":"将每个源元素映射到Igrouping中的元素的函数。","A sequence that contains the set difference of the elements of two sequences.":"包含两个序列元素的集合差的序列。"," that are obtained by performing a grouped join on two sequences.":"通过在两个序列上进行分组联接来获得。","The average of the sequence of values.":"值序列的平均值。","The sequence to return the first element of.":"返回第一个元素的序列。","An IComparer{TSource} to compare keys.":"ICOMPARER {TSOURCE}比较键。"," to hash and compare keys.":"进行哈希和比较键。","The source sequence.":"源序列。","A number that represents how many elements in the sequence satisfy the condition in the predicate function.":"表示序列中有多少个元素满足谓词函数中的条件的数字。","The first element in the specified sequence.":"指定序列中的第一个元素。","A sequence whose elements to group.":"一个序列，其元素要小组。","The sequence that contains the elements to be converted.":"包含要转换的元素的序列。","A sequence whose distinct elements that also appear in ":"一个序列，其不同的元素也出现在","The sequence to return a default value for if it is empty.":"返回默认值为空的序列。","The sequence to return an element from.":"从中返回元素的序列。","A function to extract the key for each element.":"提取每个元素的密钥的功能。","A sequence whose distinct elements that also appear in the first sequence will be returned.":"将返回在第一个序列中出现的不同元素的序列。","A sequence that contains each element of the source sequence converted to the specified type.":"一个包含转换为指定类型的源序列的每个元素的序列。","A sequence that contains default(TSource) if ":"一个包含默认值（tsource）的序列","A sequence that contains the elements that form the set intersection of two sequences.":"一个包含形成两个序列的集合相交的元素的序列。","This parameter is not used.":"此参数不使用。","The first element in the sequence that passes the test in the specified predicate function.":"序列中通过指定谓词函数中测试的第一个元素。","A function to create a result value from each group.":"从每个组创建结果值的函数。","The sequence to return the specified value for if it is empty.":"返回指定值为空的序列。","This overload always throws a ":"这个超负荷总是抛出","default(TSource) if ":"默认（tsource）如果","A function to create a result element from two matching elements.":"从两个匹配元素中创建结果元素的函数。","A sequence of elements of type ":"一系列类型元素","The value to return if the sequence is empty.":"如果序列为空，要返回的值。"," is empty; otherwise, the first element in ":"是空的; 否则，第一个元素","The first sequence to concatenate.":"联合酸盐的第一个序列。"," where each element represents a projection over a group and its key.":"每个元素代表对组及其键的投影。","A sequence that contains defaultValue if ":"一个包含defaultValue的序列","The sequence to concatenate to the first sequence.":"连接到第一个序列的序列。"," is empty or if no element passes the test specified by predicate; otherwise, the first element in ":"是空的，或者没有元素通过谓词指定的测试； 否则，第一个元素"," that are obtained by performing an inner join on two sequences.":" 这是通过对两个序列执行内部连接而获得的。","A sequence of groups.":"一组序列。","The sequence to remove duplicate elements from.":"从中删除重复元素的序列。","A sequence that contains the concatenated elements of the two input sequences.":"包含两个输入序列的串联元素的序列。","The sequence to return the last element from.":"从中返回最后一个元素的序列。","A function to map each source element to an element in an IGrouping<TKey, TElement>.":"将每个源元素映射到igrouping <tkey，telement>中的元素的函数。","A sequence that contains distinct elements from the source sequence.":"包含与源序列不同元素的序列。"," that passes the test specified by predicate.":"通过谓词指定的测试。","A sequence in which to locate a value.":"定位值的序列。","A function to map each source element to an element in an IGrouping{Key, TElement}.":"将每个源元素映射到igrouping {key，telement}中的元素的函数。"," to compare values.":"比较值。","The value to locate in the sequence.":"在序列中定位的值。"," whose elements will be processed by ":"其元素将由","The first sequence to join.":"第一个加入的序列。","A sequence to return an element from.":"返回元素的序列。","The maximum value in the sequence.":"序列中的最大值。","The value at the last position in the source sequence.":"源序列中最后一个位置的值。","The sequence to join to the first sequence.":"加入第一个序列的序列。","An Action to invoke on each element.":"对每个元素调用的操作。","A sequence of values to determine the minimum value of.":"一个值序列以确定最小值。","The element at the specified position in the source sequence.":"源序列中指定位置的元素。","An OrderedParallelQuery{TSource}that contains elements to sort.":"一个包含要排序的元素的有序parallelquery {tsource}。","A function to extract the join key from each element of the first sequence.":"从第一个序列的每个元素中提取联接键的函数。","The last element in the sequence that passes the test in the specified predicate function.":"序列中通过指定谓词函数中测试的最后一个元素。","default(TSource) if the index is outside the bounds of the source sequence; otherwise, the element at the specified position in the source sequence.":"默认值（tsource）如果索引在源序列的边界之外； 否则，在源序列中指定位置处的元素。","The minimum value in the sequence.":"序列中的最小值。","The sequence to return the single element of.":"返回单个元素的序列。","A sequence whose elements correspond to those of the input sequence in reverse order.":"一个序列，其元素以相反顺序对应于输入序列的元素。","The sequence with elements to filter.":"带有元素过滤的序列。","A sequence that contains elements from the input sequence that occur before the element at which the test no longer passes.":"一个序列，其中包含来自测试不再通过的元素之前发生的输入序列的元素。","default() if the source sequence is empty; otherwise, the last element in the sequence.":"默认值（）如果源序列为空； 否则，序列中的最后一个元素。","A sequence of values to invoke a transform function on.":"一个值序列以调用转换函数。","The single element of the input sequence.":"输入序列的单个元素。","A sequence that contains elements from the input sequence filtered by type.":"一个序列，其中包含从类型过滤的输入序列中的元素。","An OrderedParallelQuery{TSource} that contains elements to sort.":"一个包含要排序的元素的有序parallelquery {tsource}。","default() if the sequence is empty or if no elements pass the test in the predicate function; otherwise, the last element that passes the test in the predicate function.":"默认值（）如果序列为空或没有元素通过谓词函数中的测试； 否则，在谓词函数中传递测试的最后一个元素。","A sequence whose elements are the result of invoking the transform function on each element of ":"一个序列，其元素是在每个元素上调用转换函数的结果","A sequence of values to determine the maximum value of.":"一个值序列，以确定最大值。","A sequence whose elements are sorted descending according to a key.":"一个序列，其元素根据键将其分类为下降。","A sequence of values to order.":"要排序的值序列。",", based on the index supplied to ":"，根据提供给的索引","A sequence whose distinct elements form the second set for the union.":"一个序列，其独特的元素构成了联合的第二组。","A sequence to create an array from.":"从中创建数组的序列。","An OrderedParallelQuery{TSource} whose elements are sorted according to a key.":"订购的Parallelquery {tsource}其元素根据键进行排序。","A function to test an element for a condition.":"用于测试条件的元素的函数。","A sequence of values to project.":"一系列值得投射的值。","An IComparer{TKey} to compare keys.":"一个ICOMPARER {TKEY}比较键。","A sequence that contains the elements from both input sequences, excluding duplicates.":"包含两个输入序列元素的序列，不包括重复。","An array that contains the elements from the input sequence.":"包含输入序列元素的数组。","The single element of the input sequence that satisfies a condition.":"满足条件的输入序列的单个元素。","A sequence whose elements are the result of invoking the one-to-many transform function on each element of the input sequence.":"一个序列，其元素是在输入序列的每个元素上调用一到一对的变换函数的结果。","A sequence to filter.":"滤波的序列。","A sequence to create a ":"创建一个序列","An OrderedParallelQuery{TSource} whose elements are sorted descending according to a key.":"订购的parlallelquery {tsource}，其元素根据键将其排序。","The single element of the input sequence, or default() if the sequence contains no elements.":"如果序列不包含元素，则输入序列的单个元素或默认值（）。","A transform function to apply to each source element; the second parameter of the function represents the index of the source element.":"适用于每个源元素的变换函数； 该函数的第二个参数表示源元素的索引。","A sequence that contains elements from the input sequence that satisfy the condition.":"一个包含满足条件的输入序列元素的序列。"," from.":"从。","The value of the first integer in the sequence.":"序列中第一个整数的值。","A ParallelQuery on which to set the option.":"可以在其上设置选项的平行线。","A sequence whose elements are the result of invoking the one-to-many transform function ":"一个元素，其元素是调用一对多变换函数的结果","A function to extract a key from each element.":"从每个元素提取键的功能。","The single element of the input sequence that satisfies the condition, or default() if no such element is found.":"满足条件的输入序列的单个元素，如果没有找到这样的元素，则默认（）。","The number of sequential integers to generate.":"要生成的顺序整数的数量。","A cancellation token.":"取消令牌。","An IEnumerable<Int32> in C# or IEnumerable(Of Int32) in Visual Basic that contains a range of sequential integral numbers.":"在C＃或Inumerable（INT32）中的IEnumerable <int32>中包含一系列顺序积分数字。","The sequence to return elements from.":"从返回元素的序列。"," on each element of ":"在每个元素上"," that contains keys and values.":"其中包含键和值。","ParallelQuery representing the same query as source, but with the registered cancellation token.":"平行标准与源相同的查询，但带有注册的取消令牌。","The number of elements to skip before returning the remaining elements.":"在返回其余元素之前，要跳过的元素数量。","The value to be repeated.":"要重复的值。","A transform function to produce a result element value from each element.":"转换函数从每个元素产生结果元素值。","A ParallelQuery on which to set the limit on the degrees of parallelism.":"一个平行的平行，可以设置并行度的限制。"," based on the index supplied to ":"根据提供给的索引","The degree of parallelism for the query.":"查询的平行性程度。","The number of times to repeat the value in the generated sequence.":"在生成序列中重复该值的次数。","A sequence that contains the elements that occur after the specified index in the input sequence.":"包含输入序列中指定索引后发生的元素的序列。"," that contains values of type ":"包含类型的值","ParallelQuery representing the same query as source, with the limit on the degrees of parallelism set.":"平行标准与源相同的查询，并限制并行度集。","A sequence that contains a repeated value.":"包含重复值的序列。",", and then mapping each of those sequence elements and their corresponding source element to a result element.":"，然后将那些序列元素和它们对应的源元素中的每一个映射到一个结果元素。","A sequence that contains the elements from the input sequence starting at the first element in the linear series that does not pass the test specified by predicate.":"一个序列，该序列包含从线性序列中第一个元素开始的输入序列的元素，该序列不会传递谓词指定的测试。"," selected from the input sequence.":"从输入序列中选择。","A sequence of values to reverse.":"一系列值逆转。","A function to test each source element for a condition; the second parameter of the function represents the index of the source element.":"测试条件的每个源元素的功能； 该函数的第二个参数表示源元素的索引。","A sequence to compare to second.":"比较第二的序列。","The mode in which to execute the query.":"执行查询的模式。"," that contains elements from the input sequence.":"其中包含来自输入序列的元素。"," that are obtained by performing ":"通过执行","A sequence to compare to the first input sequence.":"与第一个输入序列进行比较的序列。","A sequence of values to calculate the sum of.":"一个值序列来计算总和。","ParallelQuery representing the same query as source, but with the registered execution mode.":"平行标准的查询与源相同，但具有注册的执行模式。","The sequence to create a ":"创建一个序列"," pairwise on two sequences. If the sequence lengths are unequal, this truncates to the length of the shorter sequence.":"在两个序列上成对。 如果序列长度不等，则将其截断为较短序列的长度。","The merge options to set for this query.":"为此查询设置的合并选项。"," if the two source sequences are of equal length and their corresponding elements are equal according to the default equality comparer for their type; otherwise, ":"如果两个源序列的长度相等，并且根据其类型的默认平等比较，则它们的相应元素相等； 否则，","A Lookup<(Of <(TKey, TElement>)>) that contains values of type TElement selected from the input sequence.":"查找<（of <（tkey，telement>）>），其中包含从输入序列中选择的类型远程值的值。","The sum of the projected values in the sequence.":"序列中的投影值之和。","An expression tree to associate with the new instance.":"与新实例相关联的表达树。","A sequence to compare to ":"比较的序列","ParallelQuery representing the same query as source, but with the registered merge options.":"平行标准的查询与来源相同，但具有注册的合并选项。","The number of elements to return.":"要返回的元素数量。","A sequence whose distinct elements form the first set for the union.":"一个序列，其独特的元素构成了联合的第一组。"," to use to compare elements.":"用于比较元素。","The first sequence to zip.":"拉链的第一个序列。","A collection to associate with the new instance.":"与新实例相关联的集合。","A sequence that contains the specified number of elements from the start of the input sequence.":"从输入序列开始时包含指定数量元素的序列。","A projection function to apply to each element.":"用于应用于每个元素的投影函数。"," that contains the set difference of the elements of two sequences.":"其中包含两个序列元素的集合差。","The second sequence to zip.":"拉链的第二个序列。","An enumerator that can be used to iterate through the associated data source.":"可以用来通过关联的数据源迭代的枚举器。","A sequence of values to calculate the average of.":"一系列值以计算平均值。","A sequence that contains the elements from the input sequence that occur before the element at which the test no longer passes.":"一个序列，其中包含来自测试不再通过的元素之前发生的输入序列的元素。"," is empty; otherwise, the last element in ":"是空的; 否则，最后一个元素"," to return the first element of.":"返回第一个元素。"," to return a single element from.":"从中返回一个元素。","An expression tree that represents an ":"代表一个表达树"," sequence is empty or contains only ":"序列为空或仅包含"," if the source sequence is empty; otherwise, the last element in the ":"如果源序列为空； 否则，是","The first element in ":"第一个元素"," whose elements to chunk.":"其元素要块。"," collection of data.":"数据收集。","The single element of the input sequence that satisfies the condition in ":"输入序列的单个元素满足条件"," is empty or if no elements pass the test in the predicate function; otherwise, the last element of ":"为空或没有元素通过谓词功能中的测试； 否则，是最后一个元素"," that passes the test in ":"通过测试","The maximum size of each chunk.":"每个块的最大尺寸。","The single element of the input sequence, or ":"输入序列的单个元素，或"," object that is associated with ":"与之关联的对象"," that passes the test in the predicate function.":"这通过谓词函数中的测试。","The default value to return if the sequence is empty.":"如果序列为空，则要返回的默认值。"," that contains the elements the input sequence split into chunks of size ":"包含元素输入序列分为大小的块",") if the sequence contains no elements.":"）如果序列不包含元素。"," if the sequence is empty or if no elements pass the test in the predicate function; otherwise, the last element that passes the test in the predicate function.":"如果序列为空或没有元素通过谓词函数中的测试； 否则，在谓词函数中传递测试的最后一个元素。"," is empty or if no element passes the test specified by ":"是空的，或者没有元素通过指定的测试"," that contains the concatenated elements of the two input sequences.":"其中包含两个输入序列的串联元素。"," if the sequence contains no elements.":"如果序列不包含元素。","The number of elements in ":"元素中的数量","; otherwise, the first element in ":"; 否则，第一个元素","An expression tree to execute.":"个表达式树来执行。"," that passes the test specified by ":"通过指定的测试",") if no such element is found.":"）如果找不到这样的元素。"," that satisfy the condition in the predicate function.":"满足谓词功能中的条件。"," in which to locate ":" 在哪个位置 ","An EnumerableQuery object that is associated with ":"与之关联的枚举对象","A sequence of values to determine the maximum of.":"一个值序列，以确定最大值。","The single element of the input sequence that satisfies the condition, or ":"满足条件的输入序列的单个元素，或"," whose elements to group.":"其元素要小组。","The value that results from executing ":"执行产生的价值","The object to locate in the sequence.":"在序列中定位的对象。","The value with the maximum key in the sequence.":"序列中具有最大键的值。"," in C# or ":"在C＃或"," if the input sequence contains an element that has the specified value; otherwise, ":"如果输入序列包含具有指定值的元素； 否则，"," if no such element is found.":"如果找不到这样的元素。","A textual representation of the enumerable collection or, if it is null, of the expression tree that is associated with this instance.":"枚举集合的文本表示形式，或者（如果为null），则与此实例相关联的表达树。"," in Visual Basic where each ":"在视觉基础中每个"," to return elements from.":"从中返回元素。","The type of the data in the collection that this instance represents.":"此实例代表的集合中数据的类型。"," that contains the elements to be counted.":"其中包含要计算的元素。"," object contains a sequence of objects and a key.":"对象包含一系列对象和一个键。","A sequence of values to determine the minimum of.":"值的序列来确定最小值。","The expression tree that is associated with or that represents this instance.":"与此实例相关联或代表此实例的表达树。"," that contains elements that occur after the specified index in the input sequence.":"其中包含输入序列中指定索引后发生的元素。","The number of elements in the sequence that satisfies the condition in the predicate function.":"序列中满足谓词函数中条件的元素数量。","The value with the minimum key in the sequence.":"序列中具有最小键的值。","The query provider that is associated with this instance.":"与此实例关联的查询提供商。"," to return a default value for if empty.":"要返回一个默认值，如果为空。","The number of elements to omit from the end of the queryable sequence.":"从可查询序列的末尾省略要省略的元素。"," contains a sequence of objects and a key.":" 包含一系列对象和一个键。"," whose elements to filter.":"其元素要过滤。","(":"（（","An accumulator function to apply to each element.":"累加器函数应用于每个元素。","A collection that contains the elements from ":"包含来自"," minus ":"减","An accumulator function to invoke on each element.":"累加器函数以调用每个元素。",") if ":"） 如果"," contains a sequence of objects of type ":"包含一系列类型的对象"," elements from the end of the queryable sequence.":"从查询序列末尾的元素。"," that have type ":"有类型","A sequence whose elements to test for a condition.":"一个序列，其元素要测试条件。"," to return the specified value for if empty.":"返回指定的值，以归功于空。"," and a key.":"和钥匙。"," whose elements are sorted according to a key.":"其元素是根据钥匙进行排序的。"," that has a type argument of ":"有一个类型的参数","A sequence to check for being empty.":"一个检查空的序列。"," that contains elements from ":" 它包含来自 "," to remove duplicates from.":" 删除重复项。"," whose elements are sorted in descending order according to a key.":" 其元素根据键按降序排序。","A queryable sequence.":"可查询序列。"," and where each element represents a projection over a group and its key.":"以及每个元素代表对组及其键的投影。"," that contains distinct elements from ":"其中包含与"," starting at the first element in the linear series that does not pass the test specified by ":"从线性系列中的第一个元素开始，该元素未通过指定的测试"," to prepend to ":"预先准备","An element of type ":"类型元素"," that contains elements of type ":"其中包含类型的元素","A function to test each element for a condition; the second parameter of this function represents the index of the source element.":"测试条件的每个元素的功能； 此函数的第二个参数表示源元素的索引。"," that contains distinct elements from the source sequence.":"其中包含与源序列的不同元素。"," prepended at the beginning.":"在开始时备用。"," to return an element from.":"从中返回元素。"," whose elements correspond to those of the input sequence in reverse order.":"其元素以相反顺序对应于输入序列的元素。"," obtained by performing a grouped join on two sequences.":"通过对两个序列进行分组联接获得。"," values to calculate the sum of.":"计算总和的值。"," to append to ":" 附加到 ","The index of the element to retrieve, which is either from the start or the end.":"要检索的元素的索引，该元素是从开始或结束的。","A comparer to hash and compare keys.":"与哈希和比较键进行比较。"," whose elements are the result of invoking a projection function on each element of ":"其元素是在每个元素上调用投影函数的结果","The sum of the values in the sequence.":"序列中的值之和。","A new queryable sequence that contains the elements from ":"一个新的可查询序列，其中包含来自","The element at the specified position in the ":"在指定位置的元素","A sequence of values of type ":"一系列类型的值"," are returned.":"退回。"," whose elements are the result of invoking a one-to-many projection function on each element of the input sequence.":"其元素是在输入序列的每个元素上调用一对多投影函数的结果。"," plus the specified ":"加上指定的","The element at the specified position in ":"在指定位置的元素","A sequence whose distinct elements that also appear in the first sequence are returned.":"一个序列，其在第一个序列中也出现的不同元素被返回。","The sum of the projected values.":"投影值的总和。","A projection function to apply to each element; the second parameter of this function represents the index of the source element.":"用于应用于每个元素的投影函数； 此函数的第二个参数表示源元素的索引。","A sequence that contains the set intersection of the two sequences.":"包含两个序列的集合相交的序列。"," appended at the end.":"结尾处附加。"," that contains the specified number of elements from the start of ":"从一开始就包含指定数量的元素"," is outside the bounds of the ":"在"," whose distinct elements that also appear in ":"其独特的元素也出现在","A sequence to convert.":"转换的序列。","A projection function to apply to each element of the input sequence.":"投影函数以应用于输入序列的每个元素。"," sequence; otherwise, the element at the specified position in the ":"序列; 否则，在指定位置的元素","The range of elements to return, which has start and end indexes either from the start or the end.":"要返回的元素范围，该元素从开始或结束时具有启动和结束索引。"," whose distinct elements that also appear in the first sequence are returned.":"其在第一个序列中也出现的独特元素将返回。"," that represents the input sequence.":"这代表输入序列。","A projection function to apply to each element of each intermediate sequence.":"用于应用于每个中间序列的每个元素的投影函数。"," that contains the specified ":"包含指定的"," that contains the set intersection of the two sequences.":"其中包含两个序列的集合相交。","A sequence of ":"一个序列"," is outside the bounds of ":" 是在 "," of elements from the ":"来自"," whose elements are the result of invoking the one-to-many projection function ":"其元素是调用一对多投影功能的结果"," whose distinct elements that also appear in the first sequence will be returned.":"其在第一个序列中也出现的独特元素将返回。"," values to calculate the average of.":"计算平均值的值。","A queryable sequence instance.":"可查询的序列实例。","; otherwise, the element at the specified position in ":"; 否则，在指定位置的元素","A sequence of nullable ":"一系列无效的"," and then mapping each of those sequence elements and their corresponding ":"然后映射每个序列元素及其相应的"," that has elements of type ":"有类型的元素","The number of elements to take from the end of the queryable sequence.":"从可查询序列的末尾获取的元素数量。"," element to a result element.":"元素到结果元素。"," obtained by performing an inner join on two sequences.":"通过在两个序列上执行内在连接获得。","The average of the sequence of values, or ":"值序列的平均值，或"," whose elements that are not also in ":" 谁的元素不也在 ","A new queryable sequence that contains the last ":"一个新的可查询序列，其中包含最后一个","A projection function to apply to each element of the input sequence; the second parameter of this function represents the index of the source element.":"用于应用于输入序列的每个元素的投影函数； 此函数的第二个参数表示源元素的索引。"," to return the last element of.":"返回最后一个元素。"," if the source sequence is empty or contains only ":"如果源序列为空或仅包含"," elements from ":"来自"," whose elements that also occur in the first sequence will not appear in the returned sequence.":"在第一个序列中也出现的元素不会出现在返回的序列中。"," whose elements to compare to those of ":"与之相比的元素","The value at the last position in ":"在最后位置的价值","A sequence whose distinct elements form the first set for the union operation.":"一个序列，其独特的元素构成了联合操作的第一组。"," that contains elements from the input sequence occurring before the element at which the test specified by ":"其中包含来自在测试指定的元素之前发生的输入序列的元素"," whose elements to compare to those of the first sequence.":"其元素与第一个序列的元素相比。"," that contains the set difference of the two sequences.":"其中包含两个序列的集合差。","The last element in ":"最后一个元素","A sequence whose distinct elements form the second set for the union operation.":"一个序列，其独特的元素构成了联合操作的第二组。"," no longer passes.":"不再通过。"," object contains a collection of objects and a key.":"对象包含一个对象和键的集合。"," whose keys that are not also in ":"其键也不在"," that contains the elements from both input sequences, excluding duplicates.":"其中包含来自两个输入序列的元素，不包括重复。","A function to test each element for a condition; the second parameter of the function represents the index of the element in the source sequence.":"测试条件的每个元素的功能； 该函数的第二个参数表示源序列中元素的索引。"," if the two source sequences are of equal length and their corresponding elements compare equal; otherwise, ":"如果两个源序列的长度相等，并且它们的相应元素比较相等； 否则，","A function to map each source element to an element in the ":"将每个源元素映射到元素的功能"," to return the single element of.":"返回单个元素。"," whose keys that also occur in the first sequence will cause those elements to be removed from the returned sequence.":"在第一个序列中也出现的键将导致这些元素从返回的序列中删除。","A collection whose elements are sorted in descending order according to a key.":"根据键按降序排序的元素的集合。"," whose distinct elements form the first set for the union.":" 其不同的元素构成联合的第一个集合。","An array containing the data in the current read-only sequence.":"一个包含当前读取序列中数据的数组。","The number of items written.":"写的项目数。"," object contains a collection of objects of type ":"对象包含类型的对象集合","A sequence of values that are used to calculate a sum.":"用于计算总和的值序列。"," whose distinct elements form the second set for the union.":"其独特的要素构成了联盟的第二组。","The buffer writer to which to write ":"写作的缓冲作者","The minimum requested length of the ":"最小要求的长度"," that contains the specified number of elements from the start of the input sequence.":"从输入序列开始，其中包含指定数量的元素。","A collection of elements of type ":"类型元素的集合"," to filter.":"过滤。","The read-only span to be written to ":"只读的跨度","The number of elements to take from the end of the collection.":"从集合的末尾获取的元素数量。"," to compare keys with.":"比较键。"," whose length is at least ":"长度至少是"," that contains elements from the input sequence that satisfy the condition specified by ":"其中包含来自输入序列的元素，这些元素满足了由",".  If ":"。 如果","The number of data items written to the ":"写入的数据项数量","A new enumerable collection that contains the last ":"一个新的可枚举集合，其中包含最后一个 ",") if the source sequence is empty; otherwise, the last element in the ":"）如果源序列为空； 否则，是","The first sequence to merge.":"合并的第一个序列。","The minimum length of the returned ":"返回的最小长度"," is not provided or is equal to 0, some non-empty buffer is returned.":"不提供或等于0，返回一些非空缓冲区。","A sequence to return elements from.":"从返回元素的序列。","The second sequence to merge.":"第二顺序合并。",") if the sequence is empty or if no elements pass the test in the predicate function; otherwise, the last element that passes the test in the predicate function.":"）如果序列为空或没有元素通过谓词函数中的测试； 否则，在谓词函数中传递测试的最后一个元素。","A span of at least ":"至少一个跨度",". If 0, a non-empty buffer is returned.":"。 如果0，则返回非空缓冲区。"," that contains the elements from the input sequence that occur before the element at which the test no longer passes.":"其中包含来自测试不再通过的元素之前发生的输入序列的元素。","A sequence of tuples with elements taken from the first and second sequences, in that order.":"一系列具有从第一和第二个序列取的元素的元素。"," of at least the size ":"至少大小"," in length. If ":"长度。 如果"," that contains elements from the input sequence that occur before the element at which the test no longer passes.":"其中包含来自测试不再通过的元素之前发生的输入序列的元素。","The number of elements in the source sequence.":"源序列中的元素数量。","The third sequence to merge.":"合并的第三个序列。","The total capacity of the underlying buffer.":"基础缓冲区的总容量。"," to create an array from.":"从中创建一个数组。"," is 0, returns a non-empty buffer.":"为0，返回非空缓冲区。","A sequence of tuples with elements taken from the first, second and third sequences, in that order.":"一系列具有从第一，第二和第三个序列取的元素的元素。"," values to determine the maximum value of.":"确定最大值的值。"," to create a ":"创建一个","A function that specifies how to merge the elements from the two sequences.":"指定如何合并两个序列元素的函数。","The minimum number of elements of ":"最小元素数量","The space available for writing without forcing the underlying buffer to grow.":"可用于编写的空间，而无需强迫下面的缓冲区生长。","A value of type ":"类型的值"," that contains keys and values. The values within each group are in the same order as in ":"其中包含键和值。 每个组中的值与中的顺序相同"," that contains merged elements of two input sequences.":"其中包含两个输入序列的合并元素。"," that the memory pool can hold. A value of -1 returns a memory pool set to the default size for the pool.":"内存池可以保持。 -1的值将存储池设置为池的默认大小。"," in Visual Basic that corresponds to the maximum value in the sequence.":"在Visual Basic中，与序列中的最大值相对应。","The amount of data written to the underlying buffer.":"写入基础缓冲区的数据量。","A memory block capable of holding at least ":"至少能够持有的记忆块","When this method returns, contains the count of ":"当此方法返回时，包含","The value of type ":"类型的价值"," to aggregate over.":"汇总。","The data written to the underlying buffer.":"写入基础缓冲区的数据。"," elements of T.":"T的元素。"," if successful, or zero if the method failed to determine the count.":"如果成功，则为零，如果该方法未能确定计数。","The read-only span to read.":"仅阅读的跨度。","The maximum buffer size supported by this pool.":"该池支持的最大缓冲尺寸。"," that contains the elements to apply the predicate to.":" 它包含要应用谓词的元素。"," values to determine the minimum value of.":" 值来确定最小值。","A singleton instance of a memory pool.":"内存池的单例实例。","The big endian value.":"最大的终极价值。"," if the count of ":"如果计数"," to check for emptiness.":"检查空虚。"," in Visual Basic that corresponds to the minimum value in the sequence.":"在Visual Basic中，与序列中的最小值相对应。","The array from which to create a read-only sequence.":"创建仅读取序列的数组。"," whose elements to apply the predicate to.":"其将谓词应用于的元素。"," can be determined without enumeration; otherwise, ":"可以在没有枚举的情况下确定； 否则，","The little endian value.":"小末日的价值。"," that contains elements from the input sequence of type ":"其中包含来自类型输入序列的元素"," if the source sequence is not empty and at least one of its elements passes the test in the specified predicate; otherwise, ":"如果源序列不是空的，并且其至少一个元素将通过指定谓词中的测试。 否则，"," that contains elements from the input sequence that satisfy the condition.":"其中包含来自满足条件的输入序列的元素。","The array from which to create the read-only sequence.":"创建仅读取序列的数组。","The read-only span of bytes to read.":"要读取的字节的只读跨度。","A sequence of values.":"一个值序列。","The zero-based index of the first element in the array to include in the read-only sequence.":"数组中第一个元素的基于零的索引，将包含在仅读取序列中。","The value to prepend to ":"预先提交的价值","A sequence of tuples with elements taken from the first, second, and third sequences, in that order.":"以该顺序从第一，第二和第三序列中取出的一系列元素。","The value to append to ":"附加的价值","The value to reverse.":"逆转的值。","The key of the ":"关键","The number of elements to include in the read-only sequence.":"仅在读取序列中包含的元素数量。","A new sequence that begins with ":"一个新的序列，以","A new sequence that ends with ":"一个新的序列，以","The passed-in value, unmodified.":"传递值未修改。","The initial node of the linked memory list.":"链接内存列表的初始节点。"," in Visual Basic that contains a range of sequential integral numbers.":"在包含一系列顺序积分数字的Visual Basic中。","The key to search for in the ":"在 ","The sequence to type as ":"键入为"," that contains a repeated value.":"其中包含重复值。"," is in the ":"在里面"," if the source sequence is empty or contains only values that are ":"如果源序列为空或仅包含","The position to the start of the sequence inside ":"内部序列开始的位置","The reversed value.":"的反转值。"," whose elements are the result of invoking the one-to-many transform function on each element of the input sequence.":"其元素是在输入序列的每个元素上调用一到一对的变换函数的结果。","The number of key/value collection pairs in the ":"密钥/值收集对的数量","The final node of the linked memory list.":"链接内存列表的最终节点。"," that contains the elements to be cast to type ":"其中包含要键入的元素","When this method returns, contains the value read out of the read-only span of bytes, as big endian.":"当此方法返回时，包含从字节的仅读取跨度读取的值，如大端。","The key of the desired sequence of values.":"所需值序列的关键。"," whose elements are the result of invoking the one-to-many transform function on each element of an input sequence.":"其元素是在输入序列的每个元素上调用一到一对的变换函数的结果。","The position to the end of the sequence inside ":"内部序列末端的位置"," that contains each element of the source sequence cast to the specified type.":"其中包含施放到指定类型的源序列的每个元素。"," if the span is large enough to contain a ":"如果跨度足够大，可以包含一个"," whose elements are the result of invoking the one-to-many transform function ":"其元素是调用一对多变换功能的结果"," sequence of values indexed by the specified key.":"由指定键索引的值序列。","A read-only block of memory of elements of type ":"类型元素的仅阅读记忆块","A sequence that contains elements to be tested and counted.":"一个包含要测试和计数的元素的序列。"," and then mapping each of those sequence elements and their corresponding source element to a result element.":"然后将每个序列元素及其相应的源元素映射到结果元素。","When this method returns, contains the value read out of the read-only span of bytes, as little endian.":"当此方法返回时，包含从单个字节的读取跨度读取的值，如小eNdian。"," used to extract the key for each element.":"用于提取每个元素的密钥。","Returns an enumerator over the ":"返回枚举者","When this method returns, the value read out of the read-only span of bytes, as big endian.":"当此方法返回时，作为大型endian的字节的仅读取跨度读取的值。"," object that contains the default value for the ":"包含默认值的对象"," to compare to ":"比较"," used to compare keys for placement in the returned sequence.":"用于比较在返回序列中放置的键。"," of which to get the offset.":"其中有偏移。","When this method returns, the value read out of the read-only span of bytes, as little endian.":"当此方法返回时，该值从单个字节的仅读取跨度读取为小endian。",") if the index is outside the bounds of the source sequence; otherwise, the element at the specified position in the source sequence.":"）如果索引在源序列的边界之外； 否则，在源序列中指定位置处的元素。"," to sort the elements in descending order; ":"按降序排序元素；"," to compare to the first sequence.":"与第一个序列进行比较。","An empty ":"一个空"," if the span is large enough to contain an ":"如果跨度足够大，可以包含一个","The offset from the start of the sequence.":"从序列开始的偏移。"," to sort the elements in ascending order.":"按升顺序排序元素。"," if the two source sequences are of equal length and their corresponding elements compare equal according to ":"如果两个源序列的长度相等，它们的相应元素将根据","The span of bytes where the value is to be written, as big endian.":"值得写的字节的跨度，如大末日。"," whose type argument is ":"谁的类型参数是","An object representing the sequence position that starts at the specified ":"表示从指定开始的序列位置的对象","A function to project a result value from each key and its associated values.":"从每个密钥及其关联值投射结果值的函数。","The value to write into the span of bytes.":"写入字节跨度的值。"," that contains the elements that occur after the specified index in the input sequence.":"其中包含输入序列中指定索引后发生的元素。"," whose elements that also occur in the first sequence will cause those elements to be removed from the returned sequence.":"在第一个序列中也出现的元素将导致这些元素从返回的序列中删除。"," from the start of the sequence.":"从序列的开始。","A collection that contains one value for each key/value collection pair in the ":"一个包含每个密钥/值收集对的值的集合","An enumerable collection instance.":"一个枚举的集合实例。","The span of bytes where the value is to be written, as little endian.":"值得写的值的字节跨度，如小末日。"," position of the specified ":"指定的位置","The key to find in the ":"在","The offset from the specified ":"指定的偏移","The item to find in the ":"在"," position object.":"位置对象。"," sequence position.":"序列位置。","The number of elements to omit from the end of the collection.":"从集合末尾省略的元素数量。","An object whose ":"一个对象","The key of the desired collection of values.":"所需值集合的关键。","The index at which to begin this slice.":"开始此切片的索引。","A sequence position representing the point from which to initiate the offset.":"一个代表启动偏移点的序列位置。"," method returns the position of the first occurrence of ":"方法返回第一次出现的位置","A new enumerable collection that contains the elements from ":"一个新的枚举集合，其中包含来自","The length of the slice.":"切片的长度。","The collection of values indexed by the specified key.":"由指定密钥索引的值集合。","An object representing the sequence position that starts at the ":"代表序列位置的对象"," elements from the end of the collection.":"收藏结尾的元素。","A slice that consists of ":"一个由",", or an object whose ":"，或一个对象","The minimum capacity with which to initialize the underlying buffer.":"初始化基础缓冲区的最小容量。"," value for the current node.":"当前节点的值。"," that contains the elements from the input sequence starting at the first element in the linear series that does not pass the test specified by ":"其中包含从线性系列中第一个元素开始的输入序列的元素，这些元素不会通过指定的测试","The offset from current position.":"偏离当前位置。"," elements from the current instance starting at index ":"从索引开始的当前实例的元素","The next node.":"下一个节点。"," if the two instances are equal; otherwise, ":"如果两个实例相等； 否则，","The read-only sequence to convert to an array.":"转换为数组的仅读取顺序。","The end (exclusive) ":"结束（独家）","The sum of node lengths before the current node.":"电流节点之前的节点长度的总和。","An object to compare to the current instance.":"与当前实例进行比较的对象。"," if the reader is not at its end and the read operation succeeded; ":"如果读者不在最后，并且读取操作成功；"," of the slice.":"切片。","One of the enumeration values that indicates the status of the decoding operation.":"指示解码操作状态的枚举值之一。","The read-only sequence over which to create the ":"创建的仅读取顺序","When the method returns, contains the data read, if any.":"当方法返回时，包含读取的数据（如果有）。","The hash code for this instance.":"此实例的哈希代码。","A slice that consists of items from the ":"一个由项目组成的切片","The input span that contains the base-64 text data that needs to be decoded.":"包含需要解码的基本-64文本数据的输入跨度。","The delimiter to look for.":"要寻找的定界符。","The number of items to advance.":"要推进的项目数。","The number of bytes written into the buffer.":"写入缓冲区的字节数。","The first format to compare.":"比较的第一种格式。","A value that indicates that an immediately following ":"一个表明立即关注的值","The value past which the reader is to advance.":"读者要推进的价值。"," index to, but not including, the ":"索引到但不包括"," is to be skipped.":"要跳过。","The second format to compare.":"比较的第二种格式。"," sequence position in the current read-only sequence.":"序列位置在当前仅读取序列中。","The number of positions the reader has advanced.":"读者已经提高了职位数量。","The input span that contains binary data that needs to be encoded.":"包含需要编码的二进制数据的输入跨度。","The character to convert to a ":"转换为","The first value to skip.":"跳过的第一个值。","The start index at which to begin this slice.":"开始此切片的开始索引。","A format with a ":"一种格式"," if found; otherwise, ":" 如果找到；否则, ","The output span that contains the result of the operation, that is, the UTF-8 encoded text in base 64.":"包含操作结果的输出跨度，即基本64中的UTF-8编码文本。","A read-only span that contains one or more delimiters.":"仅包含一个或多个定界符的仅阅读跨度。"," and a ":"和"," (the default) if the input span contains the entire data to encode. ":"（默认值）如果输入跨度包含要编码的整个数据。","A slice starting at index ":"从索引开始的切片","The second value to skip.":"跳过的第二个值。"," if the two formats are unequal; otherwise, ":"如果两种格式不平等； 否则，","One of the enumeration values that indicates the status of the encoding operation.":"指示编码操作状态的枚举值之一。","The read data, if any.":"读取数据（如果有）。"," and continuing to the end of the current read-only sequence.":"并继续到当前只读序列的末尾。","The input span that contains binary data that needs to be encoded. Because the method performs an in-place conversion, it needs to be large enough to store the result of the operation.":"包含需要编码的二进制数据的输入跨度。 由于该方法执行现场转换，因此需要足够大才能存储操作的结果。","The third value to skip.":"跳过的第三个值。"," if found.":"如果发现。","The end (exclusive) of the slice.":"切片的末端（独家）。","A read-only span that contains the character to parse.":"仅读取的跨度包含要解析的字符。","The fourth value to skip.":"跳过的第四个值。","The starting (inclusive) ":"起始（包括）","The delimiters to look for.":"特定者要寻找。","A value whose ":"一个值","The number of bytes of binary data contained within the buffer that needs to be encoded. This value must be smaller than the buffer length.":"缓冲区内包含的需要编码的二进制数据的字节数。 此值必须小于缓冲区长度。","The values to be skipped.":"要跳过的值。"," at which to begin this slice.":"开始这个切片。"," property value is the character in ":"财产价值是字符"," to move past the first found instance of any of the given ":"越过任何给定的第一个找到的实例","A slice starting at sequence position ":"从序列位置开始的切片"," were found; otherwise, ":"被发现; 否则，","The value to compare the next items to.":"要比较下一项的值。","The size of the byte span.":"字节跨度的大小。"," and whose ":"还有谁"," elements from the current instance starting at sequence position ":"当前实例从序列位置启动的元素"," to move past the ":"超越"," property value is ":"属性值是","The maximum length (in bytes) of the result.":"结果的最大长度（以字节）。","The ending (exclusive) ":"结局（独家）","The total number of values processed by the reader.":"读者处理的值总数。"," values if they are found; otherwise, ":"如果发现它们的值； 否则，","The value to format.":"格式的值。"," sequence position to, but not including, the ":"序列位置，但不包括","A span that contains the current segment in the sequence.":"序列中包含当前段的跨度。","A classic .NET standard format string.":"经典.NET标准格式字符串。"," if the values are next in sequence; otherwise, ":"如果值是序列的下一个； 否则，","The buffer to write the UTF8-formatted value to.":"将UTF8格式值写入的缓冲区。","A string that represents the current sequence.":"表示当前序列的字符串。","A format.":"格式。","The span to compare the next items to.":"比较下一个项目的跨度。","The index in the ":"索引","When the method returns, contains the length of the formatted text in bytes.":"当方法返回时，包含字节中格式的文本的长度。","The current sequence position.":"当前序列位置。","The number of items.":"项目数。","The string representation of this format.":"此格式的字符串表示。"," when there is no more data in the ":"当没有更多数据时","The standard format to use.":"使用的标准格式。","The delimiter to search for.":"要搜索的定界符。","A read-only memory span that contains the next segment after ":"仅读取的内存跨度包含下一个段之后的下一段","A read-only span that contains the character to convert.":"仅读取的跨度包含要转换的字符。","The count of items in the reader's ":"读者的项目计数"," if it is found; otherwise, ":"如果找到了； 否则，"," if the formatting operation succeeds; ":" 如果格式化操作成功; "," if the given ":"如果给定","When the method returns, contains the parsed ":"当方法返回时，包含解析","The current position in the ":"当前位置"," should to the beginning of next segment; otherwise, ":"应该到下一段的开始； 否则，"," was found; otherwise, ":"被找到; 否则，","The Utf8 string to parse.":"解析的UTF8字符串。","The remaining items in the reader's ":"读者的其余项目"," instance if the operation was successful.":"实例如果操作成功。"," if the method returned the next segment, or ":"如果该方法返回了下一个细分市场，或","The underlying read-only sequence for the reader.":"读者的基本读取顺序。","The delimiters to search for.":"搜索定界符。"," if the parsing operation was successful; otherwise, ":"如果解析行动成功； 否则，"," if the end of the read-only sequence was reached.":"如果达到了仅读取序列的末端。","When the method returns, contains the value parsed from ":"当方法返回时，包含从中解析的值","The unread portion of the ":"未读的部分"," to move past the first instance of any of the given ":"超越任何给定的一个实例"," if the read-only sequence is empty; otherwise, ":"如果仅读取序列为空； 否则，"," if the format has a precision other than ":"如果格式除了精确",", if the parsing operation succeeded.":"，如果解析操作成功。","The byte sequence reader instance from which the value is to be read.":"值得读取值的字节序列读取器实例。","The length of the read-only sequence.":"仅读取序列的长度。"," if the current instance is a default format; otherwise, ":"如果当前实例是默认格式； 否则，","If the parsing operation was successful, contains the length in bytes of the parsed substring when the method returns. If the method fails, ":"如果解析操作成功，则在方法返回时包含解析子字节的长度。 如果方法失败，"," to not move past the delimiter.":" 不要越过分隔符。","When the method returns, the value read out of the byte sequence reader, as big endian.":"当该方法返回时，值读取了字节序列读取器，作为大末日。","The precision component, which can be ":"精确组件，可以是"," to enumerate.":"枚举。"," is set to 0.":"设置为0。"," if any of the given ":"如果有任何一个给定的"," if the read operation is successful; ":"如果读取操作成功；"," if the enumerator successfully advanced to the next item; ":"如果枚举者成功地推进了下一个项目；",", or can range from 0 to 9.":"，或者可以从0到9。"," if there isn't enough data for an ":"如果没有足够的数据来进行"," if the end of the sequence has been reached.":"如果已达到序列的末尾。","Destination span to copy to.":"要复制的目标跨度。","The expected format of the Utf8 string.":"Utf8字符串的预期格式。","The target array.":"目标阵列。","The character component of the format.":"格式的字符成分。","The byte sequence reader from which to read the value.":"从中读取值的字节序列读取器。"," for success; ":"成功；"," if there is enough data to completely fill the ":"如果有足够的数据来完全填充","The index at which to begin the memory.":"开始内存的索引。","The input span that contains UTF-8 encoded text in base 64 that needs to be decoded.":"在基本64中包含UTF-8编码文本的输入跨度，需要解码。","When the method returns, the value read out of the byte sequence reader, as little endian.":"当方法返回时，值读取了字节序列读取器，即小末日。"," if the string was not syntactically valid or an overflow or underflow occurred.":"如果字符串在句法上没有有效，或者发生溢出或下流。","The index at which to begin the memory region.":"开始内存区域的索引。"," span; otherwise, ":"跨度; 否则，","The output span that contains the result of the operation, that is, the decoded binary data.":"包含操作结果的输出跨度，即解码的二进制数据。","A type-specific format specifier, such as 'G', 'D', or 'X'.":"特定于类型的格式指定符，例如'g'，'d'或'x'。","The target string.":"目标字符串。","The number of items in the memory region.":"内存区域中的项目数。","The next value, or the default value if at the end of the reader.":"下一个值，或者在读者末尾的默认值。","The number of input bytes consumed during the operation. This can be used to slice the input for subsequent calls, if necessary.":"操作过程中消耗的输入字节数量。 如果需要，可以用来将输入切片以进行后续呼叫。","The range to convert from the array.":"从数组转换的范围。","An optional precision ranging from 0 to 99, or the special value ":"可选精度从0到99，或特殊值","The read-only character memory representation of the string, or ":"字符串或"," if the reader is not at its end and the peek operation succeeded; ":"如果读者没有结束，并且窥视操作成功了；","The number of bytes written into the output span. This can be used to slice the output for subsequent calls, if necessary.":"输出跨度写入的字节数。 如果需要，可以用来将输出切片以进行后续呼叫。","The segment to convert.":"要转换的段。"," (the default).":"（默认值）。"," if at the end of the reader.":"如果在读者的结尾。","The read-only character memory representation of the string.":"字符串的仅读取字符内存表示。","The memory representation of the segment.":"段的内存表示。"," (default) if the input span contains the entire data to decode. ":"（默认值）如果输入跨度包含要解码的整个数据。","The format to compare to the current instance.":"与当前实例进行比较的格式。","The target array segment.":"目标阵列段。","The desired length for the slice.":"切片的所需长度。"," if the input span contains partial data with more data to follow.":"如果输入跨度包含部分数据，则需要遵循更多数据。","The number of items in the memory.":"内存中的项目数。","The range that indicates the start and length of the sliced string.":"表示切片字符串的开始和长度的范围。","The read-only span representation of the string.":"字符串的仅读取跨度表示。","The array to convert.":"要转换的数组。","The span representation of the array.":"数组的跨度表示。","The memory representation of the whole or part of the array.":"整个或部分数组的内存表示。","The first position of the array.":"数组的第一个位置。","The starting index.":"起始索引。","The initial index from which the array will be converted.":"阵列将转换的初始索引。","The index at which to begin the span.":"开始跨度的索引。","The number of items in the span.":"跨度中的项目数。","The range of the array to convert.":"要转换的数组的范围。","The array segment to convert.":"阵列段要转换。","The span representation of the array segment.":"阵列段的跨度表示。","The index at which to begin the Span.":"开始跨度的索引。","The index at which to begin the san.":"开始SAN的索引。","The range which has start and end indexes to use for slicing the array.":"用于切片数组的启动和端索引的范围。","The sorted ":"排序"," to search.":"寻找。"," to use when comparing.":"比较时使用。","The source span.":"源跨度。","The value to compare with the source span.":"与源跨度相比的值。","An enumeration value that determines how ":"枚举价值决定了如何"," are compared.":"比较。","A signed integer that indicates the relative order of ":"一个签名整数，指示相对顺序",":":"：","   - If less than 0, ":" - 如果少于0，"," precedes than ":"比","   - If 0, ":" - 如果0，"," equals ":"等于","   - If greater than 0, ":" - 如果大于0"," follows ":"跟随","The value to seek within the source span.":"在源跨度内寻求的价值。","An enumeration value that determines how the characters in ":"枚举价值决定了字符中的字符"," occurs within the span, ":"发生在跨越，","The span to search.":"要搜索的跨度。"," if found, ":"如果发现，","The array to copy items from.":"从中复制项目的数组。","The memory to copy items into.":"将项目复制成的内存。","The span to copy items into.":"将项目复制成的跨度。","The sequence to compare to the end of the source span.":"比较源跨度的序列。"," matches the end of ":"匹配结束","A span containing the lines to enumerate.":"包含枚举线的跨度。","An enumeration of lines.":"线条的枚举。","A rune enumerator.":"符文符。"," if equal, ":"如果等于","The index of the occurrence of the value in the span.":"跨度中值发生的索引。","The index of the occurrence of the value in the span. If not found, returns -1.":"跨度中值发生的索引。 如果找不到，返回-1。","The sequence to search for.":"搜索的顺序。","One of the values to search for.":"要搜索的值之一。","The first index of the occurrence of any of the values in the span. If not found, returns -1.":"跨度中任何值的出现的第一个索引。 如果找不到，返回-1。"}