{"The name of the file from which to read the data.":"读取数据的文件的名称。","The stream used to read the schema.":"用于读取模式的流。","The name of the file from which to read the schema information.":"读取架构信息的文件的名称。"," used to read the schema information.":"用于阅读模式信息。","The criteria to use to filter the rows. For examples on how to filter rows, see DataView RowFilter Syntax [C#].":"用于过滤行的标准。 有关如何过滤行的示例，请参见Dataview RowFilter语法[C＃]。","A string consisting of the ":"一个由","A string specifying the column and sort direction.":"指定列和排序方向的字符串。"," objects matching the filter expression.":"对象匹配过滤器表达式。","An XmlWriter.":"XMLWriter。","An XmlReader.":"XMLReader。","The stream to which the data will be written.":"数据将编写的流。"," and the ":"和"," (the default value), write the data for the current table only.":"（默认值），仅编写当前表的数据。",", write the contents of the current table and all its descendants. If ":"，写下当前表及其所有后代的内容。 如果"," with which to write the content.":"用它来编写内容。","The name of the file to which the data will be written.":"将编写数据的文件的名称。"," used to write the document.":"用于编写文档。"," (the default value), write the schema for the current table only.":"（默认值），仅编写当前表的架构。","The stream to which the XML schema will be written.":"XML模式将被编写的流。","The file to which to write the XML data.":"要编写XML数据的文件。",", write the schema of the current table and all its descendants. If ":"，写当前表及其所有后代的模式。 如果","The name of the file to use.":"要使用的文件的名称。"," if the comparison is case-sensitive; otherwise ":" 如果比较区分大小写；否则 "," object's ":"对象的"," was created independently of a ":"是独立于"," that contains the collection of ":"其中包含集合"," property, or ":"属性，或",". The default is set to the parent ":"。 默认设置为父"," objects for the table. An empty collection is returned if no ":"表的对象。 如果没有，则返回空的集合"," that contains the child relations for the table. An empty collection is returned if no ":"其中包含桌子的儿童关系。 如果没有，则返回空的集合"," to which this table belongs.":"该表属于的。"," to indicate the component has completed initialization; otherwise ":"指示该组件已完成初始化； 否则"," that contains custom user information.":"其中包含自定义用户信息。"," with which to write the contents.":" 用它来写内容。"," (returned by the ":"（由","A display string.":"显示字符串。"," that contains data about the user's machine locale. The default is the ":"其中包含有关用户机器网站的数据。 默认值是"," if errors exist; otherwise ":"如果存在错误； 否则"," belongs; if the table doesn't belong to a ":"属于 如果表不属于"," property) to which the ":"属性）"," serialization.":"序列化。","The initial starting size in rows of this table. The default is 50.":"该表行的初始起始大小。 默认值为50。"," object to add.":"要添加的对象。",", the default is the current system ":"，默认值是当前系统","The namespace to give the created ":"给出创建的名称空间"," that contains the parent relations for the table. An empty collection is returned if no ":"其中包含表格的父母关系。 如果没有，则返回空的集合"," whose rows are being cleared.":"其行被清除。","The name to give the created ":"给创建的名称"," namespace to look in.":"命名空间要查看。","The prefix of the ":"前缀"," indicating the table name.":"指示表名。"," in the collection to perform the check against.":"在集合中进行检查。"," to copy the current ":"复制电流"," object's elements into.":"对象的元素进入。"," if the table can be removed; otherwise ":"如果可以删除表格； 否则"," enumeration specifying either ":"指定枚举"," indicating the namespace name.":"指示名称名称。","The destination ":"目的地"," if the specified table exists; otherwise ":"如果存在指定的表； 否则"," object to look for.":"要寻找的对象。","The source LINQ to DataSet query from which the LINQ-enabled ":"源linq到启用LINQ的数据集查询"," index to start copying into.":"索引开始复制。","The source ":"来源"," that contains the input sequence as the type of ":"其中包含输入序列作为"," with the specified name, or -1 if the table does not exist in the collection.":"使用指定的名称，或-1，如果表格中不存在表。"," to make enumerable.":"使枚举。","The zero-based index of the table, or -1 if the table is not found in the collection.":"表的基于零的索引，或-1如果在集合中找不到表。"," from which the LINQ-enabled ":"从中启用LINQ"," with the specified index; otherwise ":"带有指定的索引； 否则"," enumeration that specifies the ":"指定的枚举"," is created.":"被建造。"," object, where the generic parameter ":"对象，那里的通用参数"," with the specified name; otherwise ":"带有指定的名称； 否则"," being added.":"被添加。"," load options.":"加载选项。","A LINQ-enabled ":"启用LINQ的"," that is being added.":"正在添加。"," objects that supplies the results for the new ":"提供新的结果的对象"," sequence.":" 序列。"," delegate that represents the method that will handle an error.":"代表将处理错误的方法的委托。"," from which the new ":"从中新的","A string representing the column's data type.":"表示列的数据类型的字符串。","The index within the buffer at which to start placing the data.":"缓冲区内开始放置数据的索引。"," for null columns.":"对于空列。","The value of the specified column in provider-specific format.":"特定于提供商的指定列的值。","The zero-based ordinal of the column.":"列的零基序。"," obtains its result set.":"获得其结果集。","The maximum length to copy into the buffer.":"最大长度复制到缓冲区中。"," into which to copy the column values from the ":"从中复制列值","An array of objects to be filled in with type information for the columns in the ":"一个要填充的对象数组","The depth of nesting for the current row; always zero.":"当前行的嵌套深度； 总是零。"," object that represents the item collection.":"代表项目集合的对象。","The buffer into which to read the stream of chars.":"读取炭流的缓冲区。"," if there was another result set; otherwise ":"如果还有另一个结果集； 否则","The number of column values copied into the array.":"列值的数量复制到数组中。","The value of the specified column. This method returns ":"指定列的值。 此方法返回","The zero-based number of the column whose value is retrieved.":"检索值的列的零基数。","When not positioned in a valid result set, 0; otherwise the number of columns in the current row.":"当未放置在有效结果集中时，0; 否则，当前行中的列数。"," if there was another row to read; otherwise ":"如果还有另一行要阅读； 否则"," does not support this property and always returns 0.":"不支持此属性，并且始终返回0。"," contains one or more rows; otherwise ":"包含一个或多个行； 否则","The index of the row to delete.":"删除行的索引。"," objects whose columns match the specified sort key value; or, if no rows contain the specified sort key values, an empty ":"列的对象匹配指定的排序键值； 或者，如果没有行包含指定的排序键值，则为空"," to apply to the ":"适用于"," contains the specified columns in the order they appear within this array.":"包含按照此数组中显示的顺序包含指定的列。","The value of the specified column in its native format.":"指定列以其本机格式的值。","An array of column values, typed as ":"列值的数组，键入为","array to copy into.":"数组要复制。","The name of the returned ":"返回的名称","The index of the row in the ":"该行的索引"," that created this view. If this is the default ":"这创建了此视图。 如果这是默认"," for navigating through the list.":"用于浏览列表。","index to start at.":"索引开始。","Reserved for internal use only.":"仅供内部使用。"," that contains the sort key value specified; otherwise -1 if the sort key value does not exist.":"其中包含指定的键值； 否则-1如果键值不存在。","A string that specifies how rows are to be filtered.":"一个指定如何过滤行的字符串。"," value to be inserted.":"值要插入。"," property returns the default ":"属性返回默认值","An array of values, typed as ":"一个值数组，键入为",", if deletes are allowed; otherwise, ":"，如果允许删除；否则, ",". Otherwise, if the ":"。 否则，如果"," instance that contains the requested rows and columns.":"包含请求的行和列的实例。","A string that contains the column name followed by \"ASC\" (ascending) or \"DESC\" (descending). Columns are sorted ascending by default. Multiple columns can be separated by commas.":"一个包含列名的字符串，后跟“ ASC”（升）或“ DESC”（降序）。 默认情况下对列进行排序。 多列可以通过逗号分隔。","The index of the position of the first row in the ":"第一行位置的索引",", if edits are allowed; otherwise, ":"，如果允许编辑； 否则，"," was created without a ":"是创建没有一个",", the returned ":"，返回"," that provides the data for this view.":"这为此视图提供了数据。",", if new rows can be added; otherwise, ":"，如果可以添加新行； 否则，"," that matches the sort key values specified; otherwise -1 if there are no matching sort key values.":"与指定的键值相匹配； 否则-1如果没有匹配的排序键值。"," contains rows that have distinct values for all its columns. The default value is ":"包含其所有列具有不同值的行。 默认值是",", this property is ":"，此属性是","The column value, typed as ":"列值，键入为"," to use in the ":"在",", if the default sort is used; otherwise, ":"，如果使用默认排序； 否则，","A string array that contains a list of the column names to be included in the returned ":"一个字符串数组，其中包含要包含在返回的列名的列表",", if the source is open; otherwise, ":"，如果源开放； 否则，",", to search for.":"，搜索。"," if the default sort is used; otherwise ":"如果使用默认排序； 否则"," to insert into the ":"插入","The number of records in the ":"记录数量","The index of a record in the ":"记录的索引","The exception that is the cause of the current exception, or a null reference (":"例外是当前异常的原因，或null引用（","The data that is required to serialize or deserialize an object.":"序列化或应对对象进行序列化的数据。","A string that contains the filter to apply.":"一个包含要应用的过滤器的字符串。","The value of the property parameter to search for.":"要搜索的属性参数的值。"," of the row that you want.":"您想要的行。"," that can be used to traverse the collection of ":"可以用来遍历","A value that is used for code persistence.":"用于代码持久性的值。","A value that indicates which rows to display.":"一个表示要显示哪个行的值。"," in Visual Basic) if no inner exception is specified.":" 在Visual Basic中）如果没有指定内部异常。"," for each ":"每个","A strongly-typed ":"强烈的"," whose elements are sorted by the specified key.":"其元素由指定键排序。","An array containing the ":"一个包含的阵列","The source and destination of a particular serialized stream.":"特定序列化流的来源和目的地。"," that contains the elements to be converted.":"其中包含要转换的元素。","The sort to apply in the ":"在"," to compare keys.":"比较键。"," objects whose update failure generated this exception.":"其更新故障生成此异常的对象。"," that contains each element of the source sequence converted to the specified type.":"其中包含转换为指定类型的源序列的每个元素。"," to indicate the collection is read-only.":"指示该集合是只读的。"," objects to copy the ":"对象复制"," being updated.":" 正在更新。",", unless overridden by a derived class.":"，除非被派生的班级覆盖。"," whose elements are sorted by the specified key and comparer.":"其元素由指定的密钥和比较对其进行排序。"," containing the ":"包含"," objects into.":"对象进入。","The values for the row being updated.":"该行更新的值。"," elements to invoke a transform function upon.":"调用转换函数的元素。"," elements to be ordered.":"要订购的元素。","The text string describing the details of the exception.":"描述异常细节的文本字符串。"," if the fill operation should continue; otherwise, ":"如果应继续填充操作； 否则，","The destination array index to start copying into.":"目标数组索引开始复制成。"," whose elements are the result of invoking the transform function on each element of ":"其元素是在每个元素上调用转换函数的结果","The error message that explains the reason for this exception.":"错误消息解释了此例外的原因。","The errors being handled.":"处理错误。","A function to extract a key from an element.":"从元素提取键的功能。"," elements to filter.":"要过滤的元素。","The name of the parent ":"父母的名字","An integer containing a count of the number of rows whose update failed.":"一个整数，包含更新失败的行数的计数。"," values to use when a row is updated. The default is ":"更新行时要使用的值。 默认值为","A function to test each element for a condition.":"测试条件的每个元素的功能。"," that is the child table in the constraint.":"那是约束中的子表。"," that contains parent ":"其中包含父"," in the constraint.":" 在约束中。"," that contains rows from the input sequence that satisfy the condition.":"其中包含来自满足条件的输入序列的行。","The object to which this ":"这个对象 "," object with the specified source column name exists, otherwise ":"具有指定源列名称的对象，否则"," objects in the constraint.":"约束中的对象。","The name of the constraint.":"约束的名称。"," column within the collection.":"集合中的列。","An array of the names of parent ":"父母名称的数组"," is compared. Two ":"比较。 二","The level of nesting.":"嵌套的水平。"," or empty string, a default name will be given when added to the constraints collection.":"或空字符串，将默认名称添加到约束集合时。","The ColumnMapping object with the specified ":"带有指定的列图对象"," are equal if they constrain the same columns.":"如果它们约束相同的列，则相等。","An array of the names of child ":"孩子名字的数组","The date and time data value of the specified field.":"指定字段的日期和时间数据值。"," if the data reader is closed; otherwise, ":"如果数据读取器关闭； 否则，","The case-sensitive ":"病例敏感","The fixed-position numeric value of the specified field.":"指定字段的固定位置数值。",", if the objects are identical; otherwise, ":"，如果对象相同； 否则，"," values. Possible values include ":"值。 可能的值包括"," if null values are accepted; otherwise, ":"如果接受零值； 否则，","The 8-bit unsigned integer value of the specified column.":"指定列的8位无符号整数值。"," objects that are the child columns of the constraint.":"是约束的子列的对象。"," values to use when a row is deleted. The default is ":"删除行时要使用的值。 默认值为","The double-precision floating point number of the specified field.":"指定字段的双精度浮点数。","The name of the source column that is mapped to the ":"映射到源列的名称","The character value of the specified column.":"指定列的字符值。"," objects that are the parent columns of the constraint.":"是约束的父列的对象。"," if the collection contains the parameter; otherwise, ":"如果该集合包含参数； 否则，"," information corresponding to the type of ":"与类型相对应的信息",". Possible values include: ":". 可能的值包括: ","The index within the row from which to start the read operation.":"从启动读取操作的行中的索引。","The 64-bit signed integer value of the specified field.":"指定字段的64位签名整数值。"," of this constraint.":"这个约束。"," that would be returned from ":"那将从","A Command object associated with the connection.":"与连接关联的命令对象。","The index of the field to find.":"该领域的索引要找到。","The name of the field or the empty string (\"\"), if there is no value to return.":"如果没有值返回的值，则字段或空字符串的名称（“”）。","A description of the merge conflict.":"合并冲突的描述。","A string containing connection settings.":"包含连接设置的字符串。","The single-precision floating point number of the specified field.":"指定字段的单精度浮点数。","The name of the field to find.":"要查找的字段名称。"," for the specified column ordinal.":" 为指定的列序数。","The data for the event.":"事件的数据。","The 16-bit signed integer value of the specified field.":"指定字段的16位有符号整数值。","The time (in seconds) to wait for a connection to open. The default value is 15 seconds.":"等待连接打开的时间（以秒为单位）。 默认值为15秒。","The index of the named field.":"指定字段的索引。","The data type information for the specified field.":"指定字段的数据类型信息。","A description of the source and destination of the specified serialized stream.":"指定序列化流的源和目的地的描述。","The 32-bit signed integer value of the specified field.":"指定字段的32位签名整数值。","The name of the current database or the name of the database to be used once a connection is open. The default value is an empty string.":"一旦连接打开，当前数据库的名称或要使用的数据库的名称。 默认值是一个空字符串。","The string value of the specified field.":"指定字段的字符串值。","The object to be compared.":"要比较的对象。"," structure to be converted.":"结构要转换。",", a shallow copy of the ":"，浅副本"," which will contain the field value upon return.":"返回时将包含字段值。"," if object is an instance of ":"如果对象是一个实例","The maximum number of digits used to represent the Value property of a data provider Parameter object. The default value is 0, which indicates that a data provider sets the precision for Value.":"用于表示数据提供商参数对象的值属性的最大数字。 默认值为0，表明数据提供商设置了值的精度。","The array of bytes to be converted.":"要转换的字节数组。"," if the value of this object is null. Otherwise, ":"如果此对象的值为null。 否则，"," if the specified field is set to null; otherwise, ":"如果指定字段设置为null； 否则，"," and the two are equal; otherwise ":"两者是相等的； 否则","The Connection object to associate with the transaction.":"连接对象与事务关联。"," structure that represents the converted array of bytes.":"表示字节的转换阵列的结构。"," that indicates the XSD of the specified ":"指示指定的XSD","The byte array to be stored or retrieved.":"要存储或检索的字节阵列。","When not positioned in a valid recordset, 0; otherwise, the number of columns in the current record. The default is -1.":"如果未放置在有效的记录集中时，则为0; 否则，当前记录中的列数。 默认值为-1。","A string that contains the ":"一个包含的字符串"," for this transaction. The default is ":"对于此交易。 默认值为"," that is ":"那是"," that is the concatenated value of x and y.":"那就是x和y的串联值。","The zero-based index of the column to get.":"列的基于零的索引要获得。"," is null the string will contain \"null\".":"null字符串将包含“ null”。"," object to be compared to this ":"对此进行比较的对象"," if the first instance is greater than the second instance. Otherwise ":"如果第一个实例大于第二个实例。 否则"," for the collection.":"用于收藏。","The column located at the specified index as an ":"该列位于指定索引为","A signed number that indicates the relative values of this ":"指示此相对值的签名数字","The position of the byte to be retrieved.":"要检索的字节的位置。","The column with the specified name as an ":"带有指定名称为一个的列","The total number of elements in a collection.":"集合中的元素总数。",". If either instance of ":"。 如果任何一个实例"," if the collection is synchronized; otherwise, ":"如果该集合已同步； 否则，","The first column of the first row in the resultset.":"结果集中的第一行的第一列。","The byte located at the position indicated by the integer parameter.":"位于整数参数指示的位置的字节。"," structure and the object.  \n  \n ":" 结构和对象。  \n  \n "," that contains the collection.":"其中包含集合。"," is null, the ":" 为null，则 ","The length of the binary data in the ":"二进制数据的长度","The object to be compared to this ":"比较的对象"," used to synchronize the collection.":"用于同步集合。","The time (in seconds) to wait for the command to execute. The default value is 30 seconds.":"时间（以秒为单位）等待命令执行。 默认值为30秒。","The value for the new ":"新价值"," will be ":"将会","the ":"这","The concatenated values of the ":"串联值","A collection of data column mappings.":"数据列映射的集合。"," structure; either ":"结构体; 任何一个"," object of a .NET Framework data provider executes. The default value is ":".NET框架数据提供商的对象执行。 默认值是"," parameters.":"参数。","The case-insensitive name of the table within the ":"表中表的情况不敏感的名称"," if the first instance is greater than or equal to the second instance. Otherwise ":" 如果第一实例大于或等于第二实例。 否则的话 ","The integer whose value is to be used for the new ":"整数的价值将用于新的"," if the two values are equal. Otherwise, ":"如果两个值相等。 否则，","The name of the database to use in place of the current database.":"用于代替当前数据库的数据库的名称。"," if a table mapping with the specified source table name exists, otherwise ":"如果存在带有指定源表名称的表映射，则","The result of the logical AND operation.":"逻辑和操作的结果。"," if the first instance is less than the second instance. Otherwise ":"如果第一个实例小于第二个实例。 否则",". If either instance is null, then the ":"。 如果任何一个实例为null，则"," value that indicates the XSD of the specified ":"指示指定的XSD的值"," object to compare, or a null reference (":"比较的对象或null引用（","The case-sensitive name of the ":"案例敏感的名称"," if the first instance is greater than the second instance; otherwise, ":"如果第一个实例大于第二个实例； 否则，"," will be null.":"将是无效的。","A signed number that indicates the relative values of the instance and value.  \n  \n ":"指示实例和值相对值的签名数字。"," with the ":"与"," if the first instance is greater than or equal to the second instance; otherwise, ":"如果第一个实例大于或等于第二个实例； 否则，"," structure's value is 1; otherwise the new ":"结构的值为1； 否则新的","An object to compare, or a null reference (":"比较的对象或null引用（"," if the first instance is less than or equal to the second instance. Otherwise ":" 如果第一实例小于或等于第二实例。 否则的话 "," then ":"然后"," if the first instance is less than the second instance; otherwise, ":"如果第一个实例小于第二个实例； 否则，"," if argument was true, ":"如果论点是真的，"," and the two are equal; otherwise, ":"两者是相等的； 否则，","A string that contains the value of the ":"一个包含值的字符串"," if the two instances are not equal or ":"如果两个实例不等于或"," if the first instance is less than or equal to the second instance; otherwise, ":"如果第一个实例小于或等于第二个实例； 否则，"," if the first instance is greater than or equal to the second instance. Otherwise, ":"如果第一个实例大于或等于第二个实例。 否则，",". If the value is null, the string will contain \"null\".":"。 如果值为null，则字符串将包含“ null”。"," if the first instance is less than the second instance. Otherwise, ":"如果第一个实例小于第二个实例。 否则，"," if the two instances are equal. If either instance of ":"如果两个实例相等。 如果任何一个实例","The one's complement of the supplied ":"一个人的补充"," if argument was null, and ":" 如果参数为null，并且 "," if the first instance is less than or equal to the second instance. Otherwise, ":"如果第一个实例小于或等于第二个实例。 否则，","A byte representing the value of the ":"一个字节，表示 "," if the two instances are equal or ":"如果两个实例相等或"," structure whose Value is the result of the bitwise OR operation.":"其值是位或操作的结果。","The results of the logical OR operation.":"逻辑或操作的结果。"," structure is null; otherwise, ":"结构为无效； 否则，"," if the two instances are not equal. If either instance of ":"如果两个实例不相等。 如果任何一个实例"," contains the remainder.":"包含其余部分。","A byte value to be stored in the ":"一个字节值存储在"," structure that contains the parsed value.":"包含解析值的结构。"," property is equal to the supplied parameter.":"属性等于提供的参数。","The remainder left after division is performed on ":"分区后的其余部分进行"," structure whose value is 1 or 0. If the ":"值为1或0的结构","The result of the logical XOR operation.":"逻辑XOR操作的结果。"," property of the new ":"新的属性","The results of subtracting the second ":"减去第二次的结果"," structure whose ":"结构谁"," structure's value equals ":"结构的价值等于"," property contains the product of the multiplication.":"属性包含乘法的乘积。","A Boolean set to the ":"布尔式布景"," property contains the results of the addition.":"属性包含加法的结果。",", the new ":"， 新的"," property contains the ones complement of the ":"属性包含一个补充"," operand from the first.":"操作数从第一。","The results of the bitwise AND operation.":"位和操作的结果。"," property contains the sum of the two operands.":"属性包含两个操作数的总和。"," to be converted to a ":" 要转换为一个 "," to be parsed.":"解析。"," structure whose value equals the ":"其价值等于","The results of the bitwise OR operation.":"位或操作的结果。","The results of the bitwise XOR operation.":"位XOR操作的结果。"," structure that contains the 8-bit number represented by the ":"包含由8位数字表示的结构"," structure to be tested.":"要测试的结构。"," object to be compared.":"要比较的对象。"," structure's value is 1. Otherwise, the new ":" structure的值为1。 否则，新的 "," parameter to be converted to a ":"要转换为一个的参数"," is non-zero; ":"非零；"," if the supplied parameter is ":"如果提供的参数为","A signed number that indicates the relative values of the instance and the object.  \n  \n ":"指示实例和对象的相对值的签名数字。","A byte value to be converted to ":"要转换为的字节值"," structure's value is 0.":"结构的值为0。"," if zero; otherwise Null.":"如果为零； 否则为空。"," property equals the ":"属性等于"," property contains the results of the division.":"财产包含该部门的结果。"," value that contains 0 or 1.":"包含0或1的值。"," then the new ":"然后是新的"," of the supplied ":"提供的"," if the first instance is greater than the second instance. Otherwise, ":"如果第一个实例大于第二个实例。 否则，"," equals the ":"等于"," on which the NOT operation will be performed.":"将执行未操作。"," value is 1. If the ":"值是1.如果","The results of the XOR operation.":"XOR操作的结果。"," of this ":"这个的"," value representing the length of the value that is contained in the ":"代表所包含的值长度的值"," structure to be converted to a byte.":" 结构要转换为一个字节。"," value is 0. If ":"值为0。如果"," structure with the same value as this ":"与此相同的值的结构"," instance.  \n  \n Returns -1 if no buffer is available to the instance or if the value is null.  \n  \n Returns a ":"实例。 \n  \n  返回-1如果实例没有缓冲区或值为null。 \n  \n  返回a","A byte whose value equals the ":"一个字节，其价值等于"," structure's value is neither 1 nor 0, the new ":"结构的价值既不是1也不是0"," structure who ":"结构谁"," property is equal to the ":"财产等于"," for a stream-wrapped instance.":"对于流包裹的实例。"," if null. Otherwise, ":" 如果为null。 否则的话, "," structure whose value is 1 or 0.  \n  \n If the ":"值为1或0的结构。 \n  \n  如果是","The array of unsigned bytes.":"未签名字节的数组。","A long representing the maximum length of the value of the internal buffer. Returns -1 for a stream-wrapped ":"长表示内部缓冲区值的最大长度。 返回-1的流包装"," property is equal to the numeric value represented by the ":"属性等于由"," structure that has the same ":"具有相同的结构"," structure's value equals true, the new ":"结构的价值等于true，新的","An instance whose ":"一个实例"," as this ":"这样"," long value offset into the value that is contained in the ":"长度值偏移到包含的值"," value that indicates the length in characters of the value that is contained in the ":"表示包含在该值中的字符长度的值","The stream that contains the SqlBytes data.":"包含SQLBYTES数据的流。","An integer value representing the day of the new ":"代表新日的整数值"," instance.  \n  \n Returns -1 if no buffer is available to the instance, or if the value is null.  \n  \n Returns a ":"实例。 \n  \n  返回-1如果实例没有缓冲区或值为null。 \n  \n  返回a","The byte array buffer to copy into.":"要复制的字节阵列缓冲区。"," that contains the string representation of the ":"包含字符串表示","The value of this ":"这个价值"," integer offset into the buffer to start copying into.":"整数偏移到缓冲区中以开始复制。","An integer value representing the microsecond (thousandths of a millisecond) of the new ":"代表新的微秒（千分之一）的整数值"," value representing the maximum length in two-byte characters of the value of the internal buffer.  \n  \n Returns -1 for a stream-wrapped ":"值表示内部缓冲区值的两个字节字符的最大长度。 \n  \n  返回-1的流包装"," structure's ":"结构"," structure to be compared.":"要比的结构。"," as an array of bytes.":"作为字节数组。"," will be a null string.":"将是一个空字符串。"," integer representing the number of bytes to copy.":"整数表示要复制的字节数。",". For more information, see Handling Null Values.":"。 有关更多信息，请参见处理空值。"," if the object is an instance of ":"如果对象是一个实例"," as an array of characters.":"作为字符数组。"," structure whose value is a string representing the date and time that is contained in this ":"其价值为字符串的结构，代表其中包含的日期和时间"," long value representing the number of copied bytes.":"长度代表复制字节的数量。",". If either argument is ":"。 如果这两个参数是"," value offset into the value that is contained in the ":" 值偏移到包含在 "," property of this ":"此财产"," object whose ":"对象谁"," long value representing the length.":"长度代表长度。","An integer value that represents the date as ticks.":"将日期表示为分时的整数值。","The character array buffer to copy into.":"字符阵列缓冲区要复制。","The object to be populated with serialization information.":"要填充序列化信息的对象。","An integer value that represents the time as ticks.":"整数值表示时间为tick。"," properties contain the same date and time values as the ":"属性包含与同一日期和时间值与","The number of ticks representing the date that is contained in the ":"代表日期包含日期的壁虱数量","The destination context of the serialization.":"序列化的目标上下文。"," integer value representing the number of characters to copy.":"整数值表示要复制的字符数。"," property of the supplied ":"提供的财产","An integer representing the year of the of the new ":"代表新年份的整数","The number of ticks representing the time of this ":"代表此时间的壁虱数量"," value representing the number of copied bytes.":"代表复制字节数的值。","This member supports the .NET Framework infrastructure and is not intended to be used directly from your code.":"该成员支持.NET框架基础架构，并且不打算直接从您的代码中使用。"," is equal to the date and time represented by the ":"等于由","The maximum number of digits that can be used to represent the ":"可用于表示的数字数量的最大数量","An integer value representing the month of the new ":"代表新月的整数值"," from this instance.":"从这个实例。"," parameter. If the ":"范围。 如果是"," value representing the length.":"代表长度的值。"," of the newly created ":"新创建的","A reference to the internal buffer. For ":"对内部缓冲区的引用。 为了","An integer value representing the day number of the new ":"代表新的日常数的整数值","The number of decimal places to which the ":"小数点的数量"," representation of this type.":"这种类型的表示。"," instances created on top of unmanaged pointers, it returns a managed copy of the internal buffer.":"在非托管指针之上创建的实例，它返回了内部缓冲区的托管副本。","An integer value representing the year of the new ":"代表新年份的整数价值"," integer representing the number of characters to copy.":"整数表示要复制的字符数。"," structure will be null.":" 结构将为null。"," is null, ":"一片空白，","An integer value representing the day of the month of the new ":"代表新月当天的整数值"," is null. Otherwise, ":"一片空白。 否则，"," is equal to the combined ":"等于组合","A double, representing the value for the new ":"双重，代表新的值","An integer value representing the hour of the new ":"代表新小时的整数值"," properties of the supplied ":"提供的属性","A double value that indicates the power to which the number should be raised.":"一个双重值，指示该数字应提高的功率。","The supplied integer value which will the used as the value of the new ":"提供的整数值将用作新的值","An integer value representing the minute of the new ":"代表新分钟的整数值"," property will be resolved for the new ":" 物业将为新物业解决 "," structure representing the results of the subtraction.":"代表减法结果的结构。"," structure that contains the results.":"包含结果的结构。","An integer value representing the second of the new ":"代表新的第二个整数值","The supplied long integer value which will the used as the value of the new ":"提供的长整数值将用作新的值","A Boolean value that indicates whether the new ":"一个布尔值，指示新的"," structure to be rounded.":"结构要舍入。"," structure equal to the date and time represented by the specified ":"结构等于指定的日期和时间"," property contains the unsigned number representing the absolute value of the ":"属性包含代表的无符号数字","An double value representing the millisecond of the new ":"代表新的毫秒的双重值"," structure represents a positive or negative number.":"结构代表正数或负数。","The number of significant fractional digits (precision) in the return value.":"返回值中显着的分数数字（精度）的数量。"," is either 0 or 1, depending on the ":"是0或1，具体取决于"," property contains the results of the bitwise XOR.":"属性包含位XOR的结果。"," property contains the sum.":"属性包含总和。"," structure that contains the results of the rounding operation.":"结构包含圆形操作的结果。","An 32-bit unsigned integer which will be combined with data2, data3, and data4 to make up the 128-bit unsigned integer that represents the new ":"一个32位未签名的整数，将与Data2，data3和data4结合使用，以构成代表新的128位未签名整数"," structure will be ":"结构将是"," property is equal to the integer part of the ":"属性等于整数部分"," structure to be adjusted.":"结构要调整。"," structures value.":"结构价值。"," structure whose sign is to be evaluated.":"将要评估标志的结构。","The number of digits in the adjusted structure.":"调整后的结构中的数字数。","A short integer whose value is the Value of the ":"一个短整数，其价值是","A double equivalent to the specified ":"相当于指定的双重","An 32-bit unsigned integer which will be combined with data1, data3, and data4 to make up the 128-bit unsigned integer that represents the new ":"一个32位未签名的整数，将与Data1，data3和data4结合使用，以构成代表新的128位未签名整数","If this parameter is ":"如果此参数为"," property is equal to the value represented by the ":"属性等于由"," is equal to the value of the number represented by the ":"等于由","An 32-bit unsigned integer which will be combined with data1, data2, and data4 to make up the 128-bit unsigned integer that represents the new ":"一个32位未签名的整数，将与Data1，data2和data4结合使用，以构成代表新的128位未签名整数","A number that indicates the sign of the ":"一个数字，表示 ",", the new Value will be rounded, if ":"，如果","The decimal representation of the ":"小数表示"," object parameter.":"对象参数。","An 32-bit unsigned integer which will be combined with data1, data2, and data3 to make up the 128-bit unsigned integer that represents the new ":"一个32位未签名的整数，将与Data1，data2和data3结合使用，以构成代表新的128位未签名整数","The double value to convert.":"要转换的double值。",", the value will be truncated.":"，该值将被截断。","A short integer value.":"一个简短的整数值。","The 128-bit unsigned integer that provides the value of the new ":"提供新的价值的128位未签名整数"," structure. If the ":" 结构。 如果 "," property contains the adjusted number.":"属性包含调整后的数字。"," with the same value as the specified double parameter.":"具有与指定的双参数相同的值。"," structure with the same value as the specified short integer.":"结构具有与指定的短整数相同的值。"," value to be stored as a ":"值存储为一个","The results of the subtraction operation.":"减法操作的结果。"," structure's Value is ":"结构的价值是"," structure for which the ceiling value is to be calculated.":"要计算天花板值的结构。","A long integer.":"一个长整数。"," property contains the results of the subtraction.":" 属性包含减法的结果。"," structure that contains the negated value.":"包含否定值的结构。"," will be 1. Otherwise, the ":"将是1.否则"," representing the smallest whole number greater than or equal to the specified ":"表示最小的整数大于或等于指定的"," is equal to the sum of the two ":"等于两者的总和"," that contains the value represented by the ":"其中包含由"," will be 0.":"将是0。"," property contains the results of the division operation.":"属性包含分区操作的结果。"," structure whose value is to be adjusted.":"其价值要调整的结构。","A 16-bit signed integer equivalent to the value that is contained in the specified ":"一个16位有符号整数，相当于指定值中包含的值 ","An XML schema consumed by .NET Framework.":".NET框架消耗的XML模式。"," property contains the remainder.":"财产包含其余部分。"," structure with the same value as this instance of ":"结构与此实例相同的值"," structure. If the value of the ":"结构体。 如果价值","The precision for the new ":"新的精度"," is equal to the product of the two ":"等于两者的乘积"," is non-zero, ":"是非零的，"," is less than 0 or greater than 255, an ":"小于0或大于255，一个"," structure whose value is a string representing the value contained in this ":"其值为字符串的结构，代表此中包含的值"," is equal to the ones complement of the ":"等于那些补充","The scale for the new ":"新的规模"," is zero and ":"为零和"," occurs.":"发生。"," object that contains the string representation of the ":"包含字符串表示的对象"," is equal to the integer part of the ":"等于整数部分"," structure whose Value has been adjusted to the precision and scale indicated in the parameters.":"其值已调整为参数中指示的精度和比例的结构。"," structure is ":"结构是"," structure to be truncated.":"结构要截断。"," equals the value of this ":" 等于this的值 "," structure whose converted value equals the rounded value of this ":"转换值的结构等于此的圆形值",". If either instance is null, the value of the ":"。 如果任何一个实例为null，则","A new long value equal to the ":"一个等于"," of this instance of ":"这个实例"," equals the integer part of the ":"等于整数部分","The decimal position to which the number will be truncated.":"数字将被截断的小数位置。"," and the two are equal. Otherwise, ":"两者是相等的。 否则，"," property contains the integer part of the ":"属性包含整数部分"," is equal to the value of this ":"等于这个值"," structure that contains the results of the XOR operation.":"包含XOR操作结果的结构。","Supply a negative value for the ":"为否定值"," structure for which the floor value is to be calculated.":"要计算地板值的结构。"," is equal to the value represented by the ":"等于由"," parameter in order to truncate the value to the corresponding position to the left of the decimal point.":"参数以将值截断到小数点左侧的相应位置。","A string representing the ":"代表","A short integer representing the value of this ":"一个代表此价值的简短整数"," structure that contains the whole number part of this ":"结构包含其中的整个部分","A long integer value.":"长整数值。","An array of bytes that contains the binary representation of the ":"包含包含二进制表示的字节数字","The integer to be converted.":"要转换的整数。","A byte array.":"字节阵列。"," is equal to the ":"等于"," structure's value.":"结构的价值。"," equals the value of the long parameter.":"等于长参数的值。"," property contains the sum of the specified ":"属性包含指定的总和"," object to be converted.":"对象要转换。","An array of integers that contains the binary representation of this ":"包含此的二进制表示的一系列整数","The first four bytes of the ":"前四个字节"," property equals the results of the subtraction operation.":"属性等于减法操作的结果。"," structures.":"结构。"," structure is null. Otherwise, ":"结构为无效。 否则，","The next two bytes of the ":"接下来的两个字节"," equals the value represented by the ":"等于由"," structure that contains the results of the bitwise AND operation.":"结构包含位和操作的结果。"," is equal to the negated ":"等于被否定的","The next byte of the ":"下一个字节"," is assigned to null. Otherwise, ":"被分配给NULL。 否则，","A 64-bit signed integer equivalent to the value that is contained in the specified ":"一个64位签名的整数等效于指定的值"," structure that contains the results of the bitwise OR operation.":"包含位或操作结果的结构。"," structure whose value equals the value of the ":"其值等于其值的结构"," equal to the ":"等于"," property is resolved.":"财产已解决。"," structure that contains the results of the one's complement operation.":"结构包含一个人的补体操作的结果。"," equal to the value of this ":"等于这个值","An array of bytes representing the ":"一系列字节代表"," value to be converted.":"值要转换。","A number in the range -79,228,162,514,264,337,593,543,950,335 through 79,228,162,514,162,514,264,337,593,543,950,335.":"一个范围为-79,228,162,514,264,337,593,543,543,950,335至79,228,162,514,162,514,514,264,264,337,337,593,543,950,3335。"," structure that contains the bytes in the ":"结构包含字节"," structure that contains the results of the bitwise XOR operation.":"包含位XOR操作结果的结构。","A double whose value will be used for the new ":"一个双重价值将用于新的"," property equals the value of the ":"属性等于"," representing the value of this ":"代表这个价值"," structure that contains the string representation of the ":"包含字符串表示的结构"," property equals the integer part of the ":"财产等于整数部分"," structure whose Value property contains the results of the subtraction.":"其价值属性包含减法结果的结构。",". Otherwise, ":"。 否则，","A long integer representing the value of this ":"一个长整数，代表了这个价值","The sum of the two ":"两者的总和","The converted integer value.":"转换的整数值。","A short integer.":"一个简短的整数。"," structure to be negated.":"否定的结构。","The monetary value to initialize.":"初始化的货币价值。"," operands.":"操作数。"," property equals the value represented by the ":"属性等于由"," contains the sum of the two ":"包含两者的总和"," property contains the sum of the two ":"属性包含两者的总和"," structure whose value contains the results of the negation.":"其价值包含否定结果的结构。","An integer value.":"整数值。"," to compare.":"比较。"," property contains the results of the bitwise AND.":"属性包含位和。"," contains the results of the division.":"包含该部门的结果。"," equivalent to the value that is contained in the specified ":"等效于指定的值"," structure whose Value property is equal to the integer parameter.":"其值属性等于整数参数的结构。"," contains the product of the multiplication.":"包含乘法的乘积。"," property contains the results of the bitwise OR.":"属性包含位的结果或。"," structure that contains the results of the division operation.":"包含分区操作结果的结构。"," equals the value of the ":"等于"," structure to be raised to a power.":"结构要提高到力量。","A 32-bit signed integer equivalent to the value that is contained in the specified ":"一个32位签名的整数等效于指定的值"," contains the product of the two parameters.":"包含两个参数的乘积。","The product of the two ":"两者的产物"," property is equal to the value of the ":"属性等于","A string whose value is the string representation of the value of this ":"一个值的字符串是该值的字符串表示形式","An byte array, that contains the contents of the ":"一个字节阵列，其中包含"," structure equal to the value of this ":"结构等于该值"," property contains the complement of the specified ":"属性包含指定的补充","The monetary value of an instance of the ":"实例的货币价值"," structure that contains the results of the subtraction.":"包含减法结果的结构。"," in ANSI format.":"以ANSI格式。","The string representation of the XML content.":"XML内容的字符串表示。","This property is ":"这个属性是"," contains the results of the negation.":"包含否定结果。","The exception that is the cause of the current exception. If the ":"例外是当前异常的原因。 如果是"," in Unicode format.":"以Unicode格式。","Indicates the number of rows affected by the statement that caused the ":"指示受陈述影响的行的数量"," parameter is not ":"参数不是","A double with a value equal to this ":"值等于此的双重","An integer representing the value of this ":"代表此价值的整数"," event to occur.":"发生的事件。","A 32-bit integer whose value equals the integer part of this ":"一个32位整数，其价值等于整数部分"," whose value is the string representation of the specified ":"其价值是指定的字符串表示形式",", the current exception is raised in a ":"，当前的例外是在","The attribute ID to match.":"匹配的属性ID。","The source and destination of a specific serialized stream.":"特定序列化流的源和目的地。","The SqlInt32 structure to be converted.":"SQLINT32结构要转换。","A 64-bit integer whose value equals the integer part of this ":"一个64位整数，其价值等于整数部分"," block that handles the inner exception.":"阻止处理内部异常。"," with the specified ID.":"使用指定的ID。",", whose contents are the same as the ":"，其内容与"," that contains data to construct the object.":"其中包含用于构建对象的数据。","A double value which will be used as the ":"双重值将用作"," structure is zero, the ":"结构为零，"," that contains the value of the specified ":"包含指定的值"," whose associated ":"谁的关联","The streaming context for the object being deserialized.":"对象被估算的流上下文。"," of the new ":"新的"," structure's value will be ":"结构的价值将是"," you want to retrieve.":"你想检索。"," equals the number represented by this ":"等于此代表的数字","An object that implements the ":"实现的对象"," structure whose value is a string representing the value of this ":"其值为字符串的结构表示该值"," containing a representation of the specified ":"包含指定的表示","A floating point number which will be used as the ":"浮点号，将用作"," interface.":"界面。"," structure that contains the date value represented by this ":"包含此表示的日期值的结构"," for any element of type ":"对于任何类型的元素","The qualified name to match. It is matched against the ":"合格的名称要匹配。 它与","An enumerable object to return an element from.":"一个枚举的对象以返回元素。"," in ":"在"," that contains the value of this ":"包含这个价值"," property of the matching node. The special value \"*\" matches all tags.":"匹配节点的属性。 特殊值“*”匹配所有标签。"," structure that contains the sum of the two specified ":"结构包含指定的两个总和","The zero-based index of the element to retrieve.":"基于零的索引要检索。","The function to evaluate for the existence of the integers in the specified range.":"评估整数在指定范围内存在的函数。"," containing a list of all matching nodes.":"包含所有匹配节点的列表。"," that is equal to the numeric value of this ":"等于此的数值"," structure that contains the results of the division.":"结构包含分裂的结果。"," for all integers starting from ":"对于所有从"," containing a representation of the ":"包含代表","The element at a specified row in a sequence.":"序列中指定行的元素。"," structure that contains the product of the multiplication.":"结构包含乘法的乘积。"," is the ":" 是 ","The function to evaluate for the existence of all the elements in ":"评估所有元素中存在的功能","The stream containing the XML document to load.":"包含要加载的XML文档的流。"," elements to invoke a transformation function upon.":"调用转换函数的元素。"," represented by this ":"以此为代表"," parameter to be converted.":"要转换的参数。"," used to feed the XML data into the document.":"用于将XML数据馈送到文档中。"," for all elements of type ":"对于类型的所有元素","A transformation function to apply to each element.":"适用于每个元素的转换函数。"," with the same value as this ":"与此相同的值","The message to display if the condition is ":"如果条件是","The URL of the file containing the XML document to load.":"包含要加载XML文档的文件的URL。"," value to be converted to float.":" 要转换为float的值。"," object that defines string comparison for this ":"定义字符串比较的对象"," whose elements are the result of invoking the transformation function on each element of ":"其元素是在每个元素上调用转换函数的结果","The value to represent (field or parameter).":"代表的值（字段或参数）。"," containing the XML document to load.":"包含要加载的XML文档。"," to constrain.":"约束。","A float that contains the value of the ":"一个包含该值的浮子"," structure that describes information about the culture of this SqlString structure including the names of the culture, the writing system, and the calendar used, and also access to culture-specific objects that provide methods for common operations, such as formatting dates and sorting strings.":"描述有关该SQLSTRING结构文化的信息的结构，包括文化的名称，写作系统和所使用的日历，还可以访问特定于文化的对象，这些对象为通用操作提供方法，例如格式化日期和分类字符串。","The value of the parameter or field at the start of a method or property.":"方法或属性开始时的参数或字段的值。"," that can be used to access the data in the ":"可用于访问数据"," to indicate that the constraint is a primary key; otherwise, ":"表示约束是主要键； 否则，","The float value to be converted to ":"浮子值要转换为","Return value of the enclosing method or property.":"封闭方法或属性的返回值。","The locale id for the string stored in the ":"存储在"," using a relational model.":"使用关系模型。"," structure that contains the value of the specified float.":"包含指定浮点的值的结构。"," objects to constrain.":" 要约束的对象。","The output value of the ":"的输出值","A value specifying how this ":"指定如何的值","The conditional expression to test.":"条件表达进行测试。"," is compared.":"比较。"," object representing the value of this ":"代表该值的对象","The type that contains the code contracts for this type.":"包含此类型的代码合同的类型。"," should be compared to other ":"应该比较其他",", if the constraints are equal; otherwise, ":"，如果约束相等； 否则，","A message to display if the condition is not met.":"如果未满足条件，则显示一条消息。","A floating point value in the range -3.40E+38 through 3.40E+38.":"范围内的浮点值-3.40E+38至3.40E+38。","The string that is stored.":"存储的字符串。",", if the constraint is on a primary key; otherwise, ":"，如果约束在主键上； 否则，","The conditional expression to assume ":"有条件的表达","The type the current class is a contract for.":"当前类是合同的类型。","A reference to an inner ":"对内心的引用","Specifies the geographical locale and language for the new ":"指定新的地理位置和语言","The message to post if the assumption fails.":"如果假设失败，要发布的消息。"," to load into ":"加载","The type that this contract applies to.":"此合同适用的类型。"," to recursively clone the subtree under the specified node; ":"在指定节点下递归克隆子树；","The object that holds the serialized object data.":"保存序列化对象数据的对象。","The conditional expression to test. The expression may include ":"条件表达进行测试。 表达可能包括","One of the enumeration values that specifies the contract that failed.":"指定失败合同的枚举值之一。","Specifies the compare options for the new ":"指定新的比较选项 ","The message to display if the expression is not ":"如果表达式不是","The message for the event.":"事件的消息。","The message to display if the expression is ":"如果表达式是","-derived instance (such as ":"-派生实例（如 ","The data array to store.":"存储的数据阵列。","The first integer to pass to ":"第一个传递的整数","The condition for the event.":"事件的条件。"," if Unicode encoded. Otherwise, ":"如果编码Unicode。 否则，",") from which to load the ":"）加载","One more than the last integer to pass to ":"一个比最后一个传递的整数还多","The exception that caused the event.":"导致事件的例外。","The starting index within the array.":"数组中的起始索引。","The function to evaluate for any value of the integer in the specified range.":"在指定范围内评估整数的任何值的功能。"," instance's Xml content.":"实例的XML内容。","The number of characters from index to copy.":"从索引到复制的字符数。","The condition for the failure.":"故障的条件。"," to clone only the node itself.":" 仅克隆节点本身。"," returns ":"返回","-derived class instance to be used as the value of the new ":" - 衍生的类实例用作新的值","The string to store.":"存储的字符串。","One of the enumeration values that specifies the type of contract that failed.":"指定失败合同类型的枚举值之一。","-derived instance that contains the XML content. The actual type may vary (for example, the return value might be ":" - 包含XML内容的衍生实例。 实际类型可能会有所不同（例如，返回值可能为","The cloned node.":"克隆的节点。"," that is the concatenated value of ":"那是串联的价值"," if the event has been handled; otherwise, ":"如果已经处理了事件； 否则，"," for any integer starting from ":" 对于从开始的任何整数 ","The prefix of the new element. If String.Empty or ":"新元素的前缀。 如果字符串",") depending on how the information is represented internally, on the server.":"）根据服务器内部表示信息的方式。"," object in which all property values are the same as the original.":" 对象，其中所有属性值都与原始值相同。"," - 1.":"-1。","The message that describes the event.":"描述事件的消息。",", there is no prefix.":"，没有前缀。","A string that indicates the XSD of the specified ":"指示指定的XSD的字符串","The local name of the new element.":"新元素的本地名称。"," value that describes the comparison options for this ":"描述此类比较选项的价值","The collection from which elements of type ":"类型元素的集合"," to apply the escalation policy; otherwise, ":"应用升级政策； 否则，"," value that corresponds to the ":"对应于"," will be drawn to pass to ":"将被吸引到","The namespace Uniform Resource Identifier (URI) of the new element. If String.Empty or ":"新元素的名称空间统一资源标识符（URI）。 如果字符串"," stream to which the object is serialized.":" 对象序列化到的流。"," for this ":"为了这","The category for the option to be set.":"设置选项的类别。","A null instance of the ":"一个无效的实例","The function to evaluate for an element in ":"计算元素的函数 "," that contains the newly concatenated value representing the contents of the two ":"包含代表两者内容的新串联值",", there is no namespaceURI.":"，没有namespaceURI。","The option setting.":"选项设置。"," type.":"类型。"," if and only if ":"当且只有","The name of the entity reference.":"实体参考的名称。","One of the enumeration values that specifies the format of the ":"指定格式的枚举值之一"," to enable the option; ":"启用该选项；","The value for the option.":"选项的值。","The parent activity's TraceId.":"父活动的跟踪。"," if the W3CIdFlags.Recorded flag is set; otherwise, ":" 如果W3CIdFlags。录标志位置位；否则, "," you want the navigator initially positioned on.":"您希望导航器最初放置。"," to disable the option.":"禁用该选项。","The property name to apply to the field.":"适用于该字段的属性名称。","The parent activity's SpanId.":"父活动的时间。"," used to navigate the document.":"用于导航文档。","The root ID, or ":"根ID或","The category of the option to be set.":"要设置的选项类别。","The property name to be applied to the field.":"要应用于字段的属性名称。","One of the enumeration values that specifies flags defined by the W3C standard that are associated with an activity.":"指定与活动相关的W3C标准定义的标志的枚举值之一。"," if the current instance has either a ":"如果当前实例有一个","One of the enumeration values that represent an activity kind.":"代表活动类型的枚举值之一。","The ID of the parent operation.":"父操作的ID。","An enumeration of activity links.":"活动链接的列举。","The value for the setting.":"设置的值。","The ID for the SPAN part of ":"跨度部分的ID"," to require verification; otherwise, ":"需要验证； 否则，","A string representing the activity name.":"代表活动名称的字符串。"," start time in UTC.":"在UTC中开始时间。"," has the W3C format; otherwise, a zero ":"具有W3C格式； 否则为零"," if verification is required; otherwise, ":"如果需要验证； 否则，","The status code":"状态代码","The parent of the activity, represented either as a ":"活动的父母表示为","The UTC time that the operation started.":"操作开始的UTC时间。","One of the enumeration values that specifies the type of failure.":"指定故障类型的枚举值之一。","A key-value pair enumeration of tags and objects.":"标签和对象的键值对枚举。","The category of the option.":"选项的类别。"," or as an ":"或作为一个","The error status description":"错误状态说明","Additional user information.":"其他用户信息。","Information that will be logged along with the ":"将与"," if the option is enabled; otherwise, ":" 如果该选项已启用；否则, ","The Activity tags collection.":"活动标签集合。","the flags associated with the activity.":"与活动相关的标志。"," to the logging system.":"到记录系统。","The setting for the option.":"选项的设置。","An activity source object.":"活动源对象。","Information that's passed to children of this ":"传递给孩子的信息","The optional tags list to initialize the created Activity object with.":"可选标签列表以使用创建的活动对象初始化。","A key-value pair enumeration of tags associated with the activity.":"与活动相关的标签的键值对枚举。","The ID for the TraceId part of the ":"Traceid部分的ID","The description of the condition that caused the failure.":"导致故障的条件的描述。","The optional ":"可选","The context of the activity, if the activity has been started; otherwise, returns the default context.":"活动的背景，如果开始活动； 否则，返回默认上下文。","The trace Id.":"跟踪ID。"," list to initialize the created Activity object with.":"列表以初始化创建的活动对象。","The inner exception that caused the current exception.":"导致当前异常的内部异常。",", if the ID has the W3C format; otherwise, a zero TraceId.":"，如果ID具有W3C格式；否则，为零TraceId。","The event name.":"事件名称。","The current operation for the current thread.":"当前线程的当前操作。","The default Id format to use.":"要使用的默认ID格式。","The W3C ":"W3C"," in Visual Basic) if the event was handled and should not trigger a failure; otherwise, returns the localized failure message.":"在Visual Basic中）如果处理事件并且不应触发故障； 否则，返回局部故障消息。","The event timestamp. Timestamp must only be used for the events that happened in the past, not at the moment of this call.":"活动时间戳。 时间戳必须仅用于过去发生的事件，而不是在此通话中。","A string that represents the activity display name.":"表示活动显示名称的字符串。"," header.":"标题。"," if there is no any listener.":"如果没有听众。","The message to display.":"要显示的消息。","The event tags.":"事件标签。","The delta between ":"之间的三角洲","A trace identifier.":"跟踪标识符。","The name of the operation.":"操作的名称。","A string representing the activity event name.":"代表活动事件名称的字符串。","The parent Id to initialize the created Activity object with.":"使用的父ID可以使用创建的活动对象。"," and the end time if the ":"以及结束时间","The baggage key.":"行李钥匙。","A span identifier.":"跨度标识符。"," if there is a listener registered for this activity source; otherwise, ":"如果有一个侦听器为此活动源注册； 否则，"," has ended (":"结束了 （","A key-value pair enumeration containing the tags associated with the event.":"一个包含与事件关联的标签的键值对枚举。","Contain details about the trace.":"包含有关跟踪的详细信息。","The baggage value.":"行李价值。","A datetime offset representing the activity event timestamp.":"代表活动事件时间戳的DateTime偏移量。","The optional start timestamp to set on the created Activity object.":"可选的启动时间戳将在创建的活动对象上设置。"," was called), or ":"被称为），或","Carries system-specific configuration data.":"运载系统特定的配置数据。"," for convenient chaining.":"为了方便链接。","The trace activity context.":"痕量活动上下文。","Indicates if the context is propagated from a remote parent.":"指示上下文是否是从远程父母传播的。","The activity event to add.":"要添加的活动事件。"," has not ended and ":"尚未结束，","The operation name of the activity.":"活动的操作名称。","The tag key name.":"标签密钥名称。","The key-value pair list of tags associated to the activity context.":"与活动上下文关联的标签的键值对列表。","The object to compare to this instance.":"与此实例进行比较的对象。","The activity link to compare.":"比较的活动链接。"," was not called.":"没有被叫。","The activity kind.":"活动种类。","The tag value mapped to the input key.":"标签值映射到输入密钥。"," if the current object is equal to the ":"如果当前对象等于"," if the current activity link is equal to ":"如果当前的活动链接等于","The created activity object, if it had active listeners, or ":"创建的活动对象，如果有主动的侦听器或","An enumeration of activity events attached to this activity. If the activity has no events, returns an empty enumeration.":"该活动附带的活动事件的列举。 如果活动没有事件，请返回空的枚举。","The tag key.":"标签键。","The first value to compare.":"比较的第一个值。","An enumeration of tags attached to the activity context.":"附加在活动上下文上的标签的枚举。"," if it has no event listeners.":"如果没有事件听众。","The tag value.":"标签值。","The second value to compare.":"比较的第二个值。","An activity callback instance used to listen to the activity start event.":"活动回调实例用于收听活动开始事件。"," to always use the ":"始终使用"," object to initialize the created activity object with.":"对象将创建的活动对象初始化。"," if the method is being called from the finalizer; ":"如果该方法是从最终制度调用的；","The W3C trace parent header.":"W3C跟踪父母标头。","The activity ID.":"活动ID。","An activity callback instance used to listen to the activity stop event.":"活动回调实例用于收听活动停止事件。","The optional tags list to initialize the created activity object with.":"可选标签列表以使用创建的活动对象初始化。"," if calling from user code.":"如果从用户代码调用。","The trace state.":"痕量状态。","The format for the ":"格式","The value of the key-value-pair item if it exists, or ":"如果存在键值对项目的价值，则"," list to initialize the created activity object with.":"列表以初始化创建的活动对象。","A sample activity instance.":"样本活动实例。"," if it does not exist.":"如果不存在。"," if the activity should be populated; ":"如果应该填充活动；"," object created from the parsing operation.":"由解析操作创建的对象。"," to listen events; ":"听事件；","The optional start timestamp to set on the created activity object.":"可选的启动时间戳将在创建的活动对象上设置。","One of the enumeration values that indicate relationship between the activity, its parents, and its children in a trace.":"指示活动，其父母和其子女之间关系的枚举价值之一。","The name associated to the object.":"与对象关联的名称。","The name of the activity source object.":"活动源对象的名称。","The parent Id to initialize the created activity object with.":"使用的父ID可以使用创建的活动对象。","The W3C trace state.":"W3C跟踪状态。","The object mapped to the property name, if one is found; otherwise, ":"如果找到了属性名称，则映射到属性名称； 否则，","An enumeration of activity links attached to this activity. If the activity has no links, returns an empty enumeration.":"该活动附加的活动链接的列举。 如果活动没有链接，请返回空枚举。","A string that represents the activity source name.":"表示活动源名称的字符串。"," if the parsing was successful; ":"如果解析成功；","The version of the component publishing the tracing info.":"组件的版本发布跟踪信息。","The tag key string.":"标签键字符串。","The parent of this ":"父母","The baggage key name":"行李钥匙名称"," if it was propagated from a remote parent; ":"如果它是从远程父母传播的；","A string that represents the activity source version.":"代表活动源版本的字符串。","The activity listener object to use for listening to the activity events.":"活动侦听器对象用于聆听活动事件。","The baggage value mapped to the input key":"映射到输入密钥的行李价值",", if it is from the same process, or ":"，如果是来自同一过程或","The Span Id in the context.":"上下文中的跨度ID。","The span to which the 8 bytes of the SpanID are to be copied.":"要复制Spanid的8个字节的跨度。"," if this instance has no parent (it is a root activity) or if the parent is from outside the process.":"如果此实例没有父（它是根活动），或者父母来自该过程的外部。","The operation name of the Activity":"活动的操作名称","The context tracing flags.":"上下文跟踪标志。","The name to associate the value with.":"将值与值相关联的名称。","A read-only span of eight bytes.":"仅读取八个字节。"," object or ":"对象或","The tracing identifier in the context.":"在上下文中的跟踪标识符。","The parent ID, if one exists, or ":"父id，如果存在或","The object to attach and map to the property name.":"附加并映射到属性名称的对象。","The new span ID.":"新的跨度ID。"," if it does not.":"如果没有。"," if there is no any event listener.":"如果没有任何活动侦听器。","The UTC stop time.":"UTC停止时间。","A string representing the W3C 'tracestate' header.":"代表W3C“ Tracestate”标头的字符串。","The parent's ":"父母","A span that contains 16 hexadecimal characters.":"包含16个十六进制字符的跨度。"," is the same as the SpanId of ":"与","The operation name of the Activity.":"活动的操作名称。"," object to initialize the created Activity object with.":"对象将创建的活动对象初始化。","A read-only span of UTF8-encoded bytes.":"UTF8编码字节的仅读取跨度。"," is different from the SpanId of ":"与","The 16-character hexadecimal string representation of this span ID.":"该跨度ID的16个字符十六进制字符串表示。","The instance to compare.":"比较的实例。","Initial list to store in the collection.":"将存储在集合中的初始列表。"," has the same hex value as the current instance; otherwise, ":"具有与当前实例相同的十六进制值； 否则，","Key and value pair of the tag to add to the collection.":"标签的键和价值对添加到集合中。"," is an instance of ":"是一个实例"," if the collection contains tag with that key. ":"如果该集合包含该键的标签。"," and has the same hex value as the current instance; otherwise, ":"并具有与当前实例相同的十六进制值； 否则，","The array that is the destination of the elements copied from collection.":"是从集合复制的元素的目的地的数组。","The hash code of the SpanId.":"Spanid的哈希代码。","The tag key value pair to remove.":"标签键值对要删除。","The first instance to compare.":"比较的第一个实例。"," if item was successfully removed from the collection; otherwise, ":"如果项目已成功从收藏中删除； 否则，","The second instance to compare.":"要比较的第二个实例。"," if item is not found in the original collection.":"如果在原始集合中找不到项目。"," if the SpanId of ":"如果是"," if the item existed and removed. ":"如果该项目存在并删除。","When this method returns, the value associated with the specified key, if the key is found; otherwise, the default value for the type of the value parameter. This parameter is passed uninitialized.":"当此方法返回时，如果找到键，则与指定键关联的值； 否则，值参数类型的默认值。 该参数通过非初始化。","The object mapped to the key.":"对象映射到钥匙。","The span to which the 16 bytes of the trace ID are to be copied.":"要复制跟踪ID的16个字节的跨度。","A read-only span of 16 bytes.":"仅读取16个字节的跨度。","The new trace ID.":"新的跟踪ID。","A span that contains 32 hexadecimal characters.":"包含32个十六进制字符的跨度。","The hash code of the TraceId.":"跟踪的哈希代码。"," if the TraceId of ":"如果是"," is the same as the TraceId of ":"与Traceid相同"," is different from the TraceId of ":"与Traceid不同","The 32-character hexadecimal string representation of this trace ID.":"该跟踪ID的32个字符十六进制字符串表示。"," if there are any registered subscribers, ":"如果有任何注册订户，","The name of the event to check.":"要检查的事件的名称。"," if notifications are enabled; otherwise, ":"如果启用了通知； 否则，","The object that represents a context.":"代表上下文的对象。"," if it is enabled, ":"如果启用了","The activity affected by an external event.":"受外部事件影响的活动。","An object that represents the outgoing request.":"代表即将发出请求的对象。","An object that represents the incoming request.":"表示传入请求的对象。","A subscriber.":"订户。","A reference to an interface that allows the listener to stop receiving notifications before the ":"对接口的引用，该接口允许听众停止接收通知"," has finished sending them.":"已经完成了它们。","A delegate that filters events based on their name and up to two context objects (which can be ":"一个根据其名称和最多两个上下文对象过滤事件过滤事件的代表（可以是","), or ":"）， 或者"," to if an event filter is not desirable.":"如果事件过滤器是不可取的。"," if an event filter is not desirable.":"如果事件过滤器是不可取的。","An action delegate that receives the activity affected by an external event and an object that represents the incoming request.":"接收受外部事件影响的活动和代表传入请求的对象的活动委托。","An action delegate that receives the activity affected by an external event and an object that represents the outgoing request.":"接收受外部事件影响的活动和代表传出请求的对象的活动委托。","A delegate that filters events based on their name (":"根据其名称过滤事件的代表（","). The delegate should return ":"）。 代表应返回"," if the event is enabled.":"如果启用了事件。","The name of this DiagnosticListener.":"此诊断列表的名称。","The name of the event to log.":"事件的名称登录。","An object that represents the payload for the event.":"代表事件有效载荷的对象。","The name of the event being written.":"事件的名称正在编写。"," if the notification event is enabled, ":"如果启用了通知事件，","An object that represents the additional context for IsEnabled. Consumers should expect to receive ":"代表IneNabled的附加上下文的对象。 消费者应该期望收到"," which may indicate that producer called pure IsEnabled(string) to check if consumer wants to get notifications for such events at all. Based on that, producer may call IsEnabled(string, object, object) again with non-":"这可能表明生产者称为Pure IseNabled（String），以检查消费者是否希望完全收到有关此类事件的通知。 基于此，生产者可以再次调用ISENABLED（字符串，对象，对象），而不是非 - "," context.":"语境。","Optional. An object that represents the additional context for IsEnabled. ":"可选择的。 表示IsEnabled的附加上下文的对象。 "," by default. Consumers should expect to receive ":"默认。 消费者应该期望收到"," which may indicate that producer called pure IsEnabled(string) or producer passed all necessary context in ":"这可能表明生产者称为Pure IseNabled（String）或生产者通过了所有必要的上下文","A payload that represents the incoming request.":"代表传入请求的有效载荷。"," to be started.":"开始。"}