{" if either, the real or imaginary part are ":"如果是，实际或虚构的部分是","The magnitude, which is the distance from the origin (the intersection of the x-axis and the y-axis) to the number.":"大小是从原点（X轴和Y轴的相交）到数字的距离。"," if the specified value is not finite nor infinite; otherwise, ":"如果指定的值不是有限的，也不是无限的； 否则，","The phase, which is the angle from the line to the horizontal axis, measured in radians.":"该相是从弧度测量的从线到水平轴的角度。"," if both, the real and imaginary parts are finite (zero, subnormal or normal); otherwise, ":"如果两者都将真实部分和虚构部分都是有限的（零，下正常或正常）； 否则，","The double-precision real number to multiply.":"双精度实数要乘以。"," in base ":"在基地","The base-10 logarithm of ":"基本10对数的","The logarithm of ":"的对数","The first complex number to multiply.":"第一个要乘以的复数数字。","The complex number to multiply.":"复杂数量乘以。","The second complex number to multiply.":"第二个复数数字要乘。"," components of the ":"组件"," parameter multiplied by -1.":"参数乘以-1。"," as a complex number.":"作为一个复杂的数字。","The second complex value to add.":"第二个要添加的复杂值。","The first complex value to add.":"要添加的第一个复杂值。","The double-precision real value to be divided.":"要分配的双精度真实值。",", as a complex number.":"，作为一个复杂的数字。","The double-precision real value to divide by.":"划分的双精度实际价值。","The second complex number to compare.":"第二个要比较的复合号码。","A complex number that has a real component equal to ":"一个具有实际组件等于的复杂数字","The complex value to divide by.":"要分开的复杂价值。","The first complex number to compare.":"第一个要比较的复杂数字。","The complex value to be divided.":"要分配的复杂值。","The value to convert to a complex number.":"转换为复杂数字的值。"," and an imaginary component equal to zero.":"和一个等于零的假想组件。"," parameter as its real part and zero as its imaginary part.":"参数为实际部分，为零作为虚构部分。","The complex value to multiply.":"复杂的值乘以。","The second complex value to multiply.":"第二个复杂值乘以。","The complex value to subtract (the subtrahend).":"减去的复杂价值（子图形）。","The double-precision real value to subtract (the subtrahend).":"减去的双重精确实际值（子图形）。","The double-precision real value to multiply.":"倍增的双精度真实值。","The first complex value to multiply.":"乘以的第一个复杂值。","The double-precision real value to subtract from (the minuend).":"从（最小值）减去的双精度实际值。","The complex value to subtract from (the minuend).":"从（最小值）减去的复杂值。","A double-precision floating-point number that specifies a power.":"指定电源的双精度浮点数。","A complex number to be raised to a power.":"一个复杂的数字要提高到力量。","The reciprocal of ":"倒数的","The complex number ":"复数数字","The hyperbolic sine of ":"双曲线的正弦","The tangent of ":"切线的","The string representation of the current instance in Cartesian form.":"笛卡尔形式的当前实例的字符串表示。","The sine of ":"正弦","The square root of ":"平方根","The ID assigned to the current object during serialization.":"在序列化过程中分配给当前对象的ID。","The phase of a complex number, in radians.":"复杂数字的阶段，弧度。","The string representation of the current instance in Cartesian form, as specified by ":"当前实例以笛卡尔形式的字符串表示形式，如","The hyperbolic tangent of ":"双曲线切线","The real component of a complex number.":"复杂数字的实际组成部分。","The stream to which the objects are serialized.":"对象序列化的流。","The imaginary component of a complex number.":"复杂数字的虚构组成部分。","The next object to serialize.":"下一个要序列化的对象。","The name of the member to serialize.":"成员序列化的名称。","The object at the root of the graph to serialize.":"图形的对象序列化。","The magnitude of the current instance.":"当前实例的大小。","The stream to deserialize.":"供应的流。","The object to schedule for serialization.":"安排序列化的对象。","The top object of the deserialized graph of objects.":"对象的供应图的顶部对象。","The object to write to the stream attached to the formatter.":"写入格式化器附加的流的对象。","The name of the array.":"数组的名称。","The object representing the value type.":"代表值类型的对象。","The object ID assigned to the object.":"分配给对象的对象ID。","The object reference to write.":"对象引用写。"," into which ":"在其中","The type of elements that the array holds.":"数组所含的元素类型。","The source and destination for the serialized data.":"序列化数据的来源和目的地。"," of the value type.":"值类型。"," is converted.":"被转换。"," values that specifies the deserializer behavior.":"指定求职者行为的值。","The stream from which to deserialize the object graph.":"可以从中挑选对象图的流。","The type of object the reference points to.":"引用指向的对象的类型。"," used with the current formatter.":"与当前格式化器一起使用。","The converted ":"转换","The top (root) of the object graph.":"对象图的顶部（根）。"," to use. Can be ":"使用。 可"," used for the current serialization.":"用于当前序列化。","The serialization binder to use with this formatter.":"与此格式化器一起使用的序列化粘合剂。","The surrogate selector to use with this formatter.":"与此格式化者一起使用的替代选择器。","The stream to which the graph is to be serialized.":"该图要序列化的流。"," that contains data stored in ":"其中包含存储在"," to check for the ability to deserialize.":"检查是否具有应有化的能力。","The streaming context to use with this formatter.":"与此格式化者一起使用的流上下文。"," and associated with ":"并与之相关","The style of type layouts to use.":"要使用的类型布局样式。","The type being serialized.":"该类型被序列化。"," property value.":"适当的价值。","The type of object to create.":"要创建对象的类型。"," that represents the current automatic deserialization level.":"这代表当前的自动挑选水平。"," of the non-transient, non-static members.":"非传输，非静态成员的","The field names of serialized objects.":"序列化对象的字段名称。","The object to write to the formatter.":"写入格式的对象。","The specified surrogate.":"指定的代理。","A zeroed object of the specified type.":"指定类型的零对象。","The field types of the serialized objects.":"序列化对象的字段类型。","The members to extract from the object.":"成员从对象中提取。"," of the named object.":"命名对象。","The type being serialized or cloned.":"该类型被序列化或克隆。","The object, or root of the object graph, to serialize. All child objects of this root object are automatically serialized.":"对象或对象图的根，以序列化。 该根对象的所有子对象都会自动序列化。"," for the specified ":"对于指定的","The information to populate the object.":"填充对象的信息。","The context where the serialization occurs.":"序列化发生的上下文。","The object to populate.":"要填充的对象。"," that performs type lookups during deserialization.":"在避难化过程中执行类型查找。","The assembly where you want to look up the object.":"您要查找对象的装配体。","The source from which the object is deserialized.":"对象应得出的来源。"," that holds a reference to the surrogate selector where the appropriate surrogate was found. This parameter is passed uninitialized.":"该引用对替代选择器进行了参考，其中找到了适当的替代物。 该参数通过非初始化。"," used for serialization and deserialization.":"用于序列化和避难所。"," that describes which fields and properties to populate.":"这描述了要填充的字段和属性。","The name of the object.":"对象的名称。","The surrogate selector where the search for a compatible surrogate begins.":"搜索兼容替代物的替代选择器开始。","The appropriate surrogate for the given type in the given context.":"在给定上下文中给定类型的适当替代物。"," that specifies the values for each field and property to populate.":"这指定了每个字段和属性填充的值。"," used by this formatter.":"该格式使用。"," if previously known to the ":"如果以前知道","The populated deserialized object.":"填充的供应对象。","The object you want an ID for.":"您想要一个ID的对象。",". These objects can take specific actions depending on the source of the information to deserialize.":"。 这些对象可以根据信息的来源采取特定的操作。","The newly populated object.":"新填充的对象。","; otherwise, zero.":"; 否则，零。","The next surrogate selector to examine.":"下一个要检查的代理选择器。"," was not previously known to the ":"以前不知道","The ID of the requested object.":"请求对象的ID。","The stream that contains the data to deserialize.":"包含数据值的流。","The surrogate selector to use. The ":"要使用的替代选择器。 这","The next surrogate selector in the chain or ":"链中的下一个替代选择器或","The object's ID is used for serialization. ":"对象的ID用于序列化。","The object with the specified object ID if it has been previously stored or ":"具有指定对象ID的对象，如果已存储或"," if this is the first time the object has been identified; otherwise, it is set to ":"如果这是第一次确定对象； 否则，将其设置为","The top object of the deserialized graph.":"避免图的顶部对象。"," determines the correct surrogate to use when deserializing objects of a given type. At deserialization time, the surrogate selector creates a new instance of the object from the information transmitted on the stream.":"确定给定类型的避免对象时使用的正确替代物。 在避难时间，替代选择器从流在流中传输的信息创建了对象的新实例。"," of object (class) that needs a surrogate.":"需要替代的对象（类）。"," if no such object has been registered.":"如果没有注册此类对象。","The object you are asking for.":"您要的对象。","The streaming context. The ":"流上下文。 这","The stream where the formatter puts the serialized data. This stream can reference a variety of backing stores (such as files, network, memory, and so on).":"格式化器放置序列化数据的流。 该流可以参考各种备用商店（例如文件，网络，内存等）。","The instance of the type that contains the method to be invoked.":"包含要调用的方法的类型的实例。","The source or destination context for the current serialization.":"当前序列化的源或目标上下文。","The object ID of ":"的对象ID"," is not used by ":"不使用","The ID of the object that the current array element will point to after fixup is completed.":"当前数组元素完成后，当前数组元素将指向的对象的ID完成。","The ID of the object to register.":"要注册的对象的ID。","The ID of the array used to record a fixup.":"数组的ID用于记录修复程序。","The field in the containing object where ":"包含对象中的字段",", but is passed as a parameter to any objects implementing ":"，但作为参数传递给任何实现的对象","The indexes within the multidimensional array that a fixup is requested for.":"需要修复的多维数组中的索引。","The index within ":"内部的索引"," used if ":"使用"," exists. This parameter has meaning only if ":"存在。 此参数仅在"," or having a ":"或有一个"," implements ":"工具"," that a fixup is requested for.":"请求修复。","The ID of the object the array elements will point to after fixup is completed.":"固定元素完成后，数组元素将指向对象的ID。"," and a member of an array, ":"和一个阵列的成员"," or has a ":"或有一个","The next ":"下一个","The ID of the object that needs the reference to ":"需要引用的对象的ID","The type of the object the formatter creates a new instance of.":"格式化器创建一个新实例的对象的类型。"," contains the index within that array where ":"包含该数组中的索引"," will be completed with any required fixup information and then passed to the required object when that object is completed.":"将使用任何必需的修复信息完成，然后在该对象完成后传递给所需的对象。","Specifies the ":"指定"," on the chain of selectors.":"在选择器链上。"," where the fixup will be performed.":"将执行修复程序的位置。"," exists. ":"存在。","The ID of the object that contains ":"包含对象的ID"," for which the surrogate is requested.":"为此请求代理。"," name of the serialized object.":"序列化对象的名称。"," is ignored if ":"如果忽略","The ID of the object required by ":"对象的ID",". This parameter is required only if ":"。 仅当此参数才需要","The surrogate to use.":"使用的代理。","The ID of the object that needs the reference to the ":"需要引用的对象的ID"," is not both a ":"不是两个"," class that contains information about the current serialization operation.":"包含有关当前序列化操作的信息的类。"," is a value type.":"是值类型。","The member of ":"成员"," and a member of an array.":"和一个阵列的成员。","The surrogate for a particular type.":"特定类型的代理。"," for which the surrogate is required.":"为此需要代理。","The format provider.":"格式提供商。"," to check whether the enclosing XML element name and namespace correspond to the expected name and namespace; otherwise, ":"检查封闭XML元素名称和名称空间是否对应于预期名称和名称空间； 否则，","The name of the XML element that encloses the content to serialize or deserialize. The default is \"root\".":"XML元素的名称包含内容以序列化或进行序列化。 默认值是“ root”。"," for which to remove the surrogate.":"为此去除替代物。","The context-specific data.":"特定于上下文的数据。","The formatting options that customize string parsing for some date and time parsing methods.":"为某些日期和时间解析方法自定义字符串解析的格式选项。"," to skip the verification. The default is ":"跳过验证。 默认值为"," for the current surrogate.":"对于当前的代理。"," that contains the root element name of the content.":"其中包含内容的根元素名称。","The surrogate to call for this type.":"呼吁这种类型的代理。","The format sting.":"格式字符串。","The format strings to control the formatting produced when a date or time is represented as a string.":"当日期或时间表示为字符串时，要控制产生的格式的格式字符串。",", which skips the verification. The default is ":"，跳过验证。 默认值为"," used to read the XML stream mapped from JSON.":"用于读取JSON映射的XML流。","The object that contains the data to write.":"包含要编写的数据的对象。","The surrogate selector to add.":"要添加的替代选择器。"," used to write the XML document to map to JSON.":"用于编写XML文档以映射到JSON。","The type of the instances that is serialized or deserialized.":"序列化或应序列化的实例类型。","The object to write.":"要编写的对象。"," if the reader is positioned correctly; otherwise, ":"如果读者的位置正确； 否则，","The maximum number of items to serialize or deserialize.":"序列化或绝对序列化的最大项目数。","The type of the instances that are serialized or deserialized.":"序列化或应序列化的实例类型。"," used to write the XML document mapped to JSON.":"用于编写映射到JSON的XML文档。"," used to write to.":"曾经写成。"," used to read the XML stream.":"用于读取XML流。"," to serialize read only types; otherwise ":"仅序列化读取类型； 否则"," that is written to.":"那是写给的。"," that contains the types that may be present in the object graph.":"其中包含对象图中可能存在的类型。"," used to write the XML start element.":"用于编写XML启动元素。"," to be read.":"要阅读。"," to use a simple dictionary format; otherwise, ":"使用简单的字典格式； 否则，","The serializer settings for the JSON serializer.":"JSON序列化器的序列化设置。","The object that contains the data to write to the stream.":"包含要写入流的数据的对象。","The deserialized object.":"避免的对象。","The DateTimeFormat that defines the culturally appropriate format of displaying dates and times.":"定义显示日期和时间的文化适当格式的DateTimeFormat。","The name of the XML element that encloses the content to serialize or deserialize.":"XML元素的名称包含内容以序列化或进行序列化。","The format of the date and time type items in object graph.":"对象图中的日期和时间类型项目的格式。"," used to write the XML document or stream to map to JSON.":"用于编写XML文档或流以映射到JSON。"," used to read the XML document mapped from JSON.":"用于读取根据JSON映射的XML文档。"," to ignore data supplied by an extension of the class when the class is being serialized or deserialized; otherwise, ":"忽略当课程被序列化或应对序列化时，由类扩展提供的数据； 否则，"," buffer array from which to read.":"缓冲区阵列可读取。","The data contract JSON serializer settings to emit type information.":"数据合同JSON序列化器设置以发出类型信息。","The name to use instead of the default dictionary key name.":"使用的名称代替默认字典键名。"," delegate to call when the reader is closed. The default value is ":"关闭读者时委托致电。 默认值是"," to ignore unknown data and ":"忽略未知数据和","The starting position from which to read in ":"可以阅读的开始位置","A collection of types that may be present in the object graph serialized using this instance the DataContractJsonSerializerSettings.":"使用此实例序列化的对象图中可能存在的类型集合。","The data contract name for the collection type.":"收集类型的数据合同名称。"," that can read JavaScript Object Notation (JSON).":"可以读取JavaScript对象符号（JSON）。"," that contains the expected types passed in as known types to the ":"包含作为已知类型传递给的预期类型","The number of bytes that can be read from ":"可以从中读取的字节数"," that can process JavaScript Object Notation (JSON) data.":"可以处理JavaScript对象表示法（JSON）数据。","The maximum number of items in an object graph to serialize or deserialize.":"对象图中的最大项目数量以序列化或进行序列化。","The namespace of the data contract.":"数据合同的名称空间。","The root name of the selected object.":"所选对象的根名。"," that contains data needed to serialize and deserialize an object.":"其中包含需要序列化和划分对象所需的数据。"," for the JSON writer.":"对于JSON作家。"," used by the reader.":"由读者使用。","The name to use instead of the default dictionary value name.":"使用的名称代替默认字典值名。"," name to map.":"映射的名称。"," to apply.":"申请。"," that specifies user context during serialization and deserialization.":"这在序列化和避免时指定用户上下文。"," that writes data encoded with JSON to the stream based on an XML Infoset.":"那将用JSON编码的数据基于XML Infoset编码为流。"," delegate to call when the reader is closed.":"关闭读者时委托致电。","The namespace of the contract.":"合同的名称空间。"," namespace to map.":"名称空间要映射。","A description of the error.":"错误的描述。"," that specifies the character encoding used by the writer. The default encoding is UTF-8.":"这指定了作者使用的字符编码。 默认编码为UTF-8。","The CLR-legal namespace of a type.":"类型的CLR-LEGAL名称空间。","Delegate to call when the reader is closed.":"关闭读者时委托致电。","The type declared in the data contract.":"数据合同中声明的类型。","The original ":"原本的","The namespace of the data contract members.":"数据合同成员的名称空间。","The output ":"输出",", the output uses multiline format, indenting each level properly; otherwise, ":"，输出使用多行格式，适当地缩进每个级别； 否则，","The deserialized object to be substituted.":"供应对象被替换。","The known type resolver.":"已知类型的解析器。"," to which the writer writes.":"作家写的。"," if the namespace has been explicitly set; otherwise, ":"如果已明确设置了名称空间； 否则，","The string used to indent each level.":"用来缩进每个级别的字符串。"," if the item name has been explicitly set; otherwise, ":"如果项目名称已明确设置； 否则，","The type the ":"类型"," that specifies the character encoding of the output stream.":"这指定了输出流的字符编码。"," if the key name has been explicitly set; otherwise, ":"如果关键名称已明确设置； 否则，"," that the substituted object should be assigned to.":" 被替换的对象应该被分配到。"," name and namespace is mapped to.":"名称和名称空间被映射到。",", the output stream is closed by the writer when done; otherwise ":"，完成后，作者关闭了输出流； 否则","The substituted deserialized object.":"取代的供应对象。"," to keep object reference data using standard XML; otherwise, ":" 使用标准XML保留对象引用数据；否则, "," if the name has been explicitly set; otherwise, ":"如果名称已明确设置； 否则，","Starting position from which to read in ":"从中读取的开始位置","The type to map.":"要映射的类型。","The object to substitute.":"替代的对象。"," if the item namespace has been explicitly set; otherwise, ":"如果项目名称空间已明确设置； 否则，","The xsi:type name.":"XSI：类型名称。","The local name of a data contract. The default is the name of the class that the attribute is applied to.":"数据合同的本地名称。 默认值是应用属性的类的名称。","Number of bytes that can be read from ":"可以从中读取的字节数","The substituted object that will be serialized.":"将序列化的替换对象。"," to keep object reference data; otherwise, ":"保留对象参考数据； 否则，","The xsi:type namespace.":"XSI：键入命名空间。"," if the default value for a member should be generated in the serialization stream; otherwise, ":"如果应在序列化流中生成成员的默认值； 否则，"," if the reference has been explicitly set; otherwise, ":"如果参考已明确设置； 否则，","The type to substitute.":"替代类型。",", if the member is required; otherwise, ":"，如果需要成员； 否则，"," if mapping succeeded; otherwise, ":"如果映射成功； 否则，"," if the value name has been explicitly set; otherwise, ":"如果已明确设置了值名； 否则，"," to substitute for the ":"代替"," that specifies the character encoding used by the reader. If ":" 指定读取器使用的字符编码。 如果 ","The type of the instance to serialize or deserialize.":"实例的类型序列化或进行序列化。","The name of the data member. The default is the name of the target that the attribute is applied to.":"数据成员的名称。 默认值是应用属性的目标名称。","The serializer settings.":"串行器设置。","The name of the method that returns an ":"返回的方法的名称"," is specified as the value, the reader attempts to auto-detect the encoding.":"被指定为值，读者试图自动检测编码。","The numeric order of serialization or deserialization.":"序列化或避免的数字顺序。"," used to prevent Denial of Service attacks when reading untrusted data.":"用于在阅读不信任数据时防止拒绝服务攻击。"," of types used when serializing or deserializing data.":"序列化或应对数据时使用的类型。","The namespace of the XML element that encloses the content to serialize or deserialize.":"包含要序列化或反序列化的内容的XML元素的命名空间。","The name to apply to collection elements.":"要应用于集合元素的名称。"," if the value has been explicitly set; otherwise, ":"如果已明确设置该值； 否则，"," that contains the known types that may be present in the object graph.":"其中包含对象图中可能存在的已知类型。","The maximum number of items to serialize or deserialize. The default is ":"序列化或绝对序列化的最大项目数。 默认值为"," that is included as a known type when serializing or deserializing data.":"在序列化或进行序列化数据时，它作为已知类型包括在内。","The value associated with the enumeration member.":"与枚举成员相关的值。","The root element name of the content.":"内容的根元素名称。"," that contains the name of the method on the type defined by the ":"其中包含该方法的名称，"," if the reader is at the start element of the stream to read; otherwise, ":"如果读者在流的开始元素上，请阅读； 否则，"," if the reader is positioned over the starting element; otherwise, ":"如果读者位于起始元素上； 否则，"," that is used during serialization or deserialization.":"这是在序列化或避难化过程中使用的。"," to keep the references; otherwise, ":" 保留引用；否则, ","The namespace of the root element.":"根元素的名称空间。"," to check whether the name of the object corresponds to the root name value supplied in the constructor; otherwise, ":"检查对象的名称是否对应于构造函数中提供的词根价值； 否则，"," if read-only types are serialized; ":"如果仅阅读类型被序列化；","The top level element in the xpath.":"XPath中的最高元素。"," used to read the XML document.":"用于阅读XML文档。"," that contains the namespace of the root element.":"其中包含根元素的名称空间。","The XML reader used to read the content.":"XML阅读器用于读取内容。"," if all types are serialized.":"如果所有类型都序列化。","The type to return a schema for.":"返回模式的类型。","The XML namespaces and their prefixes found in the data contract.":"XML名称空间及其前缀在数据合同中找到。"," to verify the object name; otherwise, ":"验证对象名称； 否则，"," to check whether the enclosing XML element name and namespace correspond to the root name and root namespace; otherwise, ":"检查封闭XML元素名称和名称空间是否对应于root名称和根名称空间； 否则，","The serializer which is being surrogated.":"正在替代的序列化器。"," to skip the verification.":"跳过验证。"," that contains the XML schema.":"其中包含XML模式。","An implementation of the ":"实施","  \n  \n The XPath generated from the type and member data.":"从类型和成员数据生成的XPath。","The surrogate serializer.":"代理序列化器。"," used to read the XML document or stream.":"用于读取XML文档或流。"," to map ":"映射"," that was exported.":"那是出口。"," to check whether the enclosing XML element name and namespace correspond to the root name and root namespace; ":"检查封闭XML元素名称和名称空间是否对应于root名称和根名称空间；","The surrogate serialization provider.":"替代序列化提供商。"," that contains the schemas to be exported.":" 其中包含要导出的架构。"," that represents the contract name of the type and its namespace.":"这代表类型及其命名空间的合同名称。"," declarations to data contract types.":"数据合同类型的声明。"," used to write the content to the XML document or stream.":"用于将内容写入XML文档或流。","The component used to dynamically map xsi:type declarations to known contract types.":"用于动态映射XSI的组件：将声明键入已知合同类型。"," that contains options used to customize how types are exported to schemas.":"其中包含用于自定义类型如何导出到模式的选项。"," used to write the stream.":"用于写流。","A collection of types that may be present in the object graph serialized using this instance of the DataContractSerializerSettings.":"使用Datacontractserializertings的此实例序列化的对象图中可能存在类型的集合。"," that contains the assemblies with the types to export.":"其中包含带有导出类型的组件。"," used to write the XML document.":"用于编写XML文档。"," that contains the schemas transformed from the set of common language runtime (CLR) types after calling the ":"其中包含调用通用语言运行时（CLR）类型的图案"," to add the generated schema type to.":"将生成的模式类型添加到。"," to use non-standard XML constructs to preserve object reference data; otherwise, ":"使用非标准XML构造来保留对象参考数据； 否则，","The stream to write to.":"流写的流。"," if the types can be exported; otherwise, ":"如果可以导出类型； 否则，","An XmlDictionaryWriter used to write the content to the XML document or stream.":"XmldictionaryWriter用于将内容写入XML文档或流。"," that specifies the type name to assign the schema to.":"这指定了将架构分配给的类型名称。"," that contains the specified types to export.":"其中包含要导出的指定类型。","The root namespace for the specified object.":"指定对象的根名称空间。",", any namespaces declared outside the fragment is declared again if used inside of it; if ":"，如果在其内部使用，则再次声明片段之外声明的任何名称空间； 如果","The object that contains the content to write.":"包含要写内容的对象。"," used for reading.":"用于阅读。"," to serialize read only types; otherwise, ":"仅序列化读取类型； 否则，"," to export.":"出口。"," used for writing.":"用于写作。"," the namespaces are not declared again.":"名称空间不再声明。"," if the type can be exported; otherwise, ":"如果可以导出类型； 否则，"," used to map ":"用于映射"," collection that contains types that may be encountered during serialization or deserialization. XML schema representations are exported for all the types specified in this collection by the ":"收集包含在序列化或避免时可能遇到的类型。 XML模式表示为本集合中指定的所有类型的导出","The type that represents a data contract.":"代表数据合同的类型。"," (of ":"（的","The buffer to write to.":"缓冲区要写入。"," declarations to known data contracts.":"已知数据合同的声明。","The metadata, generated using the ":"元数据，使用"," that contains data that is not recognized as belonging to the data contract.":"其中包含不公认属于数据合同的数据。","The starting position from which to write in ":"从中写入的开始位置",") that contains the types to export.":"）包含导出类型。"," used to write the XML document or stream.":"用于编写XML文档或流。","A  ":"一个"," method of the ":"方法的方法"," used to read the XML stream or document.":"用于读取XML流或文档。","The number of bytes to be written to the ":"要写入的字节数","The object to write to the stream.":"写入流的对象。"," to transform into an XML schema.":"转换为XML模式。"," class, that points to the specific data member used to generate the query.":"类，指出用于生成查询的特定数据成员。"," if the reader can read the data; otherwise, ":"如果读者可以阅读数据； 否则，"," can process XML fragments; otherwise, ":"可以处理XML片段； 否则，"," to omit the extension data; otherwise, ":"省略扩展数据； 否则，"," to query.":"查询。"," to indicate the stream is closed by the writer when done; otherwise, ":"指示该流完成后由作者关闭； 否则，","Offset position within the ":"偏移位置","The stream being released.":"流被释放。"," if the UniqueId represents a ":"如果唯一代表一个","Key to look up.":"钥匙要查找。","Number of array entries to use, starting from ":"从"," that represents the top-level name and namespace for this ":"这代表了最高的名称和名称空间","The buffer from which to read.":"可以阅读的缓冲区。","The length of the string representation of the ":"字符串表示的长度","A string used to generate the ":"用于生成的字符串","The stream from which to read.":"可以读取的流。"," is defined, the ":"定义，",", which is written to the stream when writing this object.":"，在编写此对象时将其写入流。","The key value.":"关键值。","Delegate to be called when the reader is closed.":"关闭读者时要召集委托。","The string array of local names to be searched.":"要搜索的本地名称的字符串数组。","The value.":"价值。","The possible character encoding of the input.":"输入的可能字符编码。"," if the object equals this ":"如果对象等于此"," that is mapped to the key; otherwise ":" 即映射到密钥；否则 ","The namespace of current node.":"当前节点的名称空间。"," that is added to an internal collection.":"这添加到了内部集合中。","The quotas to apply to this reader.":"适用于此读者的配额。"," if key is in the dictionary; otherwise, ":"如果键在字典中； 否则，","An integer hash-code representation of this ":"整数哈希代码表示","The key to search on.":"搜索的关键。","The index of the local name of the current node within an array of names.":"名称数组中当前节点的本地名称的索引。","The possible character encodings of the input.":"输入的可能字符编码。","When this method returns, contains a string if an entry is found; otherwise, ":"当此方法返回时，如果找到条目，则包含一个字符串； 否则，","String value being checked for.":"弦值正在检查。"," array of local names to be searched.":"要搜索的本地名称数组。","The Content-Type MIME type of the message.":"该消息的内容类型的MIME类型。","s are equal, or are both ":"s是平等的，或者都是","The corresponding ":"相应的"," if an entry matching the ":"如果条目与"," if they are not equal, or if only one of them is ":"如果它们不等，或者其中只有一个是","The local name of the current node.":"当前节点的本地名称。"," to apply to the reader.":"适用于读者。"," if value is in the dictionary; otherwise, ":"如果词典中的价值； 否则，"," that was successfully added.":"成功添加了。"," if the string could be added; otherwise, ":"是否可以添加字符串；否则，"," if the overridden equality operator returns ":"如果覆盖平等操作员返回","The maximum allowed size of the buffer.":"缓冲区的最大允许尺寸。"," being checked for.":"被检查。"," matches local name of the current node; otherwise ":"匹配当前节点的本地名称； 否则","The initial size of the dictionary.":"字典的初始大小。","Position in the ":"位置","The matching ":"匹配","The possible character encoding of the stream.":"流的可能字符编码。"," array to start inserting the ":"数组开始插入","String to add to the dictionary.":"字符串添加到字典中。"," that represents the local name of the current node.":"这代表当前节点的本地名称。"," that was added.":"添加了。"," is in the dictionary; otherwise, ":"在词典中； 否则，","The possible character encodings of the stream.":"流的可能字符编码。","Number of entries in the ":"条目数量",", if found; otherwise ":"，如果发现； 否则"," matches namespace of the current node; otherwise ":"匹配当前节点的名称空间； 否则","The character encoding of the stream.":"流的字符编码。"," empty ":"空的","The MIME type of the message.":"消息的MIME类型。"," array filled by the ":"填充的阵列","Namespace of current node.":"当前节点的名称空间。","The delegate to be called when the reader is closed.":"关闭读者时要召集的代表。","The quotas that apply to this operation.":"适用于此操作的配额。"," object that specifies the encoding properties to apply.":"指定要应用的编码属性的对象。","A string representation of the ":"字符串表示","The namespace URI of the element.":"元素的名称空间URI。","Type of the node, if a valid node; otherwise ":"节点的类型，如果有效节点； 否则"," array that will contain the ":"数组将包含"," that fires the ":" 这会激发 ","The quotas applied to the reader.":"配额适用于读者。"," if the reader is positioned at the start of an array node; otherwise ":"如果读者位于阵列节点的开头； 否则","The array into which the nodes are put.":"放入节点的阵列。"," if the value stored in this instance of ":"如果在此实例中存储的值","A byte array that represents a ":"代表一个字节数组"," if the first tag in the array is a start tag or empty element tag and matches ":"如果数组中的第一个标签是开始标签或空元素标签并匹配"," that represents the local name of the attribute.":"这代表属性的本地名称。"," array that represents a ":"代表一个的数组","The starting index in the array.":"数组中的起始索引。"," if successful; otherwise ":"如果成功； 否则","Type of the node being tested.":"测试节点的类型。","The number of nodes to put in the array.":"放入数组中的节点数。","The maximum string length returned by the reader. The default is 8192.":"读者返回的最大字符串长度。 默认值为8192。"," that represents the namespace of the attribute.":"这代表属性的名称空间。","The array of strings to match content against.":"匹配内容的字符串数组。","The number of nodes put in the array.":"放入数组中的节点数量。"," if the node type is ":" 如果节点类型为 ","The modified quotas for the ":"修改的配额","The array into which the integers are put.":"整数放入的阵列。","The local name.":"本地名称。","The index of the entry in ":"条目的索引 "," property of the element.":"元素的属性。","The namespace for the local ":"本地的名称空间"," containing this instance.":"包含此实例。"," that matches the content.":"与内容匹配。","The number of integers to put in the array.":"将整数放入数组中的数量。","The element content.":"元素内容。","The local name of the element.":"元素的本地名称。"," objects to match content against.":"对象要匹配内容。","The number of integers put in the array.":"整数放入数组中。","The string that is the value of the dictionary entry.":"作为字典条目的值的字符串。"," to copy the default attributes from the ":"从","The node's content represented as a unique identifier.":"节点的内容表示为唯一标识符。",", the executing assembly is searched.":"，搜索执行程序集。","The array into which the float numbers are put.":"将浮子编号放入的阵列。","The integer that is the key of the dictionary entry.":"整数是字典条目的关键。","The local name of the qualified name.":"合格名称的本地名称。","The number of float numbers to put in the array.":"浮点数的数量要放入数组中。","The node's content represented as a ":"节点的内容表示为","The fully qualified name of the type to create an instance of.":"创建实例的类型的完全合格名称。","The namespace URI of the qualified name.":"合格名称的名称空间URI。","The umber of float numbers put in the array.":"数组中放置的浮点数数量。","The string value for this instance of the class.":"该类实例的字符串值。","A handle that must be unwrapped to access the newly created instance.":"必须拆开的句柄才能访问新创建的实例。","The text to write.":"要写的文字。","The node's content represented as an array of Base64 bytes.":"节点的内容表示为base64字节的数组。","The number of float numbers put in the array.":"数组中放置的浮点数数量。"," for this dictionary entry.":"对于此词典条目。"," to specify that the search for ":"指定搜索","The node's content represented as an array of ":"节点的内容表示为"," to get the text value from.":"从中获取文本值。"," is not case-sensitive; ":"不是对病例敏感的；"," array of the ":"阵列"," representing the empty string.":"表示空字符串。"," bytes.":"字节。"," to specify that the search is case-sensitive.":"指定搜索对病例敏感。"," to indicate that the reader is positioned on an attribute value or element content; otherwise, ":" 以指示读取器定位在属性值或元素内容上；否则, "," nodes.":"节点。","The node's content represented as a floating point number (":"节点的内容表示为浮点数（","The integer key for this instance of the class.":"该类实例的整数密钥。","A combination of zero or more bit flags that affect the search for the ":"零或更多位标志的组合，影响搜索的搜索"," of the value to be returned.":"要退还的值。"," value to write.":"值得写的价值。","The node's content represented as an integer (":"节点的内容表示为整数（"," constructor. If ":"构造函数。 如果"," to use as the shared dictionary.":"用作共享词典。"," object that is used to resolve any namespace prefixes related to type conversion. For example, this can be used when converting an ":"用于解析与类型转换有关的任何名称空间前缀的对象。 例如，这可以在转换时使用"," to indicate that the stream is closed by the writer when done; otherwise ":"表明该流完成后由作者关闭； 否则","The node's content represented as a long integer (":"节点的内容表示为长整数（","The Unique Id value to write.":"要编写的唯一ID值。"," object to an ":"对象"," is zero, a case-sensitive search for public constructors is conducted.":" 为零，则对公共构造函数进行区分大小写的搜索。","The maximum number of bytes that are buffered in the writer.":"作者中缓冲的最大字节数。","An object that uses ":"一个使用的对象","The qualified name of the element.":"元素的合格名称。","The prefix that is bound to the given namespace.":"绑定到给定名称空间的前缀。",". This value can be a null reference.":"。 此值可以是无效的参考。","The namespace to which the prefix is bound.":"前缀绑定到的名称空间。"," integers (":"整数（","An attribute in the ContentType SOAP header.":"ContentType肥皂标头中的属性。"," to seek and identify the ":" 寻求及识别 ","The concatenated text content or attribute value converted to the requested type.":"转换为请求类型的串联文本内容或属性值。","The content-type of the MIME part that contains the Infoset.":"包含Infoset的MIME部分的内容类型。"," if the handle is asynchronous; ":"如果手柄是异步的；","An array of integers (":"一系列整数（","An array of arguments that match in number, order, and type the parameters of the constructor to invoke. If ":"一系列参数匹配的数字，顺序和键入要调用的构造函数的参数。 如果"," that holds the serialized object data.":"持有序列化对象数据。","A byte array that contains the Base64 decoded binary bytes.":"一个包含基本64解码的二进制字节的字节阵列。"," numbers (":"数字（","The MIME boundary in the message.":"消息中的MIME边界。","The parameter of the method that this delegate encapsulates.":"该委托封装的方法的参数。"," is an empty array or ":"是一个空数组或","A byte array that contains the ":"包含的字节数组","The first parameter of the method that this delegate encapsulates.":"该委托封装的方法的第一个参数。"," decoded binary bytes.":"解码的二进制字节。","The content-id URI of the MIME part that contains the Infoset.":"包含Infoset的MIME部分的内容ID URI。",", the constructor that takes no parameters (the parameterless constructor) is invoked.":"，调用不采用参数（无参数构造函数）的构造函数。","A string that contains the contents of the current node.":"包含当前节点内容的字符串。","The second parameter of the method that this delegate encapsulates.":"该委托封装的方法的第二个参数。"," to write message headers.":"写消息标头。","The maximum array length.":"最大阵列长度。","Culture-specific information that governs the coercion of ":"控制胁迫的特定于文化的信息","Maximum allowed string length.":"最大允许的字符串长度。","The third parameter of the method that this delegate encapsulates.":"该委托封装的方法的第三个参数。","The character encoding of the output.":"输出的字符编码。","The array into which the characters are put.":"将字符放入的阵列。"," to the formal types declared for the ":"宣布的正式类型","The fourth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第四参数。","Not implemented.":"未实现。"," to include comments; otherwise, ":"包括评论； 否则，","The number of characters to put in the array.":"数组中要放置的字符数。","An array of one or more attributes that can participate in activation. This is typically an array that contains a single ":"一个或多个可以参与激活的属性的数组。 这通常是一个包含单个的数组","The fifth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第五个参数。","Number of characters read.":"字符数读数。","The stream to read from.":"从中阅读的流。","The namespace prefix.":"命名空间前缀。","The sixth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第六个参数。"," object that specifies the URL that is required to activate a remote object.  \n  \n This parameter is related to client-activated objects. Client activation is a legacy technology that is retained for backward compatibility but is not recommended for new development. Distributed applications should instead use Windows Communication Foundation.":"指定激活远程对象所需的URL的对象。 \n  \n  此参数与客户激活的对象有关。 客户激活是一种遗留技术，保留了向后兼容性，但不建议用于新开发。 分布式应用程序应该使用Windows Communication Foundation。"," representation of node's content.":"表示节点内容的表示。","Determines whether comments are included.":"确定是否包括评论。","The array that contains the data.":"包含数据的数组。","The seventh parameter of the method that this delegate encapsulates.":"该委托封装的方法的第七参数。","A reference to the newly created object.":"对新创建的对象的引用。","The prefixes to be included.":"包含的前缀。"," part of the qualified name (":"合格名称的一部分（","The number of values to write from the array.":"从数组中写入的值数。","The eighth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第八参数。"," if a public or nonpublic parameterless constructor can match; ":"如果公共或非公共参数构造函数可以匹配；","Returns 0, unless overridden in a derived class.":"返回0，除非在派生类中覆盖。"," parameter).":"范围）。"," if only a public parameterless constructor can match.":"如果只有公共参数构造函数才能匹配。","The array that contains the nodes.":"包含节点的数组。","The ninth parameter of the method that this delegate encapsulates.":"此委托封装的方法的第九个参数。",", unless overridden in a derived class.":"，除非在派生的班级中覆盖。","The name of a file that contains an assembly where the type named ":"文件的名称包含一个命名类型的汇编","The node content in a string representation.":"字符串表示中的节点内容。","The tenth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第十个参数。","The number of nodes to get from the array.":"从数组中获得的节点数。",", unless overridden in a derived class. .":"，除非在派生的班级中覆盖。 。"," is sought.":"被视为。","The maximum string length.":"最大字符串长度。","The prefix of the attribute.":"属性的前缀。","The name of the type to create an instance of.":"创建实例的类型名称。"," that applies to the current instance of this class.":"这适用于此类的当前实例。","The eleventh parameter of the method that this delegate encapsulates.":"该委托封装的方法的第十个参数。","The local name of the attribute.":"属性的本地名称。","Node content in string representation.":"字符串表示中的节点内容。","The twelfth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第十二个参数。","The exceptions that are the cause of the current exception.":"当前例外原因的例外。"," instance to which to copy values.":"实例要复制值。","The name of the data element.":"数据元素的名称。","The namespace URI of the attribute.":"属性的名称空间URI。","A new, flattened ":"一个新的，扁平的","The thirteenth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第十三个参数。"," identifies a named value; otherwise, ":"标识一个命名值； 否则，","The attribute.":"属性。"," with properties set to ":"将属性设置为","The fourteenth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第十四个参数。"," that is the root cause of this exception.":"这是此例外的根本原因。","The value of the switch.":"开关的值。","Byte array to encode.":"字节数组用于编码。","The maximum allowed array length. The default is 16384.":"最大允许阵列长度。 默认值为16384。","When this method returns, contains the value of ":"当此方法返回时，包含","The fifteenth parameter of the method that this delegate encapsulates.":"此委托封装的方法的第十五个参数。","The maximum allowed bytes returned for each read. The default is 4096.":"每个读取返回的最大字节。 默认值为4096。","The position in the buffer indicating the start of the bytes to write.":"缓冲区中的位置表示要编写字节的开始。"," was found, or ":"被发现，或","The predicate to execute for each exception. The predicate accepts as an argument the ":"为每个异常执行的谓词。 谓词接受作为参数 ","The maximum nested node depth. The default is 32.":"最大嵌套节点深度。 默认值为32。","The task that represents the asynchronous ":"代表异步的任务","The sixteenth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第十六个参数。"," was not found. This parameter is passed uninitialized.":"没找到。 该参数通过非初始化。"," to be processed and returns a Boolean to indicate whether the exception was handled.":"要处理并返回布尔值，以指示是否处理了例外。","The prefix of the element.":"元素的前缀。","The name of the assembly where the type named ":"命名类型的组件的名称","The maximum characters allowed in a table name. The default is 16384.":"表名中允许的最大字符。 默认值为16384。","A read-only collection of the ":"仅阅读的集合"," was set and the ":"被设定了"," is sought. If ":"被视为。 如果","The current application domain.":"当前的应用程序域。","The file name and path of the assembly that defines the requested type.":"定义请求类型的汇编的文件名和路径。"," instances that caused the current exception.":"导致当前例外的实例。"," argument contains the value of the switch; otherwise, ":"参数包含开关的值； 否则，","The directory that the assembly resolver uses to probe for dynamically created assemblies.":"组装抛物器用来探测动态创建的组件的目录。","The fully qualified name of the requested type, including the namespace but not the assembly (see the ":"所请求类型的完全合格的名称，包括名称空间，而不包括组件（请参阅","A pointer to the argument in ":"指向论点的指针","The message that describes the exception.":"描述异常的消息。","The file path of the base directory that the assembly resolver uses to probe for assemblies.":"汇编架用来探测组件的基本目录的文件路径。"," to access first, or the first mandatory argument in ":"首先访问或第一个强制性论点","The friendly name of this application domain.":"此应用程序域的友好名称。"," property).":"财产）。","The name of the framework version targeted by the current application.":"当前应用程序针对的框架版本的名称。"," is present in ":"出现在","The name of the file that contains the assembly to execute.":"包含要执行的汇编的文件的名称。","An object to be compared to this instance.":"将对象与此实例进行比较。"," implementation to use when comparing elements.\n\n -or-\n\n ":"比较元素时要使用的实现。 \n\n  -或者-","An integer that identifies the application domain.":"标识应用程序域的整数。","The name of the directory to be appended to the private path.":"要附加到私人路径的目录名称。","This comparison is not supported. No value is returned.":"不支持此比较。 没有返回值。","The value returned by the entry point of the assembly.":"由组件的入口点返回的值。"," if assemblies that are loaded into the current application domain execute with full trust; otherwise, ":"如果将被加载到当前应用程序域中执行的汇编以完全信任执行； 否则，","The assembly display name, in the form provided by the ":"装配显示名称，以由"," implementation of each element.":"每个元素的实现。","The next argument as a ":"下一个论点作为","The arguments to the entry point of the assembly.":"大会入口点的论点。"," if the current application domain has a homogenous set of permissions; otherwise, ":"如果当前的应用域具有一组同质的权限； 否则，","The sorted one-dimensional, zero-based ":"排序的一维，基于零","A string containing the assembly display name after policy has been applied.":"应用策略后包含汇编显示名称的字符串。","A runtime type handle that identifies the type of the argument to retrieve.":"一个运行时类型的句柄，标识要检索的参数类型。","The value that is returned by the entry point of the assembly.":"由组件的入口点返回的值。"," if monitoring is enabled; otherwise ":"如果启用了监视； 否则","The array to clear.":"阵列要清除。","The type of the next argument.":"下一个参数的类型。","The friendly name of the domain.":"域名的友好名称。","The number of surviving bytes.":"幸存字节的数量。","The array whose elements need to be cleared.":"需要清除其元素的数组。","Represents the value of the computed hash code.":"表示计算的哈希代码的值。","The number of remaining arguments.":"剩余的论点数量。","The newly created application domain.":"新创建的应用程序域。","The starting index of the range of elements to clear.":"要清除元素范围的起始索引。","Represents the hash algorithm used by the assembly manifest.":"表示组件清单使用的哈希算法。","The total number of surviving bytes for the process.":"进程的存活字节数。","The display name of the assembly. See ":"组件的显示名称。 看","The name of the parameter that caused the current exception.":"导致当前异常的参数的名称。","The number of elements to clear.":"要清除的元素数量。"," object representing the name of the assembly.":"代表组件名称的对象。","The total size of all memory allocations.":"所有内存分配的总大小。"," that contains the data to copy.":"其中包含要复制的数据。","The fully qualified name of the requested type, including the namespace but not the assembly, as returned by the ":"所请求类型的完全合格的名称，包括名称空间，而不是由组件的名称","An array of assemblies in this application domain.":"此应用程序域中的一个组件数组。","A text string describing the details of the exception. The value of this property takes one of two forms:  \n  \n ":"描述异常细节的文本字符串。 该属性的价值采用两种形式之一：","Total processor time for the current application domain.":"当前应用程序域的总处理器时间。","A 32-bit integer that represents the index in the ":"一个32位整数，代表索引","The permission set of the sandboxed application domain.":"沙盒应用程序域的权限集。","An object that is a wrapper for the new instance specified by ":"是针对由新实例指定的新实例的对象","A 32-bit signed integer that is the identifier of the current thread.":"一个32位签名的整数，是当前线程的标识符。","An object that describes the source or destination of the serialized data.":"描述序列化数据源或目的地的对象。"," that receives the data.":"接收数据。","The name of a predefined application domain property, or the name of an application domain property you have defined.":"预定义的应用程序域属性的名称，或您定义的应用程序域属性的名称。","The path under the base directory where the assembly resolver should probe for private assemblies.":"程序集解析程序应在其中探测私有程序集的基目录下的路径。","The name of the parameter that caused the exception.":"引起异常的参数名称。"," at which storing begins.":"开始存储的开始。",". The return value needs to be unwrapped to access the real object.":". 返回值需要解开才能访问真实对象。","The compatibility switch to test.":"兼容性切换到测试。","The application domain initialization information.":"应用域初始化信息。","A 32-bit integer that represents the number of elements to copy.":"一个32位整数，代表要复制的元素数量。","A Boolean value specifying whether to perform a case-sensitive search or not.":"布尔值指定是否执行对病例敏感的搜索。","The reference type argument to validate as non-null.":"参考类型参数以验证为非null。"," in Visual Basic) if no compatibility switches are set; otherwise, a Boolean value that indicates whether the compatibility switch that is specified by ":"在Visual Basic中）如果未设置兼容性开关； 否则，一个布尔值表示是否指定的兼容性开关"," if the application domain is configured to shadow copy files; otherwise, ":"如果将应用程序域配置为阴影复制文件； 否则，","The one-dimensional, zero-based ":"一维，基于零的","The name of the parameter with which ":"参数的名称","The name of the application base directory.":"应用程序基础目录的名称。"," is null, the default binder is used.":"为null，使用默认的粘合剂。"," is set.":"设置。"," to convert to a target type.":"转换为目标类型。","The target version and profile of the .NET Framework.":".NET框架的目标版本和配置文件。"," corresponds.":"对应。","The arguments to pass to the constructor. This array of arguments must match in number, order, and type the parameters of the constructor to invoke. If the parameterless constructor is preferred, ":"传递构造函数的论点。 这个参数数组必须匹配数字，顺序和键入要调用的构造函数的参数。 如果首选无参数构造函数，"," object represents the default application domain for the process; otherwise, ":"对象表示该过程的默认应用程序域； 否则，"," parameter is not a null reference, the current exception is raised in a ":"参数不是零引用，而是在A中提出当前异常"," must be an empty array or null.":"必须是空数组或空的。"," that converts each element from one type to another type.":"这将每个元素从一种类型转换为另一种类型。","The name of the parameter that causes this exception.":"导致此异常的参数的名称。"," if this application domain is unloading and the common language runtime has started invoking finalizers; otherwise, ":"如果此应用程序域正在卸载，并且通用语言运行时已经开始调用最终化器； 否则，","The array of bytes representing the raw public key data.":"代表原始公共密钥数据的字节数组。","An array of one or more attributes that can participate in activation. Typically, an array that contains a single ":"一个或多个可以参与激活的属性的数组。 通常，一个包含单个的数组","An array of the target type containing the converted elements from the source array.":"目标类型的数组包含来自源数组的转换元素的数组。"," that is a COFF-based image containing an emitted assembly.":"那是一个基于COFF的图像，其中包含发射的组件。","The value of the argument that causes this exception.":"导致此异常的参数的值。"," object that specifies the URL that is required to activate a remote object.  \n  \n This parameter is related to client-activated objects.Client activation is a legacy technology that is retained for backward compatibility but is not recommended for new development. Distributed applications should instead use Windows Communication Foundation.":"指定激活远程对象所需的URL的对象。 \n  \n  该参数与客户激活的对象有关。ClientActivation是一种遗留技术，可保留用于向后兼容性，但不建议用于新开发。 分布式应用程序应该使用Windows Communication Foundation。","The name of the application.":"应用程序的名称。","The value of the parameter that caused the current ":"导致电流的参数的值","A 64-bit integer that represents the number of elements to copy. The integer must be between zero and ":"一个64位整数，表示要复制的元素数。 整数必须在零和 ","An instance of the object specified by ":"由"," object that specifies the version of the application.":"指定应用程序版本的对象。"," containing the raw bytes representing the symbols for the assembly.":" 包含表示程序集符号的原始字节。","The text message for this exception. The value of this property takes one of two forms, as follows.\n\n ":"此例外的短信。 该属性的价值采用两种形式之一，如下所示。","A culture-specific object used to govern the coercion of types. If ":"一种特定于文化的物体，用于控制类型的胁迫。 如果","The processor architecture of the application.":"应用程序的处理器体系结构。",", inclusive.":"， 包括的。","An object that describes the assembly to load.":"描述要加载的组件的对象。","The one-dimensional, zero-based array to wrap in a read-only ":"一维，基于零的数组，以包装仅阅读"," object. that specifies the URL that is required to activate a remote object.  \n  \n This parameter is related to client-activated objects. Client activation is a legacy technology that is retained for backward compatibility but is not recommended for new development. Distributed applications should instead use Windows Communication Foundation.":"目的。 这指定了激活远程对象所需的URL。 \n  \n  此参数与客户激活的对象有关。 客户激活是一种遗留技术，保留了向后兼容性，但不建议用于新开发。 分布式应用程序应该使用Windows Communication Foundation。","A 64-bit integer that represents the index in the ":"一个64位整数，代表索引","The culture of the application.":"应用的文化。"," objects that represent the assemblies loaded into the reflection-only context of the application domain.":"代表加载到应用程序域仅反射上下文中的组件的对象。"," wrapper.":"包装纸。","The name, including the path, of a file that contains an assembly that defines the requested type. The assembly is loaded using the ":"包含定义请求类型的程序集的文件的名称，包括路径。 组件使用","The one-dimensional array that is the destination of the elements copied from the current array.":"一维数组是从当前数组复制的元素的目的地。","The fully qualified path to the shadow copy location.":"通往影子复制位置的完全合格的路径。"," object that represents an exact copy of the original.":"代表原始副本的对象。","A read-only ":"只读"," wrapper for the specified array.":"指定数组的包装器。","A 32-bit integer that represents the index in ":"一个32位整数，代表索引"," object to compare to the current ":"与当前相比的对象","The name of a user-defined application domain property to create or change.":"用户定义的应用程序域属性的名称要创建或更改。","An object that is a wrapper for the new instance, or ":"是新实例的包装器的对象，或","The sorted one-dimensional ":"分类的一维","A 64-bit integer that represents the index in ":"一个64位整数，代表索引","The value of the property.":"属性的价值。"," in the specified ":"在指定"," object is equivalent to the current ":"对象等效于当前"," is not found. The return value needs to be unwrapped to access the real object.":"找不到。 返回值需要拆开以访问真实对象。","The size of the ":"大小"," is found; otherwise, a negative number. If ":"被发现； 否则，一个负数。 如果","The fully qualified path that is the base directory for subdirectories where dynamic assemblies are stored.":"完全合格的路径是存储动态组件的子目录的基本目录。","The hash code for the current application identity.":"当前应用程序身份的哈希代码。","A new one-dimensional ":"一个新的一维","The requested object, or ":"请求的对象或"," is not found and ":"找不到，"," values that specifies the type of the principal object to attach to threads.":"指定要附加到线程的主要对象的类型的值。","A string representation of the application identity.":"应用程序身份的字符串表示。","A new three-dimensional ":"一个新的三维"," of the specified ":"指定的"," is less than one or more elements in ":"不到一个或多个元素","The culture information for the application.":"应用程序的文化信息。","A list of directory names, where each name is separated by a semicolon.":"目录名称的列表，其中每个名称都被半分离。",", the negative number returned is the bitwise complement of the index of the first element that is larger than ":"，返回的负数是第一个元素的索引的位互补，该元素大于","An array of 32-bit integers that represent the size of each dimension of the ":"一个32位整数的数组，代表每个维度的大小"," with the specified length, using zero-based indexing.":"使用指定的长度，使用基于零的索引。","A byte array containing the public key token for the application.":"一个包含用于应用程序的公共密钥令牌的字节阵列。","The principal object to attach to threads.":"要连接到线程的主要对象。"," is greater than all elements in ":"大于所有元素","A new multidimensional ":"一个新的多维 "," that specifies the version of the application.":"这指定了应用程序的版本。","The size of the first dimension of the ":"第一维的大小","A string formed by concatenating the literal string \"Name:\", the friendly name of the application domain, and either string representations of the context policies or the string \"There are no context policies.\"":"通过串联字符串“名称：”，应用程序域的友好名称以及上下文策略的字符串表示形式或字符串“没有上下文策略”而形成的字符串。",", the negative number returned is the bitwise complement of (the index of the last element plus 1). If this method is called with a non-sorted ":"，返回的负数是（最后一个元素加1的索引）的位补体。 如果此方法用未排序调用","A one-dimensional array that contains the size of each dimension of the ":"一个一维数组，包含每个维度的大小","An argument list consisting of mandatory and optional arguments.":"一个由强制性和可选参数组成的参数列表。","The size of the second dimension of the ":"第二维的大小","An application domain to unload.":"卸载的应用程序域。",", the return value can be incorrect and a negative number could be returned, even if ":"，即使","A 32-bit integer that represents the second-dimension index of the ":"一个32位整数，代表该二维指数","A one-dimensional array that contains the lower bound (starting index) of each dimension of the ":"一个一维数组，其中包含每个维度的下限（起始索引）","A new two-dimensional ":"新的二维","The base directory that the assembly resolver uses to probe for assemblies.":"组件排列器用于探测组件的基本目录。","The value at the specified position in the two-dimensional ":"二维位置的指定位置值"," to reverse.":"扭转。"," with the specified length for each dimension, using zero-based indexing.":"使用基于零的索引为每个维度的指定长度。"," with the specified length and lower bound for each dimension.":"每个维度的指定长度和下限。","The predicate that defines the conditions to check against the elements.":"定义要对元素进行检查的条件的谓词。","A 32-bit integer that represents the third-dimension index of the ":"一个32位整数，代表该指数的三维指数","The starting index of the section to reverse.":"本节的起始索引要反向。","The size of the third dimension of the ":"第三维的大小"," if every element in ":"如果每个元素","The number of elements in the section to reverse.":"本节中的元素数量逆转。","An array of 64-bit integers that represent the size of each dimension of the ":"一个64位整数的数组，代表每个维度的大小","The value at the specified position in the three-dimensional ":"在三维中指定位置的值","The object to locate in the array segment.":"要位于数组段中的对象。",". If there are no elements in the array, the return value is ":"。 如果数组中没有元素，则返回值为"," to create. Each integer in the array must be between zero and ":"去创造。 数组中的每个整数必须在零和","The one-dimensional array of elements to reverse.":"一维元素要逆转。","A one-dimensional array of 32-bit integers that represent the indexes specifying the position of the ":"一维阵列的32位整数，代表指定位置的索引"," is found in the array segment; otherwise, ":"在阵列段中找到； 否则，","An empty array.":"一个空数组。"," for all arrays.":"对于所有数组。","The new value for the specified element.":"指定元素的新值。","The value at the specified position in the multidimensional ":"多维位置的指定位置值","The object to remove from the array segment.":"从数组段删除的对象。"," that defines the conditions of the elements to search for.":"这定义了要搜索的元素的条件。"," element to set.":"要设置的元素。","The total number of elements in all the dimensions of the ":"在所有维度的元素总数","A 64-bit integer that represents the position of the ":"一个64位整数，代表","Always throws an exception.":"总是抛出异常。","The array to be filled.":"要填充的阵列。","A one-dimensional array of 32-bit integers that represent the indexes specifying the position of the element to set.":"一维数组的32位整数，代表指定元素位置的索引。","A 64-bit integer that represents the first-dimension index of the ":"一个64位整数，代表该指数的一维指数","; zero if there are no elements in the array.":"; 零，如果数组中没有元素。","The object to insert into the array segment.":"插入数组段的对象。","A one-dimensional array of 64-bit integers that represent the indexes specifying the position of the element to set.":"一维数组的64位整数，代表指定元素位置的索引。","The value to assign to each array element.":"分配给每个数组元素的值。","An array containing the data in the current array segment.":"一个包含当前数组段中数据的数组。","A 64-bit integer that represents the second-dimension index of the ":"一个64位整数，代表该二维指数"," to be filled.":"要填补。","A 64-bit integer that represents the total number of elements in all the dimensions of the ":"一个64位整数，代表所有尺寸的元素总数"," to sort.":"排序。","The original array that was passed to the constructor, and that contains the range delimited by the ":"传递给构造函数的原始数组，其中包含由","A 64-bit integer that represents the third-dimension index of the ":"一个64位整数，代表该指数的三维指数","The new value for the elements in the specified range.":"指定范围内元素的新值。","The maximum count of elements allowed in any array.":"任何数组中允许的元素的最大计数。"," that contains the keys to sort.":"其中包含分类的密钥。","The number of elements in the range delimited by the ":"由","A one-dimensional array of 64-bit integers that represent the indexes specifying the position of the ":"一维阵列的64位整数，代表指定位置的索引","The rank (number of dimensions) of the ":"级别（尺寸数）"," at which filling begins.":"开始填充。"," that contains the items that correspond to each of the keys in the ":"其中包含与与每个键相对应的项目",".\n\n -or-\n\n ":"。 \n\n  -或者-","An array segment of type ":"类型阵列","The one-dimensional, zero-based array to search.":"搜索的一维，基于零的数组。","The one-dimensional array to search.":"的一维数组进行搜索。","The index of the element to get or set.":"要获取或设置的元素的索引。"," to sort only the ":"仅分类"," containing zero elements.":"包含零元素。","The array to wrap.":"包装的阵列。","The predicate that defines the conditions of the element to search for.":"定义要搜索的元素条件的谓词。","The object to locate in ":"要定位的对象 ","The starting index of the range to sort.":"排序范围的起始索引。","The position of the first element in the range delimited by the ":"第一个元素在范围内的位置","The array containing the range of elements to delimit.":"包含要界定元素范围的数组。","The index of the first occurrence of ":"首次出现的索引"," that defines the conditions of the element to search for.":" 它定义了要搜索的元素的条件。","The number of elements in the range to sort.":"排序范围内的元素数量。",", relative to the start of the original array.":"，相对于原始数组的开始。","The zero-based index of the first element in the range.":"该范围内第一个元素的基于零索引。"," on whose elements the action is to be performed.":"在其元素上，要执行动作。",", if found; otherwise, the lower bound of the array minus 1.":"，如果发现； 否则，阵列负1的下限。","The one-dimensional array to sort.":"一维数组进行排序。"," if the array segment is read-only; otherwise, ":"如果阵列段仅读取； 否则，","The starting index of the search. 0 (zero) is valid in an empty array.":"搜索的起始索引。 0（零）在空数组中有效。"," into which the contents of this instance will be copied.":"将复制此实例的内容。","The implementation to use when comparing elements.\n\n -or-\n\n ":"比较元素时要使用的实现。 \n\n  -或者-",", if it's found, within the range of elements in ":"，如果被发现，则在"," to perform on each element of ":"在每个元素上执行","The array segment into which the contents of this instance will be copied.":"将复制此实例内容的数组段。"," if the enumerator has passed the end of the array segment.":" 如果枚举器已传递数组段的末尾。"," to the last element; otherwise, the lower bound of the array minus 1.":"到最后一个元素； 否则，阵列负1的下限。","A zero-based dimension of the ":"基于零的维度","The one-dimensional, zero-base ":"一维零基数","The element of the ":"元素","The structure to compare with the current instance.":"与当前实例进行比较的结构。"," whose length needs to be determined.":"需要确定其长度。"," generic interface implementation to use when comparing elements, or ":"比较元素或",", if it's found in the ":"，如果在","A 32-bit integer that represents the number of elements in the specified dimension.":"一个32位整数，表示指定维度中的元素数量。","The element in the array segment at the current position of the enumerator.":"阵列段中的元素处于枚举器的当前位置。"," structure is equal to the current instance; otherwise, ":"结构等于当前实例。 否则，"," generic interface implementation of each element.":"每个元素的通用接口实现。"," from index ":"来自索引","An instance that represents the currently loaded assembly.":"代表当前加载程序集的实例。"," if the specified object is a ":"如果指定的对象是"," that contains the items that correspond to the keys in ":"其中包含与密钥相对应的项目","A 64-bit integer that represents the number of elements in the specified dimension.":"一个64位整数，表示指定维度中的元素数。"," - 1; otherwise, the lower bound of the array minus 1.":"-1; 否则，阵列负1的下限。"," that represents the currently loaded assembly.":"这代表当前加载的组件。"," to sort only ":"仅分类"," structure and is equal to the current instance; otherwise, ":"结构，等于当前实例； 否则，"," in the entire ":"整个","A zero-based dimension of the array whose starting index needs to be determined.":"需要确定其起始索引的数组的基于零的维度。","Adding a value to an array is not supported. No value is returned.":"不支持在数组中添加值。 没有返回值。","The result of the asynchronous operation.":"异步操作的结果。","The zero-based starting index of the search. 0 (zero) is valid in an empty array.":"搜索的基于零的起始索引。 0（零）在空数组中有效。","An enumerator that can be used to iterate through the array segment.":"可以用来通过数组段迭代的枚举器。","The index of the first element of the specified dimension in the array.":"数组中指定维度的第一个元素的索引。"," to compare with this instance or ":"与此实例进行比较或","The  structure on the left side of the equality operator.":"平等操作员左侧的结构。"," within the range of elements in ":"在元素范围内","The object to locate in the current list. The element to locate can be ":"要位于当前列表中的对象。 要找到的元素可以是","A zero-based dimension of the array whose upper bound needs to be determined.":"需要确定上限的数组的基于零的尺寸。"," and contains the number of elements specified in ":"并包含在"," and this instance are of the same type and have identical field values; otherwise, ":"此实例是相同类型的，并且具有相同的字段值； 否则，","The structure on the right side of the equality operator.":"平等操作员右侧的结构。","The object to locate in the current list.":"要位于当前列表中的对象。","The index of the last element of the specified dimension in the array, or -1 if the specified dimension is empty.":"数组中指定维度的最后一个元素的索引，如果指定的维度为空，则为-1。"," class that describes a reusable collection of modules.":"描述可重复使用的模块集的类。","The index of the last occurrence of ":"最后发生的索引","A 32-bit integer that represents the position of the ":"一个32位整数，代表","An array segment representation of the array.":"数组的数组段表示。","The index of value if found in the list; otherwise, -1.":"如果在列表中找到价值索引； 否则，-1。","The type, or a base type, of the custom attribute to search for.":"要搜索的自定义属性的类型或基本类型。","The starting index of the backward search.":"向后搜索的起始索引。","The structure on the left side of the inequality operator.":"不等式操作员左侧的结构。"," element to get.":"要获得的元素。","A reference to the single custom attribute of type ":"对类型的单个自定义属性的引用","The index at which ":"索引","The structure on the right side of the inequality operator.":"不等式操作员右侧的结构。"," that contains the number of elements specified in ":"其中包含在","The value at the specified position in the one-dimensional ":"一维的指定位置的值"," that is applied to ":"适用于"," and ends at ":"并结束","The index at which to begin the slice.":"开始切片的索引。","An object that compares the current object and ":"比较当前对象的对象"," if there is no such attribute.":"如果没有这样的属性。","A 32-bit integer that represents the first-dimension index of the ":"一个32位整数，代表该指数的一维指数","An array segment that consists of all elements of the current array segment from ":"一个数组段，由当前数组段的所有元素组成","An integer that indicates the relationship of the current collection object to other, as shown in the following table.\n\n ":"一个整数，指示当前集合对象与其他对象的关系，如下表所示。","The one-dimensional, zero-based array to resize, or ":"要调整大小的一维、从零开始的数组，或 ","This parameter is ignored, and does not affect the operation of this method.":"此参数被忽略，不会影响此方法的操作。"," array that contains the custom attributes applied to ":"包含应用于自定义属性的数组"," to the end of the array segment.":"到阵列段的末端。","An object that determines whether the current instance and ":"确定当前实例和是否"," to create a new array with the specified size.":"创建具有指定大小的新数组。",", or an empty array if no such custom attributes exist.":"，如果没有此类自定义属性，则为空数组。"," class that describes a constructor, event, field, method, or property member of a class.":"描述类的构造函数，事件，字段，方法或属性成员的类。","The desired length of the slice.":"切片的所需长度。"," if the two objects are equal; otherwise, ":"如果两个对象相等； 否则，"," array that contains the custom attributes of type ":"包含类型的自定义属性的数组","The size of the new array.":"新数组的大小。","An array segment of ":"一个阵列",", specifies to also search the ancestors of ":"，指定也搜索"," applied to ":"应用于"," to check against the conditions.":"检查条件。"," for custom attributes.":"用于自定义属性。"," elements starting at ":"元素开始"," if a custom attribute of type ":"如果类型的自定义属性"," class that describes a portable executable file.":"描述便携式可执行文件的类。","The object to add to the array segment.":"添加到数组段的对象。"," is applied to ":" 应用于 "," class that describes a parameter of a member of a class.":"描述类成员的参数的类。"," class that describes a constructor, event, field, method, type, or property member of a class.":"描述类的构造函数，事件，字段，方法，类型或属性成员的类。"," to compare with this instance of ":"与此实例进行比较"," if this instance equals ":"如果此实例等于","The set of values combined using a bitwise OR operation to indicate which program elements are valid.":"使用位或操作组合的值集合以指示哪些程序元素有效。"," if more than one instance is allowed to be specified; otherwise, ":"如果允许指定多个实例； 否则，"," if the attribute can be inherited by derived classes and overriding members; otherwise, ":"如果属性可以通过派生的类和覆盖成员继承； 否则，","One or several ":"一个或几个","The full name of the file with the invalid image.":"使用无效图像的文件的全名。","A string containing the fully qualified name of this exception and possibly the error message, the name of the inner exception, and the stack trace.":"包含此异常的完全限定名称以及错误消息，内部异常的名称和堆栈跟踪的字符串。","The name of the file with the invalid image, or a null reference if no file name was passed to the constructor for the current instance.":"使用无效映像的文件名，或者如果没有将文件名称传递给当前实例的构造函数，则为null引用。"," containing errors reported by the assembly cache.":"包含组件缓存报告的错误。","A string containing the error message and the name of the file that caused this exception.":"包含错误消息的字符串和引起此异常的文件名。","The number to convert.":"要转换的数字。","A 64-bit signed integer whose value is equivalent to ":"一个64位签名的整数，其价值等同于","A 64-bit unsigned integer whose bits are identical to ":"一个64位未签名的整数，其位与","The value to convert.":"要转换的值。","A byte array with length 1.":"长度为1的字节阵列。","The character to convert.":"转换的角色。","An array of bytes with length 2.":"长度2的字节阵列。","An array of bytes with length 8.":"长度8的字节数组。","An array of bytes with length 4.":"长度为4的字节阵列。","The half-precision floating-point value to convert.":"要转换的半精度浮点值。","An integer representing the converted half-precision floating-point value.":"代表转换后半精度浮点值的整数。","A 16-bit unsigned integer whose bits are identical to ":"一个16位未签名的整数，其位与","The 16-bit signed integer value to convert.":"16位签名的整数值要转换。","A half-precision floating-point value that represents the converted integer.":"一个半精度的浮点值，代表转换的整数。","The integer to convert.":"要转换的整数。","A single-precision floating-point value that represents the converted integer.":"一个代表转换的整数的单精度浮点值。","A double-precision floating point number whose value is equivalent to ":"一个双精度的浮点数，其值等于","The single-precision floating-point value to convert.":"要转换的单精度浮点值。","An integer representing the converted single-precision floating-point value.":"一个代表转换后的单位浮点数值的整数。","A 32-bit unsigned integer whose bits are identical to ":"一个32位未签名的整数，其位与","The index of the byte within ":"内部字节的索引"," if the byte at ":"如果字节在"," is nonzero; otherwise, ":"是非零的； 否则，","A read-only span containing the bytes to convert.":"仅读取的跨度包含要转换的字节。","A Boolean representing the converted bytes.":"代表转换字节的布尔值。","An array that includes the two bytes to convert.":"一个包括要转换的两个字节的数组。","The starting position within ":"内部的首发位置","The character formed by two bytes beginning at ":"从两个字节形成的字符开始","A character representing the converted bytes.":"代表转换字节的字符。","An array of bytes that includes the eight bytes to convert.":"一系列字节，其中包括要转换的八个字节。","A double-precision floating point number formed by eight bytes beginning at ":"从八个字节形成的双精度浮点数","A double-precision floating-point value that represents the converted bytes.":"代表转换字节的双精度浮点值。","An array of bytes that includes the two bytes to convert.":"一个字节数组，其中包括两个要转换的字节。","A half-precision floating point number formed by two bytes beginning at ":"一个从两个字节形成的半精度浮点数","A half-precision floating-point value that represents the converted bytes.":"一个半精度的浮点值，代表转换的字节。","A 16-bit signed integer formed by two bytes beginning at ":"一个由两个字节形成的16位签名整数","A 16-bit signed integer representing the converted bytes.":"一个16位签名的整数，代表转换的字节。"}