{" that contains the output data returned by the operation.":"其中包含操作返回的输出数据。","The status of the ":"状态","The time to wait for a response, in microseconds.":"在微秒中等待响应的时间。"," parameter.\n\n ":"范围。"," based on the polling mode value passed in the ":"基于在","The maximum length of the pending connections queue.":"待处理连接队列的最大长度。","The position in the ":"在"," parameter to store the received data.":"参数存储收到的数据。"," that is the storage location for received data.":"那是收到数据的存储位置。","A list of ":"的清单","s of type ":"类型","When this method returns, contains one of the enumeration values that defines error codes for the socket.":"当此方法返回时，包含定义插座错误代码的枚举值之一。","The buffer for the received data.":"接收数据的缓冲区。","A span of bytes that is the storage location for the received data.":"一个字节的跨度是接收到的数据的存储位置。"," that contains the received data.":"其中包含收到的数据。","A bitwise combination of SocketFlags values that will be used when receiving the data.":"接收数据时将使用的插座值的位组合。","An asynchronous task that completes with the number of bytes received.":"一个异步任务，完成了接收到的字节数。","An endpoint of the same type as the endpoint of the remote host.":"与远程主机的端点相同类型的端点。"," containing the number of bytes received and the endpoint of the sending host.":"包含接收到的字节数和发送主机的端点。","A bitwise combination of the enumeration values that specifies send and receive behaviors.":"指定发送和接收行为的枚举值的比重组合。",", passed by reference, that represents the remote server.":"，通过引用传递，代表远程服务器。","A list of buffers for the received data.":"接收数据的缓冲区列表。","An asynchronous task that completes with a ":"一个异步任务，该任务完成了"," holding address and interface information.":"保留地址和接口信息。","A span of bytes that is the storage location for received data.":"一个字节的跨度是收到数据的存储位置。"," containing the number of bytes received and additional information about the sending host.":"包含接收到的字节数和有关发送主机的其他信息。"," instances to check for writability.":"实例检查是否有撰写性。","The time-out value, in microseconds. A -1 value indicates an infinite time-out.":"超秒度的超时值。 -1值表示无限的超时。","The number of bytes sent to the ":"发送到的字节数"," instances to check for readability.":"检查可读性的实例。","A span of bytes that contains the data to be sent.":"包含要发送的数据的字节跨度。"," instances to check for errors.":"实例检查错误。"," that contains the data to be sent.":"其中包含要发送的数据。","The position in the data buffer at which to begin sending data.":"在数据缓冲区中开始发送数据的位置。","A bitwise combination of SocketFlags values that will be used when sending the data.":"发送数据时将使用的插座值的位组合。","The buffer for the data to send.":"发送数据的缓冲区。","A list of buffers for the data to send.":"发送数据的缓冲区列表。","The path and name of the file to be sent. This parameter can be ":"要发送的文件的路径和名称。 此参数可以是"," that contains data to be sent before the file is sent. This buffer can be empty.":"其中包含在发送文件之前要发送的数据。 此缓冲区可以为空。","An asynchronous task that completes with the number of bytes sent.":"一个异步任务，该任务完成了发送的字节数。","One or more of ":"一个或多个"," that contains data to be sent after the file is sent. This buffer can be empty.":"其中包含在发送文件后要发送的数据。 此缓冲区可以为空。"," array that contains data to be sent after the file is sent. This parameter can be ":"在发送文件后包含要发送的数据的数组。 此参数可以是","A bitwise combination of the enumeration values that specifies how the file is transferred.":"指定文件如何传输的枚举值的位组合。"," that contains the path and name of the file to be sent. This parameter can be ":"其中包含要发送的文件的路径和名称。 此参数可以是"," array that contains data to be sent before the file is sent. This parameter can be ":"在发送文件之前包含要发送的数据的数组。 此参数可以是","The value of the option, represented as a ":"期权的价值，表示为","A value task that represents the asynchronous send file operation.":"代表异步发送文件操作的价值任务。"," that represents the destination for the data.":"这代表了数据的目的地。"," doesn't allow datagram fragmentation; otherwise, ":"不允许数据报片段； 否则，"," values that specifies the operation that will no longer be allowed.":"指定将不再允许的操作的值。"," that represents the value of the option.":"这代表了选项的价值。"," that represents the destination location for the data.":"这代表数据的目标位置。","The remote host to which to send the data.":"发送数据的远程主机。","The number of bytes of data received from the network and available to be read.":"从网络接收到的数据的字节数，可读取。"," is a dual-mode socket; otherwise, ":"是双模式插座； 否则，","The number of bytes sent.":"发送的字节数。","The IP protection level to set on this socket.":"在此插座上设置的IP保护级别。","A value of the option.":"选项的值。"," will block; otherwise, ":"会阻止; 否则，"," if the socket was created by calling the ":"如果插座是通过调用"," allows broadcast packets; otherwise, ":"允许广播数据包； 否则，","The value to which the option should be set.":"应设置选项的值。"," that contains the value of the option.":"其中包含选项的值。"," was connected to a remote resource as of the most recent operation; otherwise, ":"从最近的操作开始连接到远程资源； 否则，"," allows only one socket to bind to a specific port; otherwise, ":"仅允许一个插座与特定端口结合； 否则，"," constructor and the operating system supports IPv6; otherwise, the default is ":"构造函数和操作系统支持IPv6； 否则，默认值为"," that represents the operating system handle for the ":"这代表了操作系统的手柄"," receives outgoing multicast packets; otherwise, ":"接收外向的多播数据包； 否则，"," for Windows Server 2003 and Windows XP Service Pack 2, and ":"对于Windows Server 2003和Windows XP Service Pack 2，以及"," if the operating system support the Unix domain sockets; otherwise, ":"如果操作系统支持UNIX域插座； 否则，","A socket handle exposed in a safe manner for the socket that the current ":"插座手柄以安全的方式暴露于电流的插座"," is bound to a local port; otherwise, ":"被绑定到本地端口； 否则，"," uses the Nagle algorithm; otherwise, ":"使用Nagle算法； 否则，"," for all other versions.":"对于所有其他版本。","The time-out value, in milliseconds. The default value is 0, which indicates an infinite time-out period. Specifying -1 also indicates an infinite time-out period.":"超时价值，以毫秒为单位。 默认值为0，表示无限的超时时间。 指定-1还表示无限的超时时间。"," that specifies how to linger while closing a socket.":"这说明了如何在关闭插座时徘徊。"," that contains the size, in bytes, of the send buffer. The default is 8192.":"其中包含发送缓冲区的大小，字节。 默认值为8192。"," if the operating system and network adaptors support the IPv4 protocol; otherwise, ":"如果操作系统和网络适配器支持IPv4协议； 否则，"," if the Framework supports IPv6 for certain obsolete ":"如果该框架支持某些过时的IPv6"," with which the ":"用它"," is using for communications.":"用于通信。"," if the operating system and network adaptors support the IPv6 protocol; otherwise, ":"如果操作系统和网络适配器支持IPv6协议； 否则，"," methods; otherwise, ":"方法; 否则，","The time-out value, in milliseconds. If you set the property with a value between 1 and 499, the value will be changed to 500. The default value is 0, which indicates an infinite time-out period. Specifying -1 also indicates an infinite time-out period.":"超时价值，以毫秒为单位。 如果将属性设置为1至499之间的属性，则该值将更改为500。默认值为0，表示无限的超时时间。 指定-1还表示无限的超时时间。"," is communicating.":"正在交流。"," uses only overlapped I/O; otherwise, ":"仅使用重叠的I/O; 否则，","The offset, in bytes, in the data buffer where the operation starts.":"在操作启动的数据缓冲区中的偏移量。","The TTL value.":"TTL值。"," if the current host supports the IPv4 protocol; otherwise, ":"如果当前主机支持IPv4协议； 否则，"," array that represents the data buffer to use with an asynchronous socket method.":"代表用于与异步套接字方法一起使用的数据缓冲区的数组。","Whether to disable the capturing and flow of execution context. Execution context flow should only be disabled if it's handled by higher layers.":"是否禁用执行上下文的捕获和流动。 仅当执行上下文流由较高层处理时，才应禁用。"," on .NET Framework if the ":"在.NET框架上","The maximum amount of data, in bytes, to send or receive in the buffer.":"在Buffer中发送或接收的最大数据量。"," that represents an array of data buffers to use with an asynchronous socket method.":"这代表了与异步套接字方法一起使用的数据缓冲区数组。","The event that is signaled.":"发出信号的事件。"," was specified for the ":"为","The region of memory to use as a buffer with an asynchronous socket method.":"用作带有异步套接字方法的缓冲区的内存区域。"," instance that indicates the type of socket operation most recently performed with this context object.":"实例指示了最近使用此上下文对象执行的套接字操作类型。","The data buffer to use with an asynchronous socket method.":"用于与异步套接字方法一起使用的数据缓冲区。","The connected ":"连接"," that contains the number of bytes transferred in the socket operation.":"其中包含在插座操作中传输的字节数。"," to use or the socket created for accepting a connection with an asynchronous socket method.":"使用或创建用于接受异步套接字方法连接的套接字。"," that represents the result of the asynchronous socket operation.":"这代表异步插座操作的结果。","A region of memory that represents the data buffer to use with an asynchronous socket method.":"代表用于与异步套接字方法一起使用的数据缓冲区的内存区域。"," that contains the maximum amount of data, in bytes, to send or receive.":"其中包含以字节为单位的最大数据发送或接收。"," that indicates the cause of the connection error when a ":"这表明了连接错误的原因","A task that represents the asynchronous connection operation.":"代表异步连接操作的任务。"," that contains the offset, in bytes, into the data buffer referenced by the ":"其中包含字节中的偏移量中的偏移量"," that represents the results of an asynchronous socket operation.":"这代表了异步插座操作的结果。"," parameter contains the number of bytes received.":"参数包含接收到的字节数。"," that specifies if socket can be reused after a disconnect operation.":"该指定在断开操作后是否可以重复使用插座。"," instance that contains the destination IP address and interface of a received packet.":"包含接收数据包的目标IP地址和接口的实例。","An object that represents the user or application object associated with this asynchronous socket operation.":"代表与此异步套接字操作关联的用户或应用对象的对象。","The socket to perform the connect operation on.":"插座执行连接操作。","An array that is the storage location for received data.":"一个数组是收到数据的存储位置。","A region of memory that is the storage location for the received data.":"内存区域是收到数据的存储位置。"," that represents the remote IP endpoint for an asynchronous operation.":"这代表了异步操作的远程IP端点。","The socket that is listening for connections.":"正在侦听连接的插座。","A task that represents an asynchronous connection operation.":"代表异步连接操作的任务。"," objects that represent an array of buffers to be sent.":"代表要发送的缓冲区数组的对象。","A task that completes with the number of bytes received, or 0 if the end of the stream has been reached.":"通过接收到的字节数完成的任务，或者如果已达到流的末尾，则该任务为0。",", that represents the remote server.":"，这代表远程服务器。","The socket that is listening for incoming connections.":"正在侦听传入连接的插座。","The socket that the connect operation is performed on.":"连接操作执行的插座。"," that contains a bitwise combination of values that are used with an asynchronous operation.":"其中包含与异步操作一起使用的值的位组合。","The socket to perform the ReceiveFrom operation on.":"插座执行接收操作。","An asynchronous Task that completes with a ":"一个异步任务，该任务完成了"," that contains the size, in bytes, of the data block used in the send operation.":"其中包含发送操作中使用的数据块的大小，字节。","The socket that is used for establishing a connection.":"用于建立连接的插座。","An asynchronous task.":"一项异步任务。","An array of type Byte that is the storage location for the received data.":"类型字节数组是接收到的数据的存储位置。","An EndPoint that represents the remote device.":"代表远程设备的端点。"," struct.":"结构。","A task that completes with number of bytes sent to the socket if the operation was successful. Otherwise, the task will complete with an invalid socket error.":"如果操作成功，将完成的任务完成了发送到套接字的字节数。 否则，任务将带有无效的套接字错误。","The socket to perform the receive operation on.":"插座执行接收操作。","An EndPoint that represents the source of the data.":"代表数据源的端点。","An asynchronous task that completes with number of bytes sent if the operation was successful. Otherwise, the task will complete with an invalid socket error.":"如果操作成功，则一项异步任务是通过发送的字节数来完成的。 否则，任务将带有无效的套接字错误。","An array of type Byte that contains the data to send.":"包含要发送的数据的类型字节数组。","An asynchronous Task.":"一项异步任务。","An array that is the storage location for the received data.":"是接收数据的存储位置的数组。","An asynchronous Task that completes with a SocketReceiveFromResult struct.":"通过socketreceivefromresult结构完成的异步任务。"," to which you bind the TCP ":"您将TCP绑定到","The port number of the remote hosts.":"远程主机的端口号。"," of the host to which you intend to connect.":"您打算连接的主机。","The socket to perform the operation on.":"插座执行操作。","A task that represents the asynchronous receive operation. The value of the ":"代表异步接收操作的任务。 价值","An asynchronous task that completes with number of bytes sent to the socket if the operation was successful. Otherwise, the task will complete with an invalid socket error.":"如果操作成功，则一项异步任务，该任务完成了发送到套接字的字节数。 否则，任务将带有无效的套接字错误。"," of the IP protocol.":"IP协议。"," if the delay is disabled; otherwise, ":"如果禁用了延迟； 否则，","The port number to which you intend to connect.":"您打算连接的端口号。"," object returned by a call to ":"呼叫返回的对象","An array that contains the data to send.":"包含要发送数据的数组。","The DNS name of the remote host to which you intend to connect.":"您打算连接的远程主机的DNS名称。","A region of memory that contains the data to send.":"一个包含要发送数据的内存区域。"," array of the host to which you intend to connect.":"您打算连接的主机的数组。","The size of the receive buffer, in bytes. The default value is 8192 bytes.":"接收缓冲区的大小，字节。 默认值为8192字节。","The underlying ":"基础","The port number of the remote host to which you intend to connect.":"您打算连接的远程主机的端口号。"," used to send and receive data.":"用于发送和接收数据。"," to which you intend to connect.":"您打算连接的。"," if the connection has been made; otherwise, ":"如果建立了连接； 否则，","The time-out value of the connection in milliseconds. The default value is 0.":"连接的超时值以毫秒为单位。 默认值为0。","The underlying network ":"基础网络","The array of IP address of the remote host.":"远程主机的IP地址数组。","A cancellation token that can be used to cancel the asynchronous operation":"一个可以用来取消异步操作的取消令牌"," object that references the asynchronous connection.":"引用异步连接的对象。","The size of the send buffer, in bytes. The default value is 8192 bytes.":"发送缓冲区的大小，字节。 默认值为8192字节。"," socket was connected to a remote resource as of the most recent operation; otherwise, ":"在最近的操作中，插座已连接到远程资源。 否则，"," that designates the remote hosts.":"指定远程主机。","A cancellation token used to propagate notification that this operation should be canceled.":"一个取消令牌用于传播通知应取消此操作的通知。","A Boolean value that specifies whether to enable or disable NAT traversal.":"指定是启用还是禁用NAT遍历的布尔值。","The send time-out value, in milliseconds. The default is 0.":"发送超时值，以毫秒为单位。 默认值为0。"," if connections are pending; otherwise, ":"如果连接正在等待； 否则，"," allows only one client to use a specific port; otherwise, ":"仅允许一个客户使用特定端口； 否则，","The DNS name of the remote host.":"远程主机的DNS名称。","A user-defined object containing information about the accept operation. This object is passed to the ":"用户定义的对象，其中包含有关接受操作的信息。 这个对象传递给","The port on which to listen for incoming connection attempts.":"聆听传入连接尝试的端口。"," that represents the local IP address.":"这代表本地IP地址。"," is actively listening; otherwise, ":"正在积极倾听； 否则，"," that references the asynchronous creation of the ":"引用了异步的创造","The remote port number to which you intend to connect.":"您打算连接的远程端口号。"," for Windows Server 2003 and Windows XP Service Pack 2 and later, and ":"对于Windows Server 2003和Windows XP Service Pack 2及以后，以及"," object that references the asynchronous receive.":"引用异步接收的对象。"," instance to listen on the specified port.":"实例要在指定的端口上收听。"," allows only one ":"只允许一个"," that represents the local endpoint to which to bind the listener ":"代表绑定听众的局部终点",". By default, lingering is disabled.":"。 默认情况下，禁用缠绵。"," to listen to a specific port; otherwise, ":"听特定的端口； 否则，"," array that contains the data to be sent.":"包含要发送的数据的数组。"," returned by a call to the ":"通过电话返回","The port number to which you intend send data.":"您打算发送数据的端口号。","The interface index associated with the local IP address on which to join the multicast group.":"与本地IP地址相关联的接口索引，在该地址上加入多播组。","A user-defined object that contains information about the send operation. This object is passed to the ":"用户定义的对象，其中包含有关发送操作的信息。 这个对象传递给",".  \n  \n The ":"。 \n  \n  这","The local port number from which you intend to communicate.":"您打算通信的本地端口号。"," that specifies the network endpoint to which you intend to send data.":"这指定了您打算发送数据的网络端点。","The multicast ":"多播"," object that references the asynchronous send.":"引用异步发送的对象。","The number of bytes in the datagram.":"数据报中的字节数。","The DNS name of the remote host to which you intend send data.":"您打算向其发送数据的远程主机的DNS名称。"," values that specifies the addressing scheme of the socket.":"指定套接字的寻址方案的值。"," of the group you want to join.":"您想加入的小组。","The destination host.":"目标主机。","The port number on the remote host to which you intend to send data.":"您打算发送数据的远程主机上的端口号。"," that specifies the UDP datagram that you intend to send, represented as an array of bytes.":"这指定了您打算发送的UDP数据报，表示为字节数组。"," that represents the local endpoint to which you bind the UDP connection.":"这表示您绑定UDP连接的局部终点。"," of the multicast group to leave.":"多播小组离开。"," of the multicast group to join.":"多播组的加入。","The destination port number.":"目标端口号。"," that represents the host and port to which to send the datagram.":"这代表了发送数据报的主机和端口。","The name of the remote DNS host to which you intend to connect.":"您打算连接的远程DNS主机的名称。"," of the remote host to which you intend to send data.":"您打算发送数据的远程主机。","The Time to Live (TTL), measured in router hops.":"在路由器啤酒花中测量的生存时间（TTL）。","The local address of the multicast group to leave.":"多播组的本地地址离开。","The name of the remote host to which you intend to send the datagram.":"您打算发送数据报的远程主机的名称。"," where you can write data to be uploaded.":"您可以在哪里编写要上传的数据。"," that represents the asynchronous send operation. The value of its Result property contains the number of bytes sent.":"这代表异步发送操作。 其结果属性的值包含发送的字节数。"," that represents the remote host from which the data was sent.":"这代表了发送数据的远程主机。","The remote port number with which you intend to communicate.":"您打算通信的远程端口号。","The specified remote endpoint.":"指定的远程端点。"," if a connection is active; otherwise, ":"如果连接处于活动状态； 否则，"," array containing the server reply.":"包含服务器回复的数组。"," of Type ":"类型"," that contains datagram data.":"其中包含数据报数据。"," array that contains the server reply.":"包含服务器回复的数组。","The number of bytes of data received from the network.":"从网络接收到的数据的字节数。","If successful, an array of bytes that contains datagram data.":"如果成功，则包含数据报数据的字节数组。"," value that indicates the number of bytes sent.":"表示已发送的字节数的值。"," that specifies the UDP datagram that you intend to send represented as an array of bytes.":"这指定了您打算发送为字节数组的UDP数据报。"," that specifies the UDP datagram that you intend to send.":"这指定了您打算发送的UDP数据报。","The underlying Network ":"基础网络"," object containing the URI to download.":"包含要下载的URI的对象。"," value that indicates the number of bytes that will be sent.":"表示将发送的字节数的值。","The method used to send the data to the resource. If ":"用于将数据发送到资源的方法。 如果","The token to monitor for cancellation requests. The default value is None.":"代币监视取消请求。 默认值无。"," allows datagram fragmentation; otherwise, ":"允许数据报碎片； 否则，",", the default is POST for http and STOR for ftp.":"，默认值是HTTP的帖子和FTP的Stor。"," that identifies the resource to request.":"这确定了要请求的资源。","The URI from which to download data.":"从中下载数据的URI。","The URI of the resource to receive the string. For HTTP resources, this URI must identify a resource that can accept a request sent with the POST method, such as a script or ASP page.":"接收字符串的资源的URI。 对于HTTP资源，该URI必须确定可以接受使用帖子方法发送的请求的资源，例如脚本或ASP页面。","A buffer for data to receive in the UDP packet.":"在UDP数据包中接收数据的缓冲区。"," array containing the body of the response received from the resource when the data buffer was uploaded.":"上传数据缓冲区时，包含从资源收到的响应的正文的数组。"," object for the specified resource.":"指定资源的对象。","The HTTP method used to send the file to the resource. If null, the default is POST for http and STOR for ftp.":"用于将文件发送到资源的HTTP方法。 如果为null，则默认值为HTTP和FTP的Stor帖子。"," array containing the downloaded resource.":"包含下载资源的数组。","The remote endpoint of the UDP packet.":"UDP数据包的远端端点。","The URI of the resource to receive the file. For example, ftp://localhost/samplefile.txt.":"接收文件的资源的URI。 例如，ftp：//localhost/samplefile.txt。","The URI represented by the ":"由"," that is used to obtain the response.":"这用于获得响应。","The URI of the resource to receive the collection.":"接收该集合的资源的URI。"," instance that is to the left of the not equal operator.":"实例是非平等运算符的左侧。","The file to send to the resource. For example, \"samplefile.txt\".":"要发送到资源的文件。 例如，“ samplefile.txt”。"," object, from which to download data.":"对象，从中下载数据。","The URI of the resource to receive the file.":"接收文件的资源的URI。"," instance that is to the right of the not equal operator.":"实例是非平等运算符的右侧。"," containing the response for the specified ":"包含指定的响应"," containing the URI to download.":"包含要下载的URI。","The method used to send the file to the resource. If ":"用于将文件发送到资源的方法。 如果"," array with the data received in the UDP packet.":"带有UDP数据包中接收到的数据的数组。"," object obtained from a previous call to ":"从以前的呼叫获得的对象"," to send to the resource.":" 以发送给资源。","The file to send to the resource.":"要发送到资源的文件。","The URI of the resource to download.":"要下载的资源的URI。","The URI of the resource to receive the file. For HTTP resources, this URI must identify a resource that can accept a request sent with the POST method, such as a script or ASP page.":"接收文件的资源的URI。 对于HTTP资源，该URI必须确定可以接受使用帖子方法发送的请求的资源，例如脚本或ASP页面。","The URI of the resource to receive the collection. This URI must identify a resource that can accept a request sent with the default method.":"接收该集合的资源的URI。 该URI必须确定可以接受使用默认方法发送的请求的资源。","The name of the local file that is to receive the data.":"接收数据的本地文件的名称。","The remote endpoint from which the UDP packet was received.":"收到UDP数据包的远程端点。"," object containing event data.":"包含事件数据的对象。","The URI of the resource to receive the collection. This URI must identify a resource that can accept a request sent with the ":"接收该集合的资源的URI。 该URI必须确定可以接受与该请求一起发送的请求的资源"," from which to download data.":"从中可以下载数据。","The local file to send to the resource.":"本地文件发送到资源。","The path to connect a unix domain socket over.":"连接Unix域插座的路径。","The URI specified as a ":"URI指定为"," used to read data from a resource.":"用于从资源读取数据。",", from which to download data.":"，从中下载数据。"," array containing the body of the response received from the resource when the file was uploaded.":"上传文件时，包含从资源收到的响应的正文的数组。"," array that contains the downloaded data.":"包含下载数据的数组。","The method used to send the string to the resource. If null, the default is POST for http and STOR for ftp.":"用于将字符串发送到资源的方法。 如果为null，则默认为http的POST和ftp的STOR。","The URI of the resource to retrieve.":"要检索的资源的URI。","The URI of the resource to receive the string. For Http resources, this URI must identify a resource that can accept a request sent with the POST method, such as a script or ASP page.":"接收字符串的资源的URI。 对于HTTP资源，该URI必须确定可以接受使用帖子方法发送的请求的资源，例如脚本或ASP页面。"," array containing the response sent by the server.":"包含服务器发送的响应的数组。"," value that indicates the number of bytes received.":"表示接收到的字节数的值。","The name of the file to be placed on the local computer.":"文件的名称要放在本地计算机上。","The URI of the resource to receive the data.":"接收数据的资源的URI。","The string to be uploaded.":"要上传的字符串。","The HTTP method used to send the collection to the resource. If null, the default is POST for http and STOR for ftp.":"HTTP方法用于将集合发送到资源。 如果为null，则默认值为HTTP和FTP的Stor帖子。"," containing the requested resource.":"包含请求的资源。"," used to write data to the resource.":"用于将数据写入资源。"," value that indicates the number of bytes that will be received.":"表示将接收到的字节数的值。"," containing the response sent by the server.":"包含服务器发送的响应。","The method used to send the data to the resource. If null, the default is POST for http and STOR for ftp.":"用于将数据发送到资源的方法。 如果为null，则默认值为HTTP和FTP的Stor帖子。"," if the Web request is still in progress; otherwise ":"如果Web请求仍在进行中； 否则","The URI of the resource to receive the string. This URI must identify a resource that can accept a request sent with the ":"接收字符串的资源的URI。 该URI必须确定可以接受与该请求一起发送的请求的资源"," that contains the downloaded data.":"其中包含下载的数据。"," to enable buffering of the data written to the Internet resource; ":"启用写入Internet资源的数据；"," instance used to send requests.":"实例用于发送请求。","The data buffer to send to the resource.":"发送到资源的数据缓冲区。"," if the header is restricted; otherwise ":"如果标题受到限制； 否则","The HTTP method used to send the string to the resource. If null, the default is POST for http and STOR for ftp.":"HTTP方法用于将字符串发送到资源。 如果为null，则默认值为HTTP和FTP的Stor帖子。"," containing the base URI for requests made by a ":"包含基本URI的要求"," to test the response; ":"测试响应；"," that contains query name/value pairs associated with the request. If no pairs are associated with the request, the value is an empty ":"其中包含与请求关联的查询名称/值对。 如果对请求没有对，则值为空"," array containing the body of the response from the resource.":"阵列包含来自资源的响应主体。"," if no base address has been specified.":"如果未指定基础地址。","Internal only.":"仅内部。"," to test the request.":"测试请求。"," containing header name/value pairs associated with the response, or ":" 包含与响应相关联的标头名称/值对，或 ","The HTTP method used to send the data to the resource. If null, the default is POST for http and STOR for ftp.":"HTTP方法用于将数据发送到资源。 如果为null，则默认值为HTTP和FTP的Stor帖子。"," object that represents the application's caching requirements.":"代表应用程序缓存要求的对象。"," if the header is restricted; otherwise, ":"如果标题受到限制； 否则，"," indicating whether the script was successfully loaded.":"指示脚本是否已成功加载。"," if no response has been received.":"如果没有收到任何回应。"," instance to remove from the collection.":"实例从集合中删除。"," containing the authentication credentials for the request. The default is ":"包含请求的身份验证凭证。 默认值为"," instance of the proxy.":"代理的实例。","The event data.":"事件数据。",".  \n  \n An internal-only value returned.":"。 \n  \n  返回的仅内部值。"," value to set.":"设置的值。"," instance of the host to check for proxy use.":"主机的实例要检查代理使用。"," that is used to encode strings. The default value of this property is the encoding returned by ":"这用于编码字符串。 该属性的默认值是由"," containing the information required to serialize the ":"包含序列化所需的信息"," object to populate with data.":"用数据填充的对象。","The serialization data.":"的序列化数据。","The content of the header to set.":"标题要设置的内容。"," containing the source of the serialized stream associated with the new ":"包含与新的串行流的来源"," containing header name/value pairs associated with this request.":"包含与此请求关联的标题名称/值对。","The context for the serialized data.":"序列化数据的上下文。"," structure that indicates the destination for this serialization.":"指示此序列化目的地的结构。","The header to set.":"设置的标题。","The header to add, with the name and value separated by a colon.":"要添加的标题，其名称和值由结肠隔开。","One of the enumeration values that specifies whether the buffer is clear text or in a binary format.":"指定缓冲区是明文还是二进制格式的枚举值之一。"," that contains a list of ":"其中包含一个列表","The URI of the proxy server.":"代理服务器的URI。"," array holding the header collection.":"持有标头系列的阵列。"," containing the value of the specified header.":"包含指定标头的值。"," to indicate this is the final asynchronous send; otherwise, ":"表示这是最终的异步发送； 否则，"," to bypass the proxy for local addresses; otherwise, ":"绕过本地地址的代理； 否则，"," arrays that represents URIs that do not use the proxy server when accessed.":" 表示在访问时不使用代理服务器的Uri的数组。"," representation of the collection.":"集合的代表。","The name of the Web header.":"网络标头的名称。","The region of memory containing the message to be sent.":"包含要发送的消息的内存区域。"," containing all header names in a Web request.":"在Web请求中包含所有标题名称。","An array of regular expression strings that contain the URIs of the servers to bypass.":"包含服务器的URI绕过的一系列正则表达字符串。","An array that contains a list of regular expressions that describe URIs that do not use the proxy server when accessed.":"一个包含正则表达式列表的数组，该列表描述了访问时不使用代理服务器的URI。"," holding the value of the specified header.":"保留指定标头的值。"," indicating the number of headers in a request.":"指示请求中的标题数。","The reason why the close handshake was initiated.":"启动近距离握手的原因。"," to bypass the proxy server for local addresses; otherwise, ":"绕过本地地址的代理服务器； 否则，","An array of regular expression strings that contains the URIs of the servers to bypass.":"一系列的正则表达字符串包含要绕过的服务器的URI。"," holding the header name.":"拿着标题名称。","The description of the reason why the ":"描述原因"," instance to submit to the proxy server for authentication.":"实例提交给代理服务器进行身份验证。"," instance that contains the credentials to submit to the proxy server for authentication.":"包含以提交代理服务器进行身份验证的凭据。","The request header value.":"请求标题值。"," instance was closed.":"实例已关闭。","The header index to return.":"标题索引返回。","The WebSocket close status.":"Websocket关闭状态。","The WebSocket options for the ":"Websocket选项","The name of the proxy host.":"代理主机的名称。","The header to return.":"返回的标题。"," instance containing the specified header value.":" 包含指定标头值的实例。","The WebSocket state of the ":"Websocket状态","A description of the close status.":"关闭状态的描述。","The port number on ":"端口号","The WebSocket sub-protocol to add.":"Websocket子协议要添加。","The header to test.":"测试标题。","The response header value.":"响应标头值。","The URI of the WebSocket server to connect to.":"Websocket服务器的URI要连接到。","The size, in bytes, of the client receive buffer.":"客户端的大小，字节接收缓冲区。","The credential information for the client.":"客户的凭据信息。"," instance that contains the address of the proxy server.":"包含代理服务器地址的实例。"," instance containing the specified header.":"包含指定标头的实例。","A cancellation token used to propagate notification that the  operation should be canceled.":"取消令牌用于传播通知应取消操作的通知。"," instance that contains the nondynamic proxy settings from Internet Explorer 5.5 and later.":"实例包含Internet Explorer 5.5及以后的非动力代理设置。","The size, in bytes, of the client send buffer.":"客户端发送缓冲区的大小，字节。","The buffer to receive the response.":"缓冲区接收响应。","The connection to be used for IO operations.":"用于IO操作的连接。"," instance of the requested Internet resource.":"请求的互联网资源实例。","The WebSocket protocol keep-alive interval.":"WebSocket协议保持活动间隔。","The receive buffer to use.":"接收缓冲区要使用。","The region of memory to receive the response.":"内存区域接收响应。","The name of the HTTP header.":"HTTP标头的名称。"," instance of the Internet resource, if the resource is on the bypass list; otherwise, the ":"Internet资源的实例，如果资源在旁路列表上； 否则，","The subprotocol accepted by the client.":"客户端接受的子协议。","The proxy for WebSocket requests.":"Websocket请求的代理。","The buffer containing the message to be sent.":"包含要发送消息的缓冲区。","The created web socket.":"创建的Web插座。","The value of the HTTP header.":"HTTP标头的值。"," if default credentials should be used during WebSocket handshake; otherwise, ":"如果在Websocket握手期间应使用默认凭据； 否则，","The size in bytes of the client WebSocket receive buffer.":"客户端Websocket的字节大小接收缓冲区。","The size, in bytes, of the desired buffer.":"所需的缓冲区的大小，字节。","The cancellation token to use to cancel the send operation.":"取消令牌用于取消发送操作。","A collection of client side certificates.":"客户侧证书的集合。","The size in bytes of the client WebSocket send buffer.":"客户端Websocket的字节大小发送缓冲区。"," is targeting .NET Framework 4.5; otherwise, ":"是目标.NET框架4.5; 否则，","Flags for controlling how the ":"用于控制如何","The cookies associated with the request.":"与请求相关的cookie。","Determines how regularly a frame is sent over the connection as a keep-alive. Applies only when the connection is idle.":"确定以保持距离的方式通过连接发送的定期帧。 仅在连接空闲时适用。"," should send a message.":"应该发送消息。","The current state of the WebSocket.":"Websocket的当前状态。"," of the connection.":"连接。","Indicates whether a random key or a static key (just zeros) should be used for the WebSocket masking.":"指示是否应将随机键或静态密钥（仅零）用于Websocket屏蔽。","The current state of the WebSocket to be tested against the list of valid states.":"网站存储的当前状态将根据有效状态列表进行测试。"," is closed or aborted; otherwise, ":"被关闭或流产； 否则，","Will be used as the internal buffer in the WPC. The size has to be at least ":"将用作WPC中的内部缓冲区。 尺寸至少必须是","List of valid connection states.":"有效连接状态列表。","The description of ":"的描述 ","References the application buffer that is the storage location for the received data.":"引用已接收数据的存储位置的应用程序缓冲区。","The stream for the connection.":"连接的流。","The implementation of the ":"实施"," to indicate it's the server-side of the connection; ":"指示它是连接的服务器端；","Propagates the notification that operations should be canceled.":"传播应取消操作的通知。","The default WebSocket protocol keep-alive interval. The typical value for this interval is 30 seconds (as defined by the OS or the .NET platform). It is used to initialize ":"默认的Websocket协议保持空缺间隔。 此间隔的典型值为30秒（由OS或.NET平台定义）。 它用于初始化"," generic interface to use when comparing keys, or ":"比较密钥时要使用的通用接口，或"," if it's the client-side.":"如果是客户端。","The current state of the WebSocket connection.":"Websocket连接的当前状态。"," object that represents the received data.":"代表接收数据的对象。"," to use the default equality comparer for the type of the key, obtained from ":"使用从","The application buffer that is the storage location for the received data.":"应用程序缓冲区是收到数据的存储位置。","The agreed upon sub-protocol that was used when creating the connection.":"在创建连接时使用的商定的子协议。","The cancellation token to use to cancel the receive operation.":"取消令牌用于取消接收操作。","The number of elements the collection can hold without creating a lookup dictionary (0 creates the lookup dictionary when the first item is added), or -1 to specify that a lookup dictionary is never created.":"集合在不创建查找字典（0在添加第一个项时创建查找字典）的情况下可以容纳的元素数，或者-1指定从不创建查找字典。","The keep-alive interval to use, or ":"要使用的野生间隔","The buffer to be sent over the connection.":"通过连接发送的缓冲区。","The element to change the key of.":"更改密钥的元素。"," to disable keep-alives.":"禁用饲养物。","Indicates whether the application is sending a binary or text message.":"指示该应用程序是发送二进制或短信。","The new key for ":"新钥匙","The new web socket.":"新的Web插座。","Indicates whether the data in \"buffer\" is the last part of a message.":"指示“缓冲区”中的数据是否是消息的最后一部分。","The token that propagates the notification that operations should be canceled.":"传播通知应取消操作的通知的令牌。"," for the connection.":"用于连接。","The element from which to extract the key.":"提取密钥的元素。","The options with which the websocket must be created.":"必须创建Websocket的选项。","One of the enumeration values that indicates whether the application is sending a binary or text message.":"指示该应用程序是发送二进制或文本消息的枚举值之一。","The key for the specified element.":"指定元素的关键。","The zero-based index of the item to be replaced.":"要替换的项目的零索引。"," generic interface that is used to determine equality of keys in the collection.":"通用接口用于确定集合中键的平等。"," to indicate the data in \"buffer\" is the last part of a message; otherwise, ":"指示“缓冲区”中的数据是消息的最后一部分； 否则，","The lookup dictionary of the ":"查找词典"," with which to create this instance of the ":"用它来创建这个实例","The new item.":"新项目。","The key of the item to search in the collection.":"要在集合中搜索的项目的关键。","The action that caused the event. This must be set to ":"导致事件的动作。 必须设置为",", if it exists; otherwise, ":"，如果存在； 否则，",", the item from the collection that matches the provided key; when this method returns ":"，与提供的密钥匹配的集合中的项目； 当此方法返回时","The action that caused the event. This can be set to ":"导致事件的动作。 这可以设置为","The element with the specified key. If an element with the specified key is not found, an exception is thrown.":"带有指定键的元素。 如果找不到带有指定键的元素，则会抛出异常。"," value for the type of the collection.":"集合类型的价值。","The collection from which the elements are copied.":"复制元素的集合。","The items that are affected by the change.":"受更改影响的项目。","The action that caused the event. This can only be set to ":"导致事件的动作。 这只能设置为"," if an item for the specified key was found in the collection; otherwise, ":"如果在集合中找到了指定密钥的项目； 否则，","The list from which the elements are copied.":"从中复制元素的列表。",", to retrieve entity-level errors.":"，检索实体级别的错误。","The new items that are replacing the original items.":"更换原始物品的新项目。"," object that can be used to dispose of the object.":"可用于处理对象的对象。","The validation errors for the property or entity.":"属性或实体的验证错误。","The original items that are replaced.":"原始项目被替换。","The zero-based index specifying the location of the item to be moved.":"基于零的索引指定要移动的项目的位置。"," if the entity currently has validation errors; otherwise, ":"如果实体当前有验证错误； 否则，","The index of the first item of the items that are being replaced.":"要替换的项目的第一项索引。","The zero-based index specifying the new location of the item.":"基于零的索引指定项目的新位置。","The name of the property that changed.":"更改的属性名称。","The name of the property whose value is changing.":"价值正在更改的属性的名称。","Arguments of the event being raised.":"提出事件的论点。","The items affected by the change.":"受更改影响的项目。","The fully qualified name of the class to use for data conversion for the object this attribute is bound to.":"该属性已绑定到对象的数据转换的类完全合格的名称。","The zero-based index of the element to replace.":"元素的基于零的索引要替换。","The index where the change occurred.":"发生变化的索引。"," that represents the type of the converter class to use for data conversion for the object this attribute is bound to.":"这代表用于该属性的对象的数据转换的转换器类的类型。","The new value for the element at the specified index.":"在指定索引处的元素的新值。","The new index for the changed items.":"更改项目的新索引。"," if the value of the given object is equal to that of the current ":"如果给定对象的值等于当前的对象","The dictionary to wrap.":"包裹的字典。","The old index for the changed items.":"更改项目的旧索引。","The fully qualified type name of the ":"完全合格的类型名称"," if the dictionary contains an element that has the specified key; otherwise, ":"如果字典包含具有指定键的元素； 否则，","The item that is affected by the change.":"受更改影响的项目。"," to use as a converter for the object this attribute is bound to, or an empty string (\"\") if none exists. The default value is an empty string (\"\").":"用作对象的转换器，此属性已绑定到或一个空字符串（“”），如果不存在。 默认值是一个空字符串（“”）。","Throws a ":"扔a"," exception in all cases.":"在所有情况下例外。","The qualified name of the type.":"该类型的合格名称。","The item affected by the change.":"受更改影响的项目。","The type to store in the attribute.":"存储在属性中的类型。","An enumerator for the dictionary.":"字典的枚举者。","The new index for the changed item.":"更改项目的新索引。"," containing the qualified type name for the ":"包含合格的类型名称","The old index for the changed item.":"更改项目的旧索引。"," if the object that implements ":"如果实现的对象","The custom type.":"自定义类型。","The new item that is replacing the original item.":"更换原始项目的新项目。","The number of items in the dictionary.":"字典中的项目数。","The dictionary that is wrapped by this object.":"该对象包裹的词典。","The original item that is replaced.":"原始项目被替换。","Data used by the command.  If the command does not require data to be passed, this object can be set to ":"命令使用的数据。 如果命令不需要传递数据，则可以将此对象设置为"," if this command can be executed; otherwise, ":"如果可以执行此命令； 否则，","The index of the item being replaced.":"该项目被替换的索引。","A key collection that contains the keys of the dictionary.":"包含字典键的钥匙集。"," to indicate the dictionary is read-only.":"指示字典是只读的。"," value that describes the action that caused the event.":"描述导致事件的动作的值。","The assembly qualified type name string for the ":"汇编合格的类型名称字符串","A collection that contains the keys of the object that implements ":"包含实施对象的键的集合","The list of new items involved in the change.":"更改中涉及的新项目列表。"," class to use.":"要使用的课程。","The zero-based index at which the change occurred.":"发生更改的基于零的索引。","A collection that contains the values in the object that implements ":"一个包含实现对象中值的集合","A type that represents the type of the ":"表示代表类型的类型"," if access to the dictionary is synchronized (thread safe); otherwise, ":"如果对字典的访问已同步（线程安全）； 否则，","The list of items affected by a ":"受到影响的项目列表","The assembly qualified name of the type.":"汇编合格的类型名称。","An object that can be used to synchronize access to the dictionary.":"可用于同步词典访问的对象。",", Remove, or Move action.":"，删除或移动动作。","An object instance that implements ":"实现的对象实例","The zero-based index at which a ":"基于零的索引"," if the dictionary has a fixed size; otherwise, ":"如果字典的尺寸固定； 否则，","The method the caller invoked.":"调用者调用的方法。",", Remove, or Replace action occurred.":"，删除或更换动作。","A collection that contains the keys of the dictionary.":"包含字典键的集合。","The arguments the caller passed to the method.":"呼叫者传递给方法的论点。","The object that raised the event.":"提出事件的对象。","A collection that contains the values in the dictionary.":"包含字典中值的集合。","The object to return to the caller, or ":"返回呼叫者的对象，或","The one-dimensional array that is the destination of the elements copied from the collection. The array must have zero-based indexing.":"一维数组是从集合中复制的元素的目的地。 该数组必须具有零基索引。","Information about the event.":"有关活动的信息。"," for void methods.":"用于空隙方法。","The object to add to the collection.":"要添加到集合的对象。","The name of the property that has an error.  ":"具有错误的属性名称。","The constructor for the custom attribute.":"自定义属性的构造函数。"," if the error is object-level.":"如果错误为对象级。"," is not found in the original collection.":"在原始集合中找不到。","The arguments to the constructor of the custom attribute.":"对自定义属性的构造函数的参数。","The name of the property that has an error. ":"具有错误的属性名称。","The label for the end of the block. This will leave you in the correct place to execute finally blocks or to finish the try.":"块末端的标签。 这将使您处于正确执行或完成尝试的正确位置。","Named fields of the custom attribute.":"命名自定义属性的字段。","The name of the property to retrieve validation errors for; or ":"检索验证错误的属性名称； 或者"," object that represents the type of the local variable.":"代表本地变量类型的对象。","Values for the named fields of the custom attribute.":"自定义属性的命名字段的值。","The string to be printed.":"要打印的字符串。","The declared local variable.":"声明为本地变量。","Named properties of the custom attribute.":"自定义属性的命名属性。"," to pin the object in memory; otherwise, ":"将对象固定在内存中； 否则，","The label for which to set an index.":"设置索引的标签。","Values for the named properties of the custom attribute.":"自定义属性的命名属性的值。","The class of the type of exception to throw.":"投掷的例外类型类别。"," object that represents the local variable.":"代表局部变量的对象。"," object that represents the exception.":"代表异常的对象。","A new label that can be used as a token for branching.":"可以用作分支的代币的新标签。","The namespace to be used in evaluating locals and watches for the current active lexical scope.":"用于评估当前活动词汇范围的当地人和手表的名称空间。"," instead of an array of types. If none of the arguments have required custom modifiers, specify ":"而不是一系列类型。 如果没有参数需要自定义修饰符，请指定","The Microsoft Intermediate Language (MSIL) instruction to be put onto the stream.":"Microsoft中级语言（MSIL）指令将放在流上。"," instead of an array of arrays.":"而不是一系列数组。","The offset in the MSIL stream at which the next instruction will be emitted.":"将发出下一个指令的MSIL流中的偏移。","The MSIL instruction to be put onto the stream.":"将MSIL指令放在流上。","An array of arrays of types. Each array of types represents the optional custom modifiers for the corresponding argument, such as ":"一系列类型数组。 每个类型的每个数组代表相应参数的可选自定义修饰符，例如","The object to compare with this ":"与此相比的对象","The character argument pushed onto the stream immediately after the instruction.":"指令后，角色参数立即推向流。","The subprotocol that was negotiated during the opening handshake.":"在开放握手期间协商的子协议。",". If a particular argument has no optional custom modifiers, specify ":"。 如果特定参数没有可选的自定义修饰符，请指定"," and is equal to this object; otherwise, ":"并等于这个对象； 否则，"," instead of an array of types. If none of the arguments have optional custom modifiers, specify ":"而不是一系列类型。 如果这些参数都没有可选的自定义修饰符，请指定"," received.":"已收到。","The MSIL instruction to be put onto the stream. Defined in the ":"将MSIL指令放在流上。 定义在","The native error code for the exception.":"异常的本机错误代码。"," if the value of ":"如果价值","One of the enumeration values that indicates whether the current message is a UTF-8 message or a binary message.":"指示当前消息是UTF-8消息还是二进制消息的枚举值之一。","The object with which this instance should be compared.":"应该比较此实例的对象。","The numerical argument pushed onto the stream immediately after the instruction.":"指令后立即将数值参数推向流。"," if the given object is a ":"如果给定的对象是一个","Indicates the previous exception that led to the current exception.":"指示导致当前异常的先前例外。"," is equal to the value of the current instance; otherwise, ":"等于当前实例的值； 否则，"," to indicate the messsage has been received completely; otherwise, ":"指出该消息已完全收到； 否则，","The MSIL instruction to be emitted onto the stream.":"邮件指令将发出到流中。"," and represents the same signature; otherwise, ":"并表示相同的签名； 否则，","The description of the error.":"错误的描述。"," if the message was received completely; otherwise, ":"如果完全收到消息； 否则，","A hash code for this instance.":"此实例的哈希代码。"," argument pushed onto the stream immediately after the instruction.":"指令后立即将参数推到流上。","The dynamic module that contains the field for which the ":"包含包含该字段的动态模块","The error from the WebSocketError enumeration.":"Websocketerror枚举的错误。"," if the object referred to by the local variable is pinned in memory; otherwise, ":"如果将本地变量引用的对象固定在内存中； 否则，","One of the enumeration values that specifies if the current message is a UTF-8, binary, or close message.":"指定当前消息是UTF-8，二进制或关闭消息的枚举值之一。"," representing a constructor.":"代表构造函数。"," is requested.":"请求。","A SerializationInfo object.":"一个序列化对象。","An integer value that represents the order of declaration of the local variable within the method body.":"代表方法主体内局部变量声明顺序的整数值。","Indicates the reason for closing the WebSocket connection.":"指示关闭WebSocket连接的原因。","The type of message that was received.":"收到的消息类型。","The label to which to branch from this location.":"从该位置分支到的标签。"," object for a field.":"字段的对象。"," of the local variable.":"局部变量。","Specifies a human readable explanation as to why the connection is closed.":"指定人类可读的解释，说明为什么连接是关闭的。","Indicates whether this is the final message.":"指示这是否是最终消息。","The default value of this parameter.":"此参数的默认值。","The array of label objects to which to branch from this location. All of the labels will be used.":"从该位置分支到的标签对象的数组。 所有标签将使用。","The hash code based on the name.":"基于名称的哈希代码。","The token that can be used to propagate notification that operations should be canceled.":"可用于传播通知的令牌，应取消操作。","A byte blob representing the attributes.":"代表属性的字节斑点。","Indicates the ":"指示","A local variable.":"局部变量。"," for a local variable.":"对于本地变量。","An instance of a helper class to define the custom attribute.":"助手类的实例来定义自定义属性。","Allows applications to specify a human readable explanation as to why the connection is closed.":"允许应用程序指定人类可读的解释，说明为什么连接关闭。","A helper for constructing a signature token.":"用于构建签名令牌的助手。","An array of arrays of types. Each array of types represents the required custom modifiers for the corresponding argument of the property. If a particular argument has no required custom modifiers, specify ":"一系列类型数组。 每个类型的数组代表该属性相应参数所需的自定义修饰符。 如果特定参数没有必需的自定义修饰符，请指定","Read-only. Retrieves the attributes for this parameter.":"只读。 检索此参数的属性。","The dynamic module that contains the local variable for which the ":"包含局部变量的动态模块","The size, in bytes, of the send buffer.":"发送缓冲区的大小，字节。"," representing a field.":"代表一个字段。"," instead of an array of types. If the property has no arguments, or if none of the arguments have required custom modifiers, specify ":"而不是一系列类型。 如果该属性没有参数，或者没有参数需要自定义修饰符，请指定","Read-only. Retrieves whether this is an input parameter.":"只读。 检索这是否是输入参数。"," object for a local variable.":"局部变量的对象。"," representing a method.":"代表方法。","Read-only. Specifies whether this parameter is optional.":"只读。 指定此参数是否是可选的。","An array with the client buffers.":"带有客户端缓冲区的数组。","An array of arrays of types. Each array of types represents the optional custom modifiers for the corresponding argument of the property. If a particular argument has no optional custom modifiers, specify ":"一系列类型数组。 每个类型的数组代表该属性相应参数的可选自定义修饰符。 如果特定参数没有可选的自定义修饰符，请指定","The calling convention of the method.":"该方法的呼叫约定。","Read-only. Retrieves whether this parameter is an output parameter.":"只读。 检索此参数是否为输出参数。","The number of bytes in the signature.":"签名中的字节数。","The return type of the method, or ":"该方法的返回类型，或"," to be emitted.":"发出。"," instead of an array of types. If the property has no arguments, or if none of the arguments have optional custom modifiers, specify ":"而不是一系列类型。 如果该属性没有参数，或者没有参数具有可选的自定义修饰符，请指定","The MSIL instruction to be emitted onto the stream. Must be ":"邮件指令将发出到流中。 一定是"," for a void return type (":"对于void返回类型（"," object representing the dynamic method for which the current ":"代表当前的动态方法的对象","Read-only. Retrieves the name of this parameter.":"只读。 检索此参数的名称。"," object for a property.":"属性的对象。"," method to be called.":"被调用的方法。"," object is generating code.":"对象正在生成代码。"," procedure in Visual Basic).":"视觉基础中的过程）。","Read-only. Retrieves the signature position for this parameter.":"只读。 检索此参数的签名位置。","The argument types, or ":"参数类型，或","The name of the dynamic method. This can be a zero-length string, but it cannot be ":"动态方法的名称。 这可以是零长度的字符串，但不能是","The types of the optional arguments if the method is a ":"如果该方法为一个，则可选参数的类型"," object for a method.":"方法的对象。","A byte array made up of the full signature.":"由完整签名组成的字节阵列。","The type of the argument.":"参数的类型。","The managed calling convention to be used.":"要使用的设施呼叫约定。","A string representing the arguments of this signature.":"一个代表此签名的参数的字符串。"," values that specifies the attributes of the dynamic method. The only combination allowed is ":"指定动态方法属性的值。 允许的唯一组合是"," that contains the method for which the ":"其中包含了这样的方法","The argument type.":"参数类型。","An array that contains the signature.":"包含签名的数组。","The types of the arguments of the method, or ":"该方法的参数类型，或","The calling convention for the dynamic method. Must be ":"动态方法的呼叫约定。 一定是"," of the result.":"结果。"," if the argument is pinned; otherwise, ":"如果争论被固定； 否则，","A token that can be embedded in the metadata and the MSIL stream for the associated dynamic method.":"可以嵌入元数据和MSIL流的令牌，以进行相关的动态方法。","The types of the required arguments to the instruction.":"指令所需的参数的类型。"," if the method has no arguments.":"如果该方法没有参数。"," object that specifies the return type of the dynamic method, or ":"指定动态方法的返回类型的对象，或","An array of types representing the required custom modifiers for the argument, such as ":"代表参数所需的自定义修饰符的一系列类型，例如","The dynamic method to call.":"要呼叫的动态方法。","The types of the optional arguments for ":"可选论证的类型"," if the method has no return type.":"如果该方法没有返回类型。"," that contains the property for which the ":"其中包含了",". If the argument has no required custom modifiers, specify ":"。 如果参数没有必要的自定义修饰符，请指定","A token that can be embedded in the MSIL stream for the associated dynamic method, as the target of an MSIL instruction.":"可以嵌入MSIL流的代币作为相关的动态方法，作为MSIL指令的目标。"," calls.":"呼叫。","An array of types representing the optional custom modifiers for the argument, such as ":"代表参数可选自定义修饰符的类型数组，例如"," objects specifying the types of the parameters of the dynamic method, or ":"对象指定动态方法的参数类型，或","The calling convention of the property accessors.":"财产访问者的呼叫约定。","A token that can be used as the operand of an MSIL instruction that accesses fields, in the scope of the current ":"可以用作访问字段的MSIL指令的操作数，以当前的范围","The unmanaged calling convention to be used.":"使用的非召集约定要使用。"," if the method has no parameters.":"如果该方法没有参数。",". If the argument has no optional custom modifiers, specify ":"。 如果参数没有可选的自定义修饰符，请指定","The local variable whose value is to be written to the console.":"该值将写入控制台的本地变量。","The generic type the field belongs to.":"该字段属于的通用类型。","The property type.":"属性类型。"," representing the module with which the dynamic method is to be logically associated.":"代表与该模块在逻辑上关联的模块。","The types of the arguments to be added.":"要添加参数的类型。","The field whose value is to be written to the console.":"价值将写入控制台的字段。","An array of types representing the required custom modifiers for the return type, such as ":"代表返回类型所需的自定义修饰符的类型数组，例如","A token that can be used as the operand of an MSIL instruction that accesses fields in the scope of the current ":"一个可以用作MSIL指令的操作数的令牌，该操作数可以访问当前范围"," to skip JIT visibility checks on types and members accessed by the MSIL of the dynamic method; otherwise, ":"跳过JIT可见性检查动态方法的MSIL访问的类型和成员； 否则，","An array of arrays of types. Each array of types represents the required custom modifiers for the corresponding argument, such as ":"一系列类型数组。 每个类型的每个数组代表相应参数所需的自定义修饰符，例如","The method to be accessed.":"要访问的方法。",". If the return type has no required custom modifiers, specify ":"。 如果返回类型没有必需的自定义修饰符，请指定"," with which the dynamic method is logically associated. The dynamic method has access to all members of the type.":"动态方法在逻辑上与之相关。 动态方法可以访问该类型的所有成员。","The size of the MSIL stream, in bytes.":"MSIL流的大小，字节。",". If a particular argument has no required custom modifiers, specify ":"。 如果特定参数没有必需的自定义修饰符，请指定","A token that can be used as the operand of an MSIL instruction that accesses methods, such as ":"可以用作访问方法的MSIL指令的操作数，例如"," to skip JIT visibility checks on types and members accessed by the MSIL of the dynamic method, with this restriction: the trust level of the assemblies that contain those types and members must be equal to or less than the trust level of the call stack that emits the dynamic method; otherwise, ":"要跳过Dynamic方法的MSIL访问的类型和成员的可见性检查，并具有此限制：包含这些类型和成员的组件的信任级别必须等于或小于或小于发出的呼叫堆栈的信任级别 动态方法； 否则，","A collection that contains the attributes of the assembly.":"包含组件属性的集合。","An array of types representing the optional custom modifiers for the return type, such as ":"代表返回类型的可选自定义修饰符的类型数组，例如"," object for the method, with the specified MSIL stream size.":"该方法的对象，带有指定的MSIL流大小。","The name of the dynamic module.":"动态模块的名称。",", in the scope of the current ":"，在电流范围"," values representing the implementation flags for the method.":"代表该方法实现标志的值。"," to skip JIT visibility checks on types and members accessed by the MSIL of the dynamic method.":"跳过JIT可见性检查动态方法的MSIL访问的类型和成员。",". If the return type has no optional custom modifiers, specify ":"。 如果返回类型没有可选的自定义修饰符，请指定"," representing the defined dynamic module.":"表示定义的动态模块。","The method.":"方法。","A delegate type whose signature matches that of the dynamic method.":"其签名匹配动态方法的委托类型。","The types of the property's arguments, or ":"财产论证的类型，或"," objects that represent the parameters of the dynamic method.":"代表动态方法参数的对象。","An object to compare with this instance, or ":"与此实例进行比较的对象，或","The generic type the method belongs to.":"该方法属于的通用类型。"," if the property has no arguments.":"如果该物业没有参数。","A delegate of the specified type, which can be used to execute the dynamic method.":"指定类型的委托，可用于执行动态方法。","This argument is ignored for objects of this type.":"对于此类型的对象，忽略了此参数。","This parameter is ignored for dynamic methods, because they are static. Specify ":"对于动态方法而言，此参数被忽略，因为它们是静态的。 指定","The type to be used.":"要使用的类型。","An array that contains the custom attributes; the array is empty if there are no attributes.":"包含自定义属性的数组； 如果没有属性，则数组为空。","A token that can be used as the operand of an MSIL instruction that requires a type, in the scope of the current ":"可以用作需要类型的MSIL指令的操作数的令牌","A delegate type whose signature matches that of the dynamic method, minus the first parameter.":"签名类型的签名类型匹配动态方法的签名类型，减去第一个参数。","The name of the dynamic assembly.":"动态组件的名称。"," object that enables the binding, coercion of argument types, invocation of members, and retrieval of ":"可以实现绑定，强制参数类型，调用成员的对象以及检索","The base type from which attributes derive.":"属性得出的基本类型。","The string to be used.":"要使用的字符串。","An array of assembly names for the referenced assemblies. This array is not a complete list.":"引用组件的一系列装配名称。 此数组不是完整的列表。","An object the delegate is bound to. Must be of the same type as the first parameter of the dynamic method.":"代表绑定的对象。 必须与动态方法的第一个参数相同。"," objects through reflection. If ":"通过反射对象。 如果","A token that can be used as the operand of an MSIL instruction that requires a string, in the scope of the current ":"在当前的范围内，可以用作需要字符串的MSIL指令的操作数的令牌","The specified culture.":"指定的文化。","An array that contains the custom attributes that are derived at any level from ":"一个包含从任何级别派生的自定义属性的数组","A delegate of the specified type, which can be used to execute the dynamic method with the specified target object.":"指定类型的委托，可用于用指定目标对象执行动态方法。",", the default binder is used. For more details, see ":"，使用默认的粘合剂。 有关更多详细信息，请参阅","A pointer to a byte array containing the MSIL stream.":"指向包含MSIL流的字节数组的指针。","The specified satellite assembly.":"指定的卫星组件。","; the array is empty if there are no such attributes.":"; 如果没有此类属性，则数组为空。","The position of the parameter in the parameter list. Parameters are indexed beginning with the number 1 for the first parameter.":"参数列表中参数的位置。 参数是从第一个参数开始的数字1开始的。","An argument list. This is an array of arguments with the same number, order, and type as the parameters of the method to be invoked. If there are no parameters this parameter should be ":"一个参数列表。 这是一个参数数组，具有相同的数字，顺序和类型与要调用的方法的参数。 如果没有参数，则该参数应为","The number of bytes in the MSIL stream.":"MSIL流中的字节数。","The version of the satellite assembly.":"卫星组件的版本。","A generic list of ":"通用列表"," used to govern the coercion of types. If this is ":"用于管理类型的强制。 如果是"," values that specifies the attributes of the parameter.":"指定参数属性的值。","The name of the type to search for.":"要搜索的类型的名称。","The maximum number of items on the operand stack when the method is executing.":"该方法执行时操作数堆栈上的最大项目数。"," objects representing data about the attributes that have been applied to the current module.":"代表有关已应用于当前模块的属性的数据。","The name of the parameter. The name can be a zero-length string.":"参数的名称。 该名称可以是零长度字符串。"," for the current thread is used. For example, this information is needed to correctly convert a ":"用于当前线程。 例如，需要此信息才能正确转换","An array that contains the MSIL stream.":"包含MSIL流的数组。","The name of the requested dynamic module.":"请求的动态模块的名称。"," to throw an exception if the type is not found; otherwise, ":"如果找不到类型，请引发例外； 否则，"," that represents 1000 to a ":"代表1000","The base implementation of the method.":"该方法的基本实现。","A pointer to a byte array containing the exception metadata.":"指向包含异常元数据的字节阵列的指针。","A ModuleBuilder object representing the requested dynamic module.":"代表所请求的动态模块的模块构成对象。"," to ignore the case of the type name when searching; otherwise, ":"搜索时忽略类型名称的情况； 否则，"," value, because 1000 is represented differently by different cultures.":"价值，因为1000的代表不同。"," to search the method's inheritance chain to find the custom attributes; ":"搜索该方法的继承链以查找自定义属性；","The number of bytes of exception metadata.":"异常元数据的字节数。"," containing the exported types defined in this assembly.":"包含此组件中定义的导出类型。","The specified type, or ":"指定类型，或"," to check only the current method.":"仅检查当前方法。"," containing the return value of the invoked method.":"包含调用方法的返回值。","An array that contains the exception metadata.":"包含异常元数据的数组。"," if the type is not found or has not been created yet.":"如果未找到或尚未创建类型。","The name of the specified file.":"指定文件的名称。","An array that contains the layout of local variables for the associated ":"一个包含关联的本地变量布局的数组","An array of objects representing all the custom attributes of the method.":"代表该方法的所有自定义属性的对象数组。"," representing the type of custom attribute to search for.":"表示要搜索的自定义属性类型。","The type of attribute to test for.":"测试的属性类型。"," for the specified file, or ":"对于指定的文件或"," representing the type of custom attribute to return.":"表示要返回的自定义属性的类型。"," if one or more instances of ":"如果一个或多个实例"," if the specified custom attribute type is defined; otherwise, ":"如果定义了指定的自定义属性类型； 否则，","An array that represents the parameters of this constructor.":"代表该构造函数的参数的数组。","An array of objects representing the attributes of the method that are of type ":"代表该方法的属性的一系列对象类型的属性",", if the file is not found.":"，如果找不到文件。","The object that needs to be reinitialized.":"需要重新初始化的对象。"," is applied to this dynamic assembly; otherwise, ":"应用于此动态组件； 否则，","A string representing the method signature.":"表示方法签名的字符串。"," or derive from type ":"或源自类型"," to include resource modules; otherwise, ":"包括资源模块； 否则，","The location of the assembly, as specified originally.":"按照最初指定的组件位置。"," values that specifies the type of binding that is desired.":"指定所需绑定类型的值。"," values representing the attributes for the method.":"代表该方法属性的值。"," object that can be used to generate a method body from metadata tokens, scopes, and MSIL streams.":"可用于从元数据，范围和MSIL流中生成方法主体的对象。","The loaded modules that are part of this assembly.":"是该组件的一部分的加载模块。"," values that indicates the calling convention of the method.":"表示该方法的调用惯例的值。","The entry point of this assembly.":"此组件的入口点。"," that defines a set of properties and enables the binding, coercion of argument types, and invocation of members using reflection. If ":"这定义了一组属性，并实现了使用反射的绑定，强制性的胁迫和成员的调用。 如果","The name of the resource.":"资源的名称。"," object for the method.":"该方法的对象。","The display name of the dynamic assembly.":"动态组件的显示名称。"," if the local variables in the method are zero-initialized; otherwise, ":"如果该方法中的局部变量被零定位； 否则，",", then Binder.DefaultBinding is used.":"，然后使用binder.defaultbinding。","The name of the static field.":"静态字段的名称。"," populated with information about the resource's topology, or ":"填充有关资源拓扑的信息，或","The constant value of the literal.":"字面的恒定价值。"," if the current dynamic method is security-critical or security-safe-critical; ":"如果当前的动态方法是安全至关重要的或安全的，则；","A value that indicates the host context where the dynamic assembly is being created.":"指示创建动态组件的主机上下文的值。","An argument list. This is an array of arguments with the same number, order, and type as the parameters of the constructor to be invoked. If there are no parameters, this should be a null reference (":"一个参数列表。 这是一个参数数组，具有相同的数字，顺序和类型，与要调用的构造函数的参数。 如果没有参数，则应该是null引用（"," if the resource is not found.":"如果找不到资源。"," if this dynamic assembly is held in a collectible ":"如果这种动态组装在收藏中举行"," if it is transparent.":"如果是透明的。","The defined field.":"定义的字段。"," containing the names of all the resources.":"包含所有资源的名称。"," used to govern the coercion of types. If this is null, the ":"用于管理类型的强制。 如果这是无效的，"," : ":"：","The location of the loaded file that contains the manifest. If the loaded file has been shadow-copied, the ":"包含清单的加载文件的位置。 如果已加载的文件已被遮盖，则"," if the dynamic method is security-safe-critical at the current trust level; ":"如果动态方法在当前信托级别上是安全安全的；"," for the current thread is used.":"用于当前线程。","The name of the manifest resource being requested.":"要请求的清单资源的名称。","Returns an array of ":"返回一系列"," is that of the file before being shadow-copied.":"是在被阴影播放之前的文件。"," representing this manifest resource.":"代表此清单资源。"," if it is security-critical or transparent.":"如果是至关重要的或透明的。","An instance of the class associated with the constructor.":"与构造函数关联的类的实例。"," if the dynamic method is security-transparent at the current trust level; otherwise, ":"如果动态方法在当前信任级别是安全透明的； 否则，","The type whose namespace is used to scope the manifest resource name.":"其名称空间用于范围范围的类型。","The manifest module.":"清单模块。","This must be a bit flag from ":"这一定是来自"," objects representing the specified constructors defined for this class. If no constructors are defined, an empty array is returned.":" 表示为此类定义的指定构造函数的对象。 如果未定义构造函数，则返回空数组。","The name of the requested module.":"请求的模块的名称。",", such as InvokeMethod, NonPublic, and so on.":"，例如InvokeMethod，非公共等等。","Not supported for dynamic methods.":"不支持动态方法。"," if the dynamic assembly is in the reflection-only context; otherwise, ":"如果动态组件在仅反射的上下文中； 否则，","The module being requested, or ":"请求的模块，或","Specifies whether to search this member's inheritance chain to find the attributes.":"指定是否搜索此成员的继承链以找到属性。","An object that enables the binding, coercion of argument types, invocation of members, and retrieval of ":"一个可以实现绑定，强制参数类型，调用成员的对象以及检索"," with which the current dynamic method is associated.":"与当前动态方法相关联。"," if the module is not found.":"如果找不到模块。","The attributes of the parameter.":"参数的属性。","Returns an array of objects representing all the custom attributes of the constructor represented by this ":"返回一系列对象，代表由此表示的构造函数的所有自定义属性","The simple name of the method.":"该方法的简单名称。"," objects using reflection. If binder is ":"使用反射对象。 如果是活页夹","The name of the parameter. The name can be the null string.":"参数的名称。 名称可以是空字符串。",", the default binder is used. See ":"，使用默认的粘合剂。 看"," object to which the custom attributes are applied.":"应用自定义属性的对象。"," representing the type of the return value of the current method; ":"表示当前方法的返回值的类型；","The modules that are part of this assembly.":"是该组件的一部分的模块。","Returns an array of objects representing the attributes of this constructor that are of ":"返回代表该构造函数的一系列对象"," to set the code base to the location of the assembly after it is shadow-copied; ":"将代码底座设置为组件的位置，之后它被遮盖了阴影；","An argument list. This is an array of arguments with the same number, order, and type as the parameters of the constructor to be invoked. If there are no parameters this should be ":"一个参数列表。 这是一个参数数组，具有相同的数字，顺序和类型，与要调用的构造函数的参数。 如果没有参数，应该是"," representing the custom attributes of the return type for the dynamic method.":"表示动态方法的返回类型的自定义属性。"," to set the code base to the original location.":"将代码库设置为原始位置。"," for the current thread is used. (For example, this is necessary to convert a ":"用于当前线程。 （例如，这是必要的","An object that represents the new parameter of this constructor.":"表示此构造函数的新参数的对象。","The access rights of the assembly.":"大会的访问权。","This method is not supported. No value is returned.":"不支持此方法。 没有返回值。"," objects representing the public and non-public members declared or inherited by this type. An empty array is returned if there are no matching members.":"代表该类型声明或继承的公共和非公共成员的对象。 如果没有匹配的成员，则返回一个空数组。","Controls inheritance of custom attributes from base classes. This parameter is ignored.":"控制基本类自定义属性的继承。 此参数被忽略。"," value, since 1000 is represented differently by different cultures.)":"价值，因为不同文化的1000表示不同。）","An object that represents the new assembly.":"代表新组件的对象。","An array of objects representing all the custom attributes of the constructor represented by this ":"代表此构造函数的所有自定义属性的对象数组","The value returned by the invoked constructor.":"调用构造函数返回的值。","A member of ":"一个成员","The custom attribute type.":"自定义属性类型。"," that specifies the type of binding that is desired (for example, IBinder.CreateInstance, IBinder.ExactBinding).":"这指定了所需的绑定类型（例如，ibinder.createinstance，ibinder.exbinding）。","A custom attribute type.":"自定义属性类型。","The underlying type.":"底层类型。","An object array that represents the attributes of this constructor.":"代表该构造函数的属性的对象数组。","A set of properties and enabling for binding, coercion of argument types, and invocation of members using reflection. If binder is null, then IBinder.DefaultBinding is used.":"使用反射的一组属性和启用绑定，胁迫类型的胁迫和成员调用。 如果粘合剂为null，则使用ibinder.defaultbinding。","The method implementation flags.":"方法实现标志。","The name of the event to get.":"要获得的事件的名称。"," object for this constructor.":"此构造函数的对象。","The software preferences of a particular culture.":"特定文化的软件偏好。","A string containing the name, attributes, and exceptions of this constructor, followed by the current Microsoft intermediate language (MSIL) stream.":"包含该构造函数的名称，属性和例外的字符串，然后是当前的Microsoft中间语言（MSIL）流。"," for this constructor.":"对于这个构造函数。","This invocation attribute. This must be a bit flag from ":"此调用属性。 这一定是来自","The attributes of this field.":"该领域的属性。","The attributes for this constructor.":"该构造函数的属性。","The method implementation flags for this constructor.":"该构造函数的方法实现标志。"," object representing the event declared or inherited by this type with the specified name. If there are no matches, ":"代表该类型所声明或继承的事件的对象，并带有指定名称。 如果没有比赛，"," object for the type that declares this field.":"宣布此字段的类型的对象。"," if the declaring type is generic; otherwise, ":"如果声明类型是通用的； 否则，","The internal metadata handle for this field.":"该字段的内部元数据手柄。"," objects representing the public events declared or inherited by this type. An empty array is returned if there are no public events.":"代表此类声明或继承的公共事件的对象。 如果没有公共事件，将返回一个空阵列。","The type that declares this member.":"声明此成员的类型。"," object that represents the type of this field.":"代表此字段类型的对象。",", such as ":"， 如","Read/write. Gets or sets whether the local variables in this constructor should be zero-initialized.":"读/写。 获取或设置该构造函数中的局部变量是否应为零。"," that represents the dynamic module in which this field is being defined.":"这代表了该字段的定义动态模块。"," objects representing the public and non-public events declared or inherited by this type. An empty array is returned if there are no events, as specified.":"代表这种类型声明或继承的公共事件和非公共事件的对象。 如果没有指定的事件，则返回一个空数组。","An integer token that identifies the current module in metadata.":"一个识别元数据中当前模块的整数令牌。","The name of the field to get.":"要获得的字段名称。"," containing the name of this field.":"包含此字段的名称。","The internal handle for the method. Use this handle to access the underlying metadata handle.":"方法的内部句柄。 使用此句柄来访问基础元数据句柄。"," object from which this instance was obtained.":"从中获得此实例的对象。","Returns the ":"返回","The object to be compared with the current instance.":"将对象与当前实例进行比较。"," object that represents the dynamic module in which this constructor is defined.":"代表定义该构造函数的动态模块的对象。"," object representing the field declared or inherited by this type with the specified name and public or non-public modifier. If there are no matches, then null is returned.":"代表该类型声明或继承的字段的对象，并用指定的名称以及公共或非公开修饰符。 如果没有匹配项，则返回空。"," and equals the current instance; otherwise, ":"并等于当前实例； 否则，","The name of this constructor.":"该构造函数的名称。"," objects representing the public and non-public fields declared or inherited by this type. An empty array is returned if there are no fields, as specified.":"代表这种类型声明或继承的公共和非公共字段的对象。 如果没有指定的字段，则返回一个空数组。","Not supported for incomplete generic type parameters.":"不支持不完整的通用类型参数。"," object from which this object was obtained.":"从中获得此对象的对象。","The name of the interface.":"接口的名称。"," object for this enum.":"此枚举的对象。","The type of attribute to search for. Only attributes that are assignable to this type are returned.":"搜索属性的类型。 仅返回可分配给此类型的属性。",", the search is case-insensitive. If ":"，搜索是不敏感的。 如果","An object that represents this enumeration.":"代表这种枚举的对象。","The type referred to by the current array type, pointer type, or ":"当前数组类型，指针类型或",", the search is case-sensitive.":"，搜索对病例敏感。"," type; or ":"类型; 或者"," object representing the implemented interface. Returns null if no interface matching name is found.":"代表实现接口的对象。 如果找不到接口匹配名称，则返回null。"," if the current type is not an array type, is not a pointer type, and is not passed by reference.":"如果当前类型不是数组类型，则不是指针类型，也不是通过引用传递的。","The type of the interface for which the interface mapping is to be retrieved.":"要检索接口映射的接口类型。","Not valid for generic type parameters.":"对于通用类型参数无效。","The requested interface mapping.":"请求的接口映射。","A 32-bit integer hash code.":"32位整数哈希代码。"," objects representing the implemented interfaces. If none are defined, an empty array is returned.":"代表实现接口的对象。 如果没有定义，则返回一个空数组。"," to search without regard for case; ":"搜索而无需考虑案件；","The type of member that is to be returned.":"要退还的成员类型。"," to make a case-sensitive search.":"进行案例敏感的搜索。"," objects representing the public and non-public members defined on this type if ":"代表公众和非公共成员在此类型上定义的对象"," object that represents the interface type for which the mapping is to be retrieved.":"代表要检索映射的接口类型的对象。"," is used; otherwise, only the public members are returned.":"用来; 否则，仅退还公共成员。"," object that represents the type of a one-dimensional array whose element type is the generic type parameter.":"代表其元素类型的一维数组类型的对象。","The number of dimensions for the array.":"数组的尺寸数。"," object that represents the type of an array whose element type is the generic type parameter, with the specified number of dimensions.":"代表其元素类型的数组类型的对象是通用类型参数，其中指定的尺寸数。"," object that represents the current generic type parameter when passed as a reference parameter.":"代表当前通用类型参数作为参考参数时的对象。","An array of type arguments.":"一系列类型参数。","This method is invalid for incomplete generic type parameters.":"对于不完整的通用类型参数，此方法无效。"," object that represents a pointer to the current generic type parameter.":"代表指向当前通用类型参数的指针的对象。"," that must be inherited by any type that is to be substituted for the type parameter.":"必须用任何类型的类型继承来代替类型参数。","A byte blob representing the attribute.":"代表属性的字节斑点。","An instance of a helper class that defines the custom attribute.":"定义自定义属性的助手类的实例。"," values that represent the variance characteristics and special constraints of the generic type parameter.":"代表通用类型参数的方差特征和特殊约束的值。"," objects that represent the interfaces a type must implement in order to be substituted for the type parameter.":"代表接口的对象必须实现类型才能替换为类型参数。","A string that contains the name of the generic type parameter.":"包含通用类型参数名称的字符串。"," object representing the dynamic assembly that contains the generic type definition the current type parameter belongs to.":"代表包含当前类型参数属于的通用类型定义的动态组件的对象。"," in Visual Basic) in all cases.":"在所有情况下）。"," object that represents the base type constraint of the generic type parameter, or ":"代表通用类型参数的基本类型约束的对象，或"," if the type parameter has no base type constraint.":"如果类型参数没有基本类型约束。"," that represents the declaring method, if the current ":"这代表声明方法，如果当前"," represents a type parameter of a generic method; otherwise, ":"表示通用方法的类型参数； 否则，","If the type parameter belongs to a generic type, a ":"如果类型参数属于通用类型，则"," object representing that generic type; if the type parameter belongs to a generic method, a ":"代表该通用类型的对象； 如果类型参数属于通用方法，则"," object representing that type that declared that generic method.":"代表声明该通用方法的该类型的对象。","A bitwise combination of values that describes the covariance and special constraints of the current generic type parameter.":"描述当前通用类型参数的协方差和特殊约束的值的比值组合。","The position of the type parameter in the type parameter list of the generic type or method that declared the parameter.":"类型参数在声明参数的通用类型或方法的类型参数列表中的位置。"," object that represents the dynamic module that contains the generic type parameter.":"代表包含通用类型参数的动态模块的对象。","The name of the generic type parameter.":"通用类型参数的名称。"," object that was used to obtain the ":"用于获得的对象","An array of strings that represent the names of the generic type parameters.":"代表通用类型参数名称的一系列字符串。"," objects representing the type parameters of the generic method.":"代表通用方法的类型参数的对象。","The position of the parameter in the parameter list. Parameters are indexed beginning with the number 1 for the first parameter; the number 0 represents the return value of the method.":"参数列表中参数的位置。 参数是从第一个参数开始的数字1开始的。 数字0表示该方法的返回值。","The parameter attributes of the parameter.":"参数的参数属性。"," object that represents a parameter of this method or the return value of this method.":"代表此方法参数或该方法的返回值的对象。"," is used; otherwise, only the public methods are returned.":"用来; 否则，仅返回公共方法。"," containing the name of the nested type to get.":"包含要获取的嵌套类型的名称。","A bitmask comprised of one or more ":"一个由一个或多个组成"," that specify how the search is conducted.  \n  \n -or-  \n  \n Zero, to conduct a case-sensitive search for public methods.":"这说明了如何进行搜索。 \n  \n  -或者- \n  \n  零，以对公共方法进行病例敏感性搜索。"," object representing the nested type that matches the specified requirements, if found; otherwise, ":"代表与指定要求相匹配的嵌套类型的对象（如果找到）； 否则，"," objects representing all the types nested within the current ":"代表当前嵌套的所有类型的对象"," that match the specified binding constraints.  \n  \n An empty array of type ":"匹配指定的绑定约束。 \n  \n  一个空类型",", if no types are nested within the current ":"，如果没有类型嵌套在当前",", or if none of the nested types match the binding constraints.":"，或者如果嵌套类型都不匹配绑定约束。"," objects representing the public and non-public properties defined on this type if ":"代表该类型上定义的公共和非公共属性的对象，如果"," is used; otherwise, only the public properties are returned.":"用来; 否则，仅返回公共属性。","The name of the member to invoke. This can be a constructor, method, property, or field. A suitable invocation attribute must be specified. Note that it is possible to invoke the default member of a class by passing an empty string as the name of the member.":"调用成员的名字。 这可以是构造函数，方法，属性或字段。 必须指定合适的调用属性。 请注意，可以通过将空字符串作为成员的名称来调用类的默认成员。","The invocation attribute. This must be a bit flag from ":"调用属性。 这一定是来自","The object on which to invoke the specified member. If the member is static, this parameter is ignored.":"调用指定成员的对象。 如果成员是静态的，则将忽略此参数。","An argument list. This is an array of objects that contains the number, order, and type of the parameters of the member to be invoked. If there are no parameters this should be null.":"一个参数列表。 这是包含要调用的成员参数的数字，顺序和类型的对象数组。 如果没有参数，则应该为null。","An array of the same length as ":"与相同长度的数组"," with elements that represent the attributes associated with the arguments of the member to be invoked. A parameter has attributes associated with it in the metadata. They are used by various interoperability services. See the metadata specs for details such as this.":"用代表与要调用的成员参数相关的属性的元素。 一个参数具有与其在元数据中关联的属性。 它们由各种互操作服务使用。 有关此类详细信息，请参见元数据规格。"," for the current thread is used. (Note that this is necessary to, for example, convert a string that represents 1000 to a double value, since 1000 is represented differently by different cultures.)":"用于当前线程。 （请注意，这是例如，对于一个将1000代表1000转换为双重值的字符串是必要的，因为1000通过不同的文化表示不同。）","Each parameter in the ":"每个参数"," array gets the value in the corresponding element in the ":"数组在相应元素中获取值"," array. If the length of ":"大批。 如果长度"," is greater than the length of ":"大于长度",", the remaining argument values are passed in order.":"，其余的参数值按顺序传递。","Returns the return value of the invoked member.":"返回调用成员的返回值。"," can be assigned to this object; otherwise, ":"可以分配给此对象； 否则，"," if one or more instance of ":"如果一个或多个实例"," is defined on this member; otherwise, ":"在此成员上定义； 否则，"," object representing a one-dimensional array of the current type, with a lower bound of zero.":"代表当前类型的一维数组的对象，其下限为零。","The number of dimensions for the array. This number must be less than or equal to 32.":"数组的尺寸数。 该数字必须小于或等于32。","An object representing an array of the current type, with the specified number of dimensions.":"代表当前类型数组的对象，具有指定数量的尺寸。"," object that represents the current type when passed as a ref parameter (ByRef parameter in Visual Basic).":"代表当前类型作为REF参数（Visual Basic中的BYREF参数）时的对象。"," object that represents a pointer to the current type.":"代表指向当前类型的指针的对象。","Read-only. The dynamic assembly that contains this enum definition.":"只读。 包含此枚举定义的动态组件。","Read-only. The full path of this enum qualified by the display name of the parent assembly.":"只读。 该枚举的完整路径由父件的显示名称资格。","Read-only. The parent ":"只读。 父母"," of this type.":"这种类型。","Read-only. The type that declared this ":"只读。 宣布此的类型","Read-only. The full path of this enum.":"只读。 这个枚举的完整道路。","Read-only. The GUID of this enum.":"只读。 这个枚举的指导。"," if this object represents a constructed generic type; otherwise, ":"如果此对象表示构造的通用类型； 否则，","Read-only. The dynamic module that contains this ":"只读。 包含此的动态模块"," definition.":"定义。","Read-only. The name of this enum.":"只读。 这个枚举的名称。","Read-only. The namespace of this enum.":"只读。 这个枚举的名称空间。","Read-only. The type that was used to obtain this ":"只读。 用于获取此的类型","Read-only. The internal handle for this enum.":"只读。 此枚举的内部手柄。","Read-only. The underlying field for this enum.":"只读。 这个枚举的基础领域。","Read-only. Returns the underlying system type.":"只读。 返回基础系统类型。"," object that represents the other method.":"代表其他方法的对象。"," object that represents the method used to subscribe to this event.":"代表用于订阅此事件的方法的对象。","An instance of a helper class to describe the custom attribute.":"助手类的实例来描述自定义属性。"," object that represents the method used to raise this event.":"代表用于提高此事件的方法的对象。"," object that represents the method used to unsubscribe to this event.":"代表用于取消订阅此事件的方法的对象。","Controls inheritance of custom attributes from base classes.":"控制基本类自定义属性的继承。"," representing all the custom attributes of the constructor represented by this ":"表示由此表示的所有自定义属性","The object on which to access the field.":"访问字段的对象。"," containing the value of the field reflected by this instance.":"包含由本实例反映的字段的值。","The type of the attribute.":"属性的类型。"," is defined on this field; otherwise, ":"在该领域定义； 否则，","The new default value for this field.":"该字段的新默认值。","The offset of the field within the type containing this field.":"包含此字段的类型中的字段偏移。","The value to assign to the field.":"分配给字段的值。"}