{" to use the default ":"使用默认"," structure containing the source and destination of the serialized stream associated with the ":"结构包含与该流相关联的序列化流的源和目的地"," for the type of the key.":"对于键的类型。","  whose elements are copied to the new ":"将其元素复制到新的","The current capacity of the ":"当前能力"," structure that contains the source and destination of the serialized stream associated with the ":"结构包含与该流相关联的序列化流的源和目的地","The number of entries.":"条目的数量。"," structure for the ":"结构"," if the element is successfully found and removed; otherwise, ":"如果该元素被成功找到并删除； 否则，",".  This method returns ":"。 此方法返回"," is not found in the ":"在"," structure representing the key and value to add to the ":"代表密钥和值添加到的结构","The removed element.":"删除的元素。"," elements copied from the ":"从"," structure to locate in the ":"结构要定位"," is successfully found and removed; otherwise, ":"成功找到和删除； 否则，","The one-dimensional array that is the destination of the elements copied from ":"一维数组是复制元素的目的地"," structure representing the key and value to remove from the ":"代表密钥和值的结构从"," if the key/value pair was added to the dictionary successfully; otherwise, ":"如果键/值对成功添加到字典中； 否则，",". This method returns ":"。 此方法返回","The value associated with the specified key. If the specified key is not found, a get operation throws a ":"与指定密钥关联的值。 如果找不到指定的密钥，则get操作将抛出","When this method returns, contains the value associated with the specified key, if the key is found; otherwise, the default value for the type of the ":"当此方法返回时，包含与指定键关联的值（如果找到键）； 否则，该类型的默认值","The value of the element to add. It can be ":"要添加的元素的值。 有可能",". In the default implementation of ":"。 在默认实现中",", and a set operation creates a new element with the specified key.":"，设置操作用指定的密钥创建一个新元素。","The new capacity.":"的新容量。","A collection containing the values of the ":"一个包含值的集合"," of type ":"类型"," of the ":"的"," containing the keys of the ":" 载有 ",".  In the default implementation of ":"。 在默认实现中"," at the current position of the enumerator.":"在枚举者的当前位置。","The element in the ":"元素","The value associated with the specified key, or ":"与指定键关联的值，或 ","A collection containing the keys of the ":"包含钥匙的集合","The key of the element in the dictionary at the current position of the enumerator.":"字典在枚举器的当前位置上的元素的键。"," is of a type that is not assignable to the key type ":"是不可分配给密钥类型的类型","The element in the collection at the current position of the enumerator, as an ":"集合当前位置的元素作为一个"," if item was not found in the original ":"如果在原始中找不到物品","The value of the element in the dictionary at the current position of the enumerator.":"字典中元素在枚举器的当前位置的值。","The element in the collection at the current position of the enumerator.":"集合中的元素处于枚举器的当前位置。"," whose keys are reflected in the new ":"谁的钥匙在新的","The element in the dictionary at the current position of the enumerator, as a ":"字典中枚举器当前位置的元素，作为 ",", this property always returns the current instance.":"，此属性始终返回当前实例。","A hash code for the specified object.":"指定对象的哈希代码。"," whose values are reflected in the new ":"其价值反映在新的","The initial size of the ":"初始大小"," class for type ":"类型类","The default instance of the ":"默认实例"," if the element is already present.":"如果元素已经存在。"," if the specified objects are equal; otherwise, ":"如果指定的对象相等； 否则，"," implementation to use when comparing values in the set, or null (Nothing in Visual Basic) to use the default ":"比较集合中的值时要使用的实现，或使用null（视觉基本中的任何内容）使用默认值","The number of elements to copy to ":"要复制到的元素数量","The collection whose elements are copied to the new set.":"将元素复制到新集合的集合。","The element to locate in the ":"要定位的元素"," object that can be used for deep equality testing of the ":"可用于深度平等测试的对象"," if the element is added to the ":"如果将元素添加到"," implementation to use when comparing values in the set, or ":"比较集合中的值时使用的实现，或"," object contains the specified element; otherwise, ":"对象包含指定元素； 否则，","The minimum capacity to ensure.":"确保的最低能力。","The object for which to get a hash code.":"获取哈希码的对象。"," object; ":"目的;"," implementation for the set type.":"设置类型的实现。"," object. The array must have zero-based indexing.":"目的。 该数组必须具有零基索引。","The collection of items to remove from the ":"从","The new capacity of this instance.":"此实例的新容量。"," object is a proper subset of ":"对象是正确的子集","The new ":"新的"," object is a proper superset of ":"对象是适当的超集"," object is a superset of ":" 对象是 "," after which to insert ":"之后插入"," object is equal to ":" 对象等于 "," collection at the current position of the enumerator.":" 枚举器当前位置的集合。"," object is a subset of ":"对象是"," to add to the ":"添加到","The value from the set that the search found, or the default value of T when the search yielded no match.":"从搜索找到的集合中的值，或搜索无匹配时t的默认值。"," before which to insert ":"在此之前插入"," after which to insert a new ":"之后插入新的"," before which to insert a new ":"在此之前插入新的"," object that is used to determine equality for the values in the set.":"用于确定集合中值平等的对象。"," object and ":" 对象和 ","The value to add at the start of the ":"在开始时要添加的价值"," containing ":"包含"," to add at the end of the ":"在结束时添加"," delegate that defines the conditions of the elements to remove.":"定义要删除的元素条件的委托。"," to add at the start of the ":"在开始时添加","The first ":"首先","The value to add at the end of the ":"在末尾添加的价值","The number of elements that were removed from the ":"从","The number of elements that are contained in the set.":"集合中包含的元素数。"," that contains the specified value, if found; otherwise, ":"如果发现，则包含指定值； 否则，","The value to remove from the ":"从","The value to add to the ":"要添加到 "," belongs to, or ":"属于或",") of the ":"） 的","The last ":"最后"," if the element containing ":"如果元素包含","A reference to the value held by the node.":"对节点保存的值的引用。"," is not linked.":"没有链接。","A reference to the previous node in the ":"对先前节点的引用"," is successfully removed; otherwise, ":"成功删除； 否则，",". The collection itself cannot be ":"。 收藏本身不能是","A reference to the next node in the ":"对下一个节点的引用","The collection whose elements are copied to the new list.":"将元素复制到新列表的集合。"," if the current node is the first element (":"如果当前节点是第一个元素（"," that can be used to iterate through the linked list as a collection.":"可以用来通过链接列表作为集合来迭代。"," if the current node is the last element (":"如果当前节点是最后一个元素（","The value contained in the node.":"节点中包含的值。","The object to be added to the end of the ":"要添加到末尾的对象","The number of nodes actually contained in the ":"实际上包含的节点的数量"," delegate that defines the conditions of the element to search for.":"定义要搜索的元素条件的委托。",", but it can contain elements that are ":"，但它可以包含以下元素 ","The collection whose elements should be added to the end of the ":"应将元素添加到结束的集合","The value to contain in the ":"在"," to use the default comparer ":" 使用默认比较器 ","The collection whose elements should be inserted into the ":"该元素应插入的集合","A reference to the ":"对"," implementation to use when comparing elements, or ":"比较元素时要使用的实现，或",", if type ":"，如果类型 "," within the entire the ":"在整个中"," containing all the elements that match the conditions defined by the specified predicate, if found; otherwise, an empty ":" 如果找到，则包含与指定谓词定义的条件匹配的所有元素；否则，为空 "," that the ":"那是"," delegate that converts each element from one type to another type.":"将每个元素从一种类型转换为另一种类型的委托。","An object that acts as a read-only wrapper around the current ":"在电流周围充当仅阅读包装的对象"," that extends from the first element to ":"从第一个元素延伸到"," delegate to perform on each element of the ":"委派在每个元素上执行","An array containing copies of the elements of the ":"包含元素元素元素的数组"," of the target type containing the converted elements from the current ":"目标类型，其中包含来自电流的转换元素"," that contains ":"其中包含","The zero-based index of ":"基于零的索引"," delegate that defines the conditions to check against the elements.":"定义与元素检查的条件的委托。","The zero-based ":"基于零的"," was not found in the ":"没有在","The zero-based index in the source ":"源中的零基索引"," in the sorted ":"在分类中"," if every element in the ":"如果每个元素","The number of elements removed from the ":"从"," index at which the range starts.":"范围启动的索引。"," is found; otherwise, a negative number that is the bitwise complement of the index of the next element that is larger than ":"被发现； 否则，一个负数是下一个元素的索引的位互补，该元素大于","The new capacity of this list.":"此列表的新容量。"," matches the conditions defined by the specified predicate; otherwise, ":"匹配指定谓词定义的条件； 否则，","The position into which the new element was inserted.":"插入新元素的位置。","A shallow copy of a range of elements in the source ":"源中一系列元素的浅副本"," implementation to use when comparing elements.  \n  \n -or-  \n  \n ":"比较元素时要使用的实现。 \n  \n  -或者-"," delegate that defines the conditions of the elements to search for.":"定义要搜索的元素条件的委托。","The object to insert into the ":"要插入的对象"," can contain before resizing is required.":"在需要调整大小之前可以包含。","Initial capacity to allocate in the underlying heap array.":"在基础堆阵列中分配的初始能力。"," that extends from ":"从","Custom comparer dictating the ordering of elements.\n             Uses ":"定制比较决定元素的顺序。 \n              用途","The minimal element of the ":"最小元素","The minimum capacity to be used.":"最低使用能力。"," if the argument is ":"如果论点是"," contains one or more elements that match the conditions defined by the specified predicate; otherwise, ":" 包含与指定谓词定义的条件匹配的一个或多个元素；否则, ","The element to add to the ":"要添加到","The priority associated with the removed element.":"与删除元素相关的优先级。","The pairs of elements and priorities with which to populate the queue.":"填充队列的一对元素和优先级。","The object to insert. The value can be ":"要插入的对象。 值可以是 ","The new capacity of this queue.":"该队列的新容量。"," if the element is successfully removed; ":"如果该元素成功删除；","The priority with which to associate the new element.":"关联新元素的优先级。"," used to order the elements of the ":"用于订购元素","A hash code for the identity of ":"标识的哈希代码","The removed object.":"删除的对象。"," is empty.":"是空的。","The minimal element removed after the enqueue operation.":"在加入操作后除去的最小元素。","A collection containing the values in the ":"一个包含值的集合","The one-dimensional array of ":"一维的阵列","The minimal element in the queue.":"队列中的最小元素。"," if the object is successfully removed; ":"如果对象成功删除；","The elements to add to the queue.":"要添加到队列的元素。","The priority associated with the minimal element.":"与最小元素相关的优先级。"," structures that is the destination of the elements copied from the current ":"是从电流复制的元素目的地的结构","If present, the object at the beginning of the ":"如果存在，则在开始时的对象","The priority to associate with the new elements.":"与新元素相关联的优先事项。"," if there is a minimal element; ":"如果有最小的元素；","The element with the specified key, or ":"具有指定键的元素，或 ","; otherwise, the default value of ":"; 否则，默认值的"," The array must have zero-based indexing.":"该数组必须具有零基索引。","The number of elements in the collection.":"集合中的元素数量。","The pairs of elements and priorities to add to the queue.":"将元素和优先级的对添加到队列中。","The element in the collection at the current position of the dictionary, as a ":"词典当前位置的集合中的元素作为一个"," if there is an object at the beginning of the ":"如果在开始时有一个对象"," structure to add to the ":"结构添加到"," if item is successfully removed from the ":"如果项目成功从"," and a set operation creates a new element using the specified key.":"设定的操作使用指定键创建一个新元素。"," refer to the same object instance or if both are ":"请参阅相同的对象实例或两个"," structure.":"结构体。"," if item is not found in the ":"如果在"," structure to remove from the ":"结构从","An object containing the values in the ":"一个包含值的对象","The object for which to retrieve the hash code.":"检索哈希代码的对象。","The key of the element in the collection at the current position of the enumerator.":"集合中元素在枚举器的当前位置的关键。"," is successfully removed from the ":"成功地从",".  The value can be ":"。 值可以是"," contains an element with the key; otherwise, ":" 包含带有键的元素；否则, ","The structure that contains the source and destination of the serialized stream associated with the ":"包含与 "," to use as the key of the element to add.":"用作要添加的元素的关键。","An enumerable collection that contains the keys in the read-only dictionary.":"包含只读字典中的键的可枚举集合。","When this method returns, the value associated with the specified key, if the key is found; otherwise, the default value for the type of the ":"当此方法返回时，如果找到键，则与指定键关联的值； 否则，该类型的默认值","The value of the element in the collection at the current position of the enumerator.":"集合中元素在枚举器当前位置的值。"," is added to the set; otherwise, ":"被添加到集合中； 否则，","An enumerable collection that contains the values in the read-only dictionary.":"一个枚举的集合，其中包含仅读字典中的值。"," object that contains the information that is required to serialize the ":"包含序列化信息的对象"," if item is found in the ":"如果在"," if the set contains ":"如果该组包含","The lowest desired value in the view.":"视图中最低的期望值。"," to use as the value of the element to add.":" 以用作要添加的元素的值。","A predefined object that is used to perform a structural comparison of two collection objects.":"用于执行两个收集对象的结构比较的预定义对象。","A one-dimensional array that is the destination of the elements copied from the ":"一维数组，是从该元素复制的元素的目的地","The key whose value to get.":"获得价值的钥匙。","The highest desired value in the view.":"视图中最高的期望值。","A predefined object that is used to compare two collection objects for structural equality.":"一个预定义的对象，用于比较两个集合对象的结构平等。","The key of the element to get or set.":"元素的键来获取或设置。","A comparer for creating a collection of sets.":"创建集合集合的比较。"," for the current ":"对于电流","A subset view that contains only the values in the specified range.":"一个仅包含指定范围内值的子集视图。","The default comparer to use for comparing objects.":"用于比较对象的默认比较。","The type for which the metadata provider is created.":"创建元数据提供商的类型。","The enumerable collection to be copied.":"要复制的枚举集合。","The object that contains the information that is required to serialize the ":"包含序列化信息的对象","The comparer to use for creating the returned comparer.":"用于创建返回的比较器的比较器。","A comma-separated list of the property names of the key values on the ":"以逗号分隔的键值的属性名称列表 "," if the current ":" 如果当前 ","An enumerator that iterates through the ":"通过迭代的枚举者","The associated type that contains the metadata.":"包含元数据的关联类型。"," side of the association.":"协会的一面。"," if the element is found and successfully removed; otherwise, ":"如果找到并成功删除了元素； 否则，","The type that contains the method that performs custom validation.":"包含执行自定义验证的方法的类型。","The type of object to retrieve the type descriptor for.":"检索类型描述符的对象类型。"," in sorted order.":"按顺序排序。","An enumerator that iterates over the ":"枚举的枚举者","An instance of the type.":"类型的实例。"," if the association represents a foreign key; otherwise, ":"如果协会代表外键； 否则，"," property represents a resource key; otherwise, the non-localized value of the ":"属性代表资源密钥； 否则，未定位的值"," in reverse order.":"以相反的顺序。","A comma-separated list of the property names that represent the key values on the OtherKey side of the association.":"代表协会另一键键值的属性名称的逗号分隔列表。","The method that performs custom validation.":"执行自定义验证的方法。","A value that will be used for grouping fields in the UI, if ":"如果","The comparer that is used to order the values in the ":"用于订购值的比较","A collection of individual key members that are specified in the ":"在","The descriptor that provides metadata for the type.":"类型提供元数据的描述符。","The name to include in the formatted message.":"要包含在格式化消息中的名称。"," has been initialized; otherwise, ":"已被初始化； 否则，"," is synchronized; otherwise, ":"同步； 否则，","A comma-separated list of the property names that represent the key values on the ThisKey side of the association.":"代表协会此关键端的键值的逗号分隔列表。","The name of the association.":"协会的名称。","An instance of the formatted error message.":"格式错误消息的实例。",". If the ":"。 如果是","The property to compare with the current property.":"与当前属性进行比较的属性。","The collection to copy elements from.":"从中复制元素的集合。","The name of the validation method.":"验证方法的名称。","A value that is used for display in the UI.":"用于在UI中显示的值。"," property has been specified and the ":"已指定财产，并","The new capacity of this stack.":"这个堆栈的新容量。","The name of the field that caused the validation failure.":"导致验证失败的字段名称。","The order weight of the column.":"列的顺序重量。","The type that performs custom validation.":"执行自定义验证的类型。","The object at the top of the ":"对象在","A value that will be used to display a watermark in the UI.":"将用于在UI中显示水印的值。","The formatted error message.":"格式化的错误消息。","The name of the type to associate with the data field.":"与数据字段相关联的类型名称。","The object removed from the top of the ":"从顶部取出的对象"," property represents a resource key, a localized string is returned; otherwise, a non-localized string is returned.":" property表示资源键，返回本地化字符串；否则返回非本地化字符串。","An object that contains information about the validation request.":"包含有关验证请求的信息的对象。","The name of the custom field template to associate with the data field.":"与数据字段相关联的自定义字段模板的名称。","The localized string for the ":"用于","If present, the object at the top of the ":"如果存在，则对象在"," is valid; otherwise, ":"已验证; 否则，","The type of the resource that contains the ":"包含资源的类型 ","The name of the type associated with the data field.":"与数据字段关联的类型的名称。"," property, if the ":"属性，如果是"," if there is an object at the top of the ":"如果有一个物体的顶部"," properties.":"特性。","The data field value to validate.":"数据字段值要验证。","The text that is displayed for a field when the field's value is ":"当字段的值为字段显示的字段显示的文本","A value that is for the grid column label.":"网格列标签的值。","The other property.":"另一个财产。"," always.":"总是。",". The default is an empty string (\"\"), which indicates that this property is not set.":"。 默认值是一个空字符串（“”），该字符串表示未设置此属性。","The name of the column to use as the display column.":"用作显示列的列的名称。","The display name of the other property.":"另一个属性的显示名称。"," property, if it has been set; otherwise, ":" 属性，如果已设置；否则, "," to specify that field is editable; otherwise, ":"指定该字段是可编辑的； 否则，","The name of the custom field template that is associated with the data field.":"与数据字段关联的自定义字段模板的名称。"," if the attribute requires validation context; otherwise, ":"如果属性需要验证上下文； 否则，"," property if the ":"属性，如果是","The data-field display format.":"数据 - 场显示格式。"," if the field is editable; otherwise, ":"如果字段是可编辑的； 否则，","The name of the column to use for sorting.":"用于排序的列的名称。"," property has been specified and if the ":"已指定财产，以及"," if the property has been initialized; otherwise, ":"如果该物业已初始化； 否则，"," if an initial value is enabled; otherwise, ":"如果启用了初始值； 否则，"," value property.":"价值属性。"," to sort in descending order; otherwise, ":"按降序排序； 否则，","The value to validate.":"要验证的值。","The localized description, if the ":"本地描述，如果"," if the specified value is valid or ":"如果指定的值有效或","The name of the display column.":"显示列的名称。"," if the credit card number is valid; otherwise, ":"如果信用卡号有效； 否则，"," has been specified and the ":"已经指定了","The type of the enumeration.":"枚举的类型。"," if the passed object is equal to this attribute instance; otherwise, ":"如果传递的对象等于此属性实例； 否则，"," if UI should be generated automatically to display this field; otherwise, ":" 如果UI应该自动生成以显示此字段;否则, "," if the phone number is valid; otherwise, ":"如果电话号码有效； 否则，"," if the data field value is valid; otherwise, ":"如果数据字段值有效； 否则，","This attribute instance hash code.":"此属性实例哈希代码。","Specifies the minimum value allowed for the data field value.":"指定数据字段值允许的最小值。","The enumeration type.":"枚举类型。","The name of the sort column.":"排序列的名称。"," if UI should be generated automatically to display filtering for this field; otherwise, ":" 如果UI应该自动生成以显示此字段的过滤;否则, ","A comma delimited list of valid file extensions.":"有效文件扩展名的逗号定界列表。","Specifies the maximum value allowed for the data field value.":"指定数据字段值允许的最大值。"," if the column will be sorted in descending order; otherwise, ":"如果将列按降序排序； 否则，","Specifies the type of the object to test.":"指定要测试的对象的类型。","The name/value pairs that are used as parameters in the control's constructor.":"在控件的构造函数中用作参数的名称/值对。"," if the formatting string applies to the field value in edit mode; otherwise, ":"如果格式字符串适用于编辑模式中的字段值； 否则，","The validation context.":"验证上下文。"," if the specified value is in the range; otherwise, ":"如果指定值在该范围内； 否则，"," if the file name extension is valid; otherwise, ":" 如果文件扩展名有效；否则, ","The value that is used to display a description in the UI.":"用于在UI中显示描述的值。"," if empty string values are automatically converted to ":"如果空字符串值自动转换为","A collection that holds failed-validation information.":"掌握失败验证信息的集合。","The file name extensions, or the default file extensions (\".png\", \".jpg\", \".jpeg\", and \".gif\") if the property is not set.":"如果未设置该属性，则文件名扩展名或默认文件扩展名（“ .png”，“ .jpg”，“ .jpeg”和“ .gif”）。"," to use the invariant culture for any conversions; ":" 将不变区域性用于任何转换; ","The maximum allowable length of array or string data.":"数组或字符串数据的最大允许长度。","A value that is used to group fields in the UI.":"用于对UI中的字段进行分组的值。","The name to include in the formatted string.":"要包含在格式的字符串中的名称。"," to use the culture that is current at the time of the validation.":"使用验证时的当前文化。","A formatting string that specifies the display format for the value of the data field. The default is an empty string (\"\"), which indicates that no special formatting is applied to the field value.":"指定数据字段值的显示格式的格式化字符串。 默认值为空字符串(\"\")，表示不对字段值应用特殊格式。","The value that specifies whether scaffolding is enabled.":"指定脚手架是否启用的值。","The name of the control to use for filtering.":"用于筛选的控件的名称。","The maximum value that is allowed for the data field.":"数据字段允许的最大值。"," if the field should be HTML-encoded; otherwise, ":"如果应该对字段进行HTML编码； 否则，"," if scaffolding is enabled; otherwise, ":"如果启用了脚手架； 否则，","The name of the presentation layer that supports this control.":"支持此控件的演示层的名称。","The minimum value that is allowed for the data field.":"数据字段允许的最小值。","The name of the column the property is mapped to.":"该属性映射到的列的名称。","A localized string to describe the maximum acceptable length.":"用于描述最大可接受长度的本地化字符串。","The type of the data field whose value must be validated.":"必须验证其值的数据字段的类型。","The list of parameters for the control.":"控件的参数列表。","The order of the column.":"列的顺序。"," if the value is null, or if the value is less than or equal to the specified maximum length; otherwise, ":"如果值为null，或者该值小于或等于指定的最大长度； 否则，","The user control (field template) to use to display the data field.":"用于显示数据字段的用户控件（字段模板）。","The maximum allowable length of the array or string data.":"数组或字符串数据的最大允许长度。","The object to compare with this attribute instance.":"要与此属性实例进行比较的对象。","The regular expression that is used to validate the data field value.":"用于验证数据字段值的正则表达式。","The database provider specific data type of the column the property is mapped to.":"属性映射到的列的数据库提供程序特定数据类型。"," if validation is successful; otherwise, ":"如果验证成功； 否则，","The presentation layer that uses the class. Can be set to \"HTML\", \"Silverlight\", \"WPF\", or \"WinForms\".":"使用该类的表示层。 可以设置为\"HTML\"、\"Silverlight\"、\"WPF\"或\"WinForms\"。","The amount of time in milliseconds to execute a single matching operation.":"执行单个匹配操作的毫秒的时间。","The value of the object to validate.":"要验证的对象的值。","The metadata class to reference.":"要引用的元数据类。","The object to use to retrieve values from any data sources.":"用于从任何数据源检索值的对象。","The database generated option.":"数据库生成选项。","The pattern to match.":"匹配的模式。"," if the specified value is valid; otherwise, ":"如果指定的值有效； 否则，","The type value that represents the metadata class.":"代表元数据类的类型值。","The object to compare with this instance, or a ":"与此实例进行比较的对象或","The name of the associated navigation property, or the name of one or more associated foreign keys.":"相关导航属性的名称，或一个或多个相关的外国密钥的名称。","The length of the array or string data.":"数组或字符串数据的长度。"," object that describes the context where the validation checks are performed. This parameter cannot be ":"描述执行验证检查的上下文的对象。 此参数不能是","The name of the associated navigation property or of the associated foreign keys.":"相关导航属性的名称或相关的外国钥匙。"," if an empty string is allowed; otherwise, ":" 如果允许空字符串；否则, ","The name to include in the error message.":"在错误消息中包含的名称。",". The default value is ":"。 默认值是"," reference.":" 参考。","A localized string to describe the minimum acceptable length.":"用于描述最小可接受长度的本地化字符串。","The navigation property representing the other end of the same relationship.":"表示相同关系的另一端的导航属性。","An instance of the service, or ":"服务的实例，或"," if the specified object is equal to this instance; otherwise, ":"如果指定的对象等于此实例； 否则，"," if the specified object is valid; otherwise, ":"如果指定的对象有效； 否则，","The property of the attribute.":"属性的属性。","The error message that is associated with the validation control.":"与验证控件关联的错误消息。","The attribute instance hash code.":"属性实例哈希代码。"," if the service is not available.":"如果服务不可用。","The name of the table the class is mapped to.":"该类映射到表格的名称。","A collection of key/value pairs.":"密钥/价值对的集合。","The minimum allowable length of the array or string data.":"数组或字符串数据的最小允许长度。","The error message resource that is associated with a validation control.":"与验证控件关联的错误消息资源。","The service provider.":"的服务提供商。","The presentation layer that is used by this class.":"此类使用的表示层。","The type of error message that is associated with a validation control.":"与验证控件关联的错误消息类型。","The schema of the table the class is mapped to.":"类映射到的表的架构。","The name of the member to validate.":"要验证的成员名称。","An instance of the validation attribute type that triggered this exception.":"触发此异常的验证属性类型的实例。","The maximum length of a string.":"字符串的最大长度。"," instance that describes the validation error.":"描述验证错误的实例。","The name of the field template that displays the data field.":"显示数据字段的字段模板的名称。","The localized validation error message.":"本地化验证错误消息。","The value of the object that caused the ":"导致对象的值","The dictionary of the key/value pairs for this context.":"此上下文的键/值对的字典。","The object instance to validate. It cannot be ":"要验证的对象实例。 它不可能是","The maximum length a string.":"字符串的最大长度。"," class to trigger the validation error.":"类以触发验证错误。","The URL to validate.":"要验证的URL。","The minimum length of a string.":"字符串的最小长度。","The validation result object.":"验证结果对象。"," if the URL format is valid or ":"如果URL格式有效或","The type of the object to validate.":"要验证的对象的类型。","The user control to use to display the data field.":"用户控件用于显示数据字段。","The object instance to validate.  It cannot be ":"要验证的对象实例。  这不可能 ","An optional set of key/value pairs to make available to consumers.":"可选的键/价值对，可供消费者使用。","A collection to hold failed validations.":"用于保存失败验证的集合。","The list of member names that have validation errors.":"具有验证错误的成员名称列表。","The list of validation results.":"验证结果列表。","The object to validate. This parameter is required.":"要验证的对象。 需要此参数。","The function that enables access to validation resources.":"允许访问验证资源的函数。","The current validation result.":"当前验证结果。","The attribute that caused the current exception.":"导致当前异常的属性。","The object that implements the ":"实现的对象","The error message to associate with a validation control.":"与验证控件相关联的错误消息。","The validation attributes.":"验证属性。","The error message for the validation.":"验证的错误消息。","The value of the object that caused the attribute to trigger the validation error.":"导致属性触发验证错误的对象的值。"," to validate all properties; otherwise, ":"验证所有属性； 否则，"," interface. This parameter is optional.":" 界面。 此参数是可选的。","The context information about the validation operation.":"有关验证操作的上下文信息。","The object that holds the serialized data.":"保存序列化数据的对象。","A dictionary of key/value pairs to make available to the service consumers. This parameter is optional.":"密钥/价值对的字典，可供服务消费者使用。 此参数是可选的。","Any error that occurred during the asynchronous operation.":"异步操作期间发生的任何错误。","The collection of member names that indicate which fields have validation errors.":"表示哪些字段具有验证错误的成员名称的集合。","Context information about the source or destination of the serialized object.":"有关序列化对象源或目的地的上下文信息。","A value indicating whether the asynchronous operation was canceled.":"指示是否取消异步操作的值。","An instance of the ":"的实例 ","A specified message that states the error.":"指定错误的指定消息。","The type of the service to use for validation.":"用于验证的服务类型。","The optional user-supplied state object passed to the ":"可选的用户提供的状态对象传递给","The message that states the error.":"说明错误的消息。"," representing the argument of an asynchronous operation.":"代表异步操作的论点。"," method.":"方法。","The context that describes the object to validate.":"描述要验证的对象的上下文。","The state object passed to the asynchronous method invocation.":"传递给异步方法调用的状态对象。"," representing the result of an asynchronous operation.":"代表异步操作的结果。"," if the background operation has been canceled; otherwise ":"如果背景操作已取消； 否则","An object used to associate a piece of client state, such as a task ID, with a particular asynchronous operation.":"用于将客户状态（例如任务ID）与特定异步操作相关联的对象。","The value of the object that caused the attribute to trigger validation error.":"导致属性触发验证错误的对象的值。","The percentage of an asynchronous task that has been completed.":"已经完成的异步任务的百分比。"," instance, if an error occurred during an asynchronous operation; otherwise ":"实例，如果在异步操作期间发生错误； 否则","A collection to hold each failed validation.":"用于保存每个失败验证的集合。","A unique user state.":"独特的用户状态。","An object reference that uniquely identifies the asynchronous task; otherwise, ":"唯一标识异步任务的对象引用； 否则，"," that you can use to track the duration of an asynchronous method invocation.":" 可用于跟踪异步方法调用的持续时间。","The error message.":"的错误消息。"," if no value has been set.":"如果未设置值。"," if the object validates; otherwise, ":" 如果对象验证；否则, ","The source of the event.":"事件的来源。","A percentage value indicating the asynchronous task progress.":"指示异步任务进度的百分比值。","The synchronization context for the asynchronous operation.":"异步操作的同步上下文。","The collection of validation exceptions.":"验证异常的集合。"," to validate all properties; if ":" 验证所有属性；如果 "," that contains the event data.":" 包含事件数据。"," indicating the user state.":" 指示用户状态。"," for the layout category.":" 为布局类别。",", only required attributes are validated.":"，仅验证所需的属性。","This method does not do anything.":"这种方法不做任何事情。","The result of an asynchronous operation.":"异步操作的结果。","The context that describes the property to validate.":"描述要验证的属性的上下文。","The percentage, from 0 to 100, of the background operation that is complete.":"完成的背景操作的百分比从0到100。"," representing the user state.":"代表用户状态。"," object that wraps the delegate to be called when the operation ends.":" 在操作结束时包装要调用的委托的对象。"," for the mouse category.":" 为鼠标类别。","An argument for the delegate contained in the ":"关于代表的论点"," indicating the user state. Returned as the ":" 指示用户状态。 作为 "," if the property validates; otherwise, ":" 如果属性验证；否则, "," object that was passed to the constructor.":"传递给构造函数的对象。"," if a property or event can be modified at design time; otherwise, ":" 如果属性或事件可以在设计时修改；否则, "," property of the ":"属性"," for the window style category.":" 为窗口样式类别。","The description stored in this attribute.":"存储在此属性中的描述。","The delegate to add to the list.":"代表添加到列表中。","Another object to compare to.":"另一个要比较的对象。","A parameter for use by the background operation to be executed in the ":"背景操作使用的参数要在"," to release both managed and unmanaged resources; ":"释放托管和不受管理的资源；","The list to add.":"要添加的列表。","The string stored as the description. The default value is an empty string (\"\").":"字符串存储为描述。 默认值是一个空字符串（“”）。"," is equal to this instance; otherwise, ":"等于此实例； 否则，"," to release only unmanaged resources.":"仅发布非管理资源。","The delegate to remove from the list.":"从列表中删除的代表。","The fully qualified name of the data type of the serializer.":"序列化器数据类型的完全合格名称。","A service provided by the ":"由","An object to find in the list.":"在列表中查找的对象。"," event handler.":" 事件处理程序。","The fully qualified name of the base data type of the serializer. Multiple serializers can be supplied for a class as long as the serializers have different base types.":"序列化器的基本数据类型的完全合格名称。 只要序列化具有不同的基本类型，就可以为班级提供多个序列化。","A 32-bit signed integer hash code.":"32位有符号整数哈希码。"," that represents a service provided by the ":" 这代表由 ","The delegate for the specified key, or ":"指定键的委托，或 "," if the application has requested cancellation of a background operation; otherwise, ":" 如果应用程序已请求取消后台操作；否则, ","The base data type of the serializer. Multiple serializers can be supplied for a class as long as the serializers have different base types.":"序列化器的基本数据类型。 只要序列化程序具有不同的基类型，就可以为类提供多个序列化程序。"," if the attribute is the default value for this attribute class; otherwise, ":" 如果属性是此属性类的默认值；否则, ","The data type of the serializer.":"序列化器的数据类型。"," if the object is browsable; otherwise, ":"如果对象可浏览； 否则，"," does not provide the specified service.":" 不提供指定的服务。"," if a delegate does not exist.":" 如果委托不存在。","The fully qualified type name of the serializer base type.":"序列化器基本类型的完全合格的类型名称。","The name of the category.":"类别的名称。"," containing the name of the ":"包含名称"," object associated with the component; or ":"与组件关联的对象； 或者",", if the ":"，如果 ","The fully qualified type name of the serializer.":"序列化器的完全合格的类型名称。","The object to test the value equality of.":"测试值平等的对象。"," is running an asynchronous operation; otherwise, ":"正在进行异步操作； 否则，",", if the component does not have a site.":"，如果组件没有站点。","A unique ID for this attribute type.":"此属性类型的唯一ID。"," if the value of the given object is equal to that of the current; otherwise, ":"如果给定对象的值等于电流的值； 否则，"," to add.":"添加。","The identifer for the category to look up.":"类别查找的标识符。","The concatenation of the fully qualified name of the type that provides design-time services for the component this attribute is bound to, and the name of the assembly this type resides in.":"完全合格的名称的串联为该属性所绑定的组件提供设计时服务的类型的串联，并且该类型的名称属于此类型。"," supports progress updates; otherwise ":" 支持进度更新；否则 ","The localized name of the category, or ":"类别的本地名称，或","The unique, case-insensitive name to assign to the component.  \n  \n -or-  \n  \n ":"分配给组件的唯一，不敏感的名称。 \n  \n  -或者-","The fully qualified name of the base class to associate with the designer class.":"与设计师类相关联的基类完全合格的名称。",", if any, or ":"，如果有的话，或 "," supports cancellation; otherwise ":"支持取消； 否则"," if a localized name does not exist.":"如果不存在本地化名称。"," that leaves the component unnamed.":"这使组件未命名。"," is unnamed.":"不愿透露姓名。"," that represents the base class to associate with the ":"这代表了与"," for the action category.":"对于动作类别。","A collection of ":"集合"," if the component can raise events; otherwise, ":"如果组件可以提出事件； 否则，"," for the appearance category.":"对于外观类别。"," that contains the ":"其中包含","Specifies an argument for an asynchronous operation.":"指定异步操作的参数。"," that represents the class that provides design-time services for the component this attribute is bound to.":" 它表示为此属性绑定到的组件提供设计时服务的类。"," to pass as arguments to the given method. This can be ":"将作为参数传递给给定方法。 这可以","The name of the base type of this designer.":"该设计师的基本类型的名称。"," objects that represents all the components in the ":" 表示所有组件的对象 "," for the asynchronous category.":" 为异步类别。"," if no arguments are needed.":"如果不需要争论。"," is not encapsulated in an ":" 没有封装在 ","The name of the designer type associated with this designer attribute.":"与此设计器属性关联的设计器类型的名称。"," if the object is immutable; otherwise, ":"如果物体是不变的； 否则，"," interface that represents the asynchronous operation started by calling this method.":"代表通过调用此方法启动的异步操作的接口。"," is in design mode; otherwise, ":"处于设计模式； 否则，"," to compare with this instance or a null reference (":"与此实例或null引用进行比较（"," interface that represents the asynchronous operation started by calling ":"代表通过调用启动的异步操作的接口"," for the behavior category.":" 为行为类别。"," that is a unique identifier for the attribute.":" 这是属性的唯一标识符。","The name of the category for the property or event that this attribute is applied to.":"应用此属性的属性或事件类别的名称。"," that represents the return value generated by the asynchronous operation.":"这表示异步操作产生的返回值。"," that provides the delegates for this component.":" 这为该组件提供了委托。"," if the attribute is set to the default value; otherwise, ":"如果属性设置为默认值； 否则，"," in Visual Basic).":" 在Visual Basic中）。"," for the data category.":"对于数据类别。"," does not have an ":"没有"," values. The default is ":"值。 默认值为"," equals the type and value of this instance; otherwise, ":"等于此实例的类型和值； 否则，"," associated with it, or the ":"与之相关的"," that contains a method to call, in the context of the thread for the control.":" 它包含一个要在控件的线程上下文中调用的方法。"," for the default category.":"对于默认类别。"," if a property can be set only at design time; ":"如果只能在设计时间设置属性；"," if this instance is the default attribute for the class; otherwise, ":"如果此实例是类的默认属性； 否则，"," is removed from its ":"被从中删除"," that represents the arguments to pass to the given method. This can be ":"这代表了传递给给定方法的论点。 这可以"," if the property can be set at design time and at run time.":"如果可以在设计时间和运行时设置该属性。"," for the design category.":"对于设计类别。","The name of the initialization event.":"初始化事件的名称。"," objects to initialize the collection with.":"对象可以用来初始化集合。"," if a property can be set only at design time; otherwise, ":"如果只能在设计时间设置属性； 否则，"," that represents the return value from the delegate being invoked, or ":"代表所调用的代表的回报值，或"," to be used for deserialization.":"用于避难所。"," for the drag-and-drop category.":"对于拖放类别。"," array to copy the objects in the collection to.":"数组将集合中的对象复制到。","The display name.":"显示名称。","The destination to be used for deserialization.":"用于挑选的目的地。"," if the delegate has no return value.":"如果代表没有回报值。"," for the focus category.":"对于焦点类别。","The message to display with this exception.":"以此例外显示显示的消息。"," to test the value equality of.":"测试价值平等。"," if the caller must call ":"如果呼叫者必须致电","The name of the argument that caused the exception.":"引起异常的论点的名称。"," if the value of the given object is equal to that of the current object; otherwise, ":"如果给定对象的值等于当前对象的值； 否则，","The index of the ":"的索引 "," for the format category.":" 为格式类别。","The fully qualified type name of the editor.":"编辑器的完全合格的类型名称。"," at which copying to should begin.":"在该复制的情况下应该开始。","The fully qualified type name of the base class or interface to use as a lookup key for the editor. This class must be or derive from ":"用于编辑器的查找键的基类或接口的完全合格的类型名称。 此课必须是或源于"," for the key category.":"对于关键类别。"," if a property should be localized; otherwise, ":" 如果属性应本地化；否则, ","The value of the argument that failed.":"失败的参数的值。"," of the base class or interface to use as a lookup key for the editor. This class must be or derive from ":"用于编辑器的基础类别或接口作为查找密钥。 此课必须是或源于"," if this property can be combined with properties belonging to other objects in a Properties window; otherwise, ":"如果该属性可以与属性窗口中属于其他对象的属性相结合； 否则，","The collection index of the ":"的集合索引 "," that represents the enumeration class with the valid values.":"这代表具有有效值的枚举类。"," if the parent should be notified of changes; otherwise, ":"如果应通知父母的变化； 否则，","The source of the event, typically a data container or data-bound collection.":"事件的来源，通常是数据容器或数据结合的集合。"," instance associated with the ":"与"," that represents the type of the editor.":" 表示编辑器的类型。","The object to test for equality.":"测试平等的对象。","The value of this attribute.":"此属性的值。"," if the component is in design mode; otherwise, ":"如果组件处于设计模式； 否则，"," if the object is the same as this object; otherwise, ":"如果对象与此对象相同； 否则，","The name of the base class or interface serving as a lookup key for this editor.":"基类或接口的名称，用作该编辑器的查找键。"," to get.":" 去得到。","The value for this attribute.":"此属性的值。","The name of the component associated with the ":"与","The hash code for the object the attribute belongs to.":"属性所属对象的哈希代码。","The name of the ":"名称","; or ":"; 或者","The name of the editor class in the ":"编辑课中的名称","A component with a name matching the name specified by the ":"具有匹配名称的名称的组件",", if no name is assigned to the component.":"，如果未分配给组件。"," format.":"格式。"," to compare with the current ":" 以与当前 "," parameter, or ":"参数，或"," to a method that takes parameters of the same number and type that are contained in ":"对于采用包含相同数字和类型的参数的方法"," if the current value of the attribute is the default value of the attribute; otherwise, ":" 如果属性的当前值是属性的默认值；否则, "," if the specified ":"如果指定","The object that owns the event.":"拥有事件的对象。","An array of type ":"一系列类型"," is equal to the current ":"等于电流"," to compare with the attributes in this collection.":"与此集合中的属性进行比较。","The object that is the value of this ":"是该值的对象"," if the named component cannot be found in the collection.":" 如果在集合中找不到命名组件。"," if the attribute is contained within the collection and has the same value as the attribute in the collection; otherwise, ":"如果属性包含在集合中，并且具有与集合中的属性相同的值； 否则，"," if the parent property should be notified of changes; otherwise, ":" 如果父属性应被通知更改;否则, "," that provides a format context.":"这提供了格式上下文。"," to match.":" 相匹配。","The description text.":"描述文本。"," if the name should be enclosed in parentheses; otherwise, ":"如果该名称应包含在括号中； 否则，","The culture into which ":"文化","The zero-based index of the item that matches the property descriptor and contains the specified value.":"与属性描述符匹配并包含指定值的项目的零索引。",", if this is the default ":"，如果这是默认"," will be converted.":"将转换。"," if all the attributes in the array are contained in the collection and have the same values as the attributes in the collection; otherwise, ":" 如果数组中的所有属性都包含在集合中，并且具有与集合中的属性相同的值；否则, ","The zero-based index where the item is to be inserted.":"将插入该项目的基于零的索引。"," instance; otherwise, ":"实例; 否则，"," to convert.":"转换。","The attribute collection.":"属性集合。"," if the list type implements ":"如果列表类型实施","The item to insert in the list.":"要插入列表中的项目。"," if equal; otherwise, ":" 如果相等；否则, ","The number of attributes.":"属性数。"," to convert the value to.":"将值转换为。","A zero-based index of the item to be reset.":"重置该项目的基于零的索引。"," if the property is displayed with parentheses; otherwise, ":"如果该属性用括号显示； 否则，"," with the specified index number.":"带有指定的索引号。"," that represents the converted value.":"这代表转换值。","The zero-based index of the item to replace.":"该项目的基于零的索引。"," to show that the property this attribute is bound to is read-only; ":"要证明该属性所绑定的属性是只读的；",", otherwise, ":"，否则, "," to get from the collection.":"从收藏中获取。"," that specifies the type of array to get the properties for.":"这指定了以获取属性的数组的类型。","The new value for the item at the specified index. The value can be ":"该项目在指定索引处的新值。 值可以是"," to show that the property is read/write.":"证明该属性已读/写。"," with the specified type or, if the attribute does not exist, the default value for the attribute type.":"使用指定的类型或如果不存在属性，则属性类型的默认值。"," to add as a search criteria.":"添加为搜索标准。"," that will be used as a filter.":"它将用作过滤器。","The number of elements contained in the collection.":"集合中包含的元素数量。"," if the property this attribute is bound to is read-only; ":"如果该属性绑定的属性是仅读取的；"," to sort by.":"排序。"," that represents the type you wish to convert from.":" 它表示您要转换的类型。"," with the properties that are exposed for an array, or ":"带有阵列暴露的属性，或"," if access to the collection is synchronized (thread-safe); otherwise, ":"如果对集合的访问已同步（线程安全）； 否则，"," if the property is read/write.":"如果属性是读/写的。"," to search on.":"搜索。"," if this object can perform the conversion; otherwise, ":"如果此对象可以执行转换； 否则，","An object that can be used to synchronize access to the collection.":"可用于同步访问集合的对象。"," value indicating the nature of the refresh.":"值表示刷新的性质。"," parameter to search for.":"要搜索的参数。"," that specifies the culture to which to convert.":"这指定了转化的文化。","The name of the type to specify.":"要指定的类型的名称。"," if there are no properties.":" 如果没有属性。","The index of the row that has the given ":"具有给定的行的索引"," that represents the converted ":"代表转换的"," because ":"因为"," to remove from the indexes used for searching.":"从用于搜索的索引中删除。"," that holds a standard set of valid values.":"这具有一组标准的有效值。"," if the specified object is the same; otherwise, ":" 如果指定的对象相同；否则, "," should be called to find the properties of this object. This method never returns ":"应调用以找到此对象的属性。 此方法永远不会返回","The name of the property for which attributes will be retrieved.":"将为其检索属性的属性的名称。"," if list items can be edited; otherwise, ":"如果可以编辑列表项目； 否则，"," because the ":"因为","The hash code for the object that the attribute belongs to.":"属性所属对象的哈希代码。"," that provides the attributes for this collection.":"这提供了此集合的属性。","The type to specify.":"要指定的类型。"," if the current value of the attribute is the default; otherwise, ":"如果属性的当前值是默认值； 否则，"," returned from ":"从"," if you can add items to the list with the ":" 如果您可以使用 "," that indicates the current refresh properties for the member.":"这表明了该成员的当前刷新属性。"," is an exhaustive list of possible values. This method never returns ":"是详尽的可能值列表。 此方法永远不会返回"," to use as the new item value.":"用作新项目值。"," to find in the collection.":" 以在集合中找到。","The assembly qualified name of the type specified in the constructor.":"构造函数中指定的类型的程序集限定名。"," to be added as a new item to the associated collection.":"将作为新项目添加到关联集合中。"," if the collection contains the attribute or is the default attribute for the type of attribute; otherwise, ":"如果该集合包含属性或是属性类型的默认属性； 否则，"," that represents the type from which you want to convert.":"这表示您要转换的类型。"," method; otherwise, ":" 方法；否则, "," can be called to find a common set of values the object supports. This method never returns ":" 可以调用以查找对象支持的一组公共值。 此方法永远不会返回 "," if the collection contains all the attributes; otherwise, ":"如果该集合包含所有属性； 否则，","The component to be edited.":"要编辑的组件。",". The default depends on the underlying type contained in the list.":"。 默认值取决于列表中包含的基础类型。"," if this converter can perform the operation; otherwise, ":"如果此转换器可以执行操作； 否则，"," to copy the collection to.":"将收集复制到。"," if the component was modified; otherwise, ":"如果修改了组件； 否则，"," if you can remove items from the list with the ":"如果您可以用"," that represents the type to which you want to convert.":"这表示您要转换的类型。","The index to start from.":"索引开始。"," method otherwise, ":"否则方法，"," that represents the type you want to convert from.":" 它表示要转换的类型。"," from which to create the copy.":"从中创建副本。"," if this converter can perform the conversion; otherwise, ":"如果此转换器可以执行转换； 否则，"," if the list is sorted; otherwise, ":"如果列表已排序； 否则，"," from which the ":" 从其中 "," that provides the attributes for this collection. Can be ":"这提供了此集合的属性。 可"," that specifies the culture to represent the number.":" 它指定要表示数字的区域性。"," derives all information for finding resource files.":"得出所有用于查找资源文件的信息。"," if adding or removing items raises ":"如果添加或删除项目"," that is a copy of ":"那是"," that contains the property value to be applied.":"其中包含要应用的属性值。"," values that specifies how the collection changed.":" 指定集合如何更改的值。"," that contains the name of the object to look up in the resources.":"其中包含要在资源中查找的对象的名称。","The type to convert the object to.":"要将对象转换为的类型。"," events; otherwise, ":" 事件；否则, ","The culture for which to apply resources.":"应用资源的文化。"," to use property for binding; otherwise, ":"使用属性来绑定； 否则，"," of the attribute to retrieve.":" 要检索的属性。"," used for sorting the list.":"用于整理列表。"," that specifies the instance of the collection where the change occurred.":" 它指定发生更改的集合的实例。","The component to add.":"要添加的组件。","The object to compare.":"比较的对象。","The default ":"默认值"," that represents the instance of the collection with the change, or ":"代表与更改或",", which leaves the component unnamed.":"，这使组件未命名。"," if it is not equal.":"如果不相等。"," of a given ":"给定的"," to create a site for.":"创建一个网站。"," events are supported; otherwise, ":" 支持事件；否则, ","An enumerator of type ":"枚举类型","The name to assign to ":"分配给的名称"," if the list supports searching; otherwise, ":"如果列表支持搜索； 否则，"," if you refresh the collection.":" 如果刷新集合。"," if the property is typically used for binding; otherwise, ":" 如果属性通常用于绑定；否则, "," if the list supports sorting; otherwise, ":"如果列表支持排序； 否则，","The culture to which ":"文化","The direction of this property's data binding.":"该属性数据绑定的方向。"," containing the name of the component instance this type descriptor is describing. The default is ":" 包含此类型描述符所描述的组件实例的名称。 默认值为 "," has been called and ":"被称为"," to skip the name assignment.":" 跳过名称分配。"," to convert. This parameter must inherit from ":"转换。 此参数必须从"," of items to be contained in the ":"要包含的项目"," for the type represented by this type descriptor. The default is a newly created ":"对于此类型描述符表示的类型。 默认值是新创建的"," with the properties that are exposed for this data type, or ":"使用该数据类型暴露的属性，或","The newly created site.":"新创建的网站。"," of the service to retrieve.":"要检索的服务。"," if there are no properties. This method always returns ":"如果没有属性。 此方法总是返回"," has not been called; otherwise, ":" 未被调用；否则, "," for the default event on the object represented by this type descriptor. The default is ":" 对于此类型描述符表示的对象上的默认事件。 默认值为 "," implementing the requested service, or ":"实施请求的服务，或","The item added to the list.":"添加到列表中的项目。","The name of the property to be used as the data source.":"该属性的名称被用作数据源。"," that is being used for sorting.":"这是用于分类的。"," if the service cannot be resolved.":"如果无法解决该服务。"," for the default property on the object represented by this type descriptor. The default is ":"对于由此类型描述符表示的对象上的默认属性。 默认值为","The item that was added to the collection.":"添加到集合中的项目。","The name of the property to be used as the source for data.":"该属性的名称被用作数据源。"," if a ":"如果一个","The component to remove.":"要删除的组件。","The base type of the editor to retrieve.":"要检索的编辑器的基本类型。"," if the object is equal to the current instance; otherwise, ":"如果对象等于当前实例； 否则，"," that specifies the property to sort on.":"这指定了要排序的属性。"," event is raised when the list changes or when an item changes; otherwise, ":"当列表更改或项目更改时，将提出事件； 否则，","The index of the of the new item to be added.":"新项目的索引要添加。","The named component.":"命名的组件。",", indicating they are not equal.":"，表示它们不相等。","An editor of the given type that is to be associated with the class represented by this type descriptor. The default is ":"给定类型的编辑器，该编辑器将与此类型描述符所表示的类相关联。 默认值为 ","The component name to validate.":"要验证的组件名称。","The name of the data member property for the component to which ":"组件的数据成员属性的名称"," if the list supports searching using the ":" 如果列表支持使用 "," containing the event descriptors for the object represented by this type descriptor. The default is ":"包含该类型描述符表示对象的事件描述符。 默认值为","The index of the new item to be added.":"要添加的新项的索引。"," is bound.":"是绑定的。","The date format context.":"日期格式上下文。","An array of attributes to use as a filter. This can be ":"用作过滤器的一系列属性。 这可以","The name of the data source property for the component to which ":"组件的数据源属性的名称","A collection that contains the components in the ":"包含组件的集合 ","The source type to check.":"要检查的源类型。"," containing the event descriptions for the object represented by this type descriptor. The default is ":"包含该类型描述符表示的对象的事件描述。 默认值为"," that represents the type to associate with this component converter.":"这代表与此组件转换器关联的类型。"," to search for.":" 来搜索。"," if the specified type can be converted to a ":"如果指定类型可以转换为"," containing the property descriptions for the object represented by this type descriptor. The default is ":"包含该类型描述符表示的对象的属性描述。 默认值为"," that represents the component that was modified.":"这表示已修改的组件。","The destination type to check.":"要检查的目标类型。","The component collection to filter.":"要过滤的组件集合。"," that specifies the type of component to get the properties for.":" 它指定要获取属性的组件的类型。","The property descriptor for which to retrieve the owning object.":"要为其检索拥有对象的属性描述符。"," with the properties that are exposed for the component, or ":"与该组件暴露的属性或"," that indicates the member that has been changed.":" 表示已更改的成员。"," can be converted to the specified type; otherwise, ":" 可转换为指定类型；否则, "," that owns the given property specified by the type descriptor. The default is ":"它拥有由类型描述符指定的给定属性。 默认值为","An optional context object that can be used to obtain further information about the edit.":"可选的上下文对象，可用于获取有关编辑的更多信息。"," that represents a modified collection.":" 表示修改后的集合。","The new value of the changed member. This property can be ":"更改成员的新价值。 这个属性可以是"," if the object is suitable for binding to an ":"如果对象适合与"," that represents the type you wish to convert to.":"这代表了您希望转换为的类型。","The actual options object.":"实际选项对象。","An object to compare with this instance of ":"与此实例进行比较的对象","The date culture.":"的日期文化。"," if this instance is the same as the instance specified by the ":"如果此实例与由","The old value of the changed member. This property can be ":"更改成员的旧值。 此属性可以是 "," that specifies the culture to get the name for.":" 它指定要获取名称的区域性。"," parameter; otherwise, ":"范围; 否则，"," if the dialog box is shown; otherwise, ":" 如果显示对话框；否则, ","The object to be converted.":"要转换的对象。","The name of the specified culture.":"指定文化的名称。"," if the object should be considered suitable for binding to an ":"如果应该认为该物体适合与一个","The component that is about to be changed.":"即将改变的组件。"," to indicate that the field is in the primary key of the data row; otherwise, ":"表明该字段在数据行的主要键中； 否则，"," containing a standard set of valid values, or ":"包含一组标准的有效值，或"," indicating the member of the component that is about to be changed.":"指示即将更改的组件的成员。"," to indicate that the field is an identity field that uniquely identifies the data row; otherwise, ":"指出该字段是一个唯一标识数据行的身份字段； 否则，"," that represents the specified object.":" 表示指定的对象。","The page to which the option is bound.":"选项绑定到的页面。","The component that is about to have a member changed.":"即将更改成员的组件。"," to be converted.":"要转换。","The name of the option value.":"选项值的名称。"," if the data type does not support a standard set of values.":" 如果数据类型不支持标准值集。"," indicating the member that is about to be changed, if known, or ":"指示即将更改（如果已知）或"," to indicate that the field can be null in the data store; otherwise, ":" 以指示该字段在数据存储中可以为null；否则, ","The value of the option named ":"命名选项的值"," is not an exhaustive list of possible values (that is, other values are possible). This method never returns ":"不是可能的值的详尽列表（即其他值是可能的）。 此方法永远不会返回"," event that contains the event data.":"包含事件数据的事件。","The length of the field in bytes.":"字节中的字段长度。","An object of the specified type that represents the ":"指定类型的对象，表示 "," should be called to find a common set of values the object supports. This method never returns ":"应该调用以找到对象支持的共同值。 此方法永远不会返回","The component that is the source of the event.":"是事件源的组件。"," if the property represents an identity field in the underlying data; otherwise, ":"如果该属性代表基础数据中的身份字段； 否则，","The value of the option.":"选项的值。"," populated with available designer options.":"填充有可用的设计师选项。","The parent custom type descriptor.":"父自定义类型描述符。","The name of the default binding property.":"默认绑定属性的名称。"," that is the destination of the elements copied from the collection. The ":"那是从集合中复制的元素的目的地。 这"," containing the attributes for the type. The default is ":"包含类型的属性。 默认值为"," if the property represents a field that can be null in the underlying data store; otherwise, ":" 如果属性表示在基础数据存储中可以为null的字段；否则, ","The component associated with the event.":"事件相关联的组件。"," containing the fully qualified class name of the type this type descriptor is describing. The default is ":"包含该类型描述符类型的完全合格的类名称。 默认值为","The length of the property in bytes, or -1 if not set.":"字节中的属性长度，或-1（如果未设置）。","The component to be renamed.":"要重命名的组件。","The name of the default binding property for the component to which the ":"组件的默认绑定属性的名称 "," that can be used to iterate this collection.":" 这可以用来迭代这个集合。"," if the property is in the primary key of the data store; otherwise, ":" 如果属性在数据存储的主键中；否则, ","The name of the default event for the component this attribute is bound to.":"此属性绑定到的组件的默认事件的名称。"," values that describes the data operation the method performs.":"描述该方法执行的数据操作的值。","The object to locate in the collection.":"集合中要定位的对象。","The name of the default event for the component this attribute is bound to. The default value is ":"该属性已绑定到组件的默认事件的名称。 默认值是"," to indicate the method that the attribute is applied to is the default method of the data object for the specified ":"指示该属性应用于的方法是指定的数据对象的默认方法","The index of the first occurrence of value within the entire collection, if found; otherwise, the lower bound of the collection minus 1.":"如果找到了整个集合中的第一次值的索引； 否则，集合的下限负1。","The name of the default property for the component this attribute is bound to.":"该属性绑定到组件的默认属性的名称。"," if the method is the default method exposed by the object for a method type; otherwise, ":"如果该方法是方法类型的对象公开的默认方法； 否则，","The name of the default property for the component this attribute is bound to. The default value is ":"该属性绑定到组件的默认属性的名称。 默认值是"," values that identifies the type of data operation performed by the method to which the ":"标识通过该方法执行的数据操作类型的值"," if the dialog box can be displayed; otherwise, ":" 如果对话框可以显示;否则, ","The document that is losing activation.":"正在丢失激活的文档。"," is applied.":" 被应用。","The document that is gaining activation.":"正在激活的文档。"," to locate in the collection.":" 集合中进行定位。"," that represents the document gaining activation.":"这代表文档获得激活。"," that represents the document losing activation.":"这代表文档失去激活。","An optional ":"一个可选 "," is found in the collection; otherwise, ":" 集合中找到；否则, ","A message describing the exception.":"描述异常的消息。",". If not supplied, the current culture is assumed.":". 如果未提供，则假定当前区域性。","The error code to pass.":"要通过的错误代码。"," to insert into the collection.":" 以插入到集合中。","The stream to output to.":"流到输出的流。","The GUID of the group that this menu command belongs to.":"此菜单命令所属的组的GUID。"," to remove from the collection.":"从集合中删除。","The key to use for encryption.":"用于加密的关键。","The numeric identifier of this menu command.":"此菜单命令的数字标识符。","The number of child option collections this ":"儿童选项收集的数量"," indicating the license context.":"指示许可证上下文。"," if the specified object is equivalent to this one; otherwise, ":"如果指定的对象等效于此； 否则，"," contains.":"包含。","The Help keyword value.":"帮助关键字值。","The type from which the Help keyword will be taken.":"帮助关键字的类型。","The zero-based index of the child collection to get.":"儿童收藏的基于零的索引。"," if the Help keyword is ":"如果帮助关键字是","The child collection at the specified index.":"指定索引的儿童收集。","A string that contains the command ID information, both the GUID and integer identifier.":"包含命令ID信息（GUID和整数标识符）的字符串。","The GUID of the command group for this command.":"该命令的命令组的GUID。","The name of the child collection.":"儿童收藏的名称。","The child collection with the name specified by the ":"带有名称的儿童收藏","The Help keyword supplied by this attribute.":"此属性提供的Help关键字。","The command ID number.":"命令ID号。"," if the name is not found.":" 如果找不到名称。","The component that has changed.":"发生了变化的部件。","The name of this ":"这个名称","The member that has changed. This is ":"改变的成员。 这是","The parent collection object, or ":"父收集对象或"," if this change is not related to a single member.":"如果此更改与单个成员无关。"," if there is no parent.":"如果没有父母。","The old value of the member. This is valid only if the member is not ":"会员的旧价值。 仅当成员不在时才有效","The collection of properties offered by this ":"此提供的属性集合 ","The new value of the member. This is valid only if the member is not ":"员的新值。 只有当成员不是时，这才有效 ","The component that is about to change.":"即将更改的组件。",", along with all of its children.":" 和它所有的孩子一起。","The member that is changing. This is ":"正在改变的成员。 这是","The designer host providing design-time services. Can be ":"设计师主机提供设计时间服务。 可"," if the access to the collection is synchronized; otherwise, ":"如果对集合的访问已同步； 否则，"," if the collection has a fixed size; otherwise, ":"如果该系列的尺寸固定； 否则，","The base type specifying the components to retrieve. Can be ":"基本类型指定要检索的组件。 可","The list of available component types.":"可用组件类型的列表。","A description for this transaction.":"此事务的说明。","A dictionary of default property values, which are name/value pairs, with which to reset the component's state.":"默认属性值的字典，它们是名称/值对，用于重置组件的状态。","A dictionary of default property values, which are name/value pairs, with which to initialize the component's state.":"默认属性值的字典，是名称/值对，可以用它来初始化组件的状态。"," if the transaction was canceled; otherwise, ":" 如果交易被取消；否则, ","The component to associate with this designer.":"与该设计师关联的组件。"," indicating the base component that this designer is designing.":"指示该设计师正在设计的基本组件。"," that contains the verbs supported by the designer, or ":"其中包含设计师支持的动词，或"," if the component has no verbs.":"如果组件没有动词。","The currently active document, or ":"当前活动的文档，或 "," if there is no active document.":"如果没有活动文档。"," containing the root designers that have been created and not yet disposed.":"包含已创建且尚未处置的根设计师。"," objects for the class of the component. The keys in the dictionary of attributes are the ":"组件类的对象。 属性字典中的键是"," values of the attributes.":"属性的值。"," objects that represent the events of the class of the component. The keys in the dictionary of events are event names.":"代表组件类事件的对象。 事件字典中的键是事件名称。"," objects that represent the properties of the class of the component. The keys in the dictionary of properties are property names.":"表示组件类属性的对象。 属性字典中的键是属性名称。","The type of the component to create.":"要创建组件的类型。","The newly created component.":"新创建的组件。","The name for the component.":"组件的名称。","A new instance of ":"一个新实例",". When you complete the steps in your transaction, you should call ":"。 完成交易中的步骤时，您应该致电"," on this object.":"在这个对象上。","A title or description for the newly created transaction.":"新创建的交易的标题或描述。",". When you have completed the steps in your transaction, you should call ":"。 完成交易中的步骤后，您应该致电","The component to destroy.":"销毁的组件。"," to retrieve the designer for.":"找回设计师。"," if there is no designer for the specified component.":"如果没有指定组件的设计师。","The name of the type to load.":"加载类型的名称。","The type object for the specified type name, or ":"指定类型名称的类型对象，或"," if the type cannot be found.":"如果找不到类型。"," for this host.":"对于这个主机。"," if a transaction is in progress; otherwise, ":"如果正在进行交易； 否则，"," if the designer host is currently loading the document; otherwise, ":"如果设计师主机当前正在加载文档； 否则，","The instance of the root component class.":"根组件类的实例。","The fully qualified name of the base component class.":"基本组件类的完全合格名称。","A description of the current transaction.":"当前交易的描述。"," if the designer is closing a transaction; otherwise, ":"如果设计师正在关闭交易； 否则，","The name of the page that defines the option.":"定义选项的页面名称。","The name of the option property.":"选项属性的名称。","The value of the specified option.":"指定选项的值。","The new value.":"新值。","The old name of the component.":"组件的旧名称。","A description for the transaction.":"交易的描述。","The new name of the component.":"组件的新名称。","A value indicating whether the transaction was committed.":"表示交易是否实施的值。","The component that is being renamed.":"正在重命名的组件。","The component that was changed.":"被改变的组件。"," if this is the last transaction to close; otherwise, ":"如果这是最后一次要完成的交易； 否则，","The name of the component after the rename event.":"重命名事件后组件的名称。"," that represents the member that was changed.":"这代表了已更改的成员。",", if this is the last transaction to close; otherwise, ":"，如果这是最后一次要完成的交易； 否则，","The previous name of the component.":"组件的先前名称。","The old value of the changed member.":"更改成员的旧价值。"," if the designer called ":"如果设计师打电话给","A list that contains the collection of designers to add.":"包含要添加的设计师集合的列表。","The new value of the changed member.":"更改成员的新价值。"," on the transaction; otherwise, ":"在交易上； 否则，"," objects to store.":"存储的对象。","The text of the menu command that is shown to the user.":"向用户显示的菜单命令的文本。"," that enumerates the collection.":"这列举了集合。","The event handler that performs the actions of the verb.":"执行动词动作的事件处理程序。"," that is the destination of the elements copied from collection. The ":"那是从收藏中复制的元素的目的地。 这","The starting command ID for this verb. By default, the designer architecture sets aside a range of command IDs for verbs. You can override this by providing a custom command ID.":"该动词的启动命令ID。 默认情况下，设计器体系结构搁置了动词的一系列命令ID。 您可以通过提供自定义命令ID来覆盖此问题。","The number of designers in the collection.":"集合中的设计师数量。","The verb's text, or an empty string (\"\") if the text field is empty.":"如果文本字段为空，则动词的文本或一个空字符串（“”）。","The index of the designer to return.":"设计师返回的索引。","The designer at the specified index.":"指定索引的设计师。","A string describing the menu item.":"描述菜单项的字符串。"," of the document.":"文档。","A description for the verb command.":"动词命令的描述。","The parent designer option collection. All collections have a parent except the root object collection.":"家长设计师选项集合。 除根对象集合外，所有集合都有父。"," array that indicates the verbs to contain within the collection.":"表示包含在集合中的动词的数组。","The name of this collection.":"此系列的名称。"," to add to the collection.":"添加到集合中。","The object providing properties for this collection. Can be ":"为此集合提供属性的对象。 可","The index in the collection at which the verb was added.":"添加动词的集合中的索引。"," if the collection should not provide any properties.":"如果该集合不应提供任何属性。"," objects to add to the collection.":"对象添加到集合中。"," with the given name.":"带有给定名称。"," to search for in the collection.":"在集合中搜索。","The collection to populate.":"填充的集合。"," if the specified object exists in the collection; otherwise, ":"如果集合中的指定对象存在； 否则，","The options collection containing the object to be invoked.":"包含要调用对象的选项集合。","The array to copy collection members to.":"将收集成员复制到的数组。","The destination index to begin copying to.":"目的地索引开始复制。"," whose index to get in the collection.":"谁的索引进入该系列。","The index of the specified object if it is found in the list; otherwise, -1.":"如果在列表中找到指定对象的索引； 否则，-1。","The index in the collection at which to insert the verb.":"集合中插入动词的索引。"," to insert in the collection.":"插入集合。","The index at which to get or set the ":"获得或设置的索引"," at each valid index in the collection.":"在集合中的每个有效索引处。","The type of the license key.":"许可密钥的类型。","The assembly to get the key from.":"大会从中获取钥匙。","The saved license key that matches the specified type.":"与指定类型匹配的保存许可证密钥。","The license key.":"许可证密钥。"," indicating the licensing mode for the context.":"指示上下文的许可模式。"}