{"An object that represent the value being passed as a payload for the event.":"表示要通过的值作为事件有效载荷的对象。","The started activity for convenient chaining.":"开始活动以方便链接。","An object that represents the value passed as a payload for the event.":"代表事件的有效载荷代表值的对象。","The activity to be stopped.":"要停止的活动。","An object that represents the value being passed as a payload for the event. This is often an anonymous type which contains several sub-values.":"表示要通过的值作为事件的有效载荷的对象。 这通常是一种匿名类型，其中包含几个子值。","The medium from which values will be read.":"将读取值的介质。","Returns the extracted key-value pair list from the carrier.":"从载体返回提取的键值对列表。","The callback method to invoke to get the propagation trace ID and state from the carrier.":"调用以从载体中获取传播跟踪ID和状态的回调方法。","When this method returns, contains the trace ID extracted from the carrier.":"当此方法返回时，包含从载体中提取的跟踪ID。","The Activity object has the distributed context to inject to the carrier.":"活动对象具有分布式上下文以注入载体。","When this method returns, contains the trace state extracted from the carrier.":"当此方法返回时，包含从载体中提取的痕量状态。","The callback method to invoke to get the propagation baggage list from the carrier.":"调用的回调方法从承运人处获取传播行李列表。","The callback method to invoke to set a named key-value pair on the carrier.":"调用以在载体上设置命名键值对的回调方法。","The medium in which the distributed context will be stored.":"将存储分布式上下文的介质。","The medium used by propagators to read values from.":"传播器使用的介质从中读取值。","The currently selected process-wide propagator object.":"当前选择的整个过程范围的传播器对象。",". The value is non-":"。 该值是非 - ","When this method returns, contains the value that corresponds to ":"当此方法返回时，包含与","The propagation field name.":"传播字段名称。","When this method returns, contains a collection of values that correspond to ":"当此方法返回时，包含一个与对应的值集合","The list of fields that will be used by the ":"将使用的字段列表","The increment measurement.":"增量测量。","The medium used by propagators to write values to.":"传播者使用的介质将值写入。"," if there is more than one value for the input field name.":"如果输入字段名称有多个值。"," if there is only one value for the input field name.":"如果输入字段名称只有一个值。","A first key-value pair tag associated with the measurement.":"与测量相关联的第一个键值对标签。","The value corresponding to ":"对应于","A key-value pair tag associated with the measurement.":"与测量值关联的键值对标签。","A third key-value pair tag associated with the measurement.":"与测量相关联的第三个键值配对标签。","A second key-value pair tag associated with the measurement.":"与测量相关联的第二个键值对标签。","The measurement value.":"测量值。","The instrument name. cannot be ":"仪器名称。 不可能是","A span of key-value pair tags associated with the measurement.":"与测量相关的键值对标签的跨度。","A list of key-value pair tags associated with the measurement.":"与测量相关联的键值对标签的列表。","The tags associated with the measurement.":"与测量相关的标签。","Optional instrument description.":"可选仪器描述。","The meter that created the instrument.":"创建仪器的仪表。","Optional instrument unit of measurements.":"可选的仪器测量单位.","The measurement associated tags list.":"测量相关标签列表。"," that was responsible for sending the measurement.":"这是为了发送测量的原因。","The Meter name.":"仪表名称。","The callback to call to get the measurements when ":"拨打调用以获取测量的回调","The Meter name":"仪表名称","The optional Meter version.":"可选仪表版本。","The state object originally passed to ":"最初传递给的状态对象","A new counter.":"一个新的计数器。","The Meter version.":"仪表版本。"," is called by ":"被称为","A new histogram.":"一个新的直方图。","A state object which will be passed back to the callback getting measurements events.":"一个状态对象将传递回回调，获取测量事件。","The current measurements tracked by this instrument.":"该仪器跟踪的当前测量值。","An object containing the sampling results, which indicate the amount of data to collect for the related ":"一个包含采样结果的对象，该对象表示要收集的数据量","A new observable counter.":"一个新的可观察柜台。","The instrument to stop listening to.":"仪器停止听。","The callback which can be used to get measurement recording of numeric type T.":"可用于获取数字T型的测量记录的回调。","A span of tags to initialize the list with.":"标签的跨度可以用来初始化列表。","A new observable gauge.":"一个新的可观察量表。"," if the instrument is metrics-observable; ":"如果仪器是指标可观的；","The instrument to listen to.":"聆听的乐器。","The callback to get notified when an instrument is published.":"发表仪器时，回调要通知。","The key-value pair of the tag to add to the list.":"标签的键值对添加到列表中。","The one-dimensional Array that is the destination of the elements copied from ":"一维数组是复制元素的目的地","The Activity creation options used by ":"活动创建选项由","The zero-based index at which the item should be inserted.":"应插入该项目的基于零的索引。","The callback to get notified when the measurement is stopped on some instrument.":"当测量在某些仪器上停止时，要通知回调。","The tag to locate in the ":"要位于","The tag to insert.":"插入的标签。"," callbacks to decide creating the Activity object or not.":"回调以决定是否创建活动对象。",". The Array must have zero-based indexing.":". 数组必须具有从零开始的索引。"," containing information about the file. If the file did not contain version information, the ":"包含有关文件的信息。 如果文件不包含版本信息，则",".  \n  \n If the file did not contain version information, this list will contain only the name of the requested file. Boolean values will be ":"。 \n  \n  如果文件不包含版本信息，则此列表将仅包含请求的文件的名称。 布尔值将是","The zero-based index of the first ocurrence of ":"第一次出现的基于零的索引","The name of the company that produced the file or ":"生产文件的公司的名称或","The tag to remove from the ":"从中删除的标签"," in the tag list.":"在标签列表中。"," contains only the name of the file requested.":"仅包含所请求的文件的名称。","A value representing the build number of the file or ":"表示文件的构建号或",", and all other entries will be ":"，所有其他条目将是","The fully qualified path and name of the file to retrieve the version information for.":"完全合格的路径和文件名来检索版本信息。","A value representing the minor part of the version number of the file or 0 (zero) if the file did not contain version information.":"表示文件编号的次要部分或0（零）的值，如果文件不包含版本信息。","A list of the following properties in this class and their values:  \n  \n ":"此类中以下属性及其值的列表：","The comments associated with the file or ":"与文件相关的评论或",",  \n  \n ":"，，，，","The description of the file or ":"文件的描述或","The internal name of the file. If none exists, this property will contain the original name of the file without the extension.":"文件的内部名称。 如果不存在，则此属性将包含没有扩展名的文件的原始名称。","The name of the file described by this instance of ":"此实例描述的文件的名称"," if the file is a private build; ":"如果文件是私人构建；"," if the file did not contain version information.":"如果文件不包含版本信息。","A value representing the major part of the version number or 0 (zero) if the file did not contain version information.":"如果文件不包含版本信息，则表示版本号的主要部分或0（零）的值。"," if the file was built using standard release procedures or if the file did not contain version information.":"如果文件是使用标准发布过程构建的，或者文件不包含版本信息。"," if the file contains debugging information or is compiled with debugging features enabled; otherwise, ":" 如果文件包含调试信息或编译时启用了调试功能；否则, ","A value representing the file private part number or ":"代表文件私人零件号的值或","The copyright notices that apply to the specified file.":"版权注意到适用于指定文件的版权。","A value representing the build number of the product this file is associated with or ":"代表产品的构建编号的值该文件与或"," if the file is patched; otherwise, ":"如果文件修补； 否则，"," if the file is a special build; otherwise, ":"如果文件是特殊的构建； 否则，","A value representing the major part of the product version number or ":"代表产品版本编号的主要部分或","The trademarks and registered trademarks that apply to the file or ":"适用于文件的商标和注册商标或","The version number of the file or ":"文件的版本号或 "," if the file is prerelease; otherwise, ":"如果文件是预发行的； 否则，","The description string for the Microsoft Language Identifier in the version resource or ":"Microsoft语言标识符的描述字符串在版本资源或","The name the file was created with or ":"该文件的名称是使用或","A value representing the private part number of the product this file is associated with or ":"代表产品的私人零件编号的值本文件与或","A value representing the minor part of the product version number or ":"代表产品编号的次要部分的值或","Information about a private version of the file or ":"有关文件的私有版本或","The name of a computer on the network.":"网络上的计算机名称。"," stream.":" 溪流。","The version of the product this file is distributed with or ":"产品的版本此文件与或","The name of the product this file is distributed with or ":"该文件的产品名称与或"," component that is associated with a remote process resource identified by the ":"与远程流程资源相关联的组件","The application-defined description text.":"应用程序定义的描述文本。"," to kill only the associated process.":"仅杀死相关的过程。","The special build information for the file or ":"文件的特殊构建信息或","The name of a document or application file to run in the process.":"在该过程中运行的文档或应用程序文件的名称。"," that represents all the process resources running on the local computer.":"这代表了在本地计算机上运行的所有过程资源。"," if a process resource is started; ":"如果启动过程资源；","An application-defined description.":"应用程序定义的描述。","The command-line arguments to pass when starting the process.":"启动该过程时要通过的命令行参数。","The computer from which to read the list of processes.":"从中读取过程列表的计算机。","The handle to be wrapped.":"要包裹的手柄。"," if no new process resource is started (for example, if an existing process is reused).":"如果未启动新的流程资源（例如，如果重复使用现有过程）。"," if the close message was successfully sent; ":"如果密封的消息成功发送；"," if no process resource is started.":"如果未启动过程资源。"," that represents all the process resources running on the specified computer.":"这代表了在指定计算机上运行的所有过程资源。"," to reliably let ":"可靠地放任","The friendly name of the process.":"该过程的友好名称。"," if the associated process does not have a main window or if the main window is disabled (for example if a modal dialog is being shown).":"如果关联的过程没有主窗口或禁用主窗口（例如，显示模式对话框）。"," that contains the information that is used to start the process, including the file name and any command-line arguments.":" 它包含用于启动进程的信息，包括文件名和任何命令行参数。","The name of an application file to run in the process.":"在该过程中运行的应用程序文件的名称。"," release the handle during the finalization phase; otherwise, ":"在最终确定阶段释放手柄； 否则，"," that represents the process resources running the specified application or file.":"这代表运行指定应用程序或文件的过程资源。","Command-line arguments to pass when starting the process.":"启动该过程时要通过的命令行参数。"," that is associated with the process resource, or ":"与过程资源或"," component associated with the process resource that is running the calling application.":"与正在运行调用应用程序的流程资源关联的组件。","The line that was written by an associated ":"相关的线条"," to kill the associated process and its descendants; ":"杀死相关的过程及其后代；","The user name to use when starting the process.":"启动过程时要使用的用户名。"," if no process resource is started. Note that a new process that's started alongside already running instances of the same process will be independent from the others. In addition, Start may return a non-null Process with its ":"如果未启动过程资源。 请注意，与已经运行相同过程的实例开始的新过程将独立于其他过程。 此外，Start可能会返回具有其无效的过程"," to its redirected ":"重定向"," that contains the password to use when starting the process.":"其中包含启动过程时要使用的密码。","The system-unique identifier of a process resource.":"过程资源的系统唯一标识符。",", combined with the base component's ":"，结合基本组件的"," property already set to ":"属性已经设置为","The domain to use when starting the process.":"启动过程时要使用的域。"," return value.":"返回值。"," component that is associated with the local process resource identified by the ":"与与本地过程资源相关联的组件"," if the associated process has reached an idle state; otherwise, ":"如果关联的过程达到了闲置状态； 否则，",". In this case, the started process may have activated an existing instance of itself and then exited.":"。 在这种情况下，启动过程可能已经激活了现有的实例，然后退出。"," check.":"查看。","The amount of time, in milliseconds, to wait for the associated process to exit. A value of 0 specifies an immediate return, and a value of -1 specifies an infinite wait.":"等待相关过程退出的时间，以毫秒为单位。 值为0指定立即返回，值为-1指定无限等待。","The base priority, which is computed from the ":"基本优先级，是从","The amount of system memory, in bytes, allocated for the associated process that cannot be written to the virtual memory paging file.":"系统内存的数量（以字节为单位）分配给无法写入虚拟内存页面文件的关联过程。","The name of the computer that the associated process is running on.":"关联过程正在运行的计算机名称。","The code that the associated process specified when it terminated.":"相关过程终止时指定的代码。"," of the associated process.":"相关过程。"," if the associated process has exited; otherwise, ":"如果相关过程已退出； 否则，","The amount of memory, in bytes, allocated by the associated process that can be written to the virtual memory paging file.":"可以写入虚拟内存页面文件的关联过程分配的内存数量，以字节为单位。"," that indicates when the associated process was terminated.":"这表明何时终止关联的过程。"," that was used to start the process.":"这是用来启动该过程的。","A task that will complete when the process has exited, cancellation has been requested, or an error occurs.":"该过程已退出，已要求取消或发生错误时将完成的任务。"," event should be raised when the associated process is terminated (through either an exit or a call to ":"终止关联过程时应提出事件（通过出口或呼叫","The amount of memory, in bytes, allocated in the virtual memory paging file for the associated process.":"在虚拟内存文件文件中为关联的过程分配了内存的数量，以字节为单位。","The handle that the operating system assigned to the associated process when the process was started. The system uses this handle to keep track of process attributes.":"启动过程时，操作系统分配给关联过程的手柄。 系统使用此手柄来跟踪过程属性。","The system-generated window handle of the main window of the associated process.":"关联过程主窗口的系统生成的窗口句柄。","); otherwise, ":"）； 否则，"," if the associated process has reached an idle state.":"如果关联的过程达到了闲置状态。",". Note that the ":"。 请注意","The amount of memory, in bytes, the system has allocated for the associated process that can be written to the virtual memory paging file.":"内存的数量，在字节中，已分配给可以写入虚拟内存分页文件的关联过程。","The main window title of the process.":"该过程的主窗口标题。","A value of 1 to ":"值1至","The number of operating system handles the process has opened.":"操作系统的数量处理该过程已经打开。"," event is raised even if the value of ":"即使价值","The amount of system memory, in bytes, allocated for the associated process that can be written to the virtual memory paging file.":"系统内存的数量（以字节为单位）分配给可以写入虚拟内存页面文件的关联过程。"," that specifies the amount of time, in milliseconds, to wait for the associated process to become idle. A value of 0 specifies an immediate return, and a value of -1 specifies an infinite wait.":"这说明了等待相关过程闲置的时间，以毫秒为单位。 值为0指定立即返回，值为-1指定无限等待。","The maximum working set size that is allowed in memory for the process, in bytes.":"在字节中为过程中允许的最大工作集大小。"," if the operating system process referenced by the ":"如果操作系统流程由"," when the process exits during or before the user performs a ":"当该过程在用户执行的过程中或之前退出时","The maximum amount of memory, in bytes, allocated by the associated process that could be written to the virtual memory paging file.":"可以写入虚拟内存页面文件的关联过程分配的最大内存量，以字节为单位。","The maximum amount of virtual memory, in bytes, allocated for the associated process since it was started.":"自虚拟内存的最大数量（以字节为单位）分配给关联的过程以来。"," that indicates the amount of time that the process has spent running code inside the operating system core.":"这表明该过程已经在操作系统核心内运行代码的时间。"," component has terminated; otherwise, ":"组件已终止； 否则，","The minimum working set size that is required in memory for the process, in bytes.":"在字节中，该过程中所需的最小工作设置大小。","The name that the system uses to identify the process to the user.":"系统用来识别该过程给用户的名称。","The maximum amount of memory, in bytes, allocated in the virtual memory paging file for the associated process since it was started.":"自启动以来，在虚拟内存文件文件中分配了最大内存量，以字节为单位。","The maximum amount of physical memory that the associated process has required all at once, in bytes.":"相关过程的最大物理内存量一次性都需要一个字节。"," that represents the modules that have been loaded by the associated process.":"这代表了相关过程已加载的模块。","The system-generated unique identifier of the process that is referenced by this ":"系统生成的过程的唯一标识符","A bitmask representing the processors that the threads in the associated process can run on. The default depends on the number of processors on the computer. The default value is 2 n -1, where n is the number of processors.":"代表关联进程中线程可以继续运行的处理器的bitmask。 默认值取决于计算机上的处理器数量。 默认值为2 n -1，其中n是处理器的数量。","The maximum amount of virtual memory, in bytes, that the associated process has requested.":"关联过程已请求的最大虚拟内存量。","The maximum amount of physical memory, in bytes, allocated for the associated process since it was started.":"自启动以来，为相关过程分配了最大的物理内存量。","The amount of memory, in bytes, the system has allocated for the associated process that cannot be written to the virtual memory paging file.":"内存的数量，在字节中，已分配给无法写入虚拟内存分页文件的关联过程。"," that can be used to read the standard output stream of the application.":"可以用来读取应用程序的标准输出流。","The amount of virtual memory, in bytes, that the associated process has requested.":"相关过程已请求的虚拟内存的数量，字节中。"," if dynamic boosting of the process priority should take place for a process when it is taken out of the wait state; otherwise, ":"如果流程从等待状态中取出过程时，应对流程的动态提升进行优先考虑； 否则，"," if the user interface of the associated process is responding to the system; otherwise, ":"如果关联过程的用户界面正在响应系统； 否则，"," that represents the data with which to start the process. These arguments include the name of the executable file or document used to start the process.":"这代表了启动该过程的数据。 这些参数包括用于启动该过程的可执行文件或文档的名称。","The size, in bytes, of the memory that the module occupies.":"模块所占据的内存的大小，字节。","The priority category for the associated process, from which the ":"关联过程的优先类别","The amount of virtual memory, in bytes, allocated for the associated process.":"虚拟内存的数量，在字节中分配给关联的过程。","The native handle to this process.":"该过程的本机处理。","The name of the module.":"模块的名称。","An object  that indicates when the process started. An exception is thrown if the process is not running.":"指示该过程启动的对象。 如果该过程未运行，则会抛出异常。"," of the process is calculated.":"计算过程。"," instances with which to initialize this ":"使用此初始化的实例","The total amount of physical memory the associated process is using, in bytes.":"关联过程在字节中使用的物理内存总量。"," used to marshal event handler calls that are issued as a result of an ":"用于围载事件处理程序的呼叫，这些呼叫是由于","The Terminal Services session identifier for the associated process.":"关联进程的终端服务会话标识符。","The amount of physical memory, in bytes, allocated for the associated process.":"分配给相关过程的物理内存量，字节。","The number of bytes allocated by the associated process that cannot be shared with other processes.":"由关联过程分配的字节数不能与其他过程共享。"," instance that indicates the module to find in this collection.":"实例指示在此集合中找到的模块。"," event on the process.":"该过程中的事件。"," that can be used to read the standard error stream of the application.":"可以用来读取应用程序的标准错误流。"," if the module exists in the collection; otherwise, ":"如果该模块存在于集合中； 否则，","The load address of the module.":"模块的负载地址。","The amount of memory, in bytes, allocated for the associated process that cannot be shared with other processes.":"内存的数量（在字节中）分配给无法与其他过程共享的关联过程。"," instances to add to the collection.":"实例添加到集合中。","The entry point of the module.":"模块的入口点。"," representing the operating system threads currently running in the associated process.":" 表示当前在关联进程中运行的操作系统线程。","The zero-based index that defines the location of the module within the ":"基于零的索引，定义了模块在该模块中的位置"," that can be used to write the standard input stream of the application.":"可以用来编写应用程序的标准输入流。","The location at which to add the new instances.":"添加新实例的位置。","The zero-based index value of the module in the collection.":"集合中模块的基于零的索引值。","The fully qualified path that defines the location of the module.":"定义模块位置的完全资格的路径。","The name of the application to start, or the name of a document of a file type that is associated with an application and that has a default open action available to it. The default is an empty string (\"\").":"启动应用程序的名称，或与应用程序关联的文件类型的文档名称，并且具有可用的默认开放操作。 默认值是一个空字符串（“”）。"," that indicates the amount of time that the associated process has spent utilizing the CPU. This value is the sum of the ":"这表明相关过程使用CPU花费了时间。 此值是"," whose index is retrieved.":"检索其索引。"," that indicates the amount of time that the associated process has spent running code inside the application portion of the process (not inside the operating system core).":"这表明了相关过程已在该过程的应用程序部分（不在操作系统核心内部）中运行代码的时间。"," that indexes the modules in the collection.":"这索引了集合中的模块。"," on .NET Core apps.":"在.NET核心应用程序上。"," if the Windows user profile should be loaded; otherwise, ":"如果应该加载Windows用户配置文件； 否则，"," that contains the module's version information.":"其中包含模块的版本信息。","An application or document with which to start a process.":"启动流程的应用程序或文档。","The action to take with the file that the process opens. The default is an empty string (\"\"), which signifies no action.":"该过程打开的文件采取的措施。 默认值是一个空字符串（“”），该字符串表示没有动作。"," representing the time that was on the system when the operating system started the thread.":"表示操作系统启动线程时系统上的时间。","The user password to use when starting the process.":"启动过程时要使用的用户密码。","The file name.":"文件名。","An application with which to start a process.":"启动过程的应用程序。","The actions that the system can apply to the file indicated by the ":"系统可以应用于由","The user password in clear text.":"清晰文本中的用户密码。","The line number in the specified file.":"指定文件中的行号。"," that indicates the thread's execution, for example, running, waiting, or terminated.":"这表示线程的执行，例如，运行，等待或终止。","Command-line arguments to pass to the application when the process starts.":"当该过程启动时，命令行参数将传递到应用程序。","One of the enumeration values that indicates whether the process is started in a window that is maximized, minimized, normal (neither maximized nor minimized), or not visible. The default is ":"枚举值之一，指示该过程是在最大化，最小化，正常（最大化或最小化）或不可见的窗口中启动的。 默认值为"," if error output should be written to ":"如果应该将错误输出写入","The column number in the specified file.":"指定文件中的列号。","When ":"什么时候","A collection of command-line arguments.":"命令行参数集合。"," that indicates the amount of time that the thread has had control of the processor.":"这表明线程对处理器的控制时间。"," if input should be read from ":"如果应该从中读取输入","A single string containing the arguments to pass to the target application specified in the ":"一个包含参数的单字符串将其传递给在此处指定的目标应用程序","The file column number, or 0 (zero) if the file column number cannot be determined.":"文件列号，或0（零）如果无法确定文件列号。",", the fully qualified name of the directory that contains the process to be started. When the ":"，该目录的完全合格的名称包含要启动的过程。 当。。。的时候"," property. The default is an empty string (\"\").":"财产。 默认值是一个空字符串（“”）。"," if output should be written to ":"如果输出应写入"," indicating the amount of time that the thread has spent running code inside the application, as opposed to inside the operating system core.":"指示线程在应用程序内部运行代码的时间与操作系统核心内部的时间。","The file line number, or 0 (zero) if the file line number cannot be determined.":"文件行号，或0（零）如果无法确定文件行号。",", the working directory for the process to be started. The default is an empty string (\"\").":"，启动过程的工作目录。 默认值是一个空字符串（“”）。","An object that represents the preferred encoding for error output. The default is ":"代表错误输出首选编码的对象。 默认值为"," representing the reason that the thread is in the wait state.":"表示线程处于等待状态的原因。"," if the process should be started without creating a new window to contain it; otherwise, ":"如果应启动该过程而不创建新窗口以包含它； 否则，","The file name, or ":"文件名，或","The thread to add to the collection.":"添加到集合中的线程。","An object that represents the preferred encoding for standard input. The default is ":"代表标准输入首选编码的对象。 默认值为","The Active Directory domain to use when starting the process. If this value is ":"启动过程时要使用的Active Directory域。 如果此值为","The base priority of the thread, which the operating system computes by combining the process priority class with the priority level of the associated thread.":"线程的基本优先级，操作系统通过将过程优先类与关联线程的优先级相结合来计算。"," if the file name cannot be determined.":"如果无法确定文件名。","The zero-based index of the thread in the collection.":"集合中线程的零索引。","An object that represents the preferred encoding for standard output. The default is ":"代表标准输出首选编码的对象。 默认值为"," property must be specified in UPN format.":"属性必须以UPN格式指定。","The offset from the start of the MSIL code for the method that is executing.":"对于正在执行的方法的MSIL代码开始的偏移。","The current priority of the thread, which may deviate from the base priority based on how the operating system is scheduling the thread. The priority may be temporarily boosted for an active thread.":"线程的当前优先级，该线程可能会根据操作系统安排线程的方式偏离基本优先级。 对于活动线程，可以暂时提高优先级。"," instance that indicates the thread to find in this collection.":"实例指示在此集合中查找的线程。","The user name to use when starting the process. If you use the UPN format, ":"启动过程时要使用的用户名。 如果使用UPN格式，","A generic dictionary containing the environment variables that apply to this process and its child processes. The default is ":"包含适用于此过程及其子过程的环境变量的通用词典。 默认值为","The method in which the frame is executing.":"帧执行的方法。","@":"@"," if the thread exists in the collection; otherwise, ":"如果该线程存在于集合中； 否则，","The unique identifier associated with a specific thread.":"与特定线程关联的唯一标识符。","A string dictionary that provides environment variables that apply to this process and child processes. The default is ":"一个提供适用于此过程和子进程的环境变量的字符串词典。 默认值为","The offset from the start of the JIT-compiled code for the method that is being executed.":"从JIT编译的代码开始的偏移量为正在执行的方法。"," property must be ":"属性必须是","The preferred processor for the thread, used when the system schedules threads, to determine which processor to run the thread on.":"当系统计划线程时使用的线程的首选处理器以确定要在哪个处理器上运行线程。","The zero-based index that defines the location of the thread within the ":"基于零的索引，定义了线程中线的位置"," if the shell should be used when starting the process; ":"如果在开始过程时应使用外壳；"," if an error dialog box should be displayed on the screen if the process cannot be started; otherwise, ":"如果如果无法启动该过程，则应在屏幕上显示一个错误对话框； 否则，","A readable representation of the stack trace.":"堆栈跟踪的可读表示。","The zero-based index indicating the location at which to insert the thread.":"基于零的索引，指示插入线程的位置。"," to boost the thread's priority when the user interacts with the process's interface; otherwise, ":"当用户与过程接口交互时，提高线程的优先级； 否则，"," if the process should be created directly from the executable file. The default is ":"如果应直接从可执行文件创建该过程。 默认值为"," on .NET Framework apps and ":"在.NET框架应用程序和"," values, specifying a range that bounds the thread's priority.":"值，指定范围界限线程优先级的范围。","The thread to insert into the collection.":"插入集合的线程。","The thread to remove from the collection.":"从集合中删除的线程。","A pointer to the handle of the error dialog box that results from a process start failure.":"指向由进程启动失败导致的错误对话框句柄的指针。"," if information about the method in which the current frame is executing is available; otherwise, ":"如果有关当前帧执行的方法的信息； 否则，"," indicating the amount of time that the thread has spent running code inside the operating system core.":"表示线程在操作系统核心内运行代码的时间。","The zero-based index value of the thread in the collection.":"集合中线程的基于零的索引值。"," that points to a set of bits, each of which represents a processor that the thread can run on.":"这指向一组位，每个位都代表线程可以运行的处理器。"," that refers to the metadata import interface.":"这是指元数据导入接口。"," if a native image is available for this stack frame; otherwise, ":"如果可用于此堆栈框架的本地图像； 否则，"," that indexes the threads in the collection.":"这将索引集合中的线程。"," if the code that the specified stack frame is executing is available; otherwise, ":"如果可以使用指定的堆栈框架执行的代码； 否则，","A stack frame.":"个堆栈帧。","The thread's starting address, which points to the application-defined function that the thread executes.":"线程的起始地址，指向线程执行的应用程序定义的函数。","The specified line in the document.":"文档中指定的行。","The number of frames up the stack to skip.":"堆叠的帧数要跳过。","The GUID representing the algorithm ID.":"代表算法ID的GUID。"," to capture the file name, line number, and column number; otherwise, ":"捕获文件名，行号和列号； 否则，","The closest line that is a sequence point.":"最接近的线是序列点。","The array of columns in the documents at which the sequence points are located.":"序列点所在的文档中的列数组。","A pointer to the base address of the native image or ":"指向本机图像基本地址或","The frame that the ":"框架","The document source represented as unsigned bytes.":"文档源表示为未签名字节。","The array of lines in the documents at which the sequence points end.":"序列点结束的文档中的线数组。"," object should contain.":"对象应包含。","The checksum.":"的校验和。"," if you're targeting the .NET Framework.":"如果您针对.NET框架。","The namespace that the current method is defined within.":"当前方法在其中定义的名称空间。","The starting line in the current document.":"当前文档中的起点。","The array of columns in the documents at which the sequence points end.":"序列点结束的文档中的列数组。","The exception object from which to construct the stack trace.":"构造堆栈跟踪的异常对象。","An interface pointer to the start of the native code for the method that is being executed or ":"一个接口指针，指向正在执行的方法或","The starting column in the current document.":"当前文档中的起始列。","The document for which the offset is requested.":"请求偏移的文档。","The number of frames up the stack from which to start the trace.":"从堆栈上启动跟踪的帧数。","The starting and ending source documents.":"起始和结束源文档。","The ending line in the current document.":"当前文档中的终点线。","The document line corresponding to the offset.":"文档行对应于偏移量。"," if the offset is available; otherwise, ":"如果有偏移可用； 否则，","The ending column in the current document.":"当前文档中的结尾列。","The index of the stack frame requested.":"请求堆栈框架的索引。","The starting and ending lines in the corresponding source documents.":"相应的源文档中的启动和结尾线。","The type of the document. You can specify this parameter as ":"文档的类型。 您可以将此参数指定为","The document column corresponding to the offset.":"文档列对应于偏移量。","The starting and ending columns in the corresponding source documents.":"相应的源文档中的启动和结尾列。","The document source for the specified range.":"指定范围的文档源。","The specified stack frame.":"指定的堆栈帧。","The specified document.":"指定的文档。","The offset within the specified document.":"指定文档内的偏移量。","A GUID identifying the checksum algorithm. The value is all zeros, if there is no checksum.":"识别校验和算法的GUID。 如果没有校验和，则该值是所有的零。"," representing the function calls in the stack trace.":"在堆栈跟踪中表示函数调用。"," if the positions were defined; otherwise, ":"如果定义了职位； 否则，","The array of parameters for the current method.":"当前方法的参数数组。","The type of the current document.":"当前文档的类型。","The number of frames in the stack trace.":"堆栈跟踪中的帧数。","The root lexical scope that encloses the entire method.":"包含整个方法的根词汇范围。","An array of all documents defined in the symbol store.":"符号存储中定义的所有文档的数组。","The metadata import interface.":"元数据导入接口。","The document line corresponding to the ranges.":"文档行对应于范围。"," if the current document is stored in the symbol store; otherwise, ":"如果当前文档存储在符号存储中； 否则，","An array of all variables in the module.":"模块中所有变量的数组。","The document column corresponding to the ranges.":"文档列对应于范围。","The count of the sequence points in the method.":"法中的序列点的计数。","The metadata token of the method.":"该方法的元数据令牌。","An array of start and end offset pairs.":"一系列开始和终端偏移对。","The language of the current document.":"当前文档的语言。","The name of the file for which the reader interface is required.":"需要读取器接口的文件的名称。","The metadata token for the current method.":"当前方法的元数据令牌。","The symbol reader method object for the specified method identifier.":"指定方法标识符的符号读取器方法对象。","The language vendor of the current document.":"当前文档的语言供应商。","The search path used to locate the symbol file.":"用于定位符号文件的搜索路径。","The byte offset within the method of the lexical scope.":"词汇范围方法中的字节偏移。","The edit and continue version of the method.":"该方法的编辑和继续版本。","The child members of the current namespace.":"当前名称空间的儿童成员。","The source length of the current document.":"当前文档的源长度。","The most enclosing lexical scope for the given byte offset within the method.":"该方法中给定字节偏移的最封闭词汇范围。"," interface that reads the debugging symbols.":" 读取调试符号的接口。","The variables defined at global scope within the current namespace.":"当前名称空间内的全局范围定义的变量。","The document in which the method is located.":"方法所在的文档。","The metadata token for the method that is the user entry point for the module.":"用于模块的用户入口点的方法的元数据令牌。","The array of byte offsets from the beginning of the method for the sequence points.":"从方法开始的字节偏移数组的序列点开始。","The URL of the current document.":"当前文档的URL。","The position of the line within the document. The lines are numbered, beginning with 1.":"线路在文档中的位置。 行编号为1。","The current namespace.":"当前名称空间。","The start offset of the variable.":"变量的开始偏移。","The array of documents in which the sequence points are located.":"序列所在的文档阵列。","The child lexical scopes that of the current lexical scope.":"子词法作用域是当前词法作用域的作用域。","The points past the last instruction in the scope.":"范围中最后一个指令的要点。","The position of column within the document. The columns are numbered, beginning with 1.":"列在文档中的位置。 列编号，从1开始。","The array of lines in the documents at which the sequence points are located.":"序列位置的文档中的线数组。","The URL that identifies the document.":"标识文档的URL。","The local variables within the current lexical scope.":"当前词汇范围内的局部变量。","The document language. This parameter can be ":"文档语言。 此参数可以是","The global variable signature.":"全局变量签名。","The document language. You can specify this parameter as ":"文档语言。 您可以将此参数指定为","The namespaces that are used within the current scope.":"当前范围内使用的名称空间。","The reader method object for the specified position in the document.":"文档中指定位置的reader方法对象。","The identity of the vendor for the document language. This parameter can be ":"文档语言供应商的身份。 此参数可以是","The identity of the vendor for the document language. You can specify this parameter as ":"文档语言供应商的身份。 您可以将此参数指定为","The first address for the global variable specification.":"全局变量规范的第一个地址。","The type of the document. This parameter can be ":"文档的类型。 此参数可以是","The namespaces defined in the global scope within the current symbol store.":"当前符号存储中的全局范围中定义的名称空间。","The end offset of the current lexical scope.":"当前词汇范围的末端偏移。","The object that represents the document.":"表示文档的对象。","The second address for the global variable specification.":"全局变量规范的第二个地址。","The second address for the parameter specification.":"参数规范的第二个地址。","The method that contains the current lexical scope.":"包含当前词汇范围的方法。","The metadata token for the object for which the attribute is requested.":"为属性所请求的对象的元数据令牌。","The parent lexical scope of the current scope.":"当前范围的父词法范围。","The metadata type or method token.":"元数据类型或方法令牌。","The third address for the global variable specification.":"全局变量规范的第三个地址。","The attribute name.":"属性名称。","The third address for the parameter specification.":"参数规范的第三个地址。","The local variable name.":"本地变量名称。","The field name.":"字段名称。","The start offset of the current lexical scope.":"当前词汇范围的开始偏移。","The metadata token for the type for which the variables are requested.":"请求变量的类型的元数据令牌。","The document object for which the sequence points are being defined.":"定义序列点的文档对象。","The variable signature as an opaque blob.":"变量签名作为不透明的斑点。","A bitwise combination of the local variable attributes.":"局部变量属性的位组合。","A bitwise combination of the field attributes.":"字段属性的按位组合。","The first address of the variable.":"变量的第一个地址。","An array of variables for the parent.":"父母的变量数组。","The sequence point offsets measured from the beginning of methods.":"序列点从方法开始得出。","The local variable signature.":"本地变量签名。","The second address of the variable.":"变量的第二个地址。","The field signature.":"场签名。"," to define the start and end offsets of a scope at a later time. In this case, the offsets passed to ":"在以后的时间定义范围的起点和结束偏移。 在这种情况下，偏移传递给","The document lines for the sequence points.":"序列点的文档行。","The first address for the local variable specification.":"本地变量规范的第一个地址。","The address types for ":"地址类型的"," are ignored. A scope identifier is valid only in the current method.":"被忽略。 范围标识符仅在当前方法中有效。","The document positions for the sequence points.":"序列点的文档位置。","The third address of the variable.":"变量的第三地址。","The second address for the local variable specification.":"局部变量规范的第二个地址。","The first address for the field specification.":"现场规范的第一个地址。","The document that contains the starting position.":"包含起始位置的文档。","The second address for the field specification.":"现场规范的第二个地址。","The type of the address. One of the ":"地址的类型。 中的一个","The third address for the local variable specification.":"本地变量规范的第三个地址。","The starting line number.":"起点号。","The document end lines for the sequence points.":"序列点的文档结束行。","The third address for the field specification.":"现场规范的第三个地址。","The variable attributes.":"变量属性。","The start offset for the variable. If this parameter is zero, it is ignored and the variable is defined throughout the entire scope. If the parameter is nonzero, the variable falls within the offsets of the current scope.":"变量的开始偏移。 如果此参数为零，则将其忽略，并且在整个范围内定义了变量。 如果参数为非零，则变量落在当前范围的偏移范围内。","The document end positions for the sequence points.":"序列点的文档结束位置。","The starting column.":"开始列。","The end offset of the variable.":"变量的末端偏移。","The metadata emitter interface.":"元数据发射极接口。","The global variable name.":"全局变量名称。","The end offset for the variable. If this parameter is zero, it is ignored and the variable is defined throughout the entire scope. If the parameter is nonzero, the variable falls within the offsets of the current scope.":"变量的末端偏移。 如果此参数为零，则将其忽略，并且在整个范围内定义了变量。 如果参数为非零，则变量落在当前范围的偏移范围内。","The name of the variable.":"变量的名称。","The document that contains the ending position.":"包含结尾位置的文档。","The parameter name.":"参数名称。","The file name for which the debugging symbols are written. Some writers require a file name, and others do not. If a file name is specified for a writer that does not use file names, this parameter is ignored.":"编写调试符号的文件名。 一些作家需要一个文件名，而另一些作家则不需要。 如果为不使用文件名的作者指定文件名，则忽略此参数。","A bitwise combination of the global variable attributes.":"全局变量属性的位组合。","The ending line number.":"结尾线号。","The value to be used for the token.":"用于令牌的值。"," indicates that this is a full rebuild; ":"表明这是一个完整的重建；","A bitwise combination of the parameter attributes.":"参数属性的位组合。","The error message to write.":"要写的错误消息。","The object to check.":"要检查的对象。"," indicates that this is an incremental compilation.":"表明这是一个增量汇编。","The ending column number.":"结尾列号。","The parameter signature.":"参数签名。","The metadata token for the method to be opened.":"用于打开的方法的元数据令牌。","The detailed error message to append to the error message.":"详细的错误消息以附加到错误消息。"," and is equal to this instance; otherwise, ":"并且等于此实例； 否则，","The identifier of the lexical scope.":"词汇范围的标识符。","The first address for the parameter specification.":"参数规范的第一个地址。"," that contains the current process ID, thread ID, and stack trace information.":"其中包含当前的进程ID，线程ID和堆栈跟踪信息。","The name of the new namespace.":"新名称空间的名称。","The hash code for the current token.":"当前令牌的哈希代码。","The byte offset of the beginning of the lexical scope.":"词汇范围开始的字节偏移。"," if the trace should be produced; otherwise, ":"如果应该产生痕迹； 否则，","The offset, in bytes, from the beginning of the method to the first instruction in the lexical scope.":"从方法开始到词汇范围中的第一个指令，偏移量。","The byte offset of the end of the lexical scope.":"词汇范围末端的字节偏移。","The value of the current token.":"当前令牌的值。","The source name.":"源名称。","The name of the trace source.":"跟踪源的名称。","An opaque scope identifier that can be used with ":"不透明的示波器标识符","A data object to emit.":"要发射的数据对象。","The metadata token for which the attribute is being defined.":"定义该属性的元数据令牌。"," to write tracing and debugging output to the standard error stream; ":"为标准错误流编写跟踪和调试输出；","A format string that contains zero or more format items, which correspond to objects in the ":"包含零或更多格式项目的格式字符串，与对象相对应","An object that represents the information cache for the trace event.":"表示跟踪事件的信息缓存的对象。","An array of data objects to emit.":"一系列数据对象发出。"," to write tracing and debugging output to the standard output stream.":"为标准输出流编写跟踪和调试输出。","One of the enumeration values that identifies the event type.":"标识事件类型的枚举值之一。","The attribute value.":"属性值。"," array containing zero or more objects to format.":"包含零或多个格式的对象的数组。","A pointer to code that represents the underlying writer.":"代表代码的指针，代表基础作者。","The message to write.":"要写的消息。"," whose name is sent to the ":"其名称已发送到","The format to use for writing an array of arguments or a message to write.":"用于编写一系列参数或要写的消息的格式。"," to receive the output.":"接收输出。","The metadata token for the method that is the user entry point.":"用于用户入口点的方法的元数据令牌。","An object array containing zero or more objects to format.":"一个包含零或多个对象格式的对象数组。"," name is sent to the ":"名称已发送到","The name of the source switch.":"源开关的名称。","The fully qualified name of the namespace.":"名称空间的完全合格名称。","The name of the new instance of the trace listener.":"跟踪侦听器的新实例的名称。","A trace message to write.":"要编写的跟踪消息。","The default value for the switch.":"交换机的默认值。","A category name used to organize the output.":"用于组织输出的类别名称。","The number of spaces in an indent. The default is four spaces.":"缩进空间的数量。 默认值是四个空间。","The name of the file to receive the output.":"文件的名称接收输出。"," structure that identifies a related activity.":"识别相关活动的结构。"," if the trace listener is thread safe; otherwise, ":"如果跟踪侦听器是线程安全的； 否则，","A string array that contains the single value \"delimiter\".":"字符串数组包含单个值“定界符”。"," to cause a message to be written; otherwise, ":"引起消息写； 否则，"," if the trace listeners should be called; otherwise, ":"如果应该调用跟踪听众； 否则，","The name to display on a user interface.":"在用户界面上显示的名称。"," object that contains the current process ID, thread ID, and stack trace information.":"包含当前进程ID，线程ID和堆栈跟踪信息的对象。","A name for this ":"这个名字"," after every write; otherwise, ":"每次写作之后； 否则，"," values that represents the event level of the switch.":"表示交换机事件级别的值。","The description of the switch.":"开关的描述。","A name used to identify the output, typically the name of the application that generated the trace event.":"用于识别输出的名称，通常是生成跟踪事件的应用程序的名称。"," if the output should be indented; otherwise, ":"如果输出应缩进； 否则，"," object associated with the thread for this trace.":"与该迹线的线程关联的对象。","The name of the switch.":"开关的名称。"," values specifying the type of event that has caused the trace.":"指定导致迹线的事件类型的值。","A bitwise combination of the enumeration values. The default is ":"枚举值的比重组合。 默认值为","The name to display on the user interface.":"在用户界面上显示的名称。","The indent level. The default is zero.":"缩进水平。 默认值为零。"," to add to the list.":"添加到列表中。","The description for the switch.":"开关的描述。","A numeric identifier for the event.":"事件的数字标识符。","The default value of the switch.":"开关的默认值。","The number of spaces in an indent. The default is four.":"缩进空间的数量。 默认值为四个。","A string array that contains the names of the custom attributes supported by the switch, or ":"一个字符串数组，其中包含开关支持的自定义属性的名称，或"," if the switch is enabled; otherwise, ":"如果启用了开关； 否则，","A data object to write to the output file or stream.":"数据对象写入输出文件或流。","The position at which the new listener was inserted.":"插入新听众的位置。"," if there no custom attributes are supported.":"如果没有自定义属性。"," that represents a collection of type ":"代表类型的集合","An array of data objects to write to the output file or stream.":"一个数据对象数组以写入输出文件或流。","An object identifying the operation.":"识别操作的对象。"," objects to add to the list.":"对象要添加到列表中。"," containing the case-insensitive custom attributes for the trace switch.":"包含跟踪开关的情况不敏感的自定义属性。","The trace message to write to the output file or stream.":"跟踪消息写入输出文件或流。"," monitoring the trace output.":"监视跟踪输出。","Another ":"其他","The description of the switch. The default value is an empty string (\"\").":"开关的描述。 默认值是一个空字符串（“”）。"," structure that identifies the global activity.":"确定全球活动的结构。"," if the global lock is to be used; otherwise, ":"如果要使用全局锁； 否则，"," whose contents are added to the list.":"其内容已添加到列表中。","The name used to identify the switch. The default value is an empty string (\"\").":"用于识别开关的名称。 默认值是一个空字符串（“”）。","A format string that contains zero or more format items that correspond to objects in the ":"一个格式字符串，其中包含零或更多格式项目，与对象相对应"," object that represents the logical operation stack for the call context.":"代表呼叫上下文的逻辑操作堆栈的对象。","A string containing stack trace information. This value can be an empty string (\"\").":"包含堆栈跟踪信息的字符串。 此值可以是一个空字符串（“”）。"," to find in the list.":"在列表中查找。","The current setting for this switch. The default is zero.":"此开关的当前设置。 默认值为零。","An array containing zero or more objects to format.":"一个包含零或多个对象格式的数组。","The message to emit or display.":"发出或显示的消息。"," structure whose value is a date and time expressed in Coordinated Universal Time (UTC).":"其价值是以协调的通用时间（UTC）表示的日期和时间的结构。"," if the listener is in the list; otherwise, ":"如果听众在列表中； 否则，","A string representing the value of the switch.":"表示开关值的字符串。","The delimiter for the delimited list.":"定界列表的定界符。","The detailed message to emit or display.":"发出或显示的详细消息。"," containing correlation data.":"包含相关数据。"," to copy the elements into.":"将元素复制到。","The display name of the switch.":"开关的显示名称。"," that represents the stream the ":"代表流","The message to write to ":"写信给","The system-generated unique identifier of the current process.":"当前过程的系统生成的唯一标识符。","The starting index number in the current list to copy from.":"当前列表中要复制的起始索引号。","The type of the switch.":"开关的类型。"," if user-interface mode is enabled; otherwise, ":"如果启用了用户界面模式； 否则，"," writes to.":"写信给。","The assembly to check for switch attributes.":"组件检查开关属性。","A string that represents a unique integer identifier for this managed thread.":"代表此托管线程的唯一整数标识符的字符串。","The name of a log file to write trace or debug messages to.":"将跟踪或调试消息写入的日志文件的名称。","The index of the listener, if it can be found in the list; otherwise, -1.":"听众的索引，如果可以在列表中找到； 否则，-1。","The name of the new instance.":"新实例的名称。","The tick counter value of the underlying timer mechanism.":"基础计时器机制的tick违反价值。","An array that contains all the switch attributes for the assembly.":"包含组件的所有开关属性的数组。","The position in the list to insert the new ":"列表中插入新的位置","A bitwise combination of the ":"一定的比重组合"," that contains information for the trace event.":"其中包含跟踪事件的信息。"," that determines whether a trace should be written.":"这决定是否应编写痕迹。"," values that specifies the event type of the messages to trace.":"指定要跟踪消息的事件类型的值。"," that receives the output from the ":"从"," to insert in the list.":"插入列表。"," that represents the information cache for the trace event.":"这代表跟踪事件的信息缓存。","The conditional expression to evaluate. If the condition is ":"有条件的表达来评估。 如果情况是","Either the format to use for writing an array of arguments specified by the ":"要么用于编写由"," to remove from the list.":"从列表中删除。","The name of the file the ":"文件的名称","The name of the source.":"来源的名称。"," parameter, or a message to write.":"参数或要写的消息。",", a failure message is not sent and the message box is not displayed.":"，未发送故障消息，并且未显示消息框。"," objects that is the destination of the elements copied from the ":"是从"," to release managed resources; if ":"发布托管资源； 如果",", the specified message is not sent and the message box is not displayed.":"，未发送指定的消息，并且未显示消息框。","A trace identifier number.":"跟踪标识符号。"," has no effect.":"没有效果。"," to trace the specified event; otherwise, ":"追踪指定事件； 否则，","The position into which the new trace listener was inserted.":"插入新的跟踪听众的位置。","The format to use for writing an array of arguments, or a message to write.":"用于编写一系列参数的格式或要写的消息。","A message to write.":"写信。"," if found in the ":"如果在","A string array naming the custom attributes supported by the trace listener, or ":"字符串数组命名跟踪侦听器支持的自定义属性，或","The message to send to the ":"发送给","; otherwise, -1.":"; 否则，-1。","An array of argument objects.":"一个参数对象的数组。"," if there are no custom attributes.":"如果没有自定义属性。"," that represents the writer that receives the tracing or debugging output.":"这代表接收跟踪或调试输出的作者。",", the specified messages are not sent and the message box is not displayed.":"，未发送指定的消息，并且未显示消息框。","A trace data object.":"跟踪数据对象。"," object to insert into the ":"目的插入","The trace data to emit.":"痕量数据发射。"," that represents the stream the trace listener writes to.":"代表跟踪侦听器写入的流。","An array of trace data objects.":"跟踪数据对象的数组。","The number of listeners in the list.":"列表中的听众数量。","An array of objects to emit as data.":"一系列对象作为数据发射。","The detailed message to send to the ":"详细消息发送到"," that receives the output from the trace listener.":"从跟踪侦听器接收输出。","A string array naming the custom attributes supported by the trace source, or ":"字符串数组命名跟踪源支持的自定义属性，或"," to get from the list.":"从列表中获取。","A message to emit.":"发出的消息。"," object identifying a related activity.":"对象识别相关活动。","One of the enumeration values that specifies the event type of the trace data.":"指定跟踪数据的事件类型的枚举值之一。","The event counter name.":"事件计数器名称。"," in the list with the given ":"在给定的列表中","The trace data.":"跟踪数据。"," whose fully qualified class name you want to write.":"您想编写的完全合格的班级名称。","A detailed message to emit.":"发出的详细信息。","The event source.":"事件源。",". This item returns ":"。 此项目返回","An object array containing the trace data.":"包含跟踪数据的对象数组。","The informative message to write.":"要写的信息信息。"," containing the custom attributes for the trace listener.":"包含跟踪侦听器的自定义属性。","The name, count and mean of the current event counter.":"当前事件计数器的名称，计数和平均值。"," if no ":"如果不","An object derived from the ":"从","The trace message to write.":"要写的跟踪消息。","The value to be written.":"要编写的价值。"," with the given name can be found.":"可以找到给定名称。"," if the event source is enabled; otherwise, ":" 如果事件源已启用；否则, "," base class.":"基类。","The name to apply to the event or property.":"适用于事件或属性的名称。","A composite format string that contains text intermixed with zero or more format items, which correspond to objects in the ":"一个复合格式字符串，其中包含与零或更多格式项相互混合的文本，该文本与对象相对应","The name of the source (typically, the name of the application).":"来源的名称（通常为应用程序的名称）。","The event level to check. An event source will be considered enabled when its level is greater than or equal to ":"要检查的事件级别。 事件源将在其级别大于或等于","The number of event data items.":"事件数据项的数量。","A structure that identifies the related activity.":"标识相关活动的结构。","The value that specifies how to format the value of a user-defined type.":"指定如何格式化用户定义类型的值的值。","The name of the source, typically the name of the application.":"源的名称，通常是应用程序的名称。","The event keywords to check.":"事件关键字要检查。","The structure that contains the event data.":"包含事件数据的结构。"," containing the custom attributes for the trace switch.":"包含跟踪开关的自定义属性。","The event source to disable events for.":"禁用事件的事件源。","A bitwise combination of the enumeration values that specifies the default source level at which to trace.":"枚举值的位组合，该值指定跟踪的默认源级别。","The event channel to check.":"要检查的事件频道。","The event source to enable events for.":"事件源启用事件。"," that contains the active trace listeners associated with the source.":"其中包含与源关联的活动跟踪侦听器。","An identifier that uniquely identifies this event within the ":"一个标识符，该标识符在 ","The keywords for the event.":"事件的关键字。"," if the event source is enabled for the specified event level, keywords and channel; otherwise, ":"如果为指定的事件级别启用了事件源，则关键字和频道； 否则，","The level of events to enable.":"启用事件的水平。","The related activity identifier.":"相关的活动标识符。"," object representing the source switch value.":" 表示源开关值的对象。","The level of the event.":"事件的水平。","The keyword flags necessary to enable the events.":"启用事件所需的关键字标志。",".  \n  \n The result of this method is only an approximation of whether a particular event is active.  Use it to avoid expensive computation for logging when logging is disabled. Event sources may have additional filtering that determines their activity.":"。 \n  \n  该方法的结果仅是特定事件是否处于活动状态的近似值。 禁用记录时，请使用它来避免昂贵的计算来记录。 事件源可能会有其他确定其活动的过滤。","An array of objects that contain data about the event.":"包含有关事件数据的对象数组。","A pointer to the GUID of the related activity ID.":"指向相关活动ID的GUID的指针。","The arguments to be matched to enable the events.":"要匹配的论点以启用事件。","The operation code for the event.":"事件的操作代码。","The arguments for the event.":"事件的论点。","The thread identifier for the OS thread that wrote the event.":"编写事件的OS线程的线程标识符。","The number of items in the ":"项目数量"," values that specifies the level of messages that are allowed by the switch.":" 指定交换机允许的消息级别的值。","The event source to find the index for.":"事件源查找索引。","The event source to send the command to.":"将命令发送到的事件源。"," property is set to ":"属性设置为","The event command to send.":"要发送的事件命令。","A pointer to the first item in the event data field.":"指向事件数据字段中第一项的指针。","A small non-negative number that represents the specified event source.":"一个代表指定事件源的小型非负号。","The metadata key.":"元数据键。","The exception that was thrown during the construction of the event source, or ":"事件源构建期间抛出的例外，或","The arguments for the event command.":"事件命令的论点。","The event arguments that describe the event.":"描述事件的事件论点。"," if no exception was thrown.":"如果没有例外。","The metadata value.":"元数据值。","The current thread's new activity ID, or ":"当前线程的新活动ID或","The payload for the event.":"事件的有效载荷。"," to throw an exception when an error occurs in the underlying Windows code; otherwise, ":"在基础Windows代码中发生错误时提出异常； 否则，","The activity ID of the current thread.":"当前线程的活动ID。"," to indicate that work on the current thread is not associated with any activity.":"指出当前线程上的工作与任何活动无关。","The display name of the counter.":"计数器的显示名称。","The identifier of the related activity, or ":"相关活动的标识符，或","A bitwise combination of the enumeration values that specify the configuration settings to apply to the event source.":"指定配置设置以应用于事件源的枚举值的位组合。","A unique identifier for the event source.":"事件源的唯一标识符。","When this method returns, contains the previous activity ID on the current thread.":"当此方法返回时，将包含当前线程上的先前活动ID。","The display units of the counter.":"柜台的显示单元。"," if there is no related activity.":"如果没有相关活动。","The friendly name of the derived class.  The default is the simple name of the class.":"派生班的友好名称。 默认值是类的简单名称。","The key-value pairs that specify traits for the event source.":"为事件源指定特征的键值对。","The name to apply to the event source. Must not be ":"适用于事件源的名称。 必须不","The name and unique identifier that identify the current event source.":"标识当前事件源的名称和唯一标识符。","The date and time when the event was logged. The system tries to be as precise as possible.":"活动记录的日期和时间。 该系统试图尽可能精确。","The settings applied to this event source.":"设置应用于此事件源。","The name of the event to write.":"要写的事件的名称。","The name for this ":"这个名字","The pointer to the data.":"指向数据的指针。","The type of the event source.":"事件源的类型。","The EventSource that this counter is attached to.":"此计数器附加到的EventSource。","The number of payload items in the new overload.":"新超载中的有效负载项目数量。","The path to the assembly file (.dll) to include in the provider element of the manifest.":"汇编文件（.dll）的路径包括在清单的提供商元素中。","The options such as level, keywords and operation code for the event.":"事件的级别，关键字和操作代码等选项。","The value to increment the running total by.":"将运行总计递增的值。","The name of this counter.":"此计数器的名称。","The XML data string.":"XML数据字符串。","The name and increment of the current incrementing event counter.":"当前增量事件计数器的名称和增量。","The event source identifier.":"事件源标识符。","The event data. This type must be an anonymous type or marked with the ":"事件数据。 这种类型必须是匿名类型或标记","The path to the assembly file (.dll) file to include in the provider element of the manifest.":"汇编文件（.dll）文件的路径将包含在清单的提供商元素中。"," attribute.":"属性。","Gets or sets the rate at which this metric should be displayed.":"获取或设置应显示该指标的速率。","The name of the localization resource file, or ":"本地化资源文件的名称，或","The event identifier for the event.":"事件的事件标识符。","A bitwise combination of the enumeration values that specify how the manifest is generated.":"枚举值的位组合，以指定如何生成清单。","The event options.":"事件选项。","The event source this instance is a part of.":"事件源此实例是。"," if the localization resource file does not exist.":"如果本地化资源文件不存在。","The XML data string or ":"XML数据字符串或","An additional event log where the event should be written.":"应写入事件的附加事件日志。","A method that will be used to poll the value.":"一种用于轮询值的方法。","The name of the event source.":"事件源的名称。","The ID of the activity associated with the event.":"事件相关联的活动的ID。","The event identifier. This value should be between 0 and 65535.":"事件标识符。 该值应在0到65535之间。","A unique identifier for this event source type.":"此事件源类型的唯一标识符。","The name and increment of the current incrementing polling counter.":"当前增量投票计数器的名称和增量。","The ID of an associated activity, or ":"相关活动的ID，或","The event source that is attaching to the listener.":"附加到听众的事件源。","One of the enumeration values that specifies the level for the event.":"指定事件级别的枚举值之一。","The friendly name of the event source. The default is the simple name of the class.":"事件来源的友好名称。 默认值是类的简单名称。","One of the enumeration values that specifies the operation code.":"指定操作代码的枚举值之一。","The message that describes the error.":"描述错误的消息。","The rate at which this metric should be displayed.":"该指标应显示的速率。"," if there is no associated activity.":"如果没有相关活动。","An enumeration of all the event sources in the application domain.":"应用程序域中所有事件源的列举。","The event identifier.  This value should be between 0 and 65535.":"事件标识符。 该值应在0到65535之间。","The name and mean of the current polling counter.":"当前投票计数器的名称和平均值。"," value for this ":"为此价值","The exception that is the cause of the current exception, or ":"例外是当前例外的原因，或","The key of the trait to get.":"要获得的特征的关键。","The trait value associated with the specified key. If the key is not found, returns ":"与指定密钥关联的特征值。 如果找不到钥匙，请返回","A byte array argument.":"字节数组参数。"," if the current object is equal to ":"如果当前对象等于"," object. An event tag is a user-defined value that is passed through when the event is logged.":" 对象。 事件标记是在记录事件时传递的用户定义值。","An integer argument.":"整数论点。"," if the current event source is enabled; otherwise, ":"如果启用了当前事件源； 否则，"," if no inner exception is specified.":" 如果没有指定内部异常。","The task for the event.":"事件的任务。","The keywords applied to the event, or ":"适用于活动的关键字，或","The level of the event source.":"事件源的级别。","A 32-bit integer argument.":"一个32位整数参数。"," structure equivalent to this ":" 与此相当的结构 ","The version of the event.":"事件的版本。"," structure; otherwise, ":"结构体; 否则，"," if no keywords are set.":"如果未设置关键字。","The keyword of the event source.":"事件源的关键字。","A string argument.":"字符串参数。","The identifier of the event to disable.":"事件的标识符禁用。","A 64 bit integer argument.":"一个64位整数参数。","The blue component. Valid values are 0 through 255.":"蓝色组件。 有效值为0至255。","The event level for the event. If not set, the default is Verbose (5).":"事件的事件级别。 如果未设置，则默认值为详细信息（5）。","A value specifying the 32-bit ARGB value.":"指定32位ARGB值的值。"," is in range; otherwise, ":"在范围内； 否则，","An element of the ":"一个元素","A 64-bit integer argument.":"一个64位整数论点。","The operation code to use for the specified event. If not set, the default is ":"用于指定事件的操作代码。 如果未设置，默认值为","The identifier of the event to enable.":"事件的标识符启用。","A string that is the name of a predefined color. Valid names are the same as the names of the elements of the ":"是预定颜色的名称的字符串。 有效名称与该元素的名称相同","An array of objects.":"一系列对象。"," structure that this method creates.":"该方法创建的结构。"," (0).":"（0）。","The alpha value for the new ":"新的alpha值","An array of callback arguments.":"一系列回调参数。","The activity ID on the thread that the event was written to.":"事件已写入的线程上的活动ID。","A 32 bit integer argument.":"一个32位整数参数。","The lightness of this ":"这一点的轻度",". Valid values are 0 through 255.":"。 有效值为0至255。","The event identifier.":"事件标识符。","The callback command.":"回调命令。"," from which to create the new ":"从中创建新的","A system-defined color.":"系统定义的颜色。","The channel for the event.":"活动的渠道。",". The lightness ranges from 0.0 through 1.0, where 0.0 represents black and 1.0 represents white.":". 亮度范围从0.0到1.0，其中0.0表示黑色，1.0表示白色。"," properties of ":"属性"," that this method creates.":"该方法创建的。","The event source object.":"事件源对象。","The string representation of the Html color to translate.":"HTML颜色的字符串表示形式要翻译。","An integer value that specifies the hash code for this ":"一个整数值，用于为此指定哈希代码","The x-coordinate of the point to test.":"测试点的X坐标。"," structure that represents the translated HTML color or ":"代表翻译的HTML颜色或","The red component value for the new ":"新的红色组件值"," differ; otherwise, ":"不同; 否则，","The y-coordinate of the point to test.":"测试点的y坐标。","The hue, in degrees, of this ":"在这个程度上的色调"," that specifies the pair of numbers to subtract from the coordinates of ":"这指定了一对数字要从","The green component value for the new ":"新的绿色组件值","The OLE color to translate.":"要翻译的OLE颜色。"," if the point defined by ":"如果点由",". The hue is measured in degrees, ranging from 0.0 through 360.0, in HSL color space.":"。 该色调以HSL颜色空间为0.0至360.0的度度，范围为0.0至360.0。","The blue component value for the new ":"新的蓝色组件值"," structure that represents the translated OLE color.":"代表翻译的ole颜色的结构。"," structure that is translated by the negative of a given ":"由给定的负面翻译的结构","The saturation of this ":"这个的饱和"," structure and its ":"结构及其"," to be subtracted from.":"从中减去。","The alpha component. Valid values are 0 through 255.":"alpha组件。 有效值为0至255。","The Windows color to translate.":"窗户颜色要翻译。"," properties are equal to the corresponding properties of this ":"属性等于此的相应属性",". The saturation ranges from 0.0 through 1.0, where 0.0 is grayscale and 1.0 is the most saturated.":"。 饱和度范围为0.0至1.0，其中0.0为灰度，1.0是最饱和的。"," to subtract from the ":"从","The red component. Valid values are 0 through 255.":"红色组件。 有效值为0至255。"," structure that represents the translated Windows color.":"代表翻译的窗户颜色的结构。","The x-coordinate of the upper-left corner of this ":"x坐标的x坐标"," that is the result of the subtraction operation.":"这是减法操作的结果。"," structure to translate.":"结构翻译。","The green component. Valid values are 0 through 255.":"绿色组件。 有效值为0至255。"," that is to the left of the equality operator.":"那就是平等操作员的左侧。","The y-coordinate of the upper-left corner of this ":"Y左上角的Y坐标"," are 0; otherwise, ":"是0; 否则，","A rectangle to union.":"联合的矩形。"," that is to the right of the equality operator.":"那就是平等操作员的权利。","The x-coordinate of the lower-right corner of this ":"x右角的X坐标","The string that represents the HTML color.":"表示HTML颜色的字符串。","The x-coordinate of this ":"x坐标的"," structure that bounds the union of the two ":"界限两者的结合的结构","The y-coordinate of the lower-right corner of this ":"Y右角的Y坐标"," that is to the left of the inequality operator.":"那就是不平等运营商的左侧。","The OLE color value.":"OLE颜色值。","The y-coordinate of this ":"y坐标的","An integer that represents the hash code for this rectangle.":"代表该矩形的哈希代码的整数。","The Windows color value.":"Windows颜色值。","The y-coordinate that is the sum of ":"y坐标是"," that is to the right of the inequality operator.":"那就是不平等运营商的权利。"," that specifies the numbers to add to the coordinates of ":"指定要添加到坐标的数字"," that specifies the coordinates for the new ":"指定了新的坐标","The 32-bit ARGB value of this ":"此的32位argb值"," with which to start. This rectangle is not modified.":"从那里开始。 该矩形未修改。"," and has the same coordinates as this ":"并且具有与此相同的坐标","The height of this ":"这个高度"," structure. The default is 0.":"结构体。 默认值为0。"," enumeration, if the ":"枚举，如果","A 32-bit integer that specifies the coordinates for the new ":"一个32位整数，指定新的坐标","The amount to inflate this ":"充气的金额"," that specifies the numbers to add to the x- and y-coordinates of the ":"这指定了要添加到x-和y-coordine的数字"," properties of this ":"此的属性","The horizontal position of the point.":"点的水平位置。"," horizontally.":"水平。"," is created from a predefined color by using either the ":"是通过使用预定义颜色创建的"," values of the left and right ":"左右的值"," all have values of zero; otherwise, ":"所有值的值为零； 否则，","The vertical position of the point.":"点的垂直位置。"," vertically.":"垂直。","The point to convert from.":"要转换的要点。"," method or the ":"方法或"," that is the result of the addition operation.":"这是加法操作的结果。","The x-coordinate of the left edge of this ":"左边缘的X坐标"," method; otherwise, 0.":"方法; 否则，0。","The enlarged ":"放大","The vector that represents the converted ":"代表转换的向量"," this method converts to.":"此方法转换为。","A string that is the name of this ":"一个名称的字符串","The amount to inflate this rectangle.":"充气该矩形的数量。"," that represents the upper-left corner of this ":"这代表了这个的左上角"," method; otherwise, a string that consists of the ARGB component names and their values.":"方法; 否则，由ARGB组件名称及其值组成的字符串。","The vector to convert.":"向量转换。","The point to test for equality.":"测试平等的重点。","The x-coordinate that is the sum of ":"X坐标是"," with which to intersect.":"与之相交的。","The alpha component value of this ":"此的alpha组件值"," has the same coordinates as this point instance.":"具有与此要点实例相同的坐标。","The pair of coordinates that represents the converted ":"代表转换的一对坐标","A rectangle to intersect.":"一个相交的矩形。"," that represents the width and height of this ":"这代表了这个的宽度和高度"," representing a system-defined color.":"代表系统定义的颜色。"," to test for equality.":"测试平等。"," to indicate the ":"指示","The y-coordinate of the top edge of this ":"顶部边缘的y坐标"," that represents the intersection of ":"这代表了","The blue component value of this ":"此的蓝色组件值"," and has the same coordinates as this point instance.":"并具有与此点实例相同的坐标。"," that specifies the numbers to subtract from the coordinates of ":"这指定了从坐标中减去的数字","The rectangle to test.":"矩形进行测试。","The width of this ":"这个宽度","The green component value of this ":"此的绿色组件值","An integer value that specifies a hash value for this ":"一个整数值，它为此指定哈希值"," if the point represented by the ":"如果点由","The vector that was created from this ":"从此创建的向量"," if there is any intersection, otherwise ":"如果有任何十字路口，否则"," strcture representing a system-defined color.":"代表系统定义的颜色的结构。"," used offset this ":"使用的偏移"," parameter is contained within this ":"参数包含在此中"," that represents the upper-left corner of the rectangular region.":"这代表了矩形区域的左上角。","Amount to offset the location.":"算出位置。","This property returns ":"此属性返回"," is entirely contained within the rectangular region represented by this ":"完全包含在以此表示的矩形区域内","The amount to offset the x-coordinate.":"抵消X坐标的金额。"," if this color is uninitialized; otherwise, ":"如果这种颜色是非初始化的； 否则，"," that represents the width and height of the rectangular region.":"这代表了矩形区域的宽度和高度。"," and its ":"及其","The amount to offset the y-coordinate.":"抵消Y坐标的金额。"," was created from a predefined color by using either the ":"是通过使用预定义颜色创建的","The horizontal offset.":"水平偏移。","The x-coordinate of the upper-left corner of the rectangular region.":"矩形区域左上角的X坐标。","The x-coordinate of the upper-left corner of the rectangle.":"矩形左上角的X坐标。"," to translate.":"翻译。"," was created by using either the ":"是通过使用任何一种","The vertical offset.":"垂直偏移。","The y-coordinate of the upper-left corner of the rectangle.":"矩形左上角的Y坐标。","The y-coordinate of the upper-left corner of the rectangular region.":"矩形区域左上角的Y坐标。"," that specifies the pair of numbers to add to the coordinates of ":"这指定了一对要添加到坐标的数字"," structures have equal ":"结构相等"," was created from a system color by using either the ":"是通过使用系统颜色创建的","The width of the rectangle.":"矩形的宽度。","The translated ":"翻译","The x-coordinate of the lower-right corner of the rectangular region.":"矩形区域右下角的X坐标。"," if any of the ":"如果有","The red component value of this ":"此的红色组件值","The height of the rectangle.":"矩形的高度。","The y-coordinate of the lower-right corner of the rectangular region.":"矩形区域右下角的Y坐标。"," values of ":"值","The amount to offset the location horizontally.":"水平抵消位置的数量。"," properties of the two ":"两者的属性","The hash code for this ":"哈希代码"," if the point represented by ":"如果点代表","The amount to offset the location vertically.":"垂直抵消位置的金额。"," that results from the conversion.":"这是由于转换而产生的。"," structures are unequal; otherwise ":"结构不平等； 否则"," is contained within this ":"包含在其中"," to be copied. This rectangle is not modified.":"被复制。 该矩形未修改。"," structure; otherwise ":"结构体; 否则"," if the two specified ":"如果两个指定"," if the values of either the ":"如果两个的值","The rounded integer value of the ":"圆形整数值","The amount to enlarge the copy of the rectangle horizontally.":"放大矩形的副本的数量。"," properties; otherwise, ":"特性; 否则，"," if the rectangular region represented by ":"如果矩形区域代表"," properties or the ":"属性或","A string that contains the position, width, and height of this ":"一个包含该位置，宽度和高度的弦","The rectangle to convert.":"矩形要转换。","The amount to enlarge the copy of the rectangle vertically.":"垂直放大矩形的副本的金额。"," is entirely contained within this ":"完全包含"," structure ¾ for example, {X=20, Y=20, Width=100, Height=50}.":"结构¾，例如{x = 20，y = 20，宽度= 100，高度= 50}。","The rectangle that represents the converted ":"表示转换的矩形"," structure horizontally.":"水平结构。"," structure vertically.":"垂直结构。","The truncated value of the  ":"截断的值"," structure to convert.":"转换的结构。","The rectangle to intersect.":"矩形相交。"," structure that is converted from the specified ":"从指定的结构转换"," , ":"，，，，","A third ":"三分之一"," structure the size of which represents the overlapped area of the two specified rectangles.":"结构大小表示两个指定矩形的重叠面积。"," structures are unequal; otherwise, ":" 结构不等；否则, "," if there is any intersection; otherwise, ":"如果有任何十字路口； 否则，"," structure. For example, \"{X=20, Y=20, Width=100, Height=50}\".":"结构体。 例如，“ {x = 20，y = 20，宽度= 100，高度= 50}”。","The amount to offset the location.":"抵消位置的金额。","The rectangle, converted into a new ":"矩形，转换为新的"," structure that contains both of the two rectangles that form the union.":"结构包含构成联合的两个矩形的两个矩形。"," has a value of zero; otherwise, ":"值为零； 否则，"," structure from which to initialize this ":"从哪个结构开始","The width component of the new ":"新的宽度部分","The height component of the new ":"新的高度组件 "," structure to add.":"要添加的结构。"," structure that is the result of the addition operation.":"结构是加法操作的结果。"," structure this method converts to.":"构造此方法转换为。"," and has the same width and height as this ":"并且具有与此相同的宽度和高度",", which contains the result of dividing ":"，其中包含分裂的结果","'s height by ":"的高度","'s width by ":"的宽度",", respectively.":"， 分别。","The result of dividing ":"分裂的结果","'s width and height by ":"的宽度和高度"," structure on the left side of the equality operator.":"平等操作员左侧的结构。"," structure on the right of the equality operator.":"平等操作员右侧的结构。"," have equal width and height; otherwise, ":"具有相等的宽度和高度； 否则，"," structure to which this operator converts.":"该操作员转换的结构。"," structure on the left of the inequality operator.":"不等式操作员左侧的结构。"," structure on the right of the inequality operator.":"不平等操作员右侧的结构。"," differ either in width or height; ":" 宽度或高度不同; "," are equal.":"相等。","The multiplicand.":"乘法。","The multiplier.":"乘数。","The result of multiplying ":"乘以的结果"," structure on the left side of the subtraction operator.":"减法操作员左侧的结构。"," structure on the right side of the subtraction operator.":"减法操作员右侧的结构。"," structure that is the result of the subtraction operation.":"结构是减法操作的结果。"," structure that is a result of the subtraction operation.":"结构是减法操作的结果。","The vertical component of this ":"此的垂直组件"," structure, typically measured in pixels.":"结构，通常以像素测量。"," when this ":"当这个"," structure has both a width and height of 0; otherwise, ":"结构的宽度和高度为0； 否则，","The horizontal component of this ":"此的水平组件"," structure from which to create the new ":"创建新的结构","The pair of numbers to convert.":"这对要转换的数字。","The size, converted into a ":"大小，转换为","The vector, converted into a ":"向量转换为"," structure has both a width and height of zero; otherwise, ":"结构的宽度和高度为零； 否则，"," that is the color of the active window's border.":"那就是活动窗口边框的颜色。"," that is the color of the active window's title bar.":"那就是活动窗口标题栏的颜色。"," that is the color of the text in the active window's title bar.":"这就是Active窗口标题栏中文本的颜色。"}