{"An array of bytes that includes the four bytes to convert.":"一个字节数组，其中包括要转换的四个字节。","A 32-bit signed integer formed by four bytes beginning at ":"一个由四个字节形成的32位签名整数","A 64-bit signed integer formed by eight bytes beginning at ":"一个64位签名的整数，由八个字节开始","A 64-bit signed integer representing the converted bytes.":"一个64位签名的整数，代表转换的字节。","A 32-bit signed integer representing the converted bytes.":"一个代表转换为字节的32位签名整数。","A single-precision floating point number formed by four bytes beginning at ":"从四个字节形成的单精度浮点数","A single-precision floating-point value representing the converted bytes.":"一个代表转换字节的单精度浮点值。","An array of bytes.":"一系列字节。","A string of hexadecimal pairs separated by hyphens, where each pair represents the corresponding element in ":"一串十六进制对，由连字符分开，其中每对表示相应的元素","; for example, \"7F-2C-4A-00\".":"; 例如，“ 7F-2C-4A-00”。","The array of bytes that includes the two bytes to convert.":"字节数组包括两个要转换的字节。","The number of array elements in ":"数组元素中的数量","A string of hexadecimal pairs separated by hyphens, where each pair represents the corresponding element in a subarray of ":"一连串的十六进制对，由连字符分开，其中每对代表一个子阵列中的相应元素","An array of bytes that includes the bytes to convert.":"包含要转换字节的字节数组。","A 16-bit unsigned integer formed by two bytes beginning at ":"一个由两个字节形成的16位未签名整数","An 16-bit unsigned integer representing the converted bytes.":"一个16位的无符号整数，代表转换的字节。","A 32-bit unsigned integer representing the converted bytes.":"一个代表转换字节的32位未签名整数。","A 64-bit unsigned integer representing the converted bytes.":"一个代表转换为字节的64位无符号整数。","When this method returns, the bytes representing the converted character.":"当此方法返回时，代表转换字符的字节。","The Boolean to convert.":"布尔值转换。","A 32-bit unsigned integer formed by four bytes beginning at ":"一个由四个字节形成的32位未签名整数","When this method returns, the bytes representing the converted Boolean.":"当此方法返回时，代表转换为布尔值的字节。","When this method returns, the bytes representing the converted double-precision floating-point value.":"当此方法返回时，代表转换后的双精度浮点数值的字节。"," if the conversion was successful; ":"如果转换成功；","A 64-bit unsigned integer formed by the eight bytes beginning at ":"从八个字节形成的64位未签名整数","The double-precision floating-point value to convert.":"要转换的双精度浮点值。","When this method returns, the bytes representing the converted 16-bit signed integer.":"当此方法返回时，代表转换后的16位签名整数的字节。","When this method returns, the bytes representing the converted single-precision floating-point value.":"当此方法返回时，代表转换的单精度浮点数值的字节。","When this method returns, the bytes representing the converted 64-bit signed integer.":"当此方法返回时，代表转换后的64位签名整数的字节。","When this method returns, the bytes representing the converted half-precision floating-point value.":"当此方法返回时，代表转换的半精度浮点数值的字节。","When this method returns, the bytes representing the converted 32-bit signed integer.":"当此方法返回时，代表转换后的32位签名整数的字节。","The 16-bit signed integer to convert.":"16位签名的整数要转换。","When this method returns, the bytes representing the converted unsigned 16-bit integer.":"当此方法返回时，代表转换的未签名16位整数的字节。","The unsigned 16-bit integer to convert.":"未签名的16位整数要转换。","The 32-bit signed integer to convert.":"32位签名的整数要转换。","The 64-bit signed integer to convert.":"64位签名的整数要转换。","The unsigned 32-bit integer to convert.":"未签名的32位整数要转换。","The unsigned 64-bit integer to convert.":"未签名的64位整数要转换。","When this method returns, the bytes representing the converted unsigned 32-bit integer.":"当此方法返回时，代表转换后的无符号32位整数的字节。","A single-precision floating point number whose bits are identical to ":"一个单位浮点数，其位与"," object to compare to this instance.":"对象与此实例进行比较。","A half-precision floating point number whose bits are identical to ":"半精度的浮点数，其位与",".\n\n ":"。","When this method returns, the bytes representing the converted unsigned 64-bit integer.":"当此方法返回时，代表转换后的无符号64位整数的字节。","A double-precision floating point number whose bits are identical to ":"双精度的浮点数，其位与","This parameter is ignored.":"此参数被忽略。","1 if this instance is ":"1如果此实例是","A signed integer that indicates the relative order of this instance and ":"一个签名的整数，指示此实例的相对顺序和","A signed integer that indicates the relative values of this instance and ":"一个签名的整数，指示此实例的相对值和","The enumerated constant ":"枚举常数","The desired type.":"所需类型。","1 if the value of this instance is ":"1如果此实例的值是","A span containing the characters representing the value to convert.":"包含代表要转换值的字符的跨度。","An object to compare to this instance.":"与此实例进行比较的对象。","; otherwise, 0.":"; 否则，0。","\"True\" (the value of the ":"“ true”（价值"," implementation that supplies culture-specific information about the format of the returned value.":"提供有关返回值格式的特定文化信息的实施。","This conversion is not supported. No value is returned.":"不支持这种转换。 没有返回值。"," property) if the value of this instance is ":"属性）如果此实例的值为"," is equivalent to ":"等同于"," and has the same value as this instance; otherwise, ":"并具有与此实例相同的值； 否则，",", or \"False\" (the value of the ":"或“ false”（价值"," if the value of this instance is ":"如果此实例的值是","A string containing the value to convert.":"一个包含要转换值的字符串。","An object of the specified type, with a value that is equivalent to the value of this ":"指定类型的对象，其值等效于此值",". If the conversion failed, contains ":"。 如果转换失败，则包含","(Reserved) An ":"（保留）","The byte at the specified location in the array.":"数组中指定位置的字节。","When this method returns, this instance's value formatted as a span of characters.":"当此方法返回时，此实例的值格式为一个字符的跨度。","The zero-based byte offset into ":"基于零的字节偏移到",". The conversion fails if ":"。 如果转换失败，如果","The address of the bytes to copy.":"要复制的字节的地址。","A value to assign.":"分配的值。","An array.":"数组。","When this method returns, the number of characters that were written in ":"当此方法返回时，写在其中的字符数量"," or is not equal to the value of either the ":"或不等于任何一个的值","The target address.":"目标地址。","The number of bytes in the array.":"数组中的字节数。","The maximum length of an array instance that may be stored in the pool.":"可以存储在池中的数组实例的最大长度。","When this method returns, if the conversion succeeded, contains ":"当此方法返回时，如果转换成功，则包含","The source buffer.":"源缓冲区。","The number of bytes available in the destination memory block.":"目标内存块中可用的字节数。","A location in the array.":"阵列中的位置。","The maximum number of array instances that may be stored in each bucket in the pool. The pool groups arrays of similar lengths into buckets for faster access.":"可以存储在池中每个存储桶中的数组实例的最大数量。 泳池组类似长度的阵列将其用于存储桶，以更快地访问。"," method will not see the content of the previous caller. If ":"方法将看不到上一个呼叫者的内容。 如果","The minimum length of the array.":"阵列的最小长度。","Indicates whether the contents of the buffer should be cleared before reuse. If ":"指示在重复使用之前是否应清除缓冲区的内容。 如果"," class with the specified configuration.":"具有指定配置的类。","The offset to the element within the memory buffer to which the returned ":"返回到的内存缓冲区中元素的偏移","An array of type T that is at least ":"至少是T型"," points.":"点。","A handle used to pin array buffers.":"用于固定阵列缓冲区的手柄。",", and if the pool will store the buffer to enable subsequent reuse, the ":"，如果池将存储缓冲区以启用后续重复使用，则"," or if the pool will release the buffer, the array's contents are left unchanged.":"或者，如果池将释放缓冲区，则阵列的内容不变。"," in length.":"长度。","A reference to a manually managed object, or ":"对手动管理对象的引用，或","A shared ":"共享"," method will clear the ":"方法将清除","A handle to the block of memory.":"记忆块的手柄。","A buffer to return to the pool that was previously obtained using the ":"一个缓冲区返回到以前使用的池"," if there is no memory manager.":"如果没有内存管理器。","The memory belonging to this owner.":"属于此所有者的内存。","A pointer to memory.":"指向内存的指针。"," of its contents so that a subsequent caller using the ":"它的内容，以便随后的呼叫者使用","The number of elements in the memory buffer, starting at offset 0.":"内存缓冲区中元素的数量，从偏移0开始。","A pointer to the memory block.":"指向内存块的指针。","A handle to the memory that has been pinned.":"固定的记忆的手柄。","A memory buffer.":"内存缓冲区。","An object to compare, or ":"比较的对象","An object that supplies culture-specific parsing information about ":"提供有关文化特定解析信息的对象","The array segment to write to.":"阵列段要写入。","The string representation of the value of this object, which consists of a sequence of digits that range from 0 to 9 with no leading zeroes.":"该对象值的字符串表示，该值由一个数字序列组成，范围从0到9，没有领先的零。","The offset to the element at which the returned memory buffer starts.":"返回的内存缓冲区启动的元素的偏移。","The enumerated constant, ":"枚举常数，","The string representation of the value of this object in the format specified by the ":"该对象值的字符串表示形式，以由"," if the value of the current instance is not zero; otherwise, ":"如果当前实例的值不为零； 否则，"," if the method succeeded in retrieving the array segment; otherwise, ":"如果该方法成功地检索了数组段； 否则，","The number of elements to include in the returned memory buffer.":"在返回的内存缓冲区中包含的元素数量。","An object that supplies culture-specific information about the format of ":"提供有关文化特定信息格式的对象","A numeric format string.":"数字格式字符串。","The value of the current instance, unchanged.":"当前实例的值不变。","The memory block handled by this ":"该记忆块由此处理","A memory buffer that consists of ":"一个由记忆缓冲区组成的"," object, formatted as specified by the ":"对象，按照由"," elements starting at offset ":"元素从偏移开始","The value of the current instance, converted to a ":"当前实例的值转换为","A read-only span of objects of type ":"类型的仅读取对象",", the thread current culture is used.":"，使用线电流文化。","A span containing the charactes that represent a standard or custom format string that defines the acceptable format for ":"包含代表标准或自定义格式字符串的字符的跨度，该字符串定义可接受的格式","The value of the current instance, converted to an ":"当前实例的值，转换为","A memory span that wraps the underlying memory buffer.":"包裹基础内存缓冲区的内存跨度。","A byte value that is equivalent to the number contained in ":"一个字节值等效于包含的数字","A state object of type ":"类型的状态对象","An optional object that supplies culture-specific formatting information for ":"一个可选的对象，可为文化特定格式提供信息","The type to which to convert this ":"转换的类型","The offset to the element in the memory buffer at which the returned ":"返回的内存缓冲区中元素的偏移","A span of objects of type ":"类型对象的跨度","A string that contains a number to convert. The string is interpreted using the ":"一个包含一个要转换的数字的字符串。 使用该字符串使用","A span containing the characters representing the number to convert.":"包含代表要转换数字的字符的跨度。"," implementation that supplies information about the format of the returned value.":"提供有关返回值格式的信息。"," if the conversion succeeded, or zero if the conversion failed. This parameter is passed uninitialized; any value originally supplied in ":"如果转换成功，则如果转换失败，则为零。 该参数通过非初始化； 最初提供的任何价值","An 8-bit unsigned integer to compare.":"一个8位未签名的整数进行比较。"," style.":"风格。"," value equivalent to the number contained in ":"等同于包含的数字的值","A span containing the characters representing the number to convert. The span is interpreted using the ":"包含代表要转换数字的字符的跨度。 使用","The value of the current instance, converted to ":"当前实例的值，转换为","A string that contains a number to convert. The string is interpreted using the style specified by ":"一个包含一个要转换的数字的字符串。 使用由","The 21-bit Unicode code point represented by the ":"21位Unicode代码点由","A signed number indicating the position of this instance in the sort order in relation to the ":"一个签名的数字，指示此实例的位置，以相关的排序顺序","The numeric value of ":"数值","When this method returns, contains the 8-bit unsigned integer value equivalent to the number contained in ":"当此方法返回时，包含8位未签名的整数值等于","The character to analyze.":"要分析的字符。","A string that contains a character or surrogate pair.":"包含字符或替代对的字符串。","An object to compare this instance to, or ":"将此实例与或"," if the conversion succeeded, or zero if the conversion failed. The conversion fails if the ":"如果转换成功，则如果转换失败，则为零。 转换失败，如果"," if that character represents a number; otherwise, -1.0.":"如果该字符代表一个数字； 否则，-1.0。","The index position of the character or surrogate pair in ":"角色或替代对的索引位置"," is an ASCII character; ":"是ASCII角色；","A 21-bit Unicode code point.":"21位Unicode代码点。",", is not of the correct format, or represents a number less than ":"，不是正确的格式，或代表小于","The character position in ":"角色位置","The Unicode character to evaluate.":"unicode角色要评估。","The 21-bit Unicode code point represented by the character or surrogate pair at the position in the ":"21位Unicode代码点由字符或替代对表示的位置","A string consisting of one ":"一个由一个组成的字符串"," or greater than ":"或大于"," is a control character; otherwise, ":"是控制字符； 否则，","The numeric value of the character at position ":"角色在位置的数值"," object or a surrogate pair of ":"对象或替代对"," parameter specified by the ":"参数由"," if that character represents a number; otherwise, -1.":"如果该字符代表一个数字； 否则，-1。","A string.":"字符串。","A string containing a number to convert. The string is interpreted using the style specified by ":"一个包含要转换数字的字符串。 使用由"," objects equivalent to the code point specified by the ":"对象等同于代码点","The Unicode character to categorize.":"Unicode字符要分类。"," parameter equals the value of this instance; otherwise, ":"参数等于此实例的值； 否则，"," in Visual Basic), the current exception is raised in a ":"在Visual Basic）中，当前例外是在","The position of the character to evaluate in ":"角色评估的位置","A high surrogate code unit (that is, a code unit ranging from U+D800 through U+DBFF).":"高替代代码单元（即，一个从U+D800到U+DBFF的代码单元）。"," value that identifies the group that contains ":"识别包含组的组的价值","An object to compare with this instance or ":"与此实例进行比较的对象或"," if the numeric value of the ":"如果数值","A low surrogate code unit (that is, a code unit ranging from U+DC00 through U+DFFF).":"低替代代码单元（即，一个从U+DC00到U+DFFF的代码单元）。"," if the character at position ":"如果角色处于位置"," enumerated constant that identifies the group that contains the character at position ":"列举常数，标识包含角色位置的组","The Unicode character to convert.":"要转换的Unicode字符。"," is a number; otherwise, ":"是一个数字； 否则，"," parameter ranges from U+D800 through U+DBFF; otherwise, ":"参数范围从u+d800到u+dbff; 否则，"," is a decimal digit; otherwise, ":"是十进制数字； 否则，","The starting position of the pair of characters to evaluate within ":"在内部评估的一对字符的开始位置","A string that contains a single character, or ":"一个包含一个字符的字符串，或"," is a punctuation mark; otherwise, ":"是标点符号； 否则，"," if the numeric value of the specified character in the ":"如果在","The format to use.   \n -or-   \n A ":"要使用的格式。 \n  -或者- \n  一个"," parameter includes adjacent characters at positions ":"参数包括位置的相邻字符","A Unicode character equivalent to the sole character in ":"等效于唯一字符的Unicode字符"," is a separator character; otherwise, ":"是一个分离器角色； 否则，"," is a letter; otherwise, ":"是一封信； 否则，"," + 1, and the numeric value of the character at position ":"+ 1，角色的数值在位置"," reference (":"参考 （","The converted value of the current ":"电流的转换值"," is either a high surrogate or a low surrogate; otherwise, ":"是高代替代物或低代孕剂； 否则，"," in Visual Basic) to use the default format defined for the type of the ":"在Visual Basic中）使用针对该类型定义的默认格式"," ranges from U+D800 through U+DBFF, and the numeric value of the character at position ":"范围从u+d800到u+dbff，以及角色在位置的数字值"," is a letter or a decimal digit; otherwise, ":"是字母或十进制数字； 否则，"," object unchanged.":"对象不变。"," is a either a high surrogate or a low surrogate; otherwise, ":"是高代替代人或低替代物； 否则，"," is a lowercase letter; otherwise, ":"是小写字母； 否则，","No value is returned.":"没有返回值。","+1 ranges from U+DC00 through U+DFFF; otherwise, ":"+1范围从u+dc00到u+dfff; 否则，"," implementation.":"执行。","The character to evaluate as the high surrogate of a surrogate pair.":"评估作为替代对的高代替代物的角色。","An object of the specified type.":"指定类型的对象。","The character to evaluate.":"要评估的角色。","The provider to use to format the value.   \n -or-   \n A ":"用于格式化值的提供商。 \n  -或者- \n  一个"," is a symbol character; otherwise, ":"是符号字符； 否则，","The character to evaluate as the low surrogate of a surrogate pair.":"评估为替代对的低替代物的角色。"," object. (Specify ":"目的。 （指定"," parameter ranges from U+DC00 through U+DFFF; otherwise, ":"参数范围从u+dc00到u+dfff; 否则，"," is an uppercase letter; otherwise, ":"是一封大写字母； 否则，"," parameter ranges from U+D800 through U+DBFF, and the numeric value of the ":"参数范围从u+d800到u+dbff，以及"," in Visual Basic) to obtain the numeric format information from the current locale setting of the operating system.":"在Visual Basic中）从操作系统的当前语言环境设置中获取数字格式信息。"," parameter is ignored.)":"参数被忽略。）","The lowercase equivalent of ":"等效的小写"," is white space; otherwise, ":"是白空间； 否则，","The character array to write.":"字符阵列要写。"," is not 1. This parameter is passed uninitialized.":"不是1.该参数通过非初始化。","The value of the current instance in the specified format.":"指定格式中当前实例的值。",", or the unchanged value of ":"，或不变的价值","A UInt32 to output.":"UINT32输出。","A span containing the characters that represent a standard or custom format string that defines the acceptable format for ":"包含代表标准或自定义格式字符串的字符的跨度，该字符串定义可接受格式","The character array to write data from.":"字符阵列从中写入数据。"," that is a copy of the current ":"那是当前的副本"," is already lowercase or not alphabetic.":"已经是小写或不字母的。","Starting index in the buffer.":"在缓冲区中启动索引。"," representing the asynchronous line writing operation.":"代表异步线写作操作。",", modified according to ":"，根据"," if the index is successfully incremented and within the enumerated string; otherwise, ":"如果索引成功地增加并在枚举的字符串中； 否则，"," section that the enumerator should refer to.":"枚举者应参考的节。","The lowercase equivalent of the ":"等效的小写","The Unicode character currently referenced by this ":"当前引用的Unicode字符","The buffer containing characters to write.":"包含字符写的缓冲区。"," for the specified range of elements in the ":"对于指定的元素范围","The integer to write.":"编写整数。"," parameter, or the unchanged value of ":"参数或不变的值","The index within the buffer to start writing at.":"缓冲区内的索引开始写作。","The boxed Unicode character currently referenced by this ":"当前引用的盒装Unicode字符"," which represents a subset of the elements in the source ":"代表源中元素的子集","The 8-byte integer to write.":"编写的8字节整数。","The string representation of the value of ":"值的字符串表示"," if CLS-compliant; otherwise, ":"如果符合CLS； 否则，"," that indicates the encoding for the text writer to use.":"这指示了文本作者使用的编码。","The formatting string.":"格式字符串。","(Reserved) An object that supplies culture-specific formatting information.":"（保留）提供特定文化格式信息的对象。"," if the program element is CLS-compliant; otherwise, ":"如果程序元素符合CLS； 否则，","The number of spaces to indent.":"缩进的空间数量。","The object to write into the formatted string.":"写入格式的字符串的对象。","The name of the tool that generated the code.":"生成代码的工具的名称。","The string representation of the value of this instance as specified by ":"该实例的值的字符串表示","The new line character to use.":"新的线字符要使用。"," whose elements should be inserted into the ":" 其元素应插入 ","The formatting string to use.":"要使用的格式字符串。","The version of the tool that generated the code.":"生成代码的工具的版本。","The uppercase equivalent of ":"大写等效"," whose elements are copied to the new list.":"其元素被复制到新列表。"," wrapper around ":"包装器","The first object to write into the formatted string.":"第一个写入格式化字符串的对象。","The name of the tool that generated to code.":"生成代码的工具的名称。"," to copy multiple times in the new ":"在新的","The second object to write into the formatted string.":"第二个要写入格式化的字符串的对象。"," is already uppercase, has no uppercase equivalent, or is not alphabetic.":"已经是大写，没有大写等效物，也不是字母。"," to wrap.":"包裹。"," to use for output.":"用于输出。","The number of times ":"次数","The argument array to output.":"参数数组要输出。","The uppercase equivalent of the ":"大写等效的","The tab string to use for indentation.":"用于凹痕的标签字符串。"," wrapper around the ":" 包装在 "," should be copied.":"应该复制。","The array to write from.":"从中写的阵列。"," is already uppercase or not alphabetic.":"已经是大写或不是字母的。"," representing the asynchronous dispose operation.":"代表异步处置操作。"," number of elements, all of which are copies of ":"元素的数量，所有这些都是"," whose elements should be added to the end of the ":"应将其元素添加到结尾","Index in the array to stort writing at.":"在阵列中的索引索引写作。","When this method returns, contains a Unicode character equivalent to the sole character in ":"当此方法返回时，包含一个等同于唯一字符的Unicode字符"," representing the asynchronous flush operation.":"代表异步冲洗操作。"," to locate. The value can be ":"定位。 值可以是"," index at which to start copying the elements of ":"索引开始复制元素","The characters to write.":"要写的字符。",", if the conversion succeeded, or an undefined value if the conversion failed. The conversion fails if the ":"，如果转换成功，则如果转换失败，则不确定的值。 转换失败，如果","The Boolean value to write.":"布尔值得写的价值。"," whose elements to copy to the ":"其元素要复制到"," to use the default comparer that is the ":"使用默认比较是"," or the length of ":"或长度","Token for canceling the operation.":"代币取消操作。"," implementation to use when comparing elements.  \n  \n -or-  \n  \n A null reference (":"比较元素时要使用的实现。 \n  \n  -或者- \n  \n  null引用（","The character to write.":"要写的角色。"," is found; otherwise, a negative number, which is the bitwise complement of the index of the next element that is larger than ":"被发现； 否则，一个负数，这是下一个元素的索引的位互补，该元素大于"," in Visual Basic) to use the ":"在Visual Basic中）使用","The Boolean to write.":"布尔人写的。","An array of the specified element type containing copies of the elements of the ":"指定元素类型的数组，其中包含元素的副本"," if found; otherwise ":"如果发现； 否则"," array containing copies of the elements of the ":"阵列包含元素的副本"," wrapper with a fixed size.":"固定尺寸的包装器。","The number of elements actually contained in the ":"实际包含的元素数量"," and the default comparer is each key's implementation of ":"默认比较是每个密钥的实现"," if the current set is a proper subset of other; otherwise ":"如果当前集是其他组的适当子集； 否则","The zero-based starting index of the ":"基于零的起始索引"," object that supplies the hash codes for all keys in the ":"为提供哈希代码的对象","The element ":"元素","The context information about the source or destination of the serialization.":"有关序列化源或目的地的上下文信息。"," if the collection is a proper superset of other; otherwise ":"如果该系列是其他合适的超集； 否则","The key of the current element of the enumeration.":"枚举当前元素的关键。","The object defined in each key/value pair.":"每个密钥/值对中定义的对象。"," to use the default hash code provider, which is each key's implementation of ":"使用默认哈希代码提供商，这是每个密钥的实现"," of the destination array to create and copy elements to.":"目的地阵列的创建和复制元素。"," if the current set is a subset of other; otherwise ":"如果当前集是其他集合的子集； 否则","The value of the current element of the enumeration.":"枚举当前元素的值。","A 16-bit signed integer that is the default value.":"一个16位签名的整数，是默认值。"," object to use to determine whether two keys are equal.  \n  \n -or-  \n  \n ":"用于确定两个键是否相等的对象。 \n  \n  -或者-","The definition associated with ":"与","An object that compares members of the current collection object with the corresponding members of ":"将当前集合对象成员与相应成员进行比较的对象","if the current set and other share at least one common element; otherwise, ":"如果当前集和其他共享至少一个共同元素； 否则，","A 32-bit signed integer that is the default value.":"一个32位签名的整数，是默认值。","A number in the range from 0.1 through 1.0 that is multiplied by the default value which provides the best performance. The result is the maximum ratio of elements to buckets.":"从0.1到1.0的范围内的数字乘以提供最佳性能的默认值。 结果是元素与存储桶的最大比率。","The key of the current ":"电流的关键"," object.  \n  \n -or-  \n  \n ":"目的。 \n  \n  -或者-","A signed integer that indicates the relationship of the current collection object to ":"一个指示当前收集对象之间关系的签名整数"," if the current set is equal to other; otherwise, ":"如果当前组等于其他集合； 否则，","A 64-bit signed integer that is the default value.":"一个64位签名的整数，是默认值。","The key of the new ":"新的关键","The key in the key/value pair.":"密钥/值对中的键。","The approximate number of elements that the ":"大约元素数量"," in the sort order:":"按顺序："," that represents the default value.":"这代表默认值。"," to be created.":"要创建。","The default signed byte value.":"默认签名的字节值。"," contains an element with the specified ":"包含指定的元素","The value in the key/value pair.":"键/值对中的值。"," - If less than 0, the current instance precedes ":" -如果小于0，则当前实例先于 ","The value of the new ":"新价值"," that may be used to cancel the asynchronous iteration.":"可以用来取消异步迭代。","The hash code for ":"哈希代码","A single-precision floating point number that is the default value.":"默认值的单精度浮点数。","A key/value pair containing the provided arguments as values.":"一个键/值对，其中包含提供的参数为值。"," - If 0, the current instance and ":" - 如果0，当前实例和"," to compare with ":"比较","An enumerator that can be used to iterate asynchronously through the collection.":"可以用来通过集合来迭代异步的枚举者。"," that represents the type to convert the value to.":"这代表将值转换为的类型。"," - If greater than 0, the current instance follows ":" - 如果大于0，则当前实例如下",", which includes the string representations of the key and value.":"，其中包括键和值的字符串表示。","The key in the ":"关键"," that can be converted to the type using the ":"可以使用"," that is the key of the ":"那是关键"," that will complete with a result of ":" 这将完成与结果 ","The list that is wrapped by the new collection.":"新集合包裹的列表。"," that is the value of the ":"那就是"," to use for the ":"用于使用"," for the type and the U.S. English culture.":"对于类型和美国英语文化。","The new value for the element at the specified index. The value can be ":"在指定索引处的元素的新值。 值可以是","The object that can dispense hash codes.":"可以分配哈希代码的对象。"," object to copy to a new ":"对象复制到新的","The default unsigned 16-bit integer value.":"默认未签名的16位整数值。","The list to wrap.":"要包装的列表。"," if the enumerator was successfully advanced to the next element, or ":" 如果枚举器已成功推进到下一个元素，或 "," if the key does not exist.":"如果密钥不存在。"," object that defines the hash code provider and the comparer to use with the ":"定义哈希代码提供商的对象以及与"," if the object that implements the ":"如果实现的对象"," wraps.":"包裹。","The default unsigned integer value.":"默认无符号整数值。"," object containing the keys of the ":"包含键的对象"," to use the default hash code provider and the default comparer. The default hash code provider is each key's implementation of ":"使用默认哈希代码提供商和默认比较。 默认哈希代码提供商是每个密钥的实现"," interface contains an element that has the specified key; otherwise, ":"接口包含一个具有指定键的元素； 否则，"," that is the default value.":"那是默认值。"," containing both the key and the value of the current dictionary entry.":"包含当前字典条目的密钥和值。","The default unsigned long integer value.":"默认未签名的长整数值。","An object whose type is ":"一个类型是的对象","An 8-bit unsigned integer that is the default value.":"一个8位未符号整数，是默认值。","The element that has the specified key in the read-only dictionary.":"在仅读字典中具有指定键的元素。"," and whose value is equivalent to ":"以及其价值等同于","The default value.":"默认值。"," to insert a line break every 76 characters, or ":" 每76个字符插入一个换行符，或 ",".\n\n -or-\n\n A null reference (":"。 \n\n  -或者- \n\n  null引用（","The item to check if the set contains.":"检查集合是否包含的项目。","A Unicode character that is the default value.":"一个默认值的Unicode字符。"," that represents the default value of the property this attribute is bound to.":"代表该属性绑定到属性的默认值。"," in Visual Basic), if ":"在Visual Basic中），如果"," to not insert line breaks.":"不要插入线路断裂。"," is not zero; otherwise, ":"不是零； 否则，","A double-precision floating point number that is the default value.":"默认值的双精度浮点数。"," that is the browsable state of the property or method.":"那是属性或方法的可朗布状态。","An array of 8-bit unsigned integers.":"一个8位未签名整数的数组。"," is not a value type.":"不是价值类型。",", rounded to the nearest 8-bit unsigned integer. If ":"，被舍入到最近的8位未签名整数。 如果","The date and time value to convert.":"转换的日期和时间值。"," are equal.\n\n -or-\n\n A null reference (":"相等。 \n\n  -或者- \n\n  null引用（","The string representation, in base 64, of the contents of ":"基数64中的字符串表示形式","The type of object to return.":"要返回的对象的类型。","The double-precision floating-point number to convert.":"要转换的双精度浮点数。"," is halfway between two whole numbers, the even number is returned; that is, 4.5 is converted to 4, and 5.5 is converted to 6.":"是两个整数之间的一半，均匀的数字被返回； 也就是说，4.5转换为4，5.5转换为6。","An object whose underlying type is ":"一个基础类型的对象","The string representation in base 64 of the elements in ":"基础64中元素的字符串表示形式","A date and time value.":"日期和时间值。",", or zero if ":"，或零如果",", which reflects the value returned by invoking the ":"，这反映了通过调用返回的值","An offset in ":"偏移","A position within ":"内部的位置","The date and time equivalent of the value of ":"日期和时间等效于价值","The 8-bit signed integer to be converted.":"要转换的8位签名整数。"," method for the underlying type of ":"基础类型的方法","An array of 8-bit unsigned integers equivalent to ":"一个8位未签名的整数等效的数组","The string representation in base 64 of ":"基础64中的字符串表示",", or a date and time equivalent of ":"，或日期和时间等同于","The 8-bit signed integer to convert.":"8位签名的整数要转换。","A single-precision floating-point number.":"单精度的浮点数。"," elements at position ":"位置的元素"," elements of ":"要点","The single-precision floating-point number to convert.":"要转换的单精度浮点数。","The base of the number in ":"数字的基础",", or the date and time equivalent of ":"，或日期和时间等同于","An array of 8-bit unsigned integers that is equivalent to ":"一组8位未签名的整数等同于","A string that contains the value of either ":"一个包含任何一个值的字符串",", which must be 2, 8, 10, or 16.":"，必须是2、8、10或16。",", starting at position ":"，从位置开始","The string representation of a date and time.":"日期和时间的字符串表示形式。","The span to convert.":"要转换的跨度。","An object that supplies culture-specific formatting information. This parameter is ignored.":"提供特定文化格式信息的对象。 此参数被忽略。","An 8-bit unsigned integer that is equivalent to the number in ":"一个8位未签名的整数，等效于数字","A read-only span of 8-bit unsigned integers.":"仅读取的8位未签名整数。","A string that contains a date and time to convert.":"一个包含转换日期和时间的字符串。","The 16-bit unsigned integer to convert.":"16位未签名的整数要转换。","An object.":"一个东西。",", or 0 (zero) if ":"，或0（零）如果","One of the enumeration values that specify whether to insert line breaks in the return value. The default value is ":"指定是否插入线路断路的枚举值之一。 默认值是","The 32-bit unsigned integer to convert.":"32位未签名的整数要转换。","The decimal number that is equivalent to ":"相当于的小数","An input array of 8-bit unsigned integers.":"8位未签名整数的输入阵列。",". If the length of ":"。 如果长度","A Unicode character that is equivalent to ":"一个等效的Unicode字符","The 64-bit unsigned integer to convert.":"64位未签名的整数要转换。","A decimal number that is equivalent to ":"一个相当于的十进制数字","An output array of Unicode characters.":"Unicode字符的输出数组。"," is 0, an empty string is returned.":"是0，返回一个空字符串。","The Unicode character to return.":"返回的Unicode字符。","The Boolean value to convert.":"布尔值转换。","A decimal number that is equivalent to the number in ":"一个相当于数字的十进制数字","A 32-bit signed integer containing the number of bytes in ":"一个32位签名的整数，其中包含字节数","The Boolean value to return.":"返回的布尔值。","The number 1 if ":"数字1如果","The decimal number to convert.":"要转换的小数号。","The double-precision floating-point number that is equivalent to ":"双精度浮点数等同于","The string representation in hex of the elements in ":"元素中的弦表示"," is returned unchanged.":"退回不变。","The 8-bit unsigned integer to return.":"8位未签名的整数要返回。","A Unicode character that is equivalent to value, or ":"等效于价值的Unicode字符，或","A double-precision floating-point number that is equivalent to ":"双精度浮点数等同于","The string representation in hex of ":"在十六进制的弦乐表示","An 8-bit unsigned integer that is equivalent to ":"一个8位未签名的整数等同于","The 8-bit unsigned integer to convert.":"8位未签名的整数要转换。","The double-precision floating-point number to return.":"要返回的双精度浮点数。","A string of length 1.":"长度为1的字符串。","A span of 8-bit unsigned integers.":"8位未签名整数的跨度。","The 16-bit unsigned integer equivalent to ":"16位未签名的整数等同于","A double-precision floating-point number equivalent to ":"双精度的浮点数等效于","A number of months. The months parameter can be negative or positive.":"几个月。 月份参数可能为阴性或阳性。","A Unicode character that is equivalent to the first and only character in ":"一个等同于第一个也是唯一字符的Unicode字符","A 16-bit signed integer that is equivalent to ":"一个16位签名的整数等同于","The 8-bit signed integer that is equivalent to ":"8位签名的整数等同于","An object whose value is the sum of the date represented by this instance and months.":"一个对象，其价值是此实例和月份代表的日期的总和。",", rounded to the nearest 16-bit signed integer. If ":"，被舍入到最近的16位签名整数。 如果","A string of length 1 or ":"长度为1或",", rounded to the nearest 16-bit unsigned integer. If ":"，被舍入到最近的16位未签名整数。 如果","The single-precision floating-point number.":"单精度浮点数。","A number of years. The value parameter can be negative or positive.":"多年。 值参数可能为负或正值。","The 16-bit signed integer to return.":"16位签名的整数返回。","A string containing the characters that represent a format specifier that defines the required format of ":"一个字符串，该字符串包含代表格式指定符的字符串，该格式定义了所需格式的格式","A 16-bit unsigned integer that is equivalent to the number in ":"一个16位未签名的整数，等效于数字","A double-precision floating-point number that is equivalent to the number in ":"双精度的浮点数，等效于数字","An object whose value is the sum of the date represented by this instance and the number of years represented by value.":"一个对象，其值是该实例表示的日期的总和和值代表的年数。","A bitwise combination of the enumeration values that provides additional information about ":"枚举价值的比重组合，提供有关的其他信息","The 16-bit unsigned integer to return.":"16位未签名的整数返回。","The 16-bit signed integer equivalent of ":"16位签名的整数等同于"," if the conversion failed. The conversion fails if ":"如果转换失败。 如果转换失败，如果",", about style elements that may be present in ":"，关于可能存在的样式元素","Less than zero if this instance is earlier than value. Greater than zero if this instance is later than value. Zero if this instance is the same as value.":"如果此实例早于值，则小于零。 如果此实例晚于值，则大于零。 零，如果此实例与值相同。"," is an empty string, or does not contain a valid string representation of a date. This parameter is passed uninitialized.":"是一个空字符串，或不包含日期的有效字符串表示。 该参数通过非初始化。",", or about the conversion from ":"，或关于从","A 32-bit unsigned integer that is equivalent to ":"一个32位未签名的整数等同于","A 8-bit signed integer that is equivalent to ":"一个8位签名的整数等同于","A boxed object to compare, or ":"盒装对象进行比较，或"," value. A typical value to specify is ":"价值。 指定的典型值是","A string containing the characters representing a date to convert.":"一个包含代表要转换日期的字符的字符串。"," if the value parameter equals the value of this instance; otherwise, ":"如果值参数等于此实例的值； 否则，","The time of the day.":"一天中的时间。",", rounded to the nearest 32-bit unsigned integer. If ":"，四舍五入到最接近的32位未签名整数。 如果","A 16-bit signed integer that is equivalent to the number in ":"一个16位签名的整数，相当于数字","The string containing date to parse.":"包含分析日期的字符串。"," if value is an instance of DateOnly and equals the value of this instance; otherwise, ":"如果值是dateonly的实例，并且等于此实例的值； 否则，","A 32-bit unsigned integer that is equivalent to the number in ":"一个32位未签名的整数，等效于数字"," instance composed of the date of the current ":"实例由当前日期组成","A 32-bit signed integer that is equivalent to ":"一个32位签名的整数，等效于","The string containing the date to parse.":"包含分析日期的字符串。"," instance composed of the date part of the specified input time ":"实例由指定输入时间的日期部分组成",", rounded to the nearest 32-bit signed integer. If ":"，被舍入到最近的32位签名整数。 如果","The 32-bit unsigned integer to return.":"32位未签名的整数返回。","The number of days since January 1, 0001 in the Proleptic Gregorian calendar.":"1月1日以来的天数为五0001年的Gregorian日历。"," instance and the time specified by the input time.":"实例和输入时间指定的时间。","A number representing the day component of the date represented by this instance.":"代表该实例代表日期的日期组成部分的数字。","The 32-bit signed integer to return.":"32位签名的整数返回。","A 64-bit unsigned integer that is equivalent to ":"一个64位未签名的整数等同于"," structure instance to the specified number of days.":"结构实例为指定的天数。","The number of days since January 1, 0001 in the Proleptic Gregorian calendar represented by this instance.":"1月1日以来的天数为0001，在此实例中代表的是普罗普式的格里高利日历。","One of the enumeration values that indicates whether ticks specifies a local time, Coordinated Universal Time (UTC), or neither.":"指示刻度是否指定本地时间，协调通用时间（UTC）的枚举值之一。"," if left and right represent the same date; otherwise, ":"如果左右表示同一日期； 否则，",", rounded to the nearest 64-bit unsigned integer. If ":"，被舍入到最近的64位未签名整数。 如果","A string that contains the long date string representation of the current ":"一个包含当前的长期字符串表示形式的字符串","A number that represents the day of the week represented by this instance.":"代表本实例代表的一周中的数字。"," if left is later than right; otherwise, ":"如果左为较晚； 否则，","A 64-bit unsigned integer that is equivalent to the number in ":"一个64位未签名的整数，等效于数字","A string that contains the short date string representation of the current ":"一个包含当前的简短日期字符串表示形式的字符串","A 32-bit signed integer equivalent to ":"一个32位有符号整数，相当于 ","A number that represents the day of the year represented by this instance.":"代表以这种情况为代表的一年中的数字。","The 64-bit unsigned integer to return.":"64位未签名的整数要返回。"," if left is the same as or later than right; otherwise, ":"如果左与右左相同； 否则，","A 32-bit signed integer that is equivalent to the number in ":"一个32位签名的整数，等效于数字"," representing the latest possible date that can be created.":"代表可以创建的最新日期。","A string representation of value of the current ":"当前值的字符串表示 "," if left and right do not represent the same date; otherwise, ":"如果左右与右代表同一日期； 否则，","A span containing the string representation that is encoded with base-64 digits.":"包含用基本64数字编码的字符串表示形式的跨度。"," representing the earliest possible date that can be created.":"代表最早可能创建的日期。"," object as specified by provider.":"提供者指定的对象。","A 64-bit signed integer that is equivalent to ":"一个64位有符号整数，相当于 "," if left is earlier than right; otherwise, ":"如果左比右更早； 否则，","A standard or custom date format string.":"标准或自定义日期格式字符串。","A number that represents the month component of the date.":"代表日期的月份组成部分的数字。",", the converted 8-bit unsigned integers. When this method returns ":"，转换后的8位未签名整数。 当此方法返回时",", rounded to the nearest 64-bit signed integer. If ":"，被舍入到最近的64位签名整数。 如果"," if left is the same as or earlier than right; otherwise, ":"如果左与右相同，则相同； 否则，",", either the span remains unmodified or contains an incomplete conversion of ":"，要么跨度保持未修饰，要么包含不完整的转换","A number that represents the year component of the date.":"代表日期的年份组成部分的数字。","The memory span that contains the string to parse.":"包含要解析的字符串的内存跨度。","A 64-bit signed integer that is equivalent to the number in ":"一个64位签名的整数，相当于数字","The year (1 through the number of years in ":"一年（1至年数",", up to the last valid character.":"，直到最后有效的字符。","An 8-bit signed integer that is equivalent to ":"一个8位签名的整数等同于","An object that supplies culture-specific format information about ":"提供有关文化特定格式信息的对象"," object as specified by format.":" 格式指定的对象。","The month (1 through the number of months in ":"月份（1至月数","When this method returns, the number of bytes that were written in ":"当此方法返回时，写入的字节数",", rounded to the nearest 8-bit signed integer. If ":"，被舍入到最近的8位签名整数。 如果","A bitwise combination of enumeration values that indicates the permitted format of ":"枚举值的位组合，指示了允许格式的"," object as specified by format and provider.":"格式和提供商指定的对象。"," if the conversion was successful; otherwise, ":"如果转换成功； 否则，","The calendar that is used to interpret ":"用于解释的日历","The 8-bit signed integer to return.":"8位签名的整数返回。","When this method returns, the number of characters that were written in destination.":"当此方法返回时，在目的地写的字符数量。","An object that is equivalent to the date contained in ":"等效于包含日期的对象","The string representation that is encoded with base-64 digits.":"用基本64数字编码的字符串表示。","An 8-bit signed integer that is equivalent to the number in ":"一个8位签名的整数，相当于数字","The hours (0 through 23).":"小时（0到23）。","A span containing the characters that represent a standard or custom format string that defines the acceptable format for destination.":"一个包含代表标准或自定义格式字符串的字符的跨度，该字符串定义了目的地可接受的格式。",", a span containing the string representation in base 64 of the elements in ":"，一个包含字符串表示形式的跨度64中的元素",", as specified by provider and styles.":"，如提供者和样式所指定的。",", or 0 (zero) if value is ":"，或0（零）如果值为","An optional object that supplies culture-specific formatting information for destination.":"一个可选的对象，为目的地提供特定于文化的格式信息。","The minutes (0 through 59).":"分钟（0到59）。"," is 0, or when this method returns ":"是0，或当此方法返回时","The string that contains the string to parse.":"包含要解析的字符串的字符串。","A span containing the characters representing the date to convert.":"包含代表转换日期的字符的跨度。","The seconds (0 through 59).":"秒（0到59）。","A single-precision floating-point number that is equivalent to ":"单位浮点数等同于",", nothing is written into this parameter.":"，没有写入此参数。","A bitwise combination of the enumeration values that indicates the style elements that can be present in ":"枚举值的位组合，指示可以存在的样式元素"," value equivalent to the date contained in ":"相当于包含日期的价值","One of the enumeration values that indicates whether ":"指示是否的枚举值之一","When this method returns, the total number of characters written into ":"当此方法返回时，字符的总数写入"," is rounded using rounding to nearest. For example, when rounded to two decimals, the value 2.345 becomes 2.34 and the value 2.355 becomes 2.36.":"使用舍入到最近的圆形。 例如，当四舍五入到两个小数时，值2.345变为2.34，值2.355变为2.36。"," parameter is empty string, or does not contain a valid string representation of a date. This parameter is passed uninitialized.":"参数为空字符串，或不包含日期的有效字符串表示。 该参数通过非初始化。"," for the parse operation to succeed, and that defines how to interpret the parsed date. A typical value to specify is ":"为了使解析操作成功，并定义了如何解释解析日期。 指定的典型值是"," specify a local time, Coordinated Universal Time (UTC), or neither.":"指定当地时间，协调的通用时间（UTC）或两者。"," if the conversion is successful; otherwise, ":"如果转换成功； 否则，","The single-precision floating-point number to return.":"单精度浮点数要返回。"," if the s parameter was converted successfully; otherwise, ":"如果S参数成功转换； 否则，","A span containing the characters that represent a date to convert.":"包含代表转换日期的字符的跨度。","The milliseconds (0 through 999).":"毫秒（0到999）。","A single-precision floating-point number that is equivalent to the number in ":"一个单位浮点数，等效于数字","The year (1 through 9999).":"年度（1至9999年）。","A span containing the characters that represent a format specifier that defines the required format of ":"包含代表格式指定的字符的跨度，该格式定义了所需格式的格式","A string containing the characters representing the date to convert.":"一个包含代表转换日期的字符的字符串。","An instance of an object. This parameter is ignored.":"对象的实例。 此参数被忽略。","A date and time expressed in the number of 100-nanosecond intervals that have elapsed since January 1, 0001 at 00:00:00.000 in the Gregorian calendar.":"自1月1日以来经过的100纳秒间隔的日期和时间以00：00：00：00.000在Gregorian日历中经过。",", as specified by format, provider, and style.":"，如格式，提供商和样式所指定的。","The month (1 through 12).":"月（1至12）。"," specifies a local time, Coordinated Universal Time (UTC), or neither.":"指定当地时间，协调的通用时间（UTC）或两者。","An array of allowable formats of ":"一系列允许格式","The base of the return value, which must be 2, 8, 10, or 16.":"返回值的基础，必须为2、8、10或16。","A span containing the characters representing a date to convert.":"包含表示要转换的日期的字符的跨度。","The day (1 through the number of days in ":"日（1至 ","A string containing the characters that represent a date to convert.":"一个包含代表要转换日期的字符的字符串。","A positive or negative time interval.":"正时间间隔或负时间间隔。","An object that supplies the value to convert, or ":"提供要转换值的对象，或","The required format of ":"所需格式的格式","A string that represent a format specifier that defines the required format of ":"代表格式指定符的字符串，该格式定义了所需格式的格式","The year (1 through the number of years in calendar).":"一年（日历中的1至年数）。","An object whose value is the sum of the date and time represented by this instance and the time interval represented by ":"一个对象，其值是该实例代表的日期和时间的总和和代表的时间间隔"," is an empty string, or does not contain a date that correspond to the pattern specified in format. This parameter is passed uninitialized.":"是一个空字符串，或不包含与格式指定的模式相对应的日期。 该参数通过非初始化。",", as specified by format.":"，如格式指定。"," is an object whose value is ":" 是一个对象，其值为 ","The month (1 through the number of months in calendar).":"月（日历中的1至月数）。","A bitwise combination of one or more enumeration values that indicate the permitted format of ":"一个或多个枚举值的位组合，表示允许的格式","A number of whole and fractional days. The ":"整体和分数。 这"," parameter can be negative or positive. Note that this value is rounded to the nearest integer.":"参数可能为负或正面。 请注意，该值舍入到最近的整数。"," parameter can be negative or positive.":"参数可能为负或正面。","The span containing the string to parse.":"包含字符串解析的跨度。","The string to return.":"返回的字符串。","An object whose value is the sum of the date and time represented by this instance and the number of milliseconds represented by ":"该实例代表的日期和时间的总和的对象和代表的毫秒数","The calendar that is used to interpret year, month, and day.":"用于解释年、月和日的日历。","An object whose value is the sum of the date and time represented by this instance and the number of days represented by ":"一个对象，其值是该实例代表的日期和时间的总和和代表的天数"," parameter is an empty string, or does not contain a valid string representation of a date. This parameter is passed uninitialized.":"参数是一个空字符串，或不包含日期的有效字符串表示。 该参数通过非初始化。","The number of days to add. To subtract days, specify a negative number.":"要添加的天数。 要减去天，请指定一个负数。","A 16-bit unsigned integer that is equivalent to ":"16位未签名的整数等同于","A number of whole and fractional minutes. The ":"整体和分数。 这"," if":"如果","A number of whole and fractional hours. The ":"整体和分数小时。 这","A bitwise combination of enumeration values that defines how to interpret the parsed date. A typical value to specify is ":"枚举值的比重组合，定义了如何解释解析日期。 指定的典型值是","An object whose value is the sum of the date and time represented by this instance and the number of hours represented by ":"一个对象，其值是该实例代表的日期和时间的总和和代表的小时数","An object whose value is the sum of the date and time represented by this instance and the number of minutes represented by ":"一个对象，其值是该实例代表的日期和时间的总和和代表的分钟数","An instance whose value is the sum of the date represented by this instance and the number of days represented by value.":"一个实例是该实例代表的日期的总和和值代表的天数。","A number of months. The ":"几个月。 这","An object that is equivalent to the date and time contained in ":"等同于包含的日期和时间的对象","An OLE Automation Date value.":"OLE自动化日期值。"," object as specified by ":"指定的对象","A number of whole and fractional milliseconds. The ":"许多整体和分数毫秒。 这","An object whose value is the sum of the date and time represented by this instance and ":"一个对象，其值是此实例代表的日期和时间的总和","The time's offset from Coordinated Universal Time (UTC).":"时间与协调的通用时间（UTC）相抵消。","An object that represents the same date and time as ":"代表与同一日期和时间的对象",", as specified by ":"，按照","A standard or custom date and time format string.":"标准或自定义日期和时间格式字符串。","A number of whole and fractional seconds. The ":"许多整体和分数秒。 这","A string that contains a date and time to convert. See The string to parse for more information.":"一个包含转换日期和时间的字符串。 有关更多信息，请参见琴弦解析。","A date and time expressed as the number of 100-nanosecond intervals that have elapsed since 12:00:00 midnight on January 1, 0001.":"日期和时间表示是自1月1日午夜0001午夜以来经过的100纳秒间隔的数量。","A string array where each element is the representation of the value of this instance formatted with one of the standard date and time format specifiers.":"一个字符串数组，其中每个元素是用标准日期和时间格式之一的格式格式的该实例值的表示。",", and whose value is the UTC equivalent to the value of the current ":"，其价值是UTC等同于当前值的值"," as specified by ":"按照","An object whose value is the sum of the date and time represented by this instance and the number of seconds represented by ":"一个对象，其值是该实例代表的日期和时间的总和和代表的秒数","A standard date and time format string.":"标准日期和时间格式字符串。"," object that represents a positive or a negative time interval.":"代表正时间间隔或负时间间隔的对象。"," if the converted value is too small to be represented by a ":"如果转换值太小而无法代表","A span containing the characters that represent a date and time to convert.":"包含代表转换日期和时间的字符的跨度。","A string array where each element is the representation of the value of this instance formatted with the ":"一个字符串数组，其中每个元素是与此实例格式的值的表示","A number of 100-nanosecond ticks. The ":"许多100纳秒滴答。 这","An object whose value is the sum of the date and time represented by the current ":"值的值是当前代表的日期和时间的总和"," value equivalent to the date and time contained in ":"价值等同于所包含的日期和时间"," standard date and time format specifier.":"标准日期和时间格式指定符。","A format specifier that defines the required format of ":"定义所需格式的格式指定符"," parameter can be positive or negative.":"参数可以是正面的或负的。"," object and the time interval represented by ":"对象和代表的时间间隔",", is an empty string (\"\"), or does not contain a valid string representation of a date and time. This parameter is passed uninitialized.":"，是一个空字符串（“”），或不包含日期和时间的有效字符串表示。 该参数通过非初始化。","A date and time format string.":"日期和时间格式字符串。",". For more information, see the Remarks section.":"。 有关更多信息，请参见评论部分。","A number of whole and fractional days. The number can be negative or positive.":"整体和分数。 该数字可能为负或阳性。","An object whose value is the sum of the date and time represented by this instance and the time represented by ":"一个对象，其值是该实例代表的日期和时间的总和","An object that supplies culture-specific formatting information about this instance.":"提供有关此实例的特定文化格式信息的对象。","A span containing the characters representing the date and time to convert.":"包含代表转换日期和时间的字符的跨度。","A number of years. The ":"多年。 这"," object and the number of days represented by ":"对象和代表的天数","A string containing a date and time to convert.":"一个包含转换日期和时间的字符串。"," and the value of this instance of ":"以及此实例的价值","A number of whole and fractional hours. The number can be negative or positive.":"整体和分数小时。 该数字可能为负或阳性。","An object whose value is the sum of the date and time represented by this instance and the number of years represented by ":"一个对象，其值是该实例代表的日期和时间的总和和代表的年数","A bitwise combination of enumeration values that defines how to interpret the parsed date in relation to the current time zone or the current date. A typical value to specify is ":"枚举值的比重组合，该值定义了如何解释与当前时区或当前日期有关的解析日期。 指定的典型值是","A date and time.":"日期和时间。"," is within the daylight saving time range for the local time zone; ":"在当地时区的日光节省时间范围内；","A signed number indicating the relative values of ":"一个签名的数字，指示相对值的相对值"," object and the number of hours represented by ":"对象和代表的小时数","A span containing the characters representing a date and time to convert.":"包含代表转换日期和时间的字符的跨度。","One of the enumeration values that indicates whether the new object represents local time, UTC, or neither.":"指示新对象是否代表本地时间，UTC还是两者都表示的枚举值之一。","A 4-digit year.":"四位一年。","A number of whole and fractional milliseconds. The number can be negative or positive.":"许多整体和分数毫秒。 该数字可能为负或阳性。","A signed number indicating the relative values of this instance and the ":"指示此实例的相对值的签名数字和"," if the conversion failed. The conversion fails if either the ":"如果转换失败。 转换失败，如果","A new object that has the same number of ticks as the object represented by the ":"具有与由tick相同的刻度数量的新对象"," parameter.  \n  \n ":"范围。"," is a leap year; otherwise, ":"是leap年； 否则，"," object and the number of whole milliseconds represented by ":"对象和全毫秒的数量"," parameter and the ":"参数和",", is an empty string, or does not contain a date and time that correspond to the pattern specified in ":"，是一个空字符串，或不包含与与指定模式相对应的日期和时间","A signed number indicating the relative values of this instance and ":"指示此实例的相对值的签名数字和","A number of whole and fractional minutes. The number can be negative or positive.":"整体和分数。 该数字可能为负或阳性。"," value specified by the ":"由","The date and time value to add.":"要添加的日期和时间值。",", is ":"， 是"," object and the number of minutes represented by ":"对象和代表的分钟数","The year.":"那一年。","The date and time value to subtract.":"减去日期和时间值。",", or does not contain a valid string representation of a date and time. This parameter is passed uninitialized.":"，或不包含日期和时间的有效字符串表示。 该参数通过非初始化。","A number of whole months. The number can be negative or positive.":"整个月。 该数字可能为负或阳性。","The time interval to add.":"要添加的时间间隔。","The month (a number ranging from 1 to 12).":"这个月（一个从1到12的数字）。","A time interval that is equal to the date and time represented by this instance minus the date and time represented by ":"等于此实例代表的日期和时间的时间间隔减去代表的日期和时间"," or an element of ":"或一个元素","An object that is the sum of the values of ":"一个是值的对象","The number of days in ":"天数"," object and the number of months represented by ":" 对象和所表示的月数 "," is an empty string, or the format of ":"是一个空字符串，或"," represent the same date and time; otherwise, ":"代表相同的日期和时间； 否则，",".  \n  \n For example, if ":"。 \n  \n  例如，如果","An object that is equal to the date and time represented by this instance minus the time interval represented by ":"等于此实例表示的日期和时间的对象减去代表的时间间隔","A number of whole and fractional seconds. The number can be negative or positive.":"许多整体和分数秒。 该数字可能为负或阳性。"," is later than ":"比晚"," object and the number of seconds represented by ":"对象和代表的秒数"," equals 2 for February, the return value is 28 or 29 depending upon whether ":"等于2月2"," is not exactly as specified by at least one of the format patterns in ":"与至少一种格式模式指定的不完全"," interface. (This parameter is not used; specify ":"界面。 （不使用此参数；指定","A number of 100-nanosecond ticks. The number can be negative or positive.":"许多100纳秒滴答。 该数字可能为负或阳性。"," is the same as or later than ":"与或晚相同","A new object with the same date as this instance, and the time value set to 12:00:00 midnight (00:00:00).":"一个与此实例相同日期的新对象，将时间值设置为午夜12:00:00（00:00:00）。"," is a leap year.":"是leap年。"," object and the number of ticks represented by ":"对象和代表的壁虱数量",".)":"）"," do not represent the same date and time; otherwise, ":"不代表同一日期和时间； 否则，","The day component, expressed as a value between 1 and 31.":"一天的组件表示为1至31之间的值。","The return value for this member is not used.":"该成员的返回值不使用。","An enumerated constant that indicates the day of the week of this ":"列举的常数，指示这一周的一天"," is earlier than ":"比"," if the two values are equal; otherwise, ":" 如果两个值相等；否则, ","The current object.":"当前对象。","The day of the year, expressed as a value between 1 and 366.":"一年中的一天，以1到366的价值表示。"," is the same as or earlier than ":"与或早期相同","A number of years. The number can be negative or positive.":"几年了。 该数字可以是负数或正数。","A 64-bit signed integer that encodes the ":"一个64位签名的整数编码","An object of the type specified by the ":"由","The hour component, expressed as a value between 0 and 23.":"小时组件表示为0到23之间的值。"," object and the number of years represented by ":"对象和代表的年数","The date and time value to subtract from (the minuend).":"从（最小值）减去的日期和时间值。"," property in a 2-bit field and the ":" 属性在一个2位字段和 "," parameter, with a value equivalent to the current ":"参数，值等于电流"," property in a 62-bit field.":"在62位字段中的属性。","The destination for this serialization. (This parameter is not used; specify ":"此序列化的目的地。 （不使用此参数；指定","The date and time value to subtract (the subtrahend).":"减去的日期和时间值（子图片）。","A signed integer that indicates whether the value of the ":"一个签名的整数，指示是否值","One of the enumeration values that indicates what the current time represents. The default is ":"表示当前时间所代表的枚举值之一。 默认值为 "," object expressed as a Windows file time.":"对象表示为Windows文件时间。","The time interval between ":"之间的时间间隔","An object that is equivalent to the ":"等效于"," parameter is earlier than, later than, or the same time as the value of the ":"参数比，比晚期或与该值相同的时间","The milliseconds component, expressed as a value between 0 and 999.":"毫秒组件，表示为0到999之间的值。","; that is, ":"; 那是，"," parameter, as the following table shows.  \n  \n ":"参数，如下表所示。",", and whose value is the local time equivalent to the value of the current ":"，其价值是当地时间等同于当前的价值"," object that was serialized by the ":"被序列化的对象","The minute component, expressed as a value between 0 and 59.":"微小分量表示为0到59之间的值。","The date and time value to subtract from.":"减去日期和时间值。","A Windows file time expressed in ticks.":"Windows文件时间在tick中表达。"," object, or ":"对象或","An object to compare with the current ":"与电流相比的对象","The time interval to subtract.":"减去的时间间隔。","The month component, expressed as a value between 1 and 12.":"月份分量，表示为1至12之间的值。","An object that represents the local time equivalent of the date and time represented by the ":"代表当地时间等效日期和时间的对象"," if the converted value is too large to be represented by a ":"如果转换的值太大，以至于由","A signed integer that indicates the relationship between the current ":"一个指示当前关系的签名整数","An object whose value is the value of ":"一个值是一个值的对象","An object whose value is the current local date and time.":"一个值是当前本地日期和时间的对象。",", as the following table shows.  \n  \n ":"，如下表所示。","An object that represents the UTC time equivalent of the date and time represented by the ":"代表UTC时间等效日期和时间的对象"," if the converted value is too small to be represented as a ":"如果转换值太小而无法表示为","The seconds component, expressed as a value between 0 and 59.":"秒部分表示为0到59之间的值。"," minus the value of ":"减去价值","A string that contains the long time string representation of the current ":"一个包含当前的长时间字符串表示形式的字符串","An object that represents the date and time of ":"代表日期和时间的对象","The memory span that contains the string to parse. See The string to parse for more information.":"包含要解析的字符串的内存跨度。 有关更多信息，请参见琴弦解析。"," objects have the same ":" 对象具有相同 ","The number of ticks that represent the date and time of this instance. The value is between ":"代表此实例的日期和时间的刻度数。 价值是在",".  See Parsing and cultural conventions":"。 参见解析和文化惯例"," with the offset set to the local time offset.":"将偏移设置为当地时间偏移。","A double-precision floating-point number that contains an OLE Automation date equivalent to the value of this instance.":"包含OLE自动化日期的双精度浮点数等同于此实例的值。","A time interval that represents the fraction of the day that has elapsed since midnight.":"一个时间间隔，代表自午夜以来过去的一天的一部分。"," for the parse operation to succeed, and that defines how to interpret the parsed date in relation to the current time zone or the current date. A typical value to specify is ":"为了使解析操作成功，并定义了如何解释与当前时区或当前日期有关的解析日期。 指定的典型值是","A Unix time, expressed as the number of milliseconds that have elapsed since 1970-01-01T00:00:00Z (January 1, 1970, at 12:00 AM UTC). For Unix times before this date, its value is negative.":"Unix时间，表示自1970-01-01-01t00：00：00 Z（1970年1月1日，UTC）以来已经过去的毫秒数。 在此日期之前的Unix次时，其价值为负。","The object to compare to the current ":"要与当前进行比较的对象 ","An object that is set to today's date, with the time component set to 00:00:00.":"设置为今天日期的对象，时间组件设置为00:00:00。",". The return values of the method are interpreted as follows:  \n  \n ":"。 该方法的返回值解释如下：","An object whose value is the current UTC date and time.":"值是当前UTC日期和时间的对象。","A date and time value that represents the same moment in time as the Unix time.":"代表与UNIX时间相同时刻的日期和时间值。","A string that contains the short time string representation of the current ":"包含当前的短时字符串表示形式的字符串 ","The object that initiated the callback. The functionality for this parameter is not currently implemented.":"启动回调的对象。 目前尚未实现此参数的功能。","The year, between 1 and 9999.":"一年，1至9999年。","A Unix time, expressed as the number of seconds that have elapsed since 1970-01-01T00:00:00Z (January 1, 1970, at 12:00 AM UTC). For Unix times before this date, its value is negative.":"UNIX时间，表示自1970-01-01-01t00：00：00 Z（1970年1月1日，UTC）以来已经过去的秒数。 在此日期之前的Unix次时，其价值为负。","The day component of the current ":"当前的一天组成部分","A string representation of the value of the current ":"当前值的字符串表示","The destination for this serialization (see ":"此序列化的目的地（请参阅","The object to add the time interval to.":"要将时间间隔添加到的对象。"," interface and is used to augment the conversion. If ":"接口，用于增加转换。 如果"," object, expressed as a value between 1 and 31.":"对象，表示为1至31之间的值。"," object, expressed as a Windows file time.":"对象，表示为Windows文件时间。","An object whose value is the sum of the values of ":"一个对象，其值是值的总和"," is specified, format information is obtained from the current culture.":"指定，格式信息是从当前文化中获得的。","One of the enumeration values that indicates the day of the week of the current ":"指示当前一周的枚举值之一"," value of ":"的价值","The boxed equivalent of the current ":"电流等效的盒装","An object that represents the date and time of the current ":"表示当前的日期和时间的对象 ","The day of the year of the current ":"当前一年"," object, if that conversion is supported; otherwise, an exception is thrown and no value is returned.":"对象，如果支持该转换； 否则，将抛出异常，没有返回值。"," is later than the ":"比晚"," object converted to local time.":"对象转换为本地时间。"," object, expressed as a value between 1 and 366.":"对象，表示为1至366之间的值。"," is the same as or later than the ":"与或晚于","An empty string (":"一个空字符串（","The offset to convert the ":"转换的偏移","The hour component of the current ":"电流的小时组件"," value to.":"价值为。"," to be used to format the return value.  \n  \n -or-  \n  \n ":"用于格式化返回值。 \n  \n  -或者-"," object. This property uses a 24-hour clock; the value ranges from 0 to 23.":"目的。 该属性使用24小时的时钟； 值范围从0到23。"," to obtain the format information from the current locale setting of the operating system.":"从操作系统的当前语言环境设置中获取格式信息。"," do not have the same ":" 不具有相同 ","An object that is equal to the original ":"等于原始的对象","The local date and time of the current ":"当前的当地日期和时间"," object (that is, their ":"对象（即他们的","The value to represent as a ":"代表作为一个的价值"," is earlier than the ":"比","The millisecond component of the current ":"电流的毫秒组成部分"," methods return identical points in time) but whose ":"方法返回相同的时间点）但是","The low 32 bits of a 96-bit integer.":"96位整数的低32位。","The minuend.":"最小。"," object, expressed as an integer between 0 and 999.":"对象，表示为0到999之间的整数。","A string representation of a ":"一个字符串表示","The minute component of the current ":"电流的微小组成部分","The subtrahend.":"子特拉亨德。","The middle 32 bits of a 96-bit integer.":"96位整数的中间32位。"," object that includes the offset appended at the end of the string.":"对象包括附加在字符串末尾的偏移。"," object, expressed as an integer between 0 and 59.":"对象，表示为0到59之间的整数。","An object that represents the difference between ":"表示代表差异的对象"," object, as specified by ":"对象，如","The high 32 bits of a 96-bit integer.":"96位整数的高32位。","The month component of the current ":"当前的月份部分","The date and time object to subtract from.":"减去日期和时间对象。","A format string.":"格式字符串。"," to indicate a negative number; ":"表示负数；"," object, expressed as an integer between 1 and 12.":"对象，表示为1至12之间的整数。"," object converted to Coordinated Universal Time (UTC).":"对象转换为协调的通用时间（UTC）。","An object that is equal to the value of ":"等于值的对象"," to indicate a positive number.":"表示正数。","The number of milliseconds that have elapsed since 1970-01-01T00:00:00.000Z.":"自1970-01-01t00：00：00.000Z以来已经过去的毫秒数量。"," object whose date and time is the current local time and whose offset is the local time zone's offset from Coordinated Universal Time (UTC).":"对象的日期和时间是当前的本地时间，其偏移是本地时区与协调的通用时间（UTC）的偏移。","The number of seconds that have elapsed since 1970-01-01T00:00:00Z.":"自1970-01-01t00：00：00z以来已经过去的秒数数量。","A power of 10 ranging from 0 to 28.":"10的力量从0到28。","An object that provides culture-specific format information about ":"提供有关文化特定格式信息的对象","The difference between the current ":"电流之间的区别","When the method returns, contains the ":"当方法返回时，包含","An array of 32-bit signed integers containing a representation of a decimal value.":"一个32位签名的整数的数组，该整数包含小数值的表示。","An object that is equivalent to the date and time that is contained in ":"等效于包含的日期和时间的对象"," object's time value and Coordinated Universal Time (UTC).":"对象的时间值和协调的通用时间（UTC）。"," equivalent to the date and time of ":"等效于日期和时间","A span of four ":"四个跨度","A character span that represents a date and time.":"代表日期和时间的字符跨度。","The second component of the ":"第二个组成部分",", if the conversion failed. The conversion fails if the ":"，如果转换失败。 转换失败，如果","A character span that contains a format specifier that defines the expected format of ":"字符跨包含格式指定符的字符跨度定义了预期格式"," values that contains a binary representation of a decimal value.":"包含小数值的二进制表示的值。"," object, expressed as an integer value between 0 and 59.":"对象，表示为0到59之间的整数值。"," or does not contain a valid string representation of a date and time. This parameter is passed uninitialized.":"或不包含日期和时间的有效字符串表示。 该参数通过非初始化。","An object that is equivalent to the date and time that is contained in the ":"等效于包含的日期和时间的对象","The smallest integral value that is greater than or equal to the ":"最小的积分值大于或等于","The number of ticks in the ":"tick的数量"," parameter is successfully converted; otherwise, ":"参数已成功转换； 否则，"," parameter, as specified by the ":"参数，如"," object's clock time.":"对象的时钟时间。"," parameter. Note that this method returns a ":"范围。 请注意，此方法返回","A character span that contains a date and time to convert.":"包含转换日期和时间的字符跨度。"," value equivalent to the date and time of ":"价值等同于日期和时间"," instead of an integral type.":"而不是积分类型。"," if the conversion failed. The conversion fails if the":"如果转换失败。 转换失败，如果","The time interval of the current date that has elapsed since midnight.":"自午夜以来过去日期的时间间隔。","An array of format specifiers that define the expected formats of ":"定义预期格式的一系列格式指定符","The object to compare with this instance, or ":"与此实例进行比较的对象，或","A array of standard or custom format strings that define the acceptable formats of ":"一系列标准或自定义格式字符串，这些字符串定义可接受格式","The Coordinated Universal Time (UTC) date and time of the current ":"当前的协调通用时间（UTC）日期和时间","A format specifier that defines the expected format of ":"定义预期格式的格式指定符","A bitwise combination of enumeration values that indicates the permitted format of input. A typical value to specify is ":"枚举值的位组合，指示输入的允许格式。 指定的典型值是"," and equal to this instance; otherwise, ":"并等于此实例； 否则，","An object whose date and time is the current Coordinated Universal Time (UTC) and whose offset is ":"其日期和时间是当前协调的通用时间（UTC），其偏移为","An object that represents the value to subtract.":"表示减去值的对象。",", or does not contain a valid string representation of a date and time in the expected format defined by ":"，或不包含按定义的预期格式的日期和时间的有效字符串表示形式","The value to round.":"圆的价值。","An object that specifies the interval between the two ":"指定两个间隔的对象"," object's Coordinated Universal Time (UTC).":"对象协调的通用时间（UTC）。","An array that defines the expected formats of ":"定义预期格式的数组","An object that is equal to the date and time represented by the current ":"等于当前代表的日期和时间的对象"," has a fractional part, the next whole ":"有一个部分，下一个整体","The year component of the current ":"当前的一年部分"," number toward negative infinity that is less than ":"迈向负小度的数字小于"," does not contain a valid string representation of a date and time, or does not contain the date and time in the expected format defined by ":"不包含日期和时间的有效字符串表示形式，或不包含由定义的预期格式的日期和时间"," object, expressed as an integer value between 0 and 9999.":"对象，表示为0到9999之间的整数值。"," object, minus the time interval represented by ":"对象，减去代表的时间间隔",".  \n  \n -or-  \n  \n If ":"。 \n  \n  -或者- \n  \n  如果"," value that represents the date component of the current ":"代表当前的日期组件的值"," doesn't have a fractional part, ":"没有分数部分，","A 32-bit signed integer that indicates whether the current ":"一个32位签名的整数，指示当前是否"," object containing information required to serialize the ":"包含序列化信息的对象","The date and time of the current ":"当前的日期和时间"," object is less than, equal to, or greater than ":"对象小于，等于或大于"," is returned unchanged. Note that the method returns an integral value of type ":"退回不变。 请注意，该方法返回类型的积分值",", which is ":"，那是",", which is the number of integers in the binary representation.":"，这是二进制表示中的整数数量。","None. The return value for this member is not used.":"没有任何。 该成员的返回值不使用。","A single-precision floating-point number equivalent to the value of ":"一个单位浮点数等同于值的浮点数","An OLE Automation Currency value.":"OLE自动化货币价值。","A decimal number with the value of ":"一个小数号，值为","The type to convert the current ":"转换电流的类型","A string that represents the value of this instance.":"代表此实例值的字符串。"," that contains the equivalent of ":"其中包含等效的",", but the opposite sign.  \n  \n -or-  \n  \n Zero, if ":"，但相反的迹象。 \n  \n  -或者- \n  \n  零，如果"," object to.":"反对。","A 32-bit signed integer array with four elements that contain the binary representation of ":"一个32位签名的整数阵列，其中包含四个元素，其中包含二进制表示","A 16-bit unsigned integer equivalent to the value of ":"16位未签名的整数等同于该值"," is zero.":"为零。","The span into which to store the four-integer binary representation.":"存储四英尺二进制表示的跨度。","A 32-bit unsigned integer equivalent to the value of ":"一个32位未签名的整数等同于该值","A 64-bit unsigned integer equivalent to the value of ":"一个64位未签名的整数等同于该值","The result of adding ":"添加的结果","The decimal number to truncate.":"十进制数字为截断。"," decremented by 1.":"减少1。","An 8-bit unsigned integer that represents the converted ":"一个代表转换的8位未签名整数"," rounded toward zero, to the nearest whole number.":"朝向零，到最接近的整数。","A Unicode character that represents the converted ":"代表转换的Unicode字符","The span into which to store the binary representation.":"存储二进制表示的跨度。","A double-precision floating-point number that represents the converted ":"代表转换的双精度浮点数","The number of integers written to the destination.":"写入目的地的整数数量。","A 16-bit signed integer that represents the converted ":"一个16位签名的整数，代表转换的"," if the decimal's binary representation was written to the destination; ":"如果十进制的二进制代表写入目的地；","A 32-bit signed integer that represents the converted ":"一个32位签名的整数，代表转换的"," if the destination wasn't long enough.":"如果目的地不够长。"," number that is equivalent to the numeric value contained in ":"等效于包含的数字值","A 64-bit signed integer that represents the converted ":"一个64位签名的整数，代表转换",", if the conversion succeeded, or zero if the conversion failed. The conversion fails if the ":"，如果转换成功，则如果转换失败，则为零。 转换失败，如果","An 8-bit signed integer that represents the converted ":"一个8位签名的整数，代表转换",", is not a number in a format compliant with ":"，不是符合格式的数字","A single-precision floating-point number that represents the converted ":"一个代表转换的单精度浮点数",", or represents a number less than ":"，或代表小于","A 16-bit unsigned integer that represents the converted ":"一个16位未签名的整数，代表转换的",". This parameter is passed uininitialized; any value originally supplied in ":"。 该参数通过uinitialization； 最初提供的任何价值","A 32-bit unsigned integer that represents the converted ":"一个代表转换的32位未签名整数"," is overwritten.":"被覆盖。","A 64-bit unsigned integer that represents the converted ":"一个64位未签名的整数，代表转换的",", is not a number in a valid format, or represents a number less than ":"，不是有效格式的数字，也不是小于","The converted double-precision floating point number.":"转换后的双精度浮点数。","The class instance on which the delegate invokes ":"代表调用的类实例","The converted single-precision floating point number.":"转换后的单精度浮点数。","The name of the instance method that the delegate represents.":"代表代表的实例方法的名称。","The converted 8-bit unsigned integer.":"转换后的8位未签名整数。"," representing the class that defines ":"代表定义的类","The converted Unicode character.":"转换后的Unicode字符。","The name of the static method that the delegate represents.":"代表代表的静态方法的名称。","The converted 16-bit signed integer.":"转换后的16位签名整数。","A shallow copy of the delegate.":"代表的浅副本。","The converted 32-bit signed integer.":"转换后的32位签名整数。","The converted 64-bit signed integer.":"转换后的64位签名整数。"," have the same date and time value and the same ":"具有相同的日期和时间值，相同","The converted 8-bit signed integer.":"转换后的8位签名整数。","A Windows file time, expressed in ticks.":"Windows文件时间，以tick表示。","The converted 16-bit unsigned integer.":"转换后的16位未签名整数。","The converted 32-bit unsigned integer.":"转换后的32位未签名整数。","The converted 64-bit unsigned integer.":"转换后的64位未签名整数。"," incremented by 1.":"增加1。","The remainder resulting from dividing ":"分裂产生的其余部分"," multiplied by negative one (-1).":"乘以负一个（-1）。","The operand to return.":"操作数要返回。","The value of the operand, ":"操作数的价值，","The span containing the characters representing the number to convert.":"包含代表要转换数字的字符的跨度。"," values that indicates the style elements that can be present in ":"表示可能存在的样式元素的值"," object that supplies culture-specific information about the format of ":"提供有关文化特定信息的对象"," number equivalent to the number contained in ":"等同于包含的数字","The string representation of the number to convert.":"要转换的数字的字符串表示。","The equivalent to the number contained in ":"等效于包含的数字"," that supplies culture-specific parsing information about ":"提供有关文化特定的解析信息","A decimal number to round.":"一个小数号。","The integer that is nearest to the ":"最接近的整数"," is halfway between two integers, one of which is even and the other odd, the even number is returned.":"是两个整数之间的一半，一个是偶数，另一个是奇数，均匀的数字被返回。","A value from 0 to 28 that specifies the number of decimal places to round to.":"从0到28的值指定要舍入的小数位数。","The decimal number equivalent to ":"小数相当于"," rounded to ":"四舍五入"," decimal places.":"小数点。","The number of significant decimal places (precision) in the return value.":"返回值中重大小数位（精度）的数量。","One of the enumeration values that specifies which rounding strategy to use.":"指定要使用的四舍五入策略的枚举价值之一。","The number that ":"数字"," is rounded to using the ":"四舍五入地使用"," rounding strategy and with a precision of ":"四舍五入策略，精确",". If the precision of ":"。 如果精度","The integer that ":"整数"," rounding strategy.":"四舍五入策略。","None. This conversion is not supported.":"没有任何。 不支持这种转换。","The parameter is ignored.":"参数被忽略。","The type to which to convert the value of this ":"转换该值的类型","An 8-bit unsigned integer equivalent to ":"一个8位未签名的整数等同于","A 16-bit signed integer equivalent to ":"一个16位签名的整数等同于","A 32-bit signed integer equivalent to the value of ":"一个32位签名的整数等同于该值","A 64-bit signed integer equivalent to the value of ":"一个64位签名的整数等同于价值","A 64-bit signed integer that contains the OLE Automation equivalent of ":"一个64位签名的整数，其中包含相当于的OLE自动化","An 8-bit signed integer equivalent to ":"一个8位签名的整数等同于"}