{"The number of relocation entries for the section. Its value is zero for PE images.":"本节的搬迁条目数量。 其值为PE图像为零。","The location to which to serialize ":"序列化的位置","A blob that contains the data to serialize.":"包含要序列化的数据的斑点。","The number of line-number entries for the section.":"该部分的线数条目数量。","Reads the metadata section into memory right away.":"立即将元数据部分读取到内存中。","The flags that describe the characteristics of the section.":"描述本节特征的标志。","The file pointer to the first page of the section within the COFF file.":"Coff文件中部分的文件指针。","The file pointer to the beginning of line-number entries for the section, or zero if there are no COFF line numbers.":"文件指针指向本节的线路数字开始的开始，如果没有COFF LINE号，则零。","The file pointer to the beginning of relocation entries for the section. It is set to zero for PE images or if there are no relocations.":"文件指针指向本节重新定位条目的开头。 对于PE图像或没有重新定位，它将其设置为零。","The virtual address of the section.":"本节的虚拟地址。","The size of the section (for object files) or the size of the initialized data on disk (for image files).":"截面的大小（对于对象文件）或磁盘上的初始化数据的大小（对于图像文件）。","The object to compare to this object.":"与此对象进行比较的对象。","The total size of the section when loaded into memory.":"加载到内存中时，该部分的总尺寸。","A string containing the name of this ":"包含此名称的字符串 ","Read-only. The type of flow control.":"只读。 流控制的类型。","Read-only. The type of intermediate language (IL) instruction.":"只读。 中间语言（IL）指令的类型。","Read-only. The operand type of an IL instruction.":"只读。 IL指令的操作数类型。","Read-only. The way the IL instruction pops the stack.":"只读。 IL指令弹出堆栈的方式。","Read-only. The name of the IL instruction.":"只读。 IL指令的名称。","Read-only. The numeric value of the IL instruction.":"只读。 IL指令的数值。","The member from which to retrieve the token, as reftype.":"从中取回令牌的成员，作为reftype。","Read-only. The size of the IL instruction.":"只读。 IL指令的大小。","Read-only. The way the IL instruction pushes operand onto the stack.":"只读。 IL指令将操作数推向堆栈的方式。","The member to analyze, as reftype.":"成员分析，作为翻流。","An instance of an Opcode object.":"OPCODE对象的实例。","Name of a resource.":"资源的名称。","An integer representing the metadata token. The returned token is never nil. If unavailable, an exception is thrown.":"代表元数据令牌的整数。 返回的令牌永远不会零。 如果无法使用，则会抛出一个例外。","The value of the resource.":"资源的价值。","The output file name.":"输出文件名。"," if there is a metadata token available for the given member; otherwise, ":"如果有给定成员的元数据令牌； 否则，","Value of a resource as an 8-bit unsigned integer array.":"资源作为8位无符号整数数组的价值。","The name of the resource to add.":"要添加的资源名称。"," to close the stream after the ":"关闭流之后","Value of the resource as an 8-bit unsigned integer array.":"资源作为8位无符号整数数组的价值。","The output stream.":"的输出流。","The type name of the added data.":"添加数据的类型名称。","The value of the resource to add. The resource must support the ":"要添加的资源的价值。 资源必须支持","A name that identifies the resource that contains the added data.":"标识包含添加数据的资源的名称。","The type that is encapsulated by the delegate.":"代表封装的类型。","The offset to add.":"添加的偏移。","The void pointer to add the offset to.":"空隙指针将偏移添加到。","A byte array that contains the binary representation of the added data.":"一个包含添加数据的二进制表示的字节数组。","A new reference that reflects the addition of byte offset to pointer.":"一个新的引用，反映了将字节偏移到指针中的添加。","A new reference that reflects the addition of offset to pointer.":"一种新的参考，反映了向指针增加偏移的新参考。","The reference to add the offset to.":"将偏移添加到的参考。","A new void pointer that reflects the addition of offset to the specified pointer.":"一个新的空隙指针，反映了在指定指针中添加偏移量。","The object to cast.":"要铸造的对象。","The first reference to compare.":"第一个参考比较。","The object whose pointer is obtained.":"获得指针的对象。","The original object, casted to the given type.":"原始对象，铸造为给定类型。","The location to copy to.":"要复制的位置。","The reference to origin.":"引用原点。","The second reference to compare.":"比较的第二个引用。","The reference to reinterpret.":"对重新诠释的引用。","A pointer to the given value.":"指向给定值的指针。","The reference to target.":"引用目标。"," point to the same location; otherwise, ":"指向同一位置； 否则，","A pointer to the value to copy.":"指向要复制的值的指针。","A reference to a value of type ":"对类型值的引用","The read-only reference to reinterpret.":"重新诠释的仅读取引用。","A reference to the value to copy.":"对要复制的值的引用。","Byte offset from origin to target i.e. ":"字节偏移从原点到目标，即","The source address to copy from.":"要复制的源地址。","The number of bytes to initialize.":"初始化的字节数。","The location of the value to reference.":"值的位置要参考。","The destination address to copy to.":"要复制的目标地址。"," - ":" - ","The number of bytes to copy.":"要复制的字节数。","The reference to subtract the offset from.":"从中减去偏移的引用。","The reference to check.":"检查的参考。","The location to read from.":"要阅读的位置。","The address of the start of the memory block to initialize.":"内存块的开始的地址要初始化。","The void pointer to subtract the offset from.":"减去偏移量的void指针。"," is a null reference; otherwise, ":"是无效的参考； 否则，","The offset to subtract.":"减去偏移。"," read from the given location.":"从给定的位置阅读。","The value to initialize the block to.":"初始化块的值。","A new void pointer that reflects the subtraction of offset from the specified pointer.":"一种新的空隙指针，反映了指定指针的偏移偏移。","A new reference that reflects the subtraction of offset from pointer.":"一种新的参考，反映了指针的偏移偏移。"," that is a null reference.":"那是一个无效的引用。","The size of an object of type ":"类型对象的大小","A new reference that reflects the subraction of offset from pointer.":"一种新的参考，反映了指针的偏移偏移。","A new reference that reflects the subtraction of byte offset from pointer.":"一个新的引用，反映了指针的字节偏移的减法。","A new reference that reflects the subraction of byte offset from pointer.":"一个新的引用，反映了指针的字节偏移的减法。","The value to unbox.":"要取消框的值。","A type that an importing compiler must fully understand.  \n  \n This parameter is not supported in the .NET Framework version 2.0 and later.":"导入编译器必须完全理解的一种类型。 \n  \n  在.NET Framework 2.0及以后的.NET Framework版本中不支持此参数。"," operating system.":"操作系统。","An object that represents the Linux operating system.":"代表Linux操作系统的对象。","A type that an importing compiler must fully understand.":"导入编译器必须完全理解的一种类型。","The uninitialized object.":"未初始化的对象。"," to the boxed value ":"到盒装值"," instance and its name is the same as the current object; otherwise, ":"实例及其名称与当前对象相同； 否则，","An object that represents the OSX operating system.":"代表OSX操作系统的对象。"," if the current app is running on the specified platform; otherwise, ":"如果当前应用在指定平台上运行； 否则，","The name of the platform that this instance represents.":"此实例代表的平台的名称。","The location to write to.":"要写入的位置。","An object that represents the Windows operating system.":"代表Windows操作系统的对象。","The name of the .NET installation on which the app is running.":"应用程序正在运行的.NET安装的名称。"," instance and its name is the same as the current object.":" 实例及其名称与当前对象相同。","The dotted name of the defined namespace.":"定义的名称空间的虚线名称。","An object that represents the ":"代表","The platform architecture on which the current app is running.":"当前应用程序正在运行的平台体系结构。","A platform.":"平台。","An object that represents the FreeBSD operating system.":"代表FreeBSD操作系统的对象。","The process architecture of the currently running app.":"当前正在运行的应用程序的过程体系结构。","The type of access allowed to the memory. The default is ":"允许进入内存的访问类型。 默认值为","The number of structures read into ":"结构的数量读入","The description of the operating system on which the app is running.":"应用程序正在运行的操作系统的描述。","An opaque string that identifies the platform on which the app is running.":"一个不透明的字符串，可以标识应用程序正在运行的平台。","The position in the accessor at which to begin reading.":"在登录器中开始阅读的位置。"," to start writing from.":" 开始写作。",". This value can be less than ":"。 该值可能小于"," constant value.":"恒定值。"," object that describes the error. The content of ":"描述错误的对象。 内容的内容","The structure to contain the read data.":"包含读取数据的结构。","The number of structures in ":"结构数量","A managed array.":"托管阵列。"," is intended to be understood by humans. The caller of this constructor is required to ensure that this string has been localized for the current system culture.":"旨在被人类理解。 需要该构造函数的呼叫者，以确保该字符串已定位为当前系统文化。"," if there are fewer structures available, or zero if the end of the accessor is reached.":"如果可用的结构较少，则零，如果达到了登录的末端。"," if the accessor is readable; otherwise, ":"如果登录器可读； 否则，","The number of bytes in the accessor at which to begin reading.":"登录器中开始阅读的字节数。","The offset in bytes, of the element to be passed through platform invoke.":"字节的偏移，即通过平台调用传递的元素。","The number of bytes into the accessor at which to begin reading.":"登录器的字节数开始阅读。","The exception that is the cause of the current ":"当前原因的例外"," if the accessor is writable; otherwise, ":"如果登记器是可写的； 否则，","Object to compare with this instance.":"对象与此实例进行比较。","The array to contain the structures read from the accessor.":"包含从访问器读取的结构的数组。","The value that was read.":"读取的价值。","The buffer to contain the accessor.":"包含访问器的缓冲区。"," if the object matches this ":"如果对象与此匹配","The capacity of the accessor.":"访问器的容量。","The number of bytes into the accessor at which to begin writing.":"开始写作的登录器的字节数。"," in which to place the first copied structure.":"在其中放置第一个复制的结构。","The byte at which to start the accessor.":"启动登录器的字节。"," object to compare with this instance.":"对象与此实例进行比较。"," if the accessor is open; otherwise, ":"如果登录器打开； 否则，","The structure to write.":"写的结构。","The number of structures of type ":"类型结构数量"," constant stored in this attribute. Only ":"常数存储在此属性中。 仅有的","The size, in bytes, of memory to allocate.":"内存分配的大小，字节。"," to read from the accessor.":"从登录器中阅读。"," object matches the current instance; otherwise, ":"对象匹配当前实例； 否则，","The array to write into the accessor.":"写入登录器的数组。"," is allowed for an ":"被允许","The managed array this instance references.":"托管数组此实例引用。","The offset for this instance.":"此实例的偏移。","The object to wrap and marshal as ":"包裹和元帅的对象"," and equals the value of this instance; otherwise, ":"并等于此实例的价值； 否则，"," does not exhibit the versioning problems described in ":"不显示在"," object to compare with the ":"对象与","The dictionary to get the reference to ":"词典以获取参考","The object that is wrapped by ":"包裹的对象"," value to compare to this instance.":" 要与此实例进行比较的值。"," is the same as the value of ":"与价值相同","The key used for lookup.":"用于查找的密钥。"," because clients can only late-bind to the interface.":"因为客户只能在接口上固定。","Describes the type of interface that is generated for a class.":"描述为类生成的接口类型。"," already existed in the dictionary, and ":"词典已经存在，并且"," has the same value as this instance; otherwise, ":"具有与此实例相同的值； 否则，"," is not the same as the value of ":"与价值不同","Indicates that no class interface is generated for the class. If no interfaces are implemented explicitly, the class can only provide late-bound access through the ":"表示该类未生成类接口。 如果没有明确实现接口，则类只能通过"," if a new entry was added.":"如果添加了新的条目。"," values that describes the type of interface that is generated for a class.":"描述为类生成的接口类型的值。","The string representation of the value of this instance, consisting of a negative sign if the value is negative, and a sequence of digits ranging from 0 to 9 with no leading zeroes.":"该实例值的字符串表示形式，如果值为负，则由负符号组成，而数字序列范围为0到9，没有前导零。"," value that describes which type of interface should be generated for the class.":"描述应该为类生成哪种类型的接口的值。"," interface. This is the recommended setting for ":"界面。 这是推荐的设置"," if the class should be marshaled using the Automation Marshaler; ":"如果应该使用自动化元帅对班级进行申请；","A  reference to a ":"提及",". Using ":"。 使用","Indicates that the class only supports late binding for COM clients. A ":"表明该类仅支持COM客户端的较晚绑定。 一个"," is the only way to expose functionality through interfaces implemented explicitly by the class.":"是通过类明确实现的接口公开功能的唯一方法。"," if a proxy stub marshaler should be used.":"如果应该使用代理存根企业。"," that contains the class identifier of the original coclass.":" 它包含原始coclass的类标识符。"," in the specified dictionary.":" 在指定的字典中。"," for the class is automatically exposed to COM clients on request. The type library produced by Tlbexp.exe (Type Library Exporter) does not contain type information for the ":"因为该课程会根据要求自动接触COM客户端。 TLBEXP.EXE（类型库Exporter）生产的类型库不包含类型的信息"," to indicate that best-fit mapping is enabled; otherwise, ":"指示启用了最佳拟合映射； 否则，","The dictionary to get the ref to ":"词典要让裁判","The integer value.":"的整数值。"," containing the class identifier of the original coclass.":"包含原始瓶的类标识符。"," in order to prevent clients from caching the DISPIDs of the interface. The ":"为了防止客户缓存接口的分配。 这"," or a reference ":"或参考"," if best-fit mapping is enabled; otherwise, ":" 如果启用了最佳拟合映射；否则, ","An object to compare with this instance.":"与此实例进行比较的对象。","List from which to create the ":"从中创建的列表"," if it does not exist in the ":"如果它不存在","The method that was used to add an event handler delegate to the event source.":"用于将事件处理程序委托给事件源添加的方法。","The name of this member.":"该成员的名称。","..":"..","The object that was called when the event was raised.":"事件升起时称之为的对象。","The alias for the field or parameter as found in the type library when it was imported.":"导入时类型库中的字段或参数的别名。"," object that was used to initialize the current object.":"用于初始化当前对象的对象。"," to search this member's inheritance chain to find the attributes; otherwise, ":"搜索该成员的继承链以找到属性； 否则，"," instance over the ":"实例在","The method that was used to remove an event handler delegate from the event source.":"用于从事件源中删除事件处理程序委托的方法。","The type of object.":"对象的类型。","An array that contains all the custom attributes, or an array that has no elements if no attributes were defined.":"包含所有自定义属性的数组，或者如果未定义属性，则没有元素的数组。"," that contains the original source interface from the type library. COM uses this interface to call back to the managed class.":"其中包含来自类型库的原始源接口。 com使用此界面将其回到托管类。","The attribute type to search for.":"要搜索的属性类型。","The major version number of the assembly.":"程序集的主要版本号。","The attribute type to search for. Only attributes that are assignable to this type can be returned.":"要搜索的属性类型。 只能返回到此类型的属性。"," if the specified attribute has been applied to this member; otherwise, ":"如果指定的属性已应用于该成员； 否则，","The name of an event on ":"事件的名称","The minor version number of the assembly.":"组件的次要版本号。","An array that contains all the custom attributes of the specified type, or an array that has no elements if no attributes were defined.":"包含指定类型的所有自定义属性的数组，或者如果没有定义属性，则没有元素的数组。"," that contains the class that implements the methods of the event interface.":"其中包含实现事件接口方法的类。","The target object that the event delegate is bound to.":"事件委托绑定的目标对象。","The target object that the event delegate should bind to.":"事件委托应绑定到的目标对象。","The build number of the assembly.":"组件的构建数。"," objects representing data about the attributes that have been applied to the current ":"代表有关已应用于当前属性的数据的对象"," containing the source interface.":"包含源接口。","The read-only attributes for this event.":"此事件的仅读取属性。","The event delegate.":"活动代表。"," to include non-public methods; otherwise, ":"包括非公共方法； 否则，","The COM object that triggers the events the caller would like to respond to.":"触发呼叫者想要响应的事件的com对象。","The revision number of the assembly.":"组件的修订号。","A 32-bit Integer that represents the metadata token.":"一个代表元数据令牌的32位整数。","The identifier of the source interface used by the COM object to trigger events.":"COM对象使用的源接口的标识符来触发事件。","An array representing the methods that have been associated with the event in metadata. If there are no such methods, an empty array is returned.":"代表与元数据中事件相关的方法的数组。 如果没有这样的方法，则返回一个空数组。"," to return non-public methods; otherwise, ":" 返回非公共方法；否则, "," value indicating the default interface to expose to COM.":"值指示默认接口暴露于com。","The module associated with the current ":"与当前关联的模块","The dispatch identifier of the method on the source interface.":"源接口上该方法的调度标识符。","The delegate to remove from the invocation list.":"从调用列表中删除的代表。"," object that specifies the default interface to expose to COM.":"指定默认接口的对象以暴露于com。","When this method returns, contains the connection cookie. This parameter is passed uninitialized.":"当此方法返回时，包含连接cookie。 该参数通过非初始化。"," interface on the new full moniker of the object.":" 对象的新完整名称上的接口。","The delegate to invoke when the COM event is fired.":"触发COM事件时要调用的委托。"," when the connection was originally established.":"当连接最初建立时。","The delegate that was removed from the invocation list.":"从调用列表中删除的代表。","The aspect, or view, of the object. Contains a value taken from the ":"对象的方面或视图。 包含从","When this method returns, contains the newly created enumerator. This parameter is passed uninitialized.":"当此方法返回时，包含新创建的枚举器。 该参数通过非初始化。","The COM object the delegate is attached to.":"代表附加的com对象。"," object that holds the serialized object data.":"保存串行对象数据的对象。","When this method returns, contains an ":"当此方法返回时，包含一个 ","When this parameter returns, contains the IID of the outgoing interface managed by this connection point. This parameter is passed uninitialized.":"当此参数返回时，包含该连接点管理的传出接口的IID。 该参数通过非初始化。","The portion of the view that has changed. Currently, only -1 is valid.":"视图的一部分已经改变。 目前，仅-1是有效的。"," that receives the interface pointer to the new enumerator object. If the implementation sets ":"接收到新枚举对象的接口指针。 如果实现设置"," object that supplies the contextual information about the source or destination.":"提供有关源或目的地的上下文信息的对象。",". This value is ":"。 这个值是","When this parameter returns, contains the connectable object's ":"当此参数返回时，包含可连接对象的","When this method returns, contains a reference to the object parameter enumerator. This parameter is passed uninitialized.":"当此方法返回时，包含对对象参数枚举器的引用。 该参数通过非初始化。"," interface. This parameter is passed uninitialized.":"界面。 该参数通过非初始化。","The message that indicates the reason for the exception.":"表示异常原因的消息。",", there are no connections to advisory sinks at this time. This parameter is passed uninitialized.":"，目前没有与咨询台的联系。 该参数通过非初始化。"," if the method returns ":"如果方法返回","This method supports the standard return value E_OUTOFMEMORY, as well as the following:  \n  \n ":"此方法支持标准返回值e_outofmemory，以及以下内容：","The connection cookie previously returned from the ":"连接cookie以前从","A pointer to the structure to receive the binding options.":"指向结构接收绑定选项的指针。","The message that indicates the reason the exception occurred.":"表示异常原因的消息。","When this method returns, contains the interface pointer of the enumerator. This parameter is passed uninitialized.":"当此方法返回时，包含枚举器的接口指针。 该参数通过非初始化。"," member is not significant in this case and should be ignored. This parameter is passed uninitialized.":"在这种情况下，成员并不重要，应被忽略。 该参数通过非初始化。"," values that specifies the direction of the data.":"指定数据方向的值。","The error code (HRESULT) value associated with this exception.":"与此异常关联的错误代码（hresult）值。","The name of the object to search for.":"要搜索的对象的名称。"," properties of the exception.":"异常的属性。"," structure, passed by reference, that defines the format, medium, and target device to use when passing the data. It is possible to specify more than one medium by using the Boolean OR operator, allowing the method to choose the best medium among those specified.":"通过引用传递的结构，该结构定义了传递数据时使用的格式，介质和目标设备。 可以通过使用布尔或操作员来指定多个媒介，从而可以在指定的方法中选择最佳介质。","A reference to the outgoing interface IID whose connection point is being requested.":"引用了该连接点的传出接口IID。","This method supports the standard return values E_INVALIDARG and E_OUTOFMEMORY, as well as the following:  \n  \n ":"此方法支持标准返回值E_INVALIDARG和E_OUTOFMEMORY，以及以下内容:  \n  \n ","When this method returns, contains the object interface pointer. This parameter is passed uninitialized.":"当此方法返回时，包含对象接口指针。 该参数通过非初始化。","A null-delimited list of fully qualified event source interface names.":"完全限定的事件源界面名称的无效列表。","When this method returns, contains the connection point that manages the outgoing interface ":"当此方法返回时，包含管理传出接口的连接点","A pointer to a ":"指向一个指针","When this method returns, contains a pointer to the ":"当此方法返回时，包含一个指向 ","When this method returns, contains a reference to the Running Object Table (ROT). This parameter is passed uninitialized.":"当此方法返回时，包含对运行对象表（ROT）的引用。 该参数通过非初始化。"," of the source interface.":"源接口的。"," structure, passed by reference, that defines the format, target device, aspect, and medium that will be used for future notifications.":"通过引用通过的结构定义了将用于未来通知的格式，目标设备，方面和介质。"," structure, passed by reference, that defines the format, medium, and target device that the caller would like to use to retrieve data in a subsequent call such as ":"通过引用传递的结构，该结构定义了呼叫者希望在后续调用中检索数据的格式，介质和目标设备，例如"," structure that indicates the storage medium containing the returned data through its ":"结构指示包含返回数据的存储介质","The object to register for release.":"注册发布的对象。"," of the default source interface.":"默认源接口。"," member is not significant in this case and should be ignored.":"在这种情况下，成员并不重要，应被忽略。"," member, and the responsibility for releasing the medium through the value of its ":"成员，以及通过其价值释放媒介的责任"," values that specifies a group of flags for controlling the advisory connection.":"指定一组用于控制咨询连接的标志的值。","The name to register ":"注册的名称"," of a source interface.":"源接口。"," member. If ":"成员。 如果","When this method returns, contains a pointer to a ":"当此方法返回时，包含一个指针","The object to register.":"要注册的对象。"," interface on the advisory sink that will receive the change notification.":"咨询接收器上的接口将收到更改通知。","The fully qualified name of the event source interface.":"事件源接口的完全合格名称。",", the receiver of the medium is responsible for releasing it; otherwise, ":"，培养基的接收器负责释放它； 否则，"," structure that contains the most general information possible for a specific rendering, making it canonically equivalent to ":"结构包含特定渲染的最通用信息，使其在规范上等同于","When this method returns, contains a pointer to a DWORD token that identifies this connection. You can use this token later to delete the advisory connection by passing it to ":"当此方法返回时，包含一个指向DWORD令牌的指针，该指标可以标识此连接。 您可以在以后使用此令牌来删除咨询连接，以将其传递给","The object to unregister for release.":"未注册的对象。",", passed by reference, which describes the format, target device, rendering, and storage information of the calling data object.":"，通过引用传递，该引用描述了调用数据对象的格式，目标设备，渲染和存储信息。"," points to the ":"指向",". The caller must allocate this structure and the ":"。 来电者必须分配此结构和","The key to unregister.":"解开的关键。",". If this value is zero, the connection was not established. This parameter is passed uninitialized.":"。 如果此值为零，则没有建立连接。 该参数通过非初始化。"," interface on the appropriate object so its ":"适当对象上的接口，以便"," method must fill in the data. To retrieve data in a subsequent call such as ":"方法必须填写数据。 在随后的呼叫中检索数据，例如",", passed by reference, which defines the storage medium (global memory, disk file, storage object, stream object, Graphics Device Interface (GDI) object, or undefined) and ownership of that medium for the calling data object.":"，通过引用传递，该引用定义存储介质（全局内存，磁盘文件，存储对象，流对象，图形设备接口（GDI）对象或未定义）以及该介质的所有权用于调用数据对象。"," value if the specified key was successfully removed from the table; otherwise, an ":"值如果指定的键成功从表中删除； 否则，一个","This method supports the standard return values E_INVALIDARG, E_UNEXPECTED, and E_OUTOFMEMORY, as well as the following:  \n  \n ":"此方法支持标准返回值E_INVALIDARG，E_UNEDECT和E_OUTOFMEMORY，以及以下内容：","A pointer to the ":"指向",", the caller uses the supplied value of ":"，呼叫者使用提供的值"," method can be called. The medium must be allocated and filled in by ":"可以调用方法。 介质必须分配并填充","The structure containing the binding options to set.":"包含绑定选项设置的结构。"," structure, passed by reference, that defines the format, medium, and target device to use when passing the data. Only one medium can be specified in ":"通过引用传递的结构，该结构定义了传递数据时使用的格式，介质和目标设备。 只能在","A DWORD token that specifies the connection to remove. Use the value returned by ":"一个指定要删除的连接的dword令牌。 使用返回的值",". The caller must also free the medium. The implementation of this method must always supply a value of ":"。 呼叫者还必须释放介质。 该方法的实施必须始终提供",", unless the value supplied is ":"，除非提供的价值是","A reference to the sink to receive calls for the outgoing interface managed by this connection point.":"引用接收到该连接点管理的接口的呼叫。"," if the number of elements skipped equals the ":"如果跳过的元素数量等于",", and only the following ":"，只有以下","When this method returns, contains a reference to the actual number of elements enumerated in ":"当此方法返回时，包含对实际列举的元素数量的引用"," member of the ":"成员"," to enumerate from right to left.":"从右到左枚举。"," structure that this parameter points to.":"该参数指向的结构。"," structures to return in ":"返回的结构"," values are valid: ":"值有效："," if the number of elements skipped equals ":"如果跳过的元素数量等于","When this method returns, contains a reference to the enumerator object for the moniker. This parameter is passed uninitialized.":"当此方法返回时，包含对绰号的枚举对象的引用。 该参数通过非初始化。","When this method returns, contains a reference to the enumerated ":"当此方法返回时，包含对枚举的引用"," structure, passed by reference, that defines the format, medium, and target device to use for the query.":"通过引用传递的结构，该结构定义了用于查询的格式，介质和目标设备。",", passed by reference, that defines the storage medium containing the data being transferred. The medium must be allocated by the caller and filled in by ":"，通过引用，定义包含要传输数据的存储介质。 介质必须由呼叫者分配并填写"," references. This parameter is passed uninitialized.":"参考。 该参数通过非初始化。"," interface on the bind context object used in this binding operation.":"在此绑定操作中使用的绑定上下文对象上的接口。","When this method returns, contains the CLSID. This parameter is passed uninitialized.":"当此方法返回时，包含CLSID。 该参数通过非初始化。"," structure, passed by reference, that defines the format used by the data object when interpreting the data contained in the storage medium.":"通过引用传递的结构，该结构在解释存储介质中包含的数据时定义了数据对象使用的格式。"," value if the moniker is running; an ":"如果绰号运行，则有价值； 一个","A reference to the moniker to the left of the current moniker, if the moniker is part of a composite moniker.":"如果绰号是复合绰号的一部分，则指称当前绰号的纪念碑。","When this method returns, contains a reference to the actual number of references enumerated in ":"当此方法返回时，包含对实际列举的实际参考数量的引用"," structure, passed by reference, that defines the storage medium in which the data is being passed.":"通过引用的结构定义了通过数据传递的存储介质。","A reference to the bind context to use in this operation.":"对本操作中使用的绑定上下文的引用。"," value if the moniker is not running; or an ":"如果绰号不运行，则有价值； 或一个","The interface identifier (IID) of the interface that the client intends to use to communicate with the object that the moniker identifies.":"客户端打算使用的接口标识符（IID）与绰号识别的对象进行通信。","When this method returns, contains the display name string. This parameter is passed uninitialized.":"当此方法返回时，包含显示名称字符串。 该参数通过非初始化。"," to specify that the data object called, which implements ":"指定调用数据对象，哪个实现","An HRESULT with the value ":"具有价值的hresult","When this method returns, contains a pointer to an integer that is one of the values from the ":"当此方法返回时，包含一个指向整数的指针，该整数是来自","When this method returns, contains a reference to the interface requested by ":"当此方法返回时，包含对接口的引用","When this method returns, contains a ":"当此方法返回时，包含一个","The number of monikers to return in ":"返回的绰号",", owns the storage medium after the call returns. This means that the data object must free the medium after it has been used by calling the ":"呼叫返回后，拥有存储介质。 这意味着数据对象在使用介质后必须释放该介质，以通过调用"," interface on the bind context object used during this binding operation.":"在此绑定操作中使用的绑定上下文对象上的接口。"," enumeration, and refers to one of the COM moniker classes. This parameter is passed uninitialized.":"枚举，并指的是其中一个com绰号课程。 该参数通过非初始化。"," function. ":"功能。"," value indicating the size, in bytes, of the stream needed to save this object. This parameter is passed uninitialized.":"值表示保存此对象所需的流的大小，字节中的大小。 该参数通过非初始化。","When this method returns, contains a reference to the enumerated monikers. This parameter is passed uninitialized.":"当此方法返回时，包含对枚举的绰号的引用。 该参数通过非初始化。","The interface identifier (IID) of the storage interface requested.":"所请求的存储接口的接口标识符（IID）。"," value if the moniker is a system moniker; otherwise, an ":"如果绰号是系统绰号，则有价值； 否则，一个","A reference to the bind context to use in this binding operation.":"对绑定上下文的引用，以在此绑定操作中使用。","When this method returns, contains a reference to the actual number of monikers enumerated in ":"当此方法返回时，包含对实际列举的绰号"," to specify that the caller retains ownership of the storage medium, and the data object called uses the storage medium for the duration of the call only.":"为了指定呼叫者保留存储介质的所有权，并且称为称为呼叫持续时间的存储介质的数据对象。"," interface on another moniker to compare with the current moniker for a common prefix.":"另一个绰号上的接口与当前的绰号进行比较。","The stream that the object is loaded from.":"对象从中加载的流。","When this method returns, contains the time of the last change. This parameter is passed uninitialized.":"当此方法返回时，包含最后一个更改的时间。 该参数通过非初始化。","When this parameter returns, contains a reference to the actual number of references enumerated in ":"当此参数返回时，包含对实际列举的实际参考数量的引用","When this method returns, contains a reference to the newly created enumerator. This parameter is passed uninitialized.":"当此方法返回时，包含对新创建的枚举器的引用。 该参数通过非初始化。","A reference to the moniker that has been built from the display name up to this point.":"到目前为止，从显示名称构建的绰号。","When this method returns, contains the moniker that is the common prefix of the current moniker and ":"当此方法返回时，包含是当前绰号的普通前缀和","When this method returns, contains the hash value for this moniker. This parameter is passed uninitialized.":"当此方法返回时，包含该绰号的哈希值。 该参数通过非初始化。","A reference to the string containing the remaining display name to parse.":"对包含剩余的显示名称的字符串引用。"," references to return in ":"参考返回","The number of strings to return in ":"返回的字符串数"," interface on a moniker to append to the end of the current moniker.":"绰号上的接口，以附加到当前绰号的末尾。","When this method returns, contains a reference to the enumerated connections. This parameter is passed uninitialized.":"当此方法返回时，包含对枚举连接的引用。 该参数通过非初始化。","When this method returns, contains a moniker that is the inverse of the current moniker. This parameter is passed uninitialized.":"当此方法返回时，包含一个是当前绰号倒数的绰号。 该参数通过非初始化。","When this method returns, contains the number of characters that were consumed in parsing ":"当此方法返回时，包含解析中消耗的字符数量"," to indicate that the caller requires a nongeneric composition. The operation proceeds only if ":"为了表明呼叫者需要一个非元素组成。 仅当操作才进行","When this method returns, contains a reference to the enumerated strings. This parameter is passed uninitialized.":"当此方法返回时，包含对枚举字符串的引用。 该参数通过非初始化。","When this method returns, contains a reference to the actual number of connections enumerated in ":"当此方法返回时，包含对实际列举的实际连接数量的引用"," value if the object has changed; otherwise, an ":"值如果对象已更改； 否则，一个"," is a moniker class that the current moniker can combine with in some way other than forming a generic composite. ":"是当前绰号可以以某种方式与形成通用复合材料相结合的绰号类别。"," parameter equals the ":"参数等于","When this method returns, contains a reference to the moniker that was built from ":"当此方法返回时，包含对建造的绰号的引用","When this method returns, contains a reference to the actual number of strings enumerated in ":"当此方法返回时，包含对实际列举的字符串数的引用","A reference to the moniker to use for comparison.":"提及用于比较的绰号。"," to indicate that the method can create a generic composite if necessary.":"指示该方法可以在必要时创建通用复合材料。"," interface on the bind context to use in this binding operation.":"绑定上下文上的接口以在此绑定操作中使用。","The number of elements to skip in the enumeration.":"在枚举中跳过的元素数量。"," value if the monikers are identical; otherwise, an ":"如果绰号相同，则有价值； 否则，一个"," reference to the newly created enumerator.":"引用新创建的枚举器。","When this method returns, contains a reference to the resulting composite moniker. This parameter is passed uninitialized.":"当此方法返回时，包含对结果复合绰号的引用。 该参数通过非初始化。","A value that specifies how far the current moniker should be reduced.":"指定当前绰号应减少多远的值。","The number of elements to return in ":"返回的元素数量"," to enumerate the monikers from left to right. ":"从左到右列举绰号。","A reference to the moniker to the left of the current moniker if the current moniker is part of a composite.":"如果当前的绰号是复合材料的一部分，则对当前绰号左侧的绰号的引用。","When this method returns, contains a reference to the relative moniker. This parameter is passed uninitialized.":"当此方法返回时，包含对相对绰号的引用。 该参数通过非初始化。","A reference to the moniker to the left of the current moniker.":"对当前绰号左侧的绰号的引用。","The stream to which the object is saved.":"对象保存的流。","When this method returns, contains a reference to the enumerated elements. This parameter is passed uninitialized.":"当此方法返回时，包含对枚举元素的引用。 该参数通过非初始化。","When this method returns, contains the requested running object. This parameter is passed uninitialized.":"当此方法返回时，包含请求的运行对象。 该参数通过非初始化。","A reference to the moniker most recently added to the Running Object Table (ROT).":"对绰号的引用最近添加到运行对象表（ROT）中。","When this method returns, contains a reference to the reduced form of the current moniker, which can be ":"当此方法返回时，包含对当前绰号的简化形式的引用，可以是"," value that indicates the success or failure of the operation.":"表示操作成功或失败的值。","On successful return, contains the actual number of bytes written to the destination.":"成功返回后，包含写入目的地的实际字节数。","The buffer to write this stream to.":"将此流写入的缓冲区。"," to clear the modified flag after the save is complete; otherwise ":"保存完成后清除修改的标志； 否则"," if an error occurs or if the current moniker is reduced to nothing. This parameter is passed uninitialized.":"如果发生错误，或者当前的绰号降低到一无所有。 该参数通过非初始化。","When this object returns, contains the objects last change time. This parameter is passed uninitialized.":"当此对象返回时，包含对象的最后更改时间。 该参数通过非初始化。","When this method returns, contains a reference to the CLSID. This parameter is passed uninitialized.":"当此方法返回时，包含对CLSID的引用。 该参数通过非初始化。","The byte offset for the beginning of the range.":"范围开始时的字节偏移。","The number of bytes to write to the stream.":"写入流的字节数。","The Running Object Table (ROT) entry of the changed object.":"已更改对象的运行对象表（ROT）条目。","A reference to the moniker to which a relative path should be taken.":"对应采取相对路径的绰号的引用。","When this method returns, contains the address of a pointer to a zero-terminated string containing the path for the current file, or the default file name prompt (such as *.txt). This parameter is passed uninitialized.":"当此方法返回时，包含指向零终止字符串的指针的地址，该字符串包含当前文件的路径或默认文件名称提示符（例如 *.txt）。 该参数通过非初始化。","On successful return, contains the actual number of bytes written to the stream object. If the caller sets this pointer to ":"成功返回后，包含写入流对象的字节的实际数量。 如果呼叫者将此指针设置为","The length of the range, in bytes, to restrict.":"范围的长度，字节限制。"," was bound. This parameter is passed uninitialized.":"被束缚。 该参数通过非初始化。"," if the file has changed since it was last saved; ":"如果文件自上次保存以来已更改；","A reference to the object's last change time.":"引用对象的最后更改时间。",", this method does not provide the actual number of bytes written.":"，此方法不提供书面字节的实际数量。","The requested restrictions on accessing the range.":"请求访问该范围的限制。"," variable. This parameter is passed uninitialized.":"多变的。 该参数通过非初始化。"," if the file has not changed since it was last saved.":"如果文件自上次保存以来没有更改。","When this method returns, contains the data read from the stream. This parameter is passed uninitialized.":"当此方法返回时，包含从流读取的数据。 该参数通过非初始化。","Specifies whether the Running Object Table's (ROT) reference to ":"指定运行对象表（rot）是否引用到","The name to bind.":"绑定的名称。","The member ID of the ":"该成员ID","A zero-terminated string containing the absolute path of the file to open.":"一个零终止的字符串，其中包含要打开的文件的绝对路径。"," is weak or strong, and controls access to the object through its entry in the ROT.":"是弱或坚固的，并通过其在腐烂中的输入来控制对象的访问。","The number of bytes to read from the stream object.":"从流对象读取的字节数。","A hash value for ":"哈希值"," member's address to retrieve.":"会员的地址要检索。","A combination of values from the ":"来自的价值的组合","A reference to the object being registered as running.":"对被注册为运行的对象的引用。"," variable that receives the actual number of bytes read from the stream object.":"从流对象读取的实际字节数的变量。"," computed by ":"由"," values that specifies whether the member is a property, and if so, what kind.":"指定会员是否是属性的值，如果是属性，则是什么样的。"," enumeration to indicate the access mode in which to open ":"枚举以指示打开的访问模式","A reference to the moniker that identifies ":"对标识的绰号的引用","The displacement to add to ":"添加到","When this method returns, contains a reference to the ":"当此方法返回时，包含对","A flags word containing one or more of the invoke flags defined in the ":"一个包含一个或多个在","A value that can be used to identify this ROT entry in subsequent calls to ":"在随后的调用中，可用于识别此腐烂条目的值","The origin of the seek. The origin can be the beginning of the file, the current seek pointer, or the end of the file.":"寻求的起源。 原点可以是文件的开始，当前寻求指针或文件的末尾。","A zero-terminated string containing the absolute path of the file to which the object is saved.":"一个零终止的字符串，其中包含保存对象的文件的绝对路径。"," member. This parameter is passed uninitialized.":"成员。 该参数通过非初始化。","When this method returns, contains a reference to the type description that contains the item to which it is bound, if a ":"当此方法返回时，包含对包含其绑定项的类型描述的引用，如果","The Running Object Table (ROT) entry to revoke.":"运行的对象表（ROT）输入要撤销。"," to used the ":"使用","On successful return, contains the offset of the seek pointer from the beginning of the stream.":"成功返回后，包含从流的开头的寻求指针的偏移。"," was returned. This parameter is passed uninitialized.":"被返回。 该参数通过非初始化。","The object that acts as the controlling ":"充当控制的对象"," parameter as the current working file; otherwise ":"参数为当前工作文件； 否则","The IID of the interface that the caller uses to communicate with the resulting object.":"呼叫者用来与结果对象通信的接口IID。","The new size of the stream as a number of bytes.":"流的新大小为多个字节。","When this method returns, contains a reference to a ":"当此方法返回时，包含对","When this method returns, contains the new stream object. This parameter is passed uninitialized.":"当此方法返回时，包含新的流对象。 该参数通过非初始化。","The absolute path of the file where the object was previously saved.":"先前保存对象的文件的绝对路径。"," structure that describes this stream object. This parameter is passed uninitialized.":"描述此流对象的结构。 该参数通过非初始化。","When this method returns, contains a reference to the created object. This parameter is passed uninitialized.":"当此方法返回时，包含对创建对象的引用。 该参数通过非初始化。"," enumerator that indicates whether the name bound-to is a ":"指示名称bound-to是一个的枚举者","A value that controls how the changes for the stream object are committed.":"一个控制流对象更改的值。","Members in the ":"成员在","When this method returns, contains the new enumerator for the Running Object Table (ROT). This parameter is passed uninitialized.":"当此方法返回时，包含用于运行对象表（ROT）的新枚举器。 该参数通过非初始化。","When this method returns, contains a reference to the containing type library. This parameter is passed uninitialized.":"当此方法返回时，包含对包含类型库的引用。 该参数通过非初始化。","When this method returns, contains a reference to the bound-to ":"当此方法返回时，包含对界限的引用"," structure that this method does not return, thus saving some memory allocation operations.":"结构此方法无法返回，从而节省了一些内存分配操作。","When this method returns, contains a reference to the index of the type description within the containing type library. This parameter is passed uninitialized.":"当此方法返回时，包含对包含类型库中类型说明的索引的引用。 该参数通过非初始化。","A reference to the destination stream.":"目标流的引用。","A reference to the moniker to search for in the Running Object Table (ROT).":"对要在运行对象表(ROT)中搜索的名称的引用。"," determined by ":"取决于","The ID of the member function whose DLL entry description is to be returned.":"将返回其DLL输入描述的成员函数的ID。","The length, in bytes, of the range to restrict.":"范围内的长度，字节。","The number of bytes to copy from the source stream.":"从源流复制的字节数。"," to a ":"到","The access restrictions previously placed on the range.":"访问限制先前放在范围内。"," values that specifies the kind of member identified by ":"指定成员类型的值","On successful return, contains the actual number of bytes read from the source.":"成功返回后，包含从源读取的实际字节数。","When this method returns, contains a reference to an ":"当此方法返回时，包含对 "," that contains the name of the DLL.":"其中包含DLL的名称。","If not ":"如果不"," of the type to which ":"以下类型"," reference to a ":"引用a"," that contains the name of the entry point.":"其中包含入口点的名称。","A reference to the interface described by this type description.":"对此类型描述描述的接口的引用。",", the function sets ":"，功能集","The index of the type description within the type library.":"类型库中类型说明的索引。",", and the function is defined by an ordinal, then ":"，该函数由序数定义，然后","When this method returns, contains an index of ":"当此方法返回时，包含一个索引","Function pointer to QueryInterface.":"函数指针到查询方面。","A value that identifies the interface member.":"标识接口成员的值。"," enumeration for the type description. This parameter is passed uninitialized.":"类型说明的枚举。 该参数通过非初始化。"," is set to point to the ordinal.":"设置为指向序数。","Identifier of the interface member.":"接口成员的标识符。","The string to test. This is an in/out parameter.":"要测试的字符串。 这是一个IN/OUT参数。","Function pointer to AddRef.":"函数指针到AddRef。","Flags that describe the context of the invoke call.":"描述调用呼叫的上下文的标志。","The ID of the member whose documentation is to be returned.":"将返回文档的成员的ID。","The hash value of ":"哈希值","When this method returns, contains the name of the item method. This parameter is passed uninitialized.":"当此方法返回时，包含项目方法的名称。 该参数通过非初始化。","Function pointer to Release.":"功能指针释放。","Flags describing the context of the invoke call.":"描述调用呼叫的上下文的标志。","A reference to a structure that contains an array of arguments, an array of DISPIDs for named arguments, and counts of the number of elements in each array.":"对包含一系列参数的结构的引用，命名参数的一系列分配以及每个数组中元素数量的计数。"," was found in the type library; otherwise, ":"在类型库中发现； 否则，","The managed object to expose outside the .NET runtime.":"托管对象在.NET运行时公开。","A reference to the location at which the result is to be stored. If ":"引用将存储结果的位置。 如果","When this method returns, contains the documentation string for the specified item. This parameter is passed uninitialized.":"当此方法返回时，包含指定项目的文档字符串。 该参数通过非初始化。","Flags used to configure the generated interface.":"用于配置生成的接口的标志。"," indicates the index of the argument with incorrect type. If more than one argument returns an error, ":"用不正确的类型指示参数的索引。 如果多个参数返回错误，","The name to search for.":"要搜索的名称。"," specifies ":"指定","When this method returns, contains a reference to the Help context associated with the specified item. This parameter is passed uninitialized.":"当此方法返回时，包含对与指定项目关联的帮助上下文的引用。 该参数通过非初始化。","The generated COM interface, as a pointer to the ":"生成的com接口，作为指向"," is ignored. Set to ":"被忽略。 调成","When this method returns, contains an array of the ":"当此方法返回时，包含一个数组"," indicates only the first argument with an error.":"仅指示第一个参数带有错误。","When this method returns, contains the fully qualified name of the Help file. This parameter is passed uninitialized.":"当此方法返回时，包含帮助文件的完全合格名称。 该参数通过非初始化。","s of the found items; ":"发现的物品；"," if no result is desired.":"如果不需要结果。","The name to search for. This is an in/out parameter.":"要搜索的名称。 这是一个in/out参数。","The index of the function description to return.":"函数说明的索引要返回。"," interface implementation, that can be passed outside the .NET runtime.":" 接口实现，可以在.NET运行时之外传递。","A pointer to an exception information structure, which is filled in only if ":"指向异常信息结构的指针，仅在"," [i]. This parameter cannot be ":"[一世]。 此参数不能是","The object to use as the wrapper for the external object.":"用作外部对象的包装器的对象。","On entry, a value, passed by reference, that indicates how many instances to look for. For example, ":"进入时，通过引用传递的值表示要查找多少实例。 例如，","A hash value to speed up the search, computed by the ":"哈希值以加快搜索的速度，由"," indicates the index within ":"指示内部的索引"," structure that describes the specified function. This parameter is passed uninitialized.":" 描述指定功能的结构。 此参数未初始化地传递。"," to be used as the wrapper for the external object":"用作外部对象的包装器"," function. If ":"功能。 如果"," , passed by reference, that is used to identify the data.":"，通过引用传递，用于识别数据。","Inner for COM aggregation scenarios":"内部集合场景"," of the argument with the incorrect type. If more than one argument returns an error, ":"与不正确类型的参数。 如果多个参数返回错误，"," is 0, a value is computed.":"为0，计算值。","An array of names to map.":"要映射的名称数组。","Returns a managed object associated with the supplied external COM object.":"返回与所提供的外部COM对象关联的托管对象。","When this method returns, contains an array of pointers to the type descriptions that contain the name specified in ":"当此方法返回时，包含一系列指针到包含在","When this method returns, contains an object that specifies where to put the retrieved data. This parameter is passed uninitialized.":"当此方法返回时，包含一个对象，该对象指定将检索到的数据放在何处。 此参数未初始化地传递。"," indicates only the first argument with an error. This parameter is passed uninitialized.":" 仅指示第一个有错误的参数。 此参数未初始化地传递。","The count of names to map.":"名称计数要映射。","Collection of objects to release.":"收集要释放的对象。","An index of the type description whose documentation is to be returned.":"将返回文档的类型说明的索引。","An array of the ":"阵列"," structure to release.":"释放的结构。","Pointer to Vtable function entry.":"指向VTable功能条目的指针。","When this method returns, contains a reference to an array in which name mappings are placed. This parameter is passed uninitialized.":"当此方法返回时，包含对放置名称映射的数组的引用。 该参数通过非初始化。"," 's of the found items; ":"发现的物品；","When this method returns, contains a string that specifies the name of the specified item. This parameter is passed uninitialized.":"当此方法返回时，包含一个指定指定项目名称的字符串。 该参数通过非初始化。","An instance of the type associated with the dispatched function call.":"与调度函数调用相关联的类型的实例。","An object that acts as the controlling ":"充当控制的对象","The index of the implemented interface or base interface.":"已实现的接口或基本接口的索引。"," [i] is the ":"[i]是","When this method returns, contains a string that specifies the fully qualified name of the Help file. This parameter is passed uninitialized.":"当此方法返回时，包含一个字符串，该字符串指定了帮助文件的完全合格名称。 该参数通过非初始化。"," enumeration. This parameter is passed uninitialized.":"枚举。 该参数通过非初始化。","A pointer to ":"指针","The caller will provide an IUnknown Vtable.":"呼叫者将提供iunknown vtable。"," that indexes into the type description specified by ":"索引到由","An index of the type description whose documentation is to be returned; if ":"将返回文档的类型说明的索引； 如果","The member ID that indicates which marshaling information is needed.":"指示需要哪些编制信息的成员ID。",", which holds all custom data items.":"，其中包含所有自定义数据项。","Flag used to indicate the COM interface should implement IReferenceTrackerTarget.":"用于指示COM接口的标志应实现IREFERENCETRACKERTARGET。"," is -1, the documentation for the library is returned.":"IS -1，返回库的文档。"," [i]. Cannot be ":"[一世]。 不可能是","The index of the function to get the custom data for.":"该功能的索引获取自定义数据。","On entry, indicates how many instances to look for. For example, ":"进入时，指示寻找多少实例。 例如，","Check if the supplied instance is actually a wrapper and if so return the underlying managed object rather than creating a new wrapper.":"检查提供的实例实际上是包装器，如果是这样，则返回基础托管对象而不是创建新包装器。","When this method returns, contains a BSTR that specifies the name of the specified item. If the caller does not need the item name, ":"当此方法返回时，包含一个指定指定项目名称的BSTR。 如果呼叫者不需要项目名称，"," string used in marshaling the fields of the structure described by the referenced type description, or returns ":" 用于封送引用的类型描述所描述的结构的字段的字符串，或返回 ","The index of the implementation type for the custom data.":"定制数据实现类型的索引。"," = 1 can be called to find the first occurrence. The search stops when one instance is found.  \n  \n On exit, indicates the number of instances that were found. If the ":"= 1可以调用以找到第一次出现。 当找到一个实例时，搜索停止。 \n  \n  出口时，指示发现的实例数量。 如果是","When this method returns, contains a BSTR that specifies the fully qualified name of the file containing the DLL used for Help file. If the caller does not need the file name, ":"当此方法返回时，包含一个BSTR，该BSTR指定包含用于帮助文件的DLL的文件的完全合格名称。 如果呼叫者不需要文件名，"," which holds all custom data items.":"容纳所有自定义数据项。"," if there is no information to return. This parameter is passed uninitialized.":"如果没有信息要返回。 该参数通过非初始化。"," are identical, there might be more type descriptions that contain the name.":"是相同的，可能还有更多包含名称的类型描述。","A pointer to a count of unique names. If the caller does not need this information, set to ":"指向独特名称的指针。 如果呼叫者不需要此信息，请设置为","The string representation of the value of this instance, consisting of a sequence of digits ranging from 0 to 9 with no leading zeroes.":"此实例值的字符串表示形式，由从0到9的数字序列组成，没有前导零。","The ID of the member whose name (or names) is to be returned.":"将返回其名称（或名称）的成员的ID。","The index of the parameter of this function to get the custom data for.":"此功能参数的索引以获取自定义数据。","The index of the type description whose documentation is to be returned.":"将返回文档的类型说明的索引。"," to be wrapped and marshaled as ":"被包裹和封以称为","When this method returns, contains the name (or names) associated with the member. This parameter is passed uninitialized.":"当此方法返回时，包含与成员关联的名称（或名称）。 该参数通过非初始化。","When this method returns, contains a pointer to a change in the count of unique names. This parameter is passed uninitialized.":"当此方法返回时，包含指向唯一名称计数的更改的指针。 该参数通过非初始化。","The index of the variable to get the custom data for.":"变量的索引获取自定义数据。","When this method returns, contains a string that represents the name of the specified item. This parameter is passed uninitialized.":"当此方法返回时，包含一个表示指定项目名称的字符串。 该参数通过非初始化。","The object containing the ":"包含的对象","When this method returns, contains the number of names in the ":"当此方法返回时，包含名称的数量","The GUID used to identify the data.":"用于识别数据的GUID。","An index of the ":"一个索引"," array. This parameter is passed uninitialized.":"大批。 该参数通过非初始化。","When this method returns, contains a string that represents the documentation string for the specified item. This parameter is passed uninitialized.":"当此方法返回时，包含一个代表指定项目的文档字符串的字符串。 该参数通过非初始化。","The wrapped object to be marshaled as type ":"包裹的对象被称为类型"," that specifies where to put the retrieved data. This parameter is passed uninitialized.":"这指定了放置检索到的数据的位置。 该参数通过非初始化。","A handle to the referenced type description to return.":"引用类型说明的句柄要返回。","The default value of ":"的默认值","When this method returns, contains the Help context identifier associated with the specified item. This parameter is passed uninitialized.":"当此方法返回时，包含与指定项目关联的帮助上下文标识符。 该参数通过非初始化。","The member identifier for the type description.":"类型说明的成员标识符。"," for any call to ":"任何电话","When this method returns, contains the referenced type description. This parameter is passed uninitialized.":"当此方法返回时，包含引用类型说明。 该参数通过非初始化。",", passed by reference, that represents the IID of the ":"，通过引用传递，表示 ","When this method returns, contains a string that represents the fully qualified name of the Help file. This parameter is passed uninitialized.":"当此方法返回时，包含一个代表帮助文件的完全合格名称的字符串。 该参数通过非初始化。","The index of the implemented type whose handle is returned.":"返回其句柄的实现类型的索引。","A bitwise combination of enumeration values that specify the paths that the ":"枚举值的位组合，该值指定了路径"," that contains the name of the specified item. If the caller does not need the item name, ":" 包含指定项的名称。 如果调用者不需要项目名称, "," interface of the class whose type info is requested.":"请求其类型信息的类的接口。","When this method returns, contains a structure that contains the library's attributes. This parameter is passed uninitialized.":"当此方法返回时，包含一个包含库属性的结构。 此参数未初始化地传递。","The string to test.":"要测试的字符串。","When this method returns, contains the Help localization context. If the caller does not need the Help context, ":"当此方法返回时，包含帮助本地化上下文。 如果呼叫者不需要帮助上下文，","When this method returns, contains a reference to a handle for the implemented interface. This parameter is passed uninitialized.":"当此方法返回时，包含对实现接口的句柄的引用。 该参数通过非初始化。","Target of the returned Vtables.":"返回的Vtables的目标。"," function searches during platform invokes.":" 在平台调用期间进行函数搜索。","When this method returns, contains an instance of a ":"当此方法返回时，包含一个实例"," that contains the fully qualified name of the file containing the DLL used for the Help file. If the caller does not need the file name, ":"其中包含包含用于帮助文件的DLL的文件的完全资格的名称。 如果呼叫者不需要文件名，","When this method returns, contains a reference to the structure that contains the attributes of this type description. This parameter is passed uninitialized.":"当此方法返回时，包含对包含此类型描述属性的结构的引用。 该参数通过非初始化。","A bitwise combination of enumeration values that specify search paths for platform invokes.":"枚举值的位组合，为平台调用指定搜索路径。","Flags used to compute Vtables.":"用于计算VTABLE的标志。"," instance for this ":"实例"," that specified where to put the data. This parameter is passed uninitialized.":"指定将数据放在哪里。 该参数通过非初始化。"," interface of the containing type library. This parameter is passed uninitialized.":"包含类型库的接口。 该参数通过非初始化。","An object that represents the default value of a parameter.":"表示参数的默认值的对象。"," interface to return.":"返回的接口。","The number of elements contained in the returned memory.":"返回的内存中包含的元素数量。","The index of the variable description to return.":"要返回的变量描述的索引。","The member identifier.":"成员标识符。"," describing the type referenced by ":"描述由"," pointer containing memory for all COM interface entries.":"指针包含所有COM接口条目的内存。","The object to be wrapped and converted to ":"要包装并转换为"," structure that describes the specified variable. This parameter is passed uninitialized.":"描述指定变量的结构。 该参数通过非初始化。"," values that specifies the kind of member identified by memid.":"指定MEMID标识的成员的种类。","Object to import for usage into the .NET runtime.":"目的是导入用于.NET运行时的使用。","The number of type descriptions in the type library.":"类型库中的类型说明数量。","The object wrapped by the ":"包裹的对象","When this method returns, contains an index into the function. This parameter is passed uninitialized.":"当此方法返回时，将包含索引到该函数中。 该参数通过非初始化。","Flags used to describe the external object.":"用于描述外部对象的标志。","The native library to resolve.":"本地库解决。","The DISPID for the member.":"分配会员。","The IID of the interface or CLSID of the class whose type info is requested.":"请求类型信息的类界面或clsid的IID。","A managed object associated with the supplied external COM object.":"与所提供的外部COM对象关联的托管对象。","The assembly requesting the resolution.":"大会要求该决议。","The name of the DLL that contains the unmanaged method. This can include an assembly display name, if the DLL is included in an assembly.":"包含非托管方法的DLL的名称。 如果DLL包含在程序集中，则可以包含一个汇编显示名称。","When this method returns, contains the requested ":"当此方法返回时，包含请求的"," of the containing type library. This parameter is passed uninitialized.":" 的包含类型库。 此参数未初始化地传递。","The managed object to be converted.":"要转换的托管对象。"," on the PInvoke, if any. Otherwise, the ":"在Pinvoke上，如果有的话。 否则，"," parameter. A moniker is a name, and in this case, the moniker is defined by an interface.":"范围。 绰号是一个名字，在这种情况下，绰号是由接口定义的。","A pointer to the COM view of the managed object.":"指向托管对象的COM视图的指针。","The name of the DLL file that contains the entry point.":"包含入口点的DLL文件的名称。","The type to generate a GUID for.":"生成GUID的类型。"," on the assembly, if any. Otherwise ":"在大会上（如果有）。 否则","The object whose CCW holds a reference counted handle. The handle is strong if the reference count on the CCW is greater than zero; otherwise, it is weak.":"CCW包含参考计数的对象。 如果CCW的参考计数大于零，则手柄很强； 否则，它是虚弱的。"," interface and construct the exception just from the error code.":"接口并仅从错误代码中构造异常。","A pointer to the unmanaged data to be wrapped.":"指向要包装的非托管数据的指针。","An identifier for the specified type.":"指定类型的标识符。","An object that represents the converted HRESULT and information obtained from ":"代表转换后的hresult和信息的对象","The handle for the loaded native library on success, or ":"成功的本机库的手柄，或"," to change the strength of the handle on the ":"改变手柄的强度","The type to get a ProgID for.":"获得PROGID的类型。","An object that represents the managed view of the COM data.":"表示COM数据的托管视图的对象。"," if an HRESULT value doesn't represent an error code (for example, ":"如果hresult值不代表错误代码（例如，"," on failure.":"失败。"," parameter to weak, regardless of its reference count; ":"参数到弱，无论其参考计数如何；","The GUID of the requested interface.":"请求接口的GUID。","The ProgID of the specified type.":"指定类型的ProgID。","A pointer to an EXCEPTION_POINTERS structure.":"指向异常的指针。","The exception to be converted to an error code.":"要转换为错误代码的例外。"," to reset the handle strength on ":"重置手柄强度","A reference to the requested interface, when this method returns.":"当此方法返回时，对请求的接口的引用。","The HRESULT of the error.":"错误的问题。","The delegate to be passed to unmanaged code.":"代表将传递给非托管代码。","The object that provides the interface.":"提供接口的对象。"," to be reference counted.":"参考计数。","One of the enumeration values that indicates whether a custom implementation of IUnknown::QueryInterface was used.":"枚举值之一，指示是否使用了iunknown :: QueryInterface的自定义实现。","The object containing the HRESULT of the error.":"包含错误的对象。","A value that can be passed to unmanaged code, which, in turn, can use it to call the underlying managed delegate.":"可以传递给非托管代码的值，该代码又可以使用它来调用基础托管委托。","The type of interface that is requested.":"请求的接口类型。","The one-dimensional array to copy from.":"要复制的一维数组。","The interface type.":"接口类型。","The module whose HINSTANCE is desired.":"需要hinstance的模块。","The zero-based index in the source array where copying should start.":"源阵列中的基于零的索引应在其中复制启动。"," to be assigned.":" 被分配。","The interface pointer that represents the specified interface for the object.":"表示对象指定接口的接口指针。","The type that should be used to dispatch for ":"应该用于派遣的类型","The HINSTANCE for ":"hinstance","The memory pointer to copy to.":"内存指针复制到。","One of the enumeration values that indicates whether to apply an ":"指示是否应用的枚举值之一"," of the class.":"班级。","The number of array elements to copy.":"要复制的数组元素数。"," on the current object.":"在当前对象上。","; or -1 if the module does not have an HINSTANCE.":"; 或-1如果模块没有Hinstance。"," customization that is supplied by an ":"由","A name for the collector. This parameter allows you to name collectors that track handle types separately.":"收藏家的名字。 此参数允许您命名单独跟踪手柄类型的收集器。","Indicates if the function should throw an exception instead of returning ":"指示该函数是否应该引发异常而不是返回","The memory pointer to copy from.":"内存指针复制。","The interface pointer that represents the interface for the object.":"表示对象接口的接口指针。","The exception to convert to an HRESULT.":"转换为hresult的例外。","A value that specifies the point at which collections should begin.":"指定收集应开始的点的值。"," if this object can be cast to the given interface; otherwise, ":"如果可以将此对象施加到给定的接口； 否则，","The interface pointer that represents the ":"表示代表的接口指针","A name for the collector.  This parameter allows you to name collectors that track handle types separately.":"收藏家的名字。 此参数允许您命名单独跟踪手柄类型的收集器。","The HRESULT mapped to the supplied exception.":"映射到提供的例外的hresult。","The zero-based index in the destination array where copying should start.":"复制应该开始的目标数组中的从零开始的索引。","The location of the original type library file.":"原始类型库文件的位置。","A value that specifies the point at which collections must occur. This should be set to the maximum number of available handles.":"指定必须发生收集的点的值。 应将其设置为最大可用手柄数。","The COM object that contains the data that you want.":"包含您想要的数据的com对象。","The name of the original type library file.":"原始类型库文件的名称。","The outer ":"外部","The HRESULT corresponding to the last Win32 error code.":"最后一个Win32错误代码对应的HRESULT。","The key in the internal hash table of ":"内部哈希表中的关键","Describes how the interface should be exposed to COM clients.":"描述应如何将接口接触到COM客户端。"," to retrieve the data from.":"从中检索数据。"," pointer.":"指针。","The object whose ":"其对象"," values that describes how the interface should be exposed to COM clients.":"描述界面应如何暴露于COM客户端的值。","The data represented by the ":"由"," value that describes how the interface should be exposed to COM.":"描述接口应如何暴露于com的值。","An object to aggregate.":"一个汇总的对象。"," interface is requested.":"请求接口。"," parameter in the internal hash table of the ":"内部哈希表中的参数","The unmanaged function pointer to be converted.":"未托管的功能指针要转换。","The number of handles collected.":"收集的手柄数量。","Indicates the position of the LCID argument in the unmanaged signature, where 0 is the first argument.":"指示LCID参数在非管理签名中的位置，其中0是第一个参数。","The inner ":"内在"," pointer for the ":"指针","A value that specifies the point at which collections must occur.":"指定必须发生收集的点的值。","This ":"这个","The position of the LCID argument in the unmanaged signature, where 0 is the first argument.":"LCID论点在非托管签名中的位置，其中0是第一个参数。","The type of the delegate to be returned.":"要退还的代表的类型。","The last platform invoke error":"最后一个平台调用错误"," pointer of the managed object.":" 被管理对象的指针。","The class that contains the required stub method.":"包含所需的存根方法的类。"," property allows you to name collectors that track handle types separately.":"属性允许您命名单独跟踪手柄类型的收藏家。","A delegate instance that can be cast to the appropriate delegate type.":"可以施放适当的委托类型的委托实例。","The last system error":"最后一个系统错误","The outer IUnknown pointer.":"外部iunknown指针。","The name of the stub method.":"存根方法的名称。","A managed object that should not be finalized until the platform invoke call returns.":"在平台调用呼叫返回之前，不应确定的托管对象。","The last error code set by a call to the Win32 SetLastError function.":"由Win32 setlasterror函数的调用设置的最后一个错误代码。","The managed object to aggregate.":"托管对象汇总。","The unmanaged function pointer to convert.":"未托管的功能指针转换。","The class that contains the customized interop stub.":"包含自定义Interop存根的类。","The object for which to get a COM VARIANT.":"获得com变体的对象。"," that indicates a handle to a resource.":"这表示资源的手柄。","The inner IUnknown pointer of the managed object.":"托管对象的内部iunknown指针。","The name of a customized interop stub.":"定制的Interop存根的名称。","A instance of the specified delegate type.":"指定的委托类型的实例。","A pointer to receive the VARIANT that corresponds to the ":"接收与对应的变体的指针","The interface reference count to increment.":"接口参考计数要增加。","The object to be wrapped.":"要包装的对象。","The object that needs a handle.":"需要手柄的对象。","A type that represents an interface or class.":"代表接口或类的类型。","An object that represents the specified unmanaged COM object.":"代表指定的非托管com对象的对象。","The new value of the reference count on the ":"参考计数的新值","The handle to a resource of the specified ":"指定资源的手柄","The type of wrapper to create.":"要创建的包装器的类型。","A pointer to a COM VARIANT.":"指向COM变体的指针。","The size of the block of memory to be allocated.":"要分配的内存块的大小。"," object to retrieve an internal integer representation from.":"对象从中检索内部整数表示。","The last VTBL slot of the interface when exposed to COM. If the ":"接触到COM时，接口的最后一个VTBL插槽。 如果是","An object that corresponds to the ":"一个对应于","The newly wrapped object that is an instance of the desired type.":"新包装的对象是所需类型的实例。"," object that represents a ":"代表一个的对象","An object of the specified type that corresponds to the ":"指定类型的对象对应于"," parameter is a class, the returned VTBL slot is the last slot in the interface that is generated from the class.":"参数是类，返回的VTBL插槽是从类生成的接口中的最后一个插槽。","An integer representing the address of the block of memory allocated. This memory must be released with ":"一个整数，表示分配的内存块的地址。 此内存必须与释放 ","The newly wrapped object.":"新包装的对象。","A pointer to the first element of an array of COM VARIANTs.":"指向COM变体数组的第一个元素的指针。","The handle to a resource.":"资源的手柄。","The type of the exception.":"异常的类型。","The required number of bytes in memory.":"内存中所需的字节数。","A pointer to an unmanaged block of memory.":"指向不受管理的内存块的指针。","The count of COM VARIANTs in ":"com变体的计数","The HRESULT to be converted.":"要转换的hresult。","The object holding the handle to a resource.":"将手柄固定到资源的对象。","A pointer to the newly allocated memory. This memory must be released using the ":"指向新分配的内存的指针。 必须使用","An object array that corresponds to ":"一个对应的对象数组","An object that represents the converted HRESULT, or ":"代表转换后的hresult或","Type of a formatted class. This provides the layout information necessary to delete the buffer in the ":"格式类的类型。 这提供了删除缓冲区所需的布局信息","The object contained by the adapter object.":"适配器对象包含的对象。"," if there are any RCWs available for cleanup; otherwise, ":"如果有任何RCW可以清理； 否则，"," objects that corresponds to ":"对应的对象","The type to activate.":"激活的类型。","The RCW to be released.":"将发布的RCW。"," if the HRESULT value doesn't represent an error code (for example, ":"如果hresult值不代表错误代码（例如，","A type that represents an interface or a class.":"代表接口或类的类型。","The moniker corresponding to the desired interface pointer.":"与所需的接口指针相对应的绰号。"," interface that provides more information about the error. You can specify ":"提供有关错误的更多信息的接口。 您可以指定","The new value of the reference count of the RCW associated with the ":"RCW的参考计数的新值与","The first VTBL slot that contains user-defined methods. The first slot is 3 if the interface is based on IUnknown, and 7 if the interface is based on IDispatch.":"第一个包含用户定义方法的VTBL插槽。 如果接口基于iunknown，则第一个插槽是3，如果接口基于IDISPATCH，则为7。","The managed object to be destroyed.":"要销毁的托管对象。","An object containing a reference to the interface pointer identified by the ":"包含对接口指针的引用的对象","A pointer to the unmanaged data to be destroyed.":"指向要破坏非托管数据的指针。"," to use the current ":"使用电流"," parameter, which is 0 (zero) if the release is successful.":"参数，如果发布成功，则为0（零）。","An instance of the class corresponding to the ":"与对应的类实例"," interface of the unmanaged object.":"非托管对象的接口。","The size, in bytes, of the native data.":"本机数据的大小，字节。"," interface, or ":"接口，或"," object that represents the requested unmanaged COM object.":"代表请求的未托管com对象的对象。","The address of the BSTR to be freed.":"BSTR的地址将被释放。","The type of the requested managed class.":"请求的托管类的类型。","The CLSID of the type to return.":"要返回的类型的clsid。"," to ignore the current ":"忽略电流","The number of Unicode characters to copy.":"要复制的Unicode字符数。","The address of the memory to be freed.":"记忆的地址要释放。","The new value of the reference count on the interface specified by the ":"参考计数的新值，该接口指定的接口","The handle returned by the original matching call to ":"原始匹配电话返回的把手"," regardless of whether the CLSID is valid.":"不管CLSID是否有效。","The address, in unmanaged memory, to where ":"地址，在不受管理的内存中，","The object to which the data is to be copied. This must be an instance of a formatted class.":"数据要复制的对象。 这必须是格式化类的实例。","The COM object to release.":"要释放的com对象。","The address, in unmanaged memory, to where the string was copied, or 0 if ":"在不受管理的内存中，地址复制到了字符串的位置，或者0","The new value of the reference count of the RCW associated with ":"与RCW相关联的参考计数的新值","An object that represents an ":"代表一个的对象","The name of the exported symbol.":"导出符号的名称。","The type of object to be created. This object must represent a formatted class or a structure.":"要创建对象的类型。 此对象必须代表格式的类或结构。","A managed object that holds the data to be marshaled. This object must be a structure or an instance of a formatted class.":"一个托管对象，该对象持有要申请的数据。 该对象必须是格式类别的结构或实例。","The name of the type that the ":"类型的名称",". This value is typically zero since the RCW keeps just one reference to the wrapped COM object regardless of the number of managed clients calling it.":"。 该值通常为零，因为RCW仅保留一个对包装com对象的引用，而不管托管客户的数量是多少。","The address of the symbol.":"符号的地址。","A managed object containing the data pointed to by the ":"一个托管对象，其中包含由","A pointer to an unmanaged block of memory, which must be allocated before this method is called.":"指向不受管理的内存块的指针，必须在调用此方法之前分配。","The name of the native library to be loaded.":"要加载的本地库的名称。"," parameter points to.":"参数指向。","The managed object to copy.":"托管对象要复制。","A managed object that contains the data that the ":"一个包含数据的托管对象"," to call the ":"打电话","The OS handle for the loaded native library.":"已加载的本机库的操作系统手柄。","The object to which the data is to be copied.":"数据要复制的对象。","The address, in unmanaged memory, where the ":"地址，在不受管理的内存中，","A managed pointer to an ":"托管指针"," method on the ":"方法","The interface to be queried.":"要查询的接口。","The assembly loading the native library.":"装配加载本地库。"," parameter was copied to, or 0 if a null object was supplied.":"参数已复制为或0，如果提供了空对象。","A unique RCW for the specified ":"指定的唯一RCW"," parameter before this method copies the data. The block must contain valid data. Note that passing ":"参数此方法复制数据。 该块必须包含有效的数据。 请注意","The search path.":"搜索路径。","The interface identifier (IID) of the requested interface.":"请求接口的接口标识符（IID）。","The address, in unmanaged memory, to where the ":"地址，在不受管理的内存中，到达"," instance to update":"实例更新"," when the memory block already contains data can lead to a memory leak.":"当内存块已经包含数据时，数据可能会导致内存泄漏。","When this method returns, contains a reference to the returned interface.":"当此方法返回时，包含对返回接口的引用。","The OS handle for the loaded library.":"已加载库的操作系统手柄。"," parameter was copied, or 0 if a null object was supplied.":"复制参数，或者如果提供了空对象，则为0。","Pre-existing handle":"预先存在的手柄","A managed object that holds the data to be marshaled. The object must be a structure or an instance of a formatted class.":"一个托管对象，该对象持有要申请的数据。 对象必须是格式类别的结构或实例。","An HRESULT that indicates the success or failure of the call.":"指示通话成功或失败的hresult。","The assembly for which the resolver is registered.":"解析器注册的组件。","The address, in unmanaged memory, where ":"地址，在不受管理的记忆中，"," parameter is a COM type; otherwise, ":"参数是com类型； 否则，","The resolver callback to register.":"解析器回调要注册。","The address in unmanaged memory from which to read.":"在不受管理的内存中可以阅读的地址。","The HRESULT corresponding to the desired exception.":"与所需异常相对应的hresult。"," was copied, or 0 if ":"被复制，或0","When the method returns, contains the symbol address, if it exists.":"当该方法返回时，如果存在，则包含符号地址。"," object whose length is 0.":"长度为0的对象。","The type to check for COM visibility.":"检查可见性的类型。","The byte read from unmanaged memory.":"字节从不受管理的内存中读取。","A pointer to the IErrorInfo interface that provides more information about the error. You can specify ":"指向IERRORINFO接口的指针，可提供有关错误的更多信息。 您可以指定"," if the type is visible to COM; otherwise, ":"如果类型可见； 否则，"," if the method returned successfully; otherwise, ":"如果方法成功返回； 否则，","The COM object in which to store the data.":"存储数据的com对象。"," to use the current IErrorInfo interface, or ":"使用当前的iErrorinfo接口或","The base address in unmanaged memory from which to read.":"不受管理的内存中的基础地址可以读取。","A value type or formatted reference type that specifies the managed class. You must apply the ":"指定托管类的值类型或格式的参考类型。 您必须应用","The key in the internal hash table of the COM object in which to store the data.":"COM对象的内部哈希表中存储数据的键。","When the method returns, the OS handle of the loaded native library.":"当方法返回时，已加载的本机库的操作系统句柄。","An additional byte offset, which is added to the ":"额外的字节偏移，添加到"," to ignore the current IErrorInfo interface and construct the exception just from the error code.":"忽略当前的iErrorinfo接口并仅从错误代码中构造异常。"," to the class.":"上课。","The data to set.":"要设置的数据。"," if the native library was loaded successful; otherwise, ":"如果本地图书馆被加载成功； 否则，","The array that contains the desired element.":"包含所需元素的数组。","The field within the ":"在"," parameter before reading.":"阅读前的参数。"," if the load operation was successful; otherwise, ":"如果负载操作成功； 否则，"," parameter of the desired element.":"所需元素的参数。"," if the data was set successfully; otherwise, ":" 如果数据设置成功；否则, ","The byte read from unmanaged memory at the given offset.":"字节在给定偏移量下从不管理的内存中读取。","The offset, in bytes, for the ":"在字节中的偏移","The size, in bytes, of the block to allocate.":"分配的块的大小，字节。","Error to set":"设置错误","The address of ":"地址","The base address in unmanaged memory of the source object.":"源对象的不管理内存中的基础地址。"," parameter within the specified class that is declared by platform invoke.":"通过平台调用声明的指定类中的参数。"," inside ":"里面","The alignment, in bytes, of the block to allocate. This must be a power of ":"要分配的块的对齐（以字节为单位）。 这一定是 ","The object whose size is to be returned.":"要返回大小的对象。","The 16-bit signed integer read from unmanaged memory.":"16位签名的整数从不受管理的内存中读取。","The name of the field in the ":"该领域的名称","The index of the desired element in the ":"所需元素的索引","The size of the specified object in unmanaged code.":"在非托管代码中指定对象的大小。","A pointer to the allocated aligned block of memory.":"指向分配的对齐内存块的指针。","The method to be checked.":"要检查的方法。","The 16-bit signed integer read from unmanaged memory at the given offset.":"16位签名的整数在给定偏移量下从未管理的内存中读取。","The address in unmanaged memory to write to.":"未托管记忆中的地址要写入。","The type whose size is to be returned.":"要返回大小的类型。","A pointer to the aligned block of memory that should be freed.":"应释放的指向对齐的记忆块的指针。","The class whose methods are to be checked.":"要检查方法的类。","The 32-bit signed integer read from unmanaged memory.":"32位签名的整数从未管理的内存中读取。","The base address in unmanaged memory to write to.":"不受管理的内存中的基础地址要写入。","The previously allocated block of memory.":"先前分配的内存块。","The size of the specified type in unmanaged code.":"非托管代码中指定类型的大小。","The 32-bit signed integer read from unmanaged memory at the given offset.":"32位签名的整数在给定偏移量下从未管理的内存中读取。","The address of the first character of the unmanaged string.":"非托管字符串的第一个字符的地址。","The size, in bytes, of the type that is specified by the ":"大小，字节，是由"," parameter before writing.":"写作前的参数。","A pointer to the reallocated aligned block of memory.":"指向重新分配的对齐内存块的指针。","The 64-bit signed integer read from unmanaged memory.":"64位签名的整数从未管理的内存中读取。","A managed string that holds a copy of the unmanaged string. If ":"托管字符串，该字符串包含未托管字符串的副本。 如果"," generic type parameter.":"通用类型参数。","The base address in unmanaged memory of the target object.":"目标对象的不管理内存中的基础地址。","A pointer to the allocated block of memory.":"指向分配的内存块的指针。","The base address in the native heap to write to.":"本机堆中的基础地址要写入。",", the method returns a null string.":"，该方法返回一个空字符串。","The 64-bit signed integer read from unmanaged memory at the given offset.":"64位签名的整数在给定偏移量时从未管理的内存中读取。","The size, in bytes, of the specified object in unmanaged code.":"非托管代码中指定对象的大小，字节。","The count, in elements, of the block to allocate.":"分配的块中的计数。","The integer read from unmanaged memory. A 32 bit integer is returned on 32 bit machines and a 64 bit integer is returned on 64 bit machines.":"整数从不受管理的内存中读取。 32位机器上返回一个32位整数，并在64位计算机上返回一个64位整数。","The base address in unmanaged memory to write.":"不受管理的内存中的基础地址要编写。","The managed string to be copied.":"要复制的托管字符串。","The byte count of the input string to copy.":"要复制的输入字符串的字节数。","The size, in bytes, of each element in the allocation.":"分配中每个元素的大小，字节。","The integer read from unmanaged memory at the given offset.":"整数在给定偏移量下从不管理的内存中读取。","An unmanaged pointer to the ":"一个非托管的指针","The address of the ":"地址","A managed string that holds a copy of the native string if the value of the ":"如果托管字符串保存本机字符串的副本，则","A pointer to memory allocated with ":"分配记忆的指针","A pointer to the allocated and zeroed block of memory.":"指向分配和零内存块的指针。",", or 0 if ":"，或0","The new size of the allocated block.":"分配的块的新尺寸。"," to free.":"自由。","; otherwise, this method returns ":";否则，此方法返回 "," is null.":"一片空白。","A pointer to the block of memory that should be freed.":"指向应该释放的记忆块的指针。","The address of the unmanaged string to free.":"未托管的字符串的地址免费。","An integer representing the address of the reallocated block of memory. This memory must be released with ":"代表重新分配的内存块的地址的整数。 此内存必须与","For Unicode platforms, the address of the first Unicode character.  \n  \n -or-  \n  \n For ANSI platforms, the address of the first ANSI character.":"对于Unicode平台，第一个Unicode字符的地址。 \n  \n  -或者- \n  \n  对于ANSI平台，第一个ANSI字符的地址。","A managed string to be copied.":"要复制的托管字符串。","The size, in bytes, of the reallocated block.":"重新分配的块的大小，字节。","The new size of the allocated block. This is not a pointer; it is the byte count you are requesting, cast to type ":"分配的块的新尺寸。 这不是指针； 这是您要求的字节数，要键入","The value the data is to be marshaled as.":"数据的值将被填写为。","A managed string that holds a copy of the unmanaged string if the value of the ":"如果托管字符串，则包含未管理字符串的副本，如果","An integer representing a pointer to the block of memory allocated for the string, or 0 if ":"代表指向字符串分配内存块的指针的整数，或0","The number of characters to copy.":"要复制的字符数。","A pointer to the reallocated block of memory.":"指向重新分配的内存块的指针。",". If you pass a pointer, it is treated as a size.":"。 如果您通过指针，则将其视为尺寸。"," value the data is to be marshaled as.":"价值数据将被填写为。","The allocated memory block, or 0 if ":"分配的内存块，或0","A managed string that holds a copy of the unmanaged string.":"托管字符串，该字符串包含未托管字符串的副本。","The error message that specifies the reason for the exception.":"指定异常原因的错误消息。","A pointer to the reallocated memory. This memory must be released using ":"指向重新分配的内存的指针。 必须使用此内存","The floating-point value.":"浮点值。","An integer representing a pointer to the block of memory allocated for the string, or 0 if s is ":"一个代表指向字符串内存块的指针的整数，或者如果s为0","Called when tracking begins and ends.":"在跟踪开始和结束时被调用。","The interface to release.":"释放的接口。","The native library OS handle to be freed.":"本地图书馆的操作系统将被释放。","The string representation of the value of this instance.":"此实例值的字符串表示。","The native library OS handle.":"本地库OS句柄。","Called to determine if a managed object instance is referenced elsewhere, and must not be collected by the GC.":"调用以确定在其他地方引用托管对象实例，并且不得由GC收集。","The object to track.":"要跟踪的对象。","Called when a tracked object enters the finalization queue.":"当跟踪对象进入终结队列时调用。","A pointer to memory tagged to the object.":"指向对象标记的内存指针。","Reference tracking GC handle.":"参考跟踪GC手柄。","Handler for the propagation of unhandled Exceptions across a managed -> native boundary (that is, Reverse P/Invoke).":"处理程序在托管 - >本地边界（即反向p/Invoke）中传播未经处理的异常。","The export to override.":"要复盖的导出。","The function override.":"功能覆盖。","The exception.":"例外。","Unhandled exception.":"未处理的异常。","Last managed method.":"最后一个托管方法。","Context provided to the returned function pointer.":"提供给返回功能指针的上下文。","Exception propagation callback.":"异常传播回调。","The signal that occurred.":"发生的信号。","The signal to register for.":"要注册的信号。","The handler that gets invoked.":"被调用的处理程序。"," instance that can be disposed to unregister the handler.":"可以放置处理处理程序的实例。","The major version of the type library for which this assembly is the primary interop assembly.":"该组件的主要版本的主要版本是主要的Interop组件。","The minor version of the type library for which this assembly is the primary interop assembly.":"该组件是主要的Interop组件的类型库的次要版本。","The major version number of the type library for which this assembly is the primary interop assembly.":"此组件的主要版本编号是主要的Interop组件。","The minor version number of the type library for which this assembly is the primary interop assembly.":"该组件的类型库的次要版本编号是主要的Interop组件。","The ProgID to be assigned to the class.":"要分配给课堂的prog。","The ProgID of the class.":"班级的演奏。","The assembly to test.":"要测试的组件。"," if the assembly is loaded in the global assembly cache; otherwise, ":"如果将组件加载到全局组件缓存中； 否则，","A string that contains the path to the directory where the common language runtime is installed.":"一个包含通往通用语言运行时目录的路径的字符串。","The identifier for the desired class.":"所需类的标识符。","The identifier for the desired interface.":"所需接口的标识符。","An unmanaged pointer to the requested interface.":"非托管指针指向所请求的接口。","A string containing the version number of the common language runtime.":"一个包含通用语言运行时版本编号的字符串。","The path to the system configuration file.":"系统配置文件的路径。",", because resumable exceptions are not implemented.":"，因为未实施可重新启动的例外。","The first type equivalence string.":"第一个类型的等价字符串。","The second type equivalence string.":"第二类等价字符串。","The value of the constructor's ":"构造函数的价值"," value for the attributed method as found in the type library it was imported from.":"属性方法的值，如它从中导入的类型库中所示。"," value for this method.":"该方法的值。"," object that exclusively uses an interface.":"专门使用接口的对象。"," value for the attributed type as found in the type library it was imported from.":"属性类型的值，如它从中导入的类型库中所示。"," value for this type.":"这种类型的值。"," value for the attributed field as found in the type library it was imported from.":"属性字段的值如它从中导入的类型库中所示。"," value for this field.":"该字段的价值。","The major version number of the type library.":"类型库的主要版本编号。","The minor version number of the type library.":"类型库的次要版本编号。","The object being wrapped.":"被包裹的对象。","The wrapped object.":"包裹的对象。","The specified calling convention.":"指定的呼叫约定。","The value of the calling convention specified by the ":"由呼叫约定的价值"," constructor.":"构造函数。","The object to marshal.":"元帅的对象。","A pointer to an array of ":"指向一系列数组的指针","The number of elements of ":"元素的数量"," to include in the new instance.":"在新实例中包括。","A character to append to this secure string.":"一个可以附加到此安全字符串的字符。","A duplicate of this secure string.":"此安全字符串的重复。","The index position where parameter ":"参数的索引位置","The character to insert.":"要插入的角色。"}