{" property is initialized to this value.":"属性被初始化为此值。"," structure that specifies the portion of the ":"指定部分的结构"," object that contains the inbound replication connections for this AD LDS instance.":"包含此AD LDS实例的入站复制连接的对象。"," structure that represents the color of spaces between the lines drawn by this ":"代表该线之间的空间颜色的结构"," that represents the DNS name of the ":" 表示dns的名称 "," structure that represents the background color for this ":"代表背景颜色的结构"," to lock.":"锁定。"," that contains the IP address of the computer that hosts this AD LDS instance.":"其中包含托管此AD LDS实例的计算机的IP地址。"," object for which the local trust direction and password must be changed.":"必须更改本地信任方向和密码的对象。","The path of this ":"这条道路"," enumeration that specifies the access level (read/write) for the ":"指定访问级别的枚举（读/写）"," structure that represents the foreground color for this ":"代表此的前景颜色的结构"," value that contains the LDAP port number of this AD LDS instance.":"包含此AD LDS实例的LDAP端口号的值。","The new password for the trust relationship.":"信任关系的新密码。","The user name to use when authenticating the client. The ":"对客户端进行身份验证时要使用的用户名。 这"," values that represents the pattern of this ":"代表模式的值"," enumeration that specifies the data format of this ":"指定此数据格式的枚举"," object that contains the outbound replication connections for this AD LDS instance.":" 包含此AD LDS实例的出站复制连接的对象。"," object for which the local trust password is to be changed.":"要更改本地信任密码的对象。","The password to use when authenticating the client. The ":"对客户端进行身份验证时要使用的密码。 这"," structure that represents the starting point of the linear gradient.":"代表线性梯度的起点的结构。"," that contains information about this lock operation.":"其中包含有关此锁定操作的信息。"," members that indicate the roles that this AD LDS instance serves.":"表示此AD LDS实例服务的角色的成员。","The distinguished name of the ":"杰出的名称"," object for which the trust directions must be changed.":"必须更改信任方向的对象。"," structure that represents the endpoint of the linear gradient.":"表示线性梯度的终点的结构。","A rectangle structure that specifies the portion of the ":"指定部分的矩形结构"," that contains the name of the site of which this AD LDS instance is a member.":" 其中包含此AD lds实例是其成员的站点的名称。"," object for which to verify the trust relationship.":"验证信任关系的对象。"," object that will be the parent for the copy that is being created.":"将成为正在创建的副本的父对象。"," structure that represents the starting color of the linear gradient.":"代表线性梯度的起始颜色的结构。"," values that specifies the access level (read/write) for the ":"指定访问级别（读/写）的值"," value that specifies the direction of the trust, relative to this forest.":"相对于这个森林，指定信任方向的价值。"," object that represents the copy of this entry as a child of the new parent.":"代表本条目的副本的对象，作为新父母的孩子。"," value that contains the SSL port number of this AD LDS instance.":"包含此AD LDS实例的SSL端口号的值。"," structure that represents the ending color of the linear gradient.":" 表示线性渐变的结束颜色的结构。"," values that specifies the data format of the ":"指定数据格式的值"," object that contains all of the application partitions in this forest.":"包含该森林中所有应用程序分区的对象。","The DN of the ":"DN的DN"," delegate that this AD LDS instance will use for synchronization notifications.":"委托该AD LDS实例将用于同步通知。"," structure that specifies the bounds of the linear gradient.":"指定线性梯度边界的结构。"," that contains information about the lock operation.":"其中包含有关锁定操作的信息。","The name of the copy of this entry.":"此条目的副本的名称。"," collection that contains the ":"包含"," item to search for in this collection.":"在此集合中搜索的项目。"," structure that represents the starting color for the gradient.":" 表示渐变的起始颜色的结构。"," structure that represents the color to make transparent.":"代表使透明的颜色的结构。"," domains in the current ":"电流中的域"," item is in this collection; otherwise, ":"项目在此集合中； 否则，","A renamed copy of this entry as a child of the specified parent.":"该条目的重命名副本是指定父母的孩子。","The x-coordinate of the pixel to set.":"要设置的像素的X坐标。"," structure that represents the ending color for the gradient.":"代表梯度的结尾颜色的结构。"," items that receives the elements of this collection.":"接收此系列元素的项目。","The path of the entry to verify.":"验证条目的路径。"," value that represents the current forest mode of this ":"代表当前森林模式的价值","The y-coordinate of the pixel to set.":"要设置的像素的y坐标。"," enumeration element that specifies the orientation of the gradient. The orientation determines the starting and ending points of the gradient. For example, ":"指定梯度方向的枚举元素。 方向确定梯度的起点和终点。 例如，","The zero-based index of the first matching item. -1 if no member of this collection is identical to the ":"第一个匹配项的基于零的索引。 -1如果该集合的成员与"," if the specified path represents a valid entry in the directory service; otherwise, ":"如果指定的路径代表目录服务中的有效条目； 否则，"," specifies that the starting point is the upper-left corner of the rectangle and the ending point is the lower-right corner of the rectangle.":"指定起点是矩形的左上角，终点是矩形的右角。"," item.":"物品。","The operating mode level of the forest.":"森林的操作模式水平。"," structure that represents the color to assign to the specified pixel.":"代表要分配给指定像素的颜色的结构。"," objects that contains the arguments of the method to invoke.":"包含调用方法参数的对象。"," object that is used to create this application partition.":"用于创建此应用程序分区的对象。","The angle, measured in degrees clockwise from the x-axis, of the gradient's orientation line.":"该角度以梯度方向线的x轴顺时针式测量。"," global catalogs in the current ":"当前的全球目录","The return value of the invoked method.":"调用方法的返回值。","The horizontal resolution, in dots per inch, of the ":"水平分辨率，以每英寸点为单位"," to specify that the angle is affected by the transform associated with this ":"指定角度受到与此相关的转换的影响"," that specifies the distinguished name for this application partition.":"这指定了此应用程序分区的杰出名称。","The name of the property to get.":"要获得的属性名称。"," object that represents the domain controller that is the FSMO naming master of this ":"代表域控制器的对象，该控制器是FSMO命名主的命名主","The vertical resolution, in dots per inch, of the ":"垂直分辨率，以每英寸点为单位， "," by which to multiply the geometric transform.":"通过它乘以几何变换。","An object that represents the requested property.":"代表请求属性的对象。"," that specifies the object class that represents this application partition.":"这指定代表此应用程序分区的对象类。"," object that represents the first domain that was created in this ":"代表在此创建的第一个域的对象"," that specifies in which order to multiply the two matrices.":"该指定在哪个顺序乘以两个矩阵。"," that specifies information about the lock operation.":"这指定了有关锁定操作的信息。","The name of the property to set.":"要设置的属性名称。"," object that contains all of the directory servers that host this application partition.":"包含托管此应用程序分区的所有目录服务器的对象。"," object that represents the schema of the current ":"代表当前模式的对象","The Active Directory Domain Services object to set.":"Active Directory域服务对象要设置。"," that specifies whether to append or prepend the rotation matrix.":"这指定是添加还是预先预留旋转矩阵。","A pointer to the GDI+ brush object.":"指向GDI+刷子对象的指针。"," that specifies the name of the site to search.":"这指定了要搜索的站点的名称。"," object that represents the domain controller that is the FSMO schema master of this ":"代表域控制器的对象，该控制器是FSMO模式的主体"," object set to a system-defined color.":"对象设置为系统定义的颜色。","The parent to which you want to move this entry.":"您要移动此条目的父母。","The amount by which to scale the transform in the x-axis direction.":"在X轴方向上缩放变换的数量。"," object to which to write the contents of the graphics buffer.":"对象编写图形缓冲区的内容。"," object that contains the directory servers that host this application partition in the specified site.":"包含在指定站点中托管此应用程序分区的目录服务器的对象。","The new name of this entry.":"该条目的新名称。"," sites in the current ":"电流中的站点"," object that contains the directory servers that were found.":"包含发现的目录服务器的对象。","The amount by which to scale the transform in the y-axis direction.":"在y轴方向上缩放变换的数量。"," that points to the device context to which to write the contents of the graphics buffer.":"这指向编写图形缓冲区内容的设备上下文。","An array of the specified properties.":"指定属性的数组。"," object that contains one or more ":"包含一个或多个的对象"," object that outputs to the graphics buffer.":"输出到图形缓冲区的对象。"," that specifies whether to append or prepend the scaling matrix.":"这指定是附加还是预先预示缩放矩阵。"," object that contains the directory servers that are found.":"包含找到目录服务器的对象。","A value from 0 through 1 that specifies the center of the gradient (the point where the gradient is composed of only the ending color).":"从0到1的值指定梯度的中心（梯度仅由末端颜色组成的点）。"," objects that describe the trust relationship collision errors.":"描述信任关系碰撞错误的对象。","The new name of the entry.":"条目的新名称。"," object that contains the target and credentials to use for the search.":"包含用于搜索的目标和凭据的对象。"," to match the pixel format for the new buffer to.":"要匹配新缓冲区的像素格式。"," that contains one or more ":"其中包含一个或多个"," object containing the child entries of this node in the Active Directory Domain Services hierarchy.":"在Active Directory域服务层次结构中包含该节点的子条目的对象。"," that contains the distinguished name of the application partition to search for.":"其中包含要搜索的应用程序分区的杰出名称。","A value from 0 through1 that specifies how fast the colors falloff from the starting color to ":"从0到1的值指定颜色从起始颜色降低到的速度"," indicating the size of the buffer to create.":"指示要创建的缓冲区的大小。"," object is in the collection; otherwise, ":"对象在集合中； 否则，"," structure that represents the GUID of the ":"代表指导的结构"," that can be used to draw to a buffer of the specified dimensions.":"可以用来绘制指定尺寸的缓冲区。"," object that represents the results of the search.":"代表搜索结果的对象。"," (ending color)":"（结尾颜色）","The name of the object as named with the underlying directory service.":"用基础目录服务命名的对象的名称。","A string that contains the DNS name of the ":"一个包含DNS名称的字符串"," to a device context to match the pixel format of the new buffer to.":"到设备上下文以匹配新缓冲区的像素格式。","A value from 0 through 1 that specifies the center of the gradient (the point where the starting color and ending color are blended equally).":"从0到1的值指定梯度的中心（开始颜色和结尾颜色平均混合的点）。"," object for this application partition and site.":"此应用程序分区和站点的对象。",", as returned from the provider.":"，如提供者返回。","A string that contains the SID of the ":"一个包含SID的字符串"," value that indicates whether cached information should be ignored. ":"表示是否应忽略缓存信息的值。"," indicating the maximum size of the buffer dimensions.":"指示缓冲尺寸的最大尺寸。","A value from 0 through 1 that specifies how fast the colors falloff from the ":"从0到1的值指定颜色从","The native ADSI object.":"本机ADSI对象。","A string that contains the NetBIOS name of the ":"一个包含netbios名称的字符串"," for the current application domain.":"对于当前的应用程序域。","The value of the translation in x.":"x中翻译的值。"," if cached information should be ignored; otherwise, ":"如果应该忽略缓存的信息； 否则，"," values that represents the status of the ":"代表状态的值"," object that represents the security descriptor for this directory entry.":"代表此目录条目的安全描述符的对象。","The value of the translation in y.":"y翻译的价值。","The position of the first character in the range. For example, if ":"第一个字符在该范围内的位置。 例如，如果"," that specifies a site name.":"该指定站点名称。"," containing the collision record resulting from a collision between forest trust records.":"包含森林信托记录之间的碰撞导致的碰撞记录。"," object that contains the provider-specific options for this entry.":"包含此条目的提供商特定选项的对象。","The order (prepend or append) in which to apply the translation.":"应用翻译的订单（预处理或附加）。"," is set to 0, the first position of the range is position 0 in the string.":"设置为0，范围的第一个位置是字符串中的位置0。"," object for this application partition and specified site.":"该应用程序分区和指定网站的对象。"," value indicating the collision type.":"表示碰撞类型的值。"," object that represents the parent of this entry.":"代表此条目的父对象。"," object that contains the target and credentials to use to retrieve the application partition object.  The directory context must specify the DNS name of the application partition.":"包含用于检索应用程序分区对象的目标和凭据的对象。 目录上下文必须指定应用程序分区的DNS名称。"," value that provides information about the collision when the ":"提供有关碰撞信息的价值"," that represents a custom falloff for the gradient.":"这代表了梯度的自定义损坏。","The password to use when authenticating the client.":"对客户端进行身份验证时要使用的密码。","The number of positions in the range.":"该范围内的位置数量。","The value is ":"值是"," object that represents the application partition for the specified directory context.":"代表指定目录上下文的应用程序分区的对象。"," object. The default is an empty string (\"\").":"目的。 默认值是一个空字符串（“”）。","The object to compare to for equality.":"比较平等的对象。"," type is ":"类型是"," if gamma correction is enabled for this ":"如果对此启用了伽马校正"," to indicate the specified object is an instance with the same ":"指示指定的对象是一个具有相同的实例"," object that contains the properties that are set on this entry.":"包含此条目上设置的属性的对象。"," for this application partition.":"对于此应用程序分区。"," that contains the excluded top-level names in the current object.":"其中包含当前对象中排除的顶级名称。"," that defines a multicolor linear gradient.":"这定义了多色线性梯度。"," value as this instance; otherwise, ":"值为此实例； 否则，","The name of the schema class for this ":"为此的模式类的名称"," objects that represent directory servers for this application partition.":"代表此应用程序分区的目录服务器的对象。"," object that contains the top-level names in the current object.":"当前对象中包含顶级名称的对象。"," to indicate the two ":"指示两个"," object that represents the schema class for this entry.":"代表此条目的模式类的对象。","An array of two ":"两个阵列"," object  for the current object.":"当前对象的对象。","The distinguished name of the security reference domain for this application.":"此应用程序的安全参考域的杰出名称。"," to compare for inequality.":"比较不平等。"," structures that represents the starting and ending colors of the gradient.":"代表梯度的起始和结束颜色的结构。"," object that represents the domain controller.":"代表域控制器的对象。"," if the cache should not be committed after each operation; otherwise, ":"如果每次操作后都不应进行缓存； 否则，","The user name to use when authenticating the client.":"对客户端进行身份验证时要使用的用户名。","Not applicable. This method will always throw an ":"不适用。 这种方法将永远抛出"," to indicate the either the ":"指示要么"," structure that specifies the starting and ending points of the gradient.":"指定梯度的起点和终点的结构。"," is in this collection, otherwise, ":"在此集合中，否则"," values of the two ":"两个值"," if mutual authentication has been performed; otherwise, ":"如果进行了相互认证； 否则，"," object that contains the target and credentials to use for the search. The target of the context must be a forest.":"包含用于搜索的目标和凭据的对象。 环境的目标必须是森林。"," that defines a geometric transform that applies only to fills drawn with this ":"定义了仅适用于填充的几何变换","The zero-based index of the first matching item. -1 if no member of this collection is identical to ":"第一个匹配项的基于零的索引。 -1如果该集合的成员与","The account name that is being set to allow queries on its principal name.":"设置的帐户名称允许查询其主名称。"," that specifies how fills drawn with this ":"这指定了如何填充的方式"," objects differ; otherwise, ":"对象有所不同； 否则，"," object that contains the global catalog servers found by the search.":"包含搜索找到的全局目录服务器的对象。"," object that contains the last originating change time for this attribute.":" 包含此属性的最后原始更改时间的对象。","The number of entries in a page.":"页面中的条目数。"," are tiled.":"是瓷砖。","The first position of this ":"第一个位置","The name of the site to search for global catalog servers.":"搜索全局目录服务器的站点名称。"," structure that contains the identifier.":"包含标识符的结构。"," enumeration members that indicates the type of password encoding.":"指示密码编码类型的枚举成员。","The number of positions in this ":"此处的职位数"," value that contains the USN.":"包含USN的值。"," structure that represents the rectangle to be transformed.":" 表示要变换的矩形的结构。","The port number to use to establish an SSL connection when the password is set or changed.":"设置或更改密码时，用于建立SSL连接的端口号。"," object that contains the Active Directory Domain Services properties that are stored on this global catalog server.":"包含该全局目录服务器上存储的Active Directory域服务属性的对象。","An array of three ":"三个阵列","The LDAP display name of the attribute.":"属性的LDAP显示名称。"," object that represents the global catalog server found by the search.":"代表搜索找到的全局目录服务器的对象。"," enumeration members that specifies if and how referral chasing is pursued.":"指定是否以及如何追逐转介的枚举成员。"," that contains the names to initialize the collection values to.":"其中包含将收集值初始化为初始化的名称。","The distinguished name of the originating server.":"原始服务器的杰出名称。","An array of strings that contains the names of the categories to initialize the collection values to.":"包含类别名称的一系列字符串，以初始化集合值。"," enumeration members that specifies the security mask.":"指定安全掩码的枚举成员。"," members that defines the type of global catalog server to find.":" 定义要查找的全局编录服务器类型的成员。"," structures that represents the points of a parallelogram to which the upper-left, upper-right, and lower-left corners of the rectangle is to be transformed. The lower-right corner of the parallelogram is implied by the first three corners.":"代表平行四边形点的结构将转换为矩形的左上，右上角和下左下。 平行四边形的右下角暗示着前三个角落。","The string to check for in the collection.":"在集合中检查的字符串。","The node in the Active Directory Domain Services hierarchy where the search starts. The ":"搜索启动的Active Directory域服务层次结构中的节点。 这","The version number of this attribute. Each originating modification of the attribute increases this value by one.":"此属性的版本编号。 每个属性的原始修改都会将此值增加一个。","The name of the site to search for a global catalog server.":"搜索全局目录服务器的站点名称。","The value in the first row and first column of the new ":"新的第一行和第一列的值"," if the specified category is contained in the collection; otherwise, ":"如果指定类别包含在集合中； 否则，"," object for the global catalog server.":"全局目录服务器的对象。","The value in the first row and second column of the new ":"新的第一行和第二列中的值","The search filter string in Lightweight Directory Access Protocol (LDAP) format. The ":"轻量级目录访问协议（LDAP）格式中的搜索过滤器字符串。 这"," object that represents an AD LDS instance that was found.":"代表发现的AD LDS实例的对象。","An  ":"一个","The index of the destination array at which to begin copying.":"目的地阵列的索引开始复制。","The set of properties that are retrieved during the search. The ":"在搜索过程中检索到的属性集。 这","The value in the second row and first column of the new ":"新的第二行和第一列的值"," that specifies a partition in which to search.":"这指定了搜索的分区。","The category name to retrieve the index of in the collection.":"要检索集合中的索引的类别名称。"," object that contains the target and credentials to use to retrieve the object. The target of the context must be a domain controller.":"包含用于检索对象的目标和凭证的对象。 上下文的目标必须是域控制器。","The value in the second row and second column of the new ":"新的第二行和第二列中的值","The set of properties to retrieve during the search. The ":"在搜索过程中要检索的属性集。 这"," object that represents the global catalog server that was found.":"代表找到的全局目录服务器的对象。"," that specifies a site in which to search.":"这指定了一个搜索网站。","The index in the collection, or ":"集合中的索引或","The value in the third row and first column of the new ":"新的第三行和第一列的值"," objects that were found.":"发现的对象。","The scope of the search that is observed by the server. The ":"服务器观察到的搜索范围。 这"," if this domain controller is a global catalog server; ":"如果此域控制器是全局目录服务器；","The search filter string in Lightweight Directory Access Protocol (LDAP) format. The  ":"轻量级目录访问协议（LDAP）格式中的搜索过滤器字符串。 这","The value in the third row and second column of the new ":"新的第三行和第二列的值"," if the string does not exist in the collection.":" 如果该字符串不存在于集合中。"," objects that are found.":"找到的对象。"," if it is not a global catalog server.":"如果不是全局目录服务器。"," is the specified ":"是指定的"," if this method releases both managed and unmanaged resources; ":"如果此方法同时释放了管理和不受管理的资源；","The index of the collection element to access.":"收集元素访问的索引。"," is in this collection; otherwise, ":"在这个系列中； 否则，"," object that contains the target and credentials to use to retrieve the object. The target of the context can be an AD LDS instance or keywords that are specified in the serviceConnectionPoint object in the current forest that can identify the configuration set.":"包含用于检索对象的目标和凭证的对象。 上下文的目标可以是当前森林中的ServiceConnectionpoint对象中指定的AD LDS实例或可以识别配置集的关键字。","The category name at the specified index.":"指定索引处的类别名称。"," array that receives the elements of this collection. The array must have zero-based indexing.":"接收此集合元素的数组。 该数组必须具有零基索引。"," if it releases only unmanaged resources.":"如果仅发布非管理资源。"," identical to this ":" 与此相同 "," object that represents the configuration set for the specified context.":"代表指定上下文的配置集的对象。"," object that contains the results of the search.":"包含搜索结果的对象。","The width of the arrow.":"箭头的宽度。"," object to locate in this collection.":"对象要定位在此集合中。"," by which this ":"这样"," object for the configuration partition.":"配置分区的对象。","The zero-based index of the first matching object. Returns -1 if no member in this collection is identical to the specified ":"第一个匹配对象的基于零的索引。 返回-1如果此集合中没有成员与指定的"," object that contains the first entry that is found during the search.":"包含搜索过程中第一个条目的对象。","The height of the arrow.":"箭头的高度。"," is to be multiplied.":"要乘以。"," object is in this collection, otherwise, ":"对象在此集合中，否则"," value that indicates  the current AD LDS replication authentication mode.":"表示当前AD LDS复制身份验证模式的值。"," if the search is asynchronous; ":"如果搜索是异步的；"," to fill the arrow cap; otherwise, ":"填充箭头帽； 否则，"," that represents the order of the multiplication.":" 这表示乘法的顺序。"," value to which to set the AD LDS replication authentication mode.":"设置AD LDS复制身份验证模式的价值。"," object that contains the target and credentials with which to establish a replication connection.":"包含建立复制连接的目标和凭证的对象。","The angle of the rotation, in degrees.":"旋转的角度为程度。"," that contains the name of the current ":"其中包含当前的名称"," if the arrow cap is filled; otherwise, ":"如果箭头盖填充； 否则，","The LDAP display name of the attribute to perform the search against, or an empty string of no attribute scope query is set.":"属性的LDAP显示名称要执行搜索，或设置一个无属性范围查询的空字符串。","The height of the arrow cap.":"箭头帽的高度。","The user-defined name of the connection.":"连接的用户定义名称。"," if the result is cached on the client computer; otherwise, ":"如果结果在客户端计算机上缓存； 否则，","The number of units between the outline of the arrow cap and the fill of the arrow cap.":"箭头盖的轮廓与箭头盖的填充之间的单位数。","The angle (extent) of the rotation, in degrees.":"旋转的角度（范围），以度为单位。","The width, in units, of the arrow cap.":"箭头帽的宽度，以单位为单位。"," objects that are in the configuration set.":"配置集中的对象。"," that specifies the order (append or prepend) in which the rotation is applied to this ":"指定将旋转应用于此的订单（附加或预定）"," object that identifies the source server of the connection.":"标识连接源服务器的对象。"," structure that contains the maximum amount of time for the client to wait for the server to return results.  \n  \n The default value is -1 second, which means to wait indefinitely.":"结构包含客户端等待服务器返回结果的最长时间。 \n  \n  默认值为-1秒，这意味着无限期等待。"," object that represents the AD LDS instance that currently holds the domain naming master role.":"代表当前持有域名主角色的AD LDS实例的对象。"," arrays.":"数组。"," object that represents the schema for this configuration set.":"代表此配置集的模式的对象。"," value that specifies the behavior in which aliases are dereferenced. The default setting for this property is ":"指定别名被解释的行为的价值。 此属性的默认设置为"," that represents the center of the rotation.":" 表示旋转的中心。","An array of blend factors that specify the percentages of the starting color and the ending color to be used at the corresponding position.":"一系列混合因素，这些因素指定了在相应位置使用的起始颜色和最终颜色的百分比。"," object that specifies when the source is available for replication.":" 指定源何时可用于复制的对象。"," object for the search. ":"搜索对象。"," object that represents the AD LDS+  \n  \n instance that currently holds the schema operations master role.":"代表AD LDS+的对象 \n  \n  当前担任架构操作主角色的实例。"," that specifies the order (append or prepend) in which the rotation is applied.":"这指定了应用旋转的顺序（附加或预定）。"," members that specifies the type of context to create.  For this constructor, the context type must be ":"指定要创建上下文类型的成员。 对于此构造函数，上下文类型必须是","An array of blend positions that specify the percentages of distance along the gradient line.":"一系列混合位置，以指定沿梯度线的距离百分比。"," if the directory synchronization control should not be used.":"如果不使用目录同步控制。"," members that specifies the transport type of the connection.":"指定连接的传输类型的成员。","The number of colors and positions in this ":"其中的颜色和位置数量"," object that contains the target and credentials to establish a replication connection with.":"包含目标和凭证建立复制连接的对象。"," in the x-axis direction.":"在X轴方向。",".  Other types of directory contexts cannot be created using this constructor because other types require a constructor that includes a parameter specifying the directory or target name.":"。 其他类型的目录上下文不能使用此构造函数创建，因为其他类型需要一个包括指定目录或目标名称的参数的构造函数。","The search filter string in LDAP format, such as \"(objectClass=user)\". The default is \"(objectClass=*)\", which retrieves all objects.":"LDAP格式的搜索过滤器字符串，例如“（ObjectClass =用户）”。 默认值为“（ObjectClass =*）”，它检索所有对象。"," members that specifies the type of context to create.":"指定要创建上下文类型的成员。"," object that contains the target and credentials to search for.":" 包含要搜索的目标和凭据的对象。"," structures that represents the colors to use at corresponding positions along a gradient.":"代表沿梯度在相应位置使用的颜色的结构。","The maximum number of objects the server can return in a paged search. The default is zero, which means do not do a paged search.":"服务器可以在分类搜索中返回的最大对象数。 默认值为零，这意味着不进行分页搜索。"," in the y-axis direction.":" 在y轴方向上。","The name of the connection to search for.":"搜索连接的名称。","The target of the directory context. This string can take any of the formats defined in the Remarks section of the ":"目录上下文的目标。 该字符串可以采用“备注”部分中定义的任何格式"," object that contains the set of properties to retrieve during the search.  \n  \n The default is an empty ":"包含在搜索过程中要检索的属性集的对象。 \n  \n  默认值为空","An array of values that specify percentages of distance along the gradient line.":"一个值阵列沿梯度线指定距离的百分比。"," that specifies the order (append or prepend) in which the scale vector is applied to this ":"指定将量表向量应用于此的顺序（附加或预定）"," topic.":"话题。"," object that represents the connection.":"代表连接的对象。","The horizontal shear factor.":"水平剪切因子。",", which retrieves all properties.":"，检索所有属性。"," object that defines the fill for the custom cap.":"定义自定义帽的填充的对象。","The vertical shear factor.":"垂直剪切因子。"," object that represents the target of the replication connection.":"代表复制连接目标的对象。"," members that specifies the type of context to create. For this constructor, this parameter must be ":" 指定要创建的上下文类型的成员。 对于此构造函数，此参数必须为 "," if the search obtains only the names of attributes to which values have been assigned; ":" 如果搜索仅获取已分配值的属性的名称; "," object that defines the outline of the custom cap.":"定义自定义上限轮廓的对象。"," that specifies the order (append or prepend) in which the shear is applied.":"这指定了应用剪切的顺序（附加或预端）。","The user name to use for access.":"用于访问的用户名。","A string that contains the name of the replication connection.":"包含复制连接名称的字符串。","The line cap from which to create the custom cap.":"创建自定义帽的线盖。"," if the search obtains the names and values for all the requested attributes. The default value is ":"如果搜索获得所有请求属性的名称和值。 默认值是","The password to use for access.":"用于访问的密码。"," structures that represents the points to transform.":"代表要转换点的结构。"," members that specifies the change notification status of this replication connection.":" 指定此复制连接的更改通知状态的成员。","The distance between the cap and the line.":"盖和线之间的距离。"," members that specifies the type of context.":"指定上下文类型的成员。","The x value by which to translate this ":"x值翻译此值"," object in the Active Directory Domain Services hierarchy where the search starts. The default is a null reference (":" 搜索开始的Active Directory域服务层次结构中的对象。 默认为空引用（"," if this replication connection uses data compression; otherwise, ":"如果此复制连接使用数据压缩； 否则，"," that represents the amount of time the server should search for a page of results.  \n  \n The default value is -1 seconds, which means to search indefinitely.":"这表示服务器应搜索结果页面的时间。 \n  \n  默认值为-1秒，这意味着无限期搜索。","The name of the context.":"上下文的名称。"," this method creates, cast as an object.":"此方法创建，铸造为对象。","The y value by which to translate this ":"翻译此的Y值","A string that contains the DNS name of the server that is the destination of this replication connection.":"包含该复制连接目的地服务器的DNS名称的字符串。"," that specifies the order (append or prepend) in which the translation is applied to this ":"指定将翻译应用于此的订单（附加或预定）"," enumeration used at the beginning of a line within this cap.":"在此帽子内的一条线开始时使用的枚举。"," that represents the amount of time that the server should search.  \n  \n The default value is -1 seconds, which means to use the server-determined default of 120 seconds.":"这表示服务器应搜索的时间。 \n  \n  默认值为-1秒，这意味着使用服务器确定的默认值为120秒。","The user name to use for access by this context.":"此上下文访问的用户名。"," if this replication connection is enabled; otherwise, ":"如果启用了此复制连接； 否则，","An array of floating-point values that represents the elements of this ":"代表此元素的一系列浮点值","The maximum number of objects that the server returns in a search. The default value is zero, which means to use the server-determined default size limit of 1000 entries.":"服务器在搜索中返回的最大对象数。 默认值为零，这意味着使用服务器确定的默认尺寸限制为1000个条目。"," enumeration used at the end of a line within this cap.":" 在此cap内的行尾使用的枚举。","Determines if the managed resources should be released. ":"确定是否应发布托管资源。"," enumeration on which this ":"枚举这"," if this replication connection was generated by the KCC; otherwise, ":"如果这种复制连接是由KCC生成的； 否则，"," is identity; otherwise, ":"是身份； 否则，"," if the managed resources are not released.":"如果托管资源未发布。"," object that specifies the property and direction that the search results should be sorted on.":"指定搜索结果应分类的属性和方向的对象。","A string that contains the user-defined name of this replication connection.":"包含此复制连接的用户定义名称的字符串。"," is based.":" 是基于."," object that contains the replication neighbors for this object.":"包含此对象的复制邻居的对象。"," is invertible; otherwise, ":"可逆； 否则，"," if deleted objects should be included in the search; ":"如果应将删除的对象包括在搜索中；","The x translation value of this ":"x翻译值"," if this replication connection supports reciprocal replication; otherwise, ":"如果此复制连接支持相互复制； 否则，"," object that represents the directory server.":"代表目录服务器的对象。","The distance between the beginning of the cap and the end of the line.":"帽的开始和线的结束之间的距离。"," otherwise. The default value is ":"否则。 默认值是"," object that contains the replication connection failures for this directory server.":"包含此目录服务器的复制连接故障的对象。","The y translation value of this ":"y的翻译值"," object that represents the schedule on which the source server is available for replication. If this property is ":"代表可用于复制的源服务器的时间表的对象。 如果此属性是"," enumeration this ":"列举这个"," object that contains the virtual list view search information. The default value for this property is ":" 包含虚拟列表视图搜索信息的对象。 此属性的默认值为 ",", then the default schedule is used.":"，然后使用默认时间表。"," objects that represents the points through which the path is constructed.":" 表示通过其构造路径的点的对象。","The distinguished name of the partition for which to retrieve the replication cursor information.":"检索复制光标信息的分区的杰出名称。"," object uses to join lines.":"对象用来连接行。",", which means do not use the virtual list view search option.":"，这意味着不要使用虚拟列表查看搜索选项。","An array of bytes that specify the types of the corresponding points in the path.":"一个字节数组，指定路径中相应点的类型。"," that contains the replication cursor information.":"其中包含复制光标信息。"," if the replication schedule is owned by the user; otherwise, ":" 如果复制计划由用户拥有；否则, ","The amount by which to scale the cap.":"缩放盖的数量。"," destination for this serialization.":"此序列化的目的地。"," that defines the area filled by this ":"定义了这个区域","The path to the object for which to retrieve the replication metadata.":"通往检索复制元数据的对象的路径。"," members that specifies the span of this replication connection.":"指定此复制连接的跨度的成员。"," structures that represents the points that make up the vertices of the path.":"代表构成路径顶点的点的结构。"," object that is the destination for this serialization.":"对象是此序列化的目的地。"," enumeration that determines how the interior of this ":"枚举决定了内部的内部"," object that contains the replication metadata for the specified object.":"包含指定对象的复制元数据的对象。","A string that contains the DNS name of the server that is the source of this replication connection.":"一个包含服务器的DNS名称的字符串是此复制连接源的源。","The extended error code.":"扩展错误代码。"," that will be multiplied by the brush's current transformation matrix.":"这将乘以刷子的当前转换矩阵。"," is filled.":"充满。","The extended error message.":"扩展错误消息。","The distinguished name of the partition for which to retrieve the replication.":"要检索复制的分区的杰出名称。","The angle (extent) of rotation.":"旋转的角度（范围）。"," members that specifies the type of transport that is used by this replication connection.":"指定此复制连接使用的运输类型的成员。"," structures that defines the coordinates of the points that make up this ":"定义构成这一点的点的坐标的结构"," object that contains the current and pending replication operations.":"包含当前和未决复制操作的对象。","The transform scale factor in the x-axis direction.":"X轴方向的变换量表因子。","The zero-based index of the first matching object. Returns -1 if no member of the collection is identical to the ":"第一匹配对象的从零开始的索引。 如果集合中没有任何成员与 ","The path of the Active Directory Domain Services object, otherwise known as the ADsPath, to which the permissions apply.":"Active Directory域服务对象的路径，也称为ADSPATH，适用于权限。"," enumeration elements that specifies the type of each corresponding point in the ":"指定每个相应点的类型的枚举元素","The time at which the last successful replication synchronization occurred.":"最后一次成功复制同步的时间。","The transform scale factor in the y-axis direction.":"Y轴方向的变换量表因子。","The name of the site within the domain to which to move the directory server.":"在域内移动目录服务器的域中的站点名称。"," object that contains the permission entries for this permission.":"包含此权限的权限条目的对象。"," enumeration that specifies how the interiors of shapes in this ":"指定形状内部的枚举","The distinguished name of the partition to synchronize.":"同步分区的杰出名称。","The name of the partition represented by this replication cursor.":"该复制光标表示的分区名称。","The path to an Active Directory Domain Services node. The default is \"*\".":"Active Directory域服务节点的路径。 默认值为“*”。","A value from 0 through 1 that specifies where, along any radial from the center of the path to the path's boundary, the center color will be at its highest intensity. A value of 1 (the default) places the highest intensity at the center of the path.":"一个从0到1的值指定的是，沿着路径中心到路径边界的任何径向，中心颜色的强度最高。 1（默认值）的值将最高强度放在路径中心。"," are filled.":"被填满。","A combination of one or more of the ":"一个或多个的组合","The invocation identifier of the replication source server":"复制源服务器的调用标识符"," values. The default is Browse.":"值。 默认值是浏览。"," that represents the rectangular bounds of the ellipse from which the arc is taken.":"这代表了取弧的椭圆的矩形边界。","A value from 0 through 1 that specifies the maximum intensity of the center color that gets blended with the boundary color. A value of 1 causes the highest possible intensity of the center color, and it is the default value.":"从0到1的值指定与边界颜色混合的中心颜色的最大强度。 值为1的值会导致中心颜色的最高强度，这是默认值。","The name of the server to synchronize the partition with.":"服务器的名称与分区同步。","The name of the replication source server.":"复制源服务器的名称。","The path of the Active Directory Domain Services node to which the permissions apply.":"Active Directory域服务节点适用于权限的路径。"," that represents the color at the center of the path gradient.":"这代表路径梯度中心的颜色。","The name of the server.":"服务器的名称。","The starting angle of the arc, measured in degrees clockwise from the x-axis.":"弧的起始角，从X轴顺时针方向以度度测量。","The path to an Active Directory Domain Services node.":"Active Directory域服务节点的路径。","The maximum update sequence number (USN) for which the destination server has accepted changes from the source server.":"目标服务器为源服务器接受更改的最大更新序列号（USN）。"," object to add to this collection.":"对象添加到此集合中。"," that represents the center point of the path gradient.":"这代表路径梯度的中心点。"," object that contains the inbound replication connections for this directory server.":"包含此目录服务器的入站复制连接的对象。","The angle between ":"之间的角度","The zero-based index in the array where this method starts copying this collection.":"该方法开始复制此集合的数组中的基于零的索引。","The number of consecutive failures since the last successful replication.":"自上次成功复制以来的连续故障数量。"," that represents the focus point for the gradient falloff.":"这代表了梯度下降的焦点。","The Internet protocol (IP) address of this directory server in string form.":"此目录服务器的Internet协议（IP）地址以字符串表单。"," and the end of the arc.":"和弧的尽头。","The zero-based index of the first matching object.  Returns -1 if no member of this collection is identical to the ":"第一个匹配对象的基于零的索引。 返回-1，如果该集合的成员与","The date and time that the first failure occurred when replicating from the source server.":"从源服务器复制时，第一次故障发生的日期和时间。"," that represents a rectangular region that bounds the path this ":"代表一个矩形区域，该区域界定了路径","The name of the directory server.":"目录服务器的名称。","The x-coordinate of the upper-left corner of the rectangular region that defines the ellipse from which the arc is drawn.":"矩形区域的左上角的X坐标定义了从之绘制弧的椭圆形。"," fills.":"填充。","An HRESULT that contains the error code that is associated with the most recent failure. This will be ERROR_SUCCESS if the specific error is unavailable.":"包含与最新故障相关的错误代码的HRESULT。 如果特定错误不可用，这将是error_success。","A Byte data type object that specifies the directory synchronization search cookie.":"指定目录同步搜索cookie的字节数据类型对象。"," object that contains the outbound replication connections for this directory server.":"包含此目录服务器的出站复制连接的对象。","The y-coordinate of the upper-left corner of the rectangular region that defines the ellipse from which the arc is drawn.":"矩形区域的左上角的Y坐标定义了弧度的椭圆形。"," structures that represents the colors associated with each point in the path this ":" 表示与路径中每个点相关联的颜色的结构 "," object that contains the distinguished names of the partitions on this directory server.":"该目录服务器上包含分区的杰出名称的对象。"," data type object.":"数据类型对象。","The error message for the most recent failure.":"最近失败的错误消息。","The width of the rectangular region that defines the ellipse from which the arc is drawn.":"定义从中绘制弧的椭圆形的矩形区域的宽度。","An array of bytes that specify the ":"指定字节数组"," data type object that specifies how a directory synchronization search is performed.":"指定目录同步搜索的数据类型对象。","The name of the site that this directory server belongs to.":"该目录服务器所属于的站点的名称。","The DNS name of the source server.":"源服务器的DNS名称。","The height of the rectangular region that defines the ellipse from which the arc is drawn.":"定义从中绘制弧的椭圆形的矩形区域的高度。"," to apply to the new ":"申请新的","The directory synchronization search cookie object.":"目录同步搜索cookie对象。","The delegate that this directory server will use for synchronization notifications.":"该目录服务器将用于同步通知的委托。","The number of failed replication attempts from this source since the last successful replication attempt. If no previous attempt was successful, the return value is the number of failed replication attempts since the source was added as a neighbor.":"自上次成功复制尝试以来，该来源的复制尝试失败数量。 如果没有以前的尝试成功，则返回值是由于源以邻居的身份添加源的复制尝试的数量。"," that represents the starting point of the curve.":"这代表曲线的起点。",". Multiple values of the ":". 的多个值 ","The time of the last replication attempt. If no replication attempt occurred, the value is zero.":"最后复制尝试的时间。 如果未发生复制尝试，则该值为零。","A Byte data type object that contains a directory synchronization search cookie.  This method resets the cookie for this ":"包含目录同步搜索cookie的字节数据类型对象。 此方法为此重置cookie","The DNS name of the domain that the trust is created with.":"信任创建的域名DNS名称。"," that represents the first control point for the curve.":"这代表了曲线的第一个控制点。"," object instance to this value.":"对象实例为此值。","The time of the last successful synchronization. If no replication succeeded, the value is zero.":"最后一个成功同步的时间。 如果没有复制成功，则该值为零。"," enumeration can be combined with the ":"枚举可以与"," members that determines the direction of the trust, relative to this domain.":"相对于此领域，确定信任方向的成员。","The number of entries after the target entry that the client is requesting from the server.":"客户端从服务器请求的目标条目后的条目数。"," that represents the second control point for the curve.":"这代表了曲线的第二个控制点。","The message that corresponds to the last replication attempt. If the last attempt succeeded, the value is an empty string.":"与最后一次复制尝试相对应的消息。 如果最后一次尝试成功，则值是一个空字符串。","The password for the trust.":"信任的密码。"," operator.":"操作员。","The number of entries before the target entry that the client is requesting from the server.":"客户端从服务器请求的目标条目之前的条目数。","The error code for the last replication attempt. If the last attempt succeeded, the value is ERROR_SUCCESS.":"最后一次复制尝试的错误代码。 如果最后一次尝试成功，则该值是error_success。"," that represents the endpoint of the curve.":"这代表曲线的终点。"," object that represents the domain that the trust is being created with.":"代表信任正在创建的域的对象。","The em-size, in points, of the new font.":"新字体的em大小（以点为单位）。","The estimated target entry's requested offset within the list.":"列表中估计的目标条目的偏移。","The DNS name of the domain that the trust exists with.":"信托存在的域名DNS名称。","The name of the partition for this ":"分区的名称","The x-coordinate of the starting point of the curve.":"曲线起点的X坐标。"," of the new font.":"新字体。"," object that represents the domain that the trust exists with.":"代表信任存在的域的对象。","The virtual list view search response.":"虚拟列表查看搜索响应。","The y-coordinate of the starting point of the curve.":"曲线起点的Y坐标。"," value that contains the attribute and option settings for this ":"包含此属性和选项设置的值","The em-size of the new font in the units specified by the ":"新字体的EM大小在指定的单元中"," that contains the domain controller objects that were found by this method.":"其中包含该方法发现的域控制器对象。","The x-coordinate of the first control point for the curve.":"曲线的第一个控制点的X坐标。","The invocation identifier that was used by the replication source server in the last replication attempt.":"复制源服务器在上次复制尝试中使用的调用标识符。","The desired target entry requested by the client.":"客户要求的所需目标条目。"," that specifies a  \n  \n GDI character set to use for the new font.":"指定a \n  \n  GDI字符设置用于新字体。","The name of the site to search for the domain controllers.":"搜索域控制器的站点名称。","The y-coordinate of the first control point for the curve.":"曲线的第一个控制点的y坐标。"," enumeration value that indicates the transport type that was used for the replication connection.":"指示用于复制连接的传输类型的枚举值。"," that specifies a  \n  \n GDI character set to use for this font.":"指定a \n  \n  GDI字符设置用于该字体。","An integer value that represents the number of entries after the target entry that the client is requesting from the server.":"一个整数值，代表客户端从服务器请求的目标条目后的条目数。"," that represents the domain controller that is found by this method.":"这代表通过此方法找到的域控制器。","The x-coordinate of the second control point for the curve.":"曲线第二控制点的X坐标。","The USN value for the last successful replication cycle. If no replication succeeded, the value is zero.":"最后一个成功复制周期的USN值。 如果没有复制成功，则该值为零。","A Boolean value indicating whether the new font is derived from a GDI vertical font.":"布尔值表示新字体是否来自GDI垂直字体。"," members that defines the type of domain controller to find.":"定义要查找的域控制器类型的成员。","An integer value that represents the estimated total count of items in the list.":"一个整数值，表示列表中项目的估计总数。","The USN of the last update that was received.":"收到的最后一个更新的USN。","The y-coordinate of the second control point for the curve.":"曲线的第二控制点的y坐标。"," for the new ":"对于新的","The x-coordinate of the endpoint of the curve.":"曲线端点的X坐标。","The name of the site to search for the domain controller.":"搜索域控制器的站点名称。","An integer value that represents the number of entries before the target entry that the client is requesting from the server.":"一个整数值，代表客户端从服务器请求的目标条目之前的条目数。","An integer that contains the operation number of this replication operation.":"一个包含此复制操作的操作编号的整数。"," that specifies a GDI character set to use for this font.":"这指定了用于该字体的GDI字符。"," that indicates the virtual list view search response.":"这表示虚拟列表查看搜索响应。","The y-coordinate of the endpoint of the curve.":"曲线端点的y坐标。"," object that represents the domain controller that is found by this method.":"代表该方法找到的域控制器的对象。"," members that indicates the type of replication operation that this operation represents.":"表示该操作代表的复制操作类型的成员。","An integer value that represents the target entry's estimated offset within the list.":"代表目标条目在列表中的估计偏移的整数值。","A Boolean value indicating whether the new ":"布尔值表示新的"," object that contains all of the trust relationships for this domain.":"包含该领域的所有信任关系的对象。"," structures that represents the points that define the curves.":"表示定义曲线的点的结构。"," object that represents the domain to which the local machine is joined.":"代表连接本地机器的域的对象。","A string that contains the distinguished name of the partition that is associated with this replication operation.":"一个包含与此复制操作关联的分区名称的字符串。"," structures that represents the points that define the curve.":"表示定义曲线的点的结构。","A string that contains the target entry that was requested by the client.":"一个包含客户端请求的目标条目的字符串。"," is derived from a GDI vertical font.":"源自GDI垂直字体。"," object that represents the domain for the specified user credentials in effect for the security context under which the application is running.":"代表指定用户凭据的域，该域为应用程序正在运行的安全上下文有效。","An integer that contains the priority of this replication operation.":"包含此复制操作优先级的整数。","An integer value that represents the estimated percentage offset within the list of the target entry.":"整数值表示目标条目列表中的估计百分比偏移。"," this method creates, cast as an ":"此方法创建，铸造为","A value between from 0 through 1 that specifies the amount that the curve bends between points, with 0 being the smallest curve (sharpest corner) and 1 being the smoothest curve.":"从0到1之间的值指定曲线在点之间弯曲的量，其中0是最小的曲线（最锋利的角），而1是最平滑的曲线。"," object that represents the domain.":"代表域的对象。","A string that contains the DNS name of the source server for this replication operation.":"该复制操作中包含源服务器的DNS名称的字符串。","The index of the element in the ":"该元素的索引"," property values as this ":"属性值"," object that contains the date and time that this replication operation was added to the operation queue.":"包含将此复制操作添加到操作队列的日期和时间的对象。"," object that  identifies the trustee of the access rule.":"识别访问规则的受托人的对象。"," object that contains the target and credentials to use to retrieve the object. The type of the context must be a domain or directory server.":"包含用于检索对象的目标和凭证的对象。 上下文的类型必须是域或目录服务器。","A handle to a device context.":"设备上下文的手柄。","The Rights-Guid of the extended right that this access rule applies to. For more information, see the Rights-Guid article. In the Active Directory schema documentation, this information can be found in the Rights-GUID row on the reference page for each extended right. If this parameter is ":"此访问规则适用的扩展权的权利确定。 有关更多信息，请参见《权利定罪》文章。 在“ Active Directory模式文档”中，可以在每个扩展右侧的参考页面上的“权利对准行”中找到此信息。 如果此参数为"," object that represents the current replication operation.":"代表当前复制操作的对象。"," array that is used as the first point in the curve.":"数组用作曲线中的第一点。"," object that represents the domain for the specified context.":"代表指定上下文的域的对象。","A value that specifies the amount that the curve bends between control points. Values greater than 1 produce unpredictable results.":"一个指定曲线在控制点之间弯曲的数量的值。 大于1的值产生不可预测的结果。"," this method creates.":"此方法创建。",", the access rule applies to all extended rights. For a list of possible extended rights, see the Extended Rights article.":"，访问规则适用于所有扩展权利。 有关可能的扩展权利列表，请参见《扩展权利文章》。"," object that contains the date and time that this replication operation started.":"包含此复制操作开始的日期和时间的对象。","The DNS name of the domain which with the trust exists.":"具有信托的域名的DNS名称存在。","The Rights-Guid attribute of the extended right that this access rule applies to. For more information, see the Rights-Guid article. In the Active Directory schema documentation, this information can be found in the Rights-GUID row on the reference page for each extended right. If this parameter is ":"此访问规则适用的扩展权利的权利属性属性。 有关更多信息，请参见《权利定罪》文章。 在“ Active Directory模式文档”中，可以在每个扩展右侧的参考页面上的“权利对准行”中找到此信息。 如果此参数为"," object that contains the pending replication operations.":"包含未决复制操作的对象。","The number of segments used to draw the curve. A segment can be thought of as a line connecting two points.":"用于绘制曲线的段数。 可以将一个段视为连接两个点的线。","A Windows handle to a GDI font.":"Windows句柄GDI字体。"," if the authentication of the trust is selective; ":"如果信托的身份验证是选择性的；"," enumeration value that indicates the category of the error.":"指示错误类别的枚举值。"," enumeration values that specifies the property access type.":"指定属性访问类型的枚举值。"," that represents the GDI ":"代表GDI"," if the authentication is domain-wide.":"如果身份验证范围内。"," that represents the bounding rectangle that defines the ellipse.":"这代表定义椭圆的边界矩形。","The schema GUID of the property that this access rule applies to. If this is ":"此访问规则适用的属性的模式指南。 如果是","A value that identifies the ":"标识的值","The DNS name of the domain which with the trust relationship exists.":"存在信任关系的域名DNS名称。"," structure from which to create the ":"从中创建的结构","The x-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形的左上角的X坐标。"," if SID filtering is enabled; otherwise, ":"如果启用了SID过滤； 否则，"," exception error.":"异常错误。",", then the access rule applies to all property types.":"，然后访问规则适用于所有属性类型。","A handle to a device context that contains additional information about the ":"设备上下文的手柄，其中包含有关该设备的其他信息","The y-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形的左上角的Y坐标。"," enumeration values which specifies the access rule type.":"指定访问规则类型的枚举值。","The DNS name of the domain with which the trust relationship exists.":"信任关系存在的域名DNS名称。","A message that describes the ":"描述的消息","The return value is ":"返回值是","The line spacing, in pixels, of this font.":"该字体的线间距。","The width of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形的宽度。"," object that represents the trust relationship between this domain and the specified domain.":"代表该域和指定域之间信任关系的对象。","The name of the source server that is involved in the ":"涉及的源服务器的名称"," that holds the vertical resolution, in dots per inch, of the display device as well as settings for page unit and page scale.":"该显示设备的垂直分辨率（每英寸点）以及页面单元和页面规模的设置。","The height of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形的高度。","The name of the target server that is involved in the ":"涉及的目标服务器的名称"," if the specified property belongs to this collection; otherwise, ":"如果指定的属性属于此集合； 否则，"," enumeration value that specifies the new operation level for the domain.":"指定域的新操作级别的枚举值。","The vertical resolution, in dots per inch, used to calculate the height of the font.":"垂直分辨率，每英寸点，用于计算字体的高度。","An array of one or more ":"一个或多个阵列","The y-coordinate of the upper left corner of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形左上角的Y坐标。","The height, in pixels, of this ":"以像素为单位的高度","A value representing the new level.":"代表新级别的值。"," that you can use to iterate through this collection.":"您可以使用此系列来迭代。"," objects that describe the errors.":"描述错误的对象。"," that represents the starting point of the line.":"这代表了行的起点。"," members that specifies the type of event.":"指定事件类型的成员。"," object that represents the domain with which the trust exists.":"代表信任存在的域的对象。",".object.":"。目的。","A Windows handle to this ":"窗户处理这个"," that represents the endpoint of the line.":"这代表了行的终点。","Contains the DNS name of the server that is the target of the replication. This parameter will be ":"包含复制目标服务器的DNS名称。 此参数将是"," to represent the ":"代表","The DNS name of the domain with which the inbound trust exists.":"入站信托存在的域名DNS名称。","The number of properties in this collection.":"此集合中的属性数量。","The x-coordinate of the starting point of the line.":"线的起点的X坐标。"," if it is not used by the notification.":"如果通知未使用。","The name of the property to retrieve.":"要检索的属性名称。","The y-coordinate of the starting point of the line.":"线的起点的Y坐标。"," if selective authentication is enabled; otherwise, ":"如果启用了选择性身份验证； 否则，","Contains the DNS name of the server that is the source of the replication. This parameter will be ":"包含复制源的服务器的DNS名称。 此参数将是"," that provides additional information for the ":"为","The value of the specified property.":"指定属性的值。","The x-coordinate of the endpoint of the line.":"线的端点的X坐标。"," is bold; otherwise, ":"大胆； 否则，","The DNS name of the domain with which the trust exists.":"信托存在的域名DNS名称。"," object that contains additional information about any error that has occurred. This parameter will be ":"包含有关发生任何错误的其他信息的对象。 此参数将是"," object that contains the names of the properties in this collection.":"包含此集合中属性名称的对象。","A byte value that specifies the GDI character set that this ":"一个字节值，指定GDI字符集","The y-coordinate of the endpoint of the line.":"线的端点的y坐标。"," if no error has occurred.":"如果没有发生错误。"," if SID filtering must be enabled; otherwise, ":"如果必须启用SID过滤； 否则，"," uses. The default is 1.":"用途。 默认值为1。"," that contains the values of the properties in this collection.":"其中包含此集合中属性的值。"," structures that represents the points that define the line segments to add.":"代表定义要添加的线段的点的结构。","The DNS name of the domain with which a trust exists.":"信托存在的域名DNS名称。"," if the SyncReplicaFromAllServers method invoked on a ":"如果在A上调用的SyncreplicaFromallSallservers方法"," is derived from a GDI vertical font; otherwise, ":"源自GDI垂直字体； 否则，","The Rights-Guid of the property set that this access rule applies to. In the Active Directory Domain Services schema documentation, this information can be found in the Rights-GUID row on the reference page for each property set. For more information, see the Rights-Guid attribute article. \n        For a list of property sets, see the Property Sets article.":"该访问规则适用的财产设置的权利确定。 在“ Active Directory Domain Services Service文档”中，可以在每个属性集的参考页面上的“权利对准行”中找到此信息。 有关更多信息，请参见“权利属性属性文章”。 \n         有关属性集列表，请参见“属性集”文章。","A Boolean value that specifies whether the first figure in the added path is part of the last figure in this path. A value of ":"布尔值指定添加路径中的第一个数字是否是该路径中最后一个数字的一部分。 一个值",",  ":"，，，，","The Rights-Guid of the property set that this access rule applies to. In the Active Directory Domain Services schema documentation, this information can be found in the Rights-GUID row on the reference page for each property set. For more information, see the Rights-Guid attribute article.  \n  \n For a list of property sets, see the Property Sets article.":"该访问规则适用的财产设置的权利确定。 在“ Active Directory Domain Services Service文档”中，可以在每个属性集的参考页面上的“权利对准行”中找到此信息。 有关更多信息，请参见“权利属性属性文章”。 \n  \n  有关属性集列表，请参见“属性集”文章。"," value for the new trust direction for the trust relationship.":"对信任关系的新信任方向的价值。"," specifies that (if possible) the first figure in the added path is part of the last figure in this path. A value of ":"指定（如果可能的话）添加路径中的第一个数字是该路径中最后一个图的一部分。 一个值"," object should resume; ":"对象应恢复；"," if the font is a member of ":"如果字体是","The property value to find.":"要查找的属性值。","The new password for the trust.":"信托的新密码。"," to indicate this font has the italic style applied; otherwise, ":"指示该字体具有斜体样式； 否则，"," specifies that the first figure in the added path is separate from the last figure in this path.":"指定添加路径中的第一个图与此路径中的最后一个图分开。"," if the SyncReplicaFromAllServers method should terminate.":"如果SyncreplicaFromallServers方法应终止。","A string representation of the face name of this ":"弦的脸部名称的字符串表示","The zero-based index of the specified property value. If the object is not found, the return value is -1.":"指定属性值的基于零的索引。 如果找不到对象，则返回值为-1。"," value that specifies the new trust direction for the trust relationship.":"指定信托关系的新信任方向的价值。"," that represents the bounding rectangle that defines the ellipse from which the pie is drawn.":"这表示定义绘制派的椭圆的边界矩形。"," value that contains the status of the ":"包含状态的值","The string representing the name of the font originally specified.":"代表最初指定字体名称的字符串。","The zero-based index at which to insert the property value.":"插入属性值的基于零的索引。"," value that specifies the direction, relative to this domain, of the trust.":"指定信任的方向，相对于该领域的方向。","The starting angle for the pie section, measured in degrees clockwise from the x-axis.":"PIE段的起始角，以X轴顺时针方向测量。"," that is located at the specified index.":"位于指定索引。"," object that contains the child domains.":"包含子域的对象。","The em-size of this ":"emsize","The property value to insert.":"要插入的属性值。"," and the end of the pie section, measured in degrees clockwise from ":"和馅饼部分的末端，以顺时针方向测量","A string that contains the name of the source ":"包含源名称的字符串"," object that contains the domain controllers in this domain.":"该域中包含域控制器的对象。","The em-size, in points, of this ":"em大小，从此角度来看","The zero-based index at which value can be found.":"可以找到值的零基索引。"," objects for this trust relationship.":"这种信任关系的对象。","The x-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse from which the pie is drawn.":"边界矩形左上角的X坐标，该矩形定义了绘制派的椭圆形。"," values that indicates the mode that this domain is operating in.":"表示该域正在运行的模式的值。","A string that contains the name of the target ":"包含目标名称的字符串"," has a horizontal line through it; otherwise, ":"通过它有一条水平线； 否则，","The property value to remove.":"要删除的属性值。","The y-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse from which the pie is drawn.":"边界矩形左上角的Y坐标定义了绘制派的椭圆形。","The domain mode level.":"域模式级别。","The zero-based index of the property value.":"属性值的基于零的索引。"," enumeration that contains style information for this ":"枚举包含样式信息"," value for this trust relationship relative to the ":"相对于这种信任关系的价值","The width of the bounding rectangle that defines the ellipse from which the pie is drawn.":"定义从中绘制派的椭圆的边界矩形的宽度。"," object that represents the forest that this domain is a member of.":"代表该领域成员的森林的对象。","The property value at the specified index.":"指定索引处的属性值。","The name of the system font, if ":"系统字体的名称，如果"," objects that created the trust.":"创建信任的对象。","The height of the bounding rectangle that defines the ellipse from which the pie is drawn.":"定义从中绘制派的椭圆的边界矩形的高度。"," object that represents the domain controller that holds the infrastructure owner role.":"代表具有基础架构所有者角色的域控制器的对象。","; otherwise, an empty string (\"\").":"; 否则，一个空字符串（“”）。","A string that contains the name of the property with the values that are included in this ":"一个包含属性名称的字符串，其中包含在此中的值"," structures that defines the polygon to add.":"定义多边形的结构。"," value that represents the type of the trust relationship.":"代表信任关系类型的价值。"," is underlined; otherwise, ":"下划线； 否则，"," object that represents the parent domain of this domain. ":"代表该域的父域的对象。","If the collection is empty, the property value is a null reference (":"如果集合为空，则属性值为null参考（"," that represents the rectangle to add.":"这代表要添加的矩形。"," if the specified object is in this collection; otherwise, ":"如果指定的对象在此集合中； 否则，"," if this domain has no parent domain.":"如果此域没有父域。"," in Visual Basic). If the collection contains one value, the property value is that value. If the collection contains multiple values, the property value equals a copy of an array of those values.  \n  \n If setting this property, the value or values are added to the ":"在Visual Basic中）。 如果该集合包含一个值，则属性值是该值。 如果该集合包含多个值，则属性值等于这些值数组的副本。 \n  \n  如果设置此属性，则将值或值添加到"," that represents the unit of measure for this ":"这代表了这一点的度量单位"," structures that represents the rectangles to add.":"代表要添加的矩形的结构。"," object that represents the domain controller that holds the PDC emulator role for this domain.":"代表具有该域PDC仿真器角色的域控制器的对象。"," object that specifies the culture used to represent the font.":"指定用来表示字体的文化的对象。",". Setting this property to a null reference (":"。 将此属性设置为null参考（"," object which identifies the trustee of the access rule.":"识别访问规则的受托人的对象。"," that represents the name of the font with which the test is drawn.":"这代表了绘制测试的字体的名称。"," object that represents the domain controller that holds the relative identifier (RID) master role for this domain.":"表示该域的相对标识符（RID）主角色的域控制器的对象。"," enumeration values that specifies the rights of the access rule.":"指定访问规则的权利的枚举价值。"," if the managed resources are released; otherwise, ":"如果释放托管资源； 否则，"," object that specifies the culture used to represent the object.":"指定用于表示对象的文化的对象。",") clears the collection.":"）清除集合。"," enumeration that represents style information about the text (bold, italic, and so on). This must be cast as an integer (see the example code later in this section).":"代表有关文本的样式信息的枚举（粗体，斜体等）。 必须将其作为整数施放（在本节稍后，请参见示例代码）。"," that receives this collection's properties.":"收到此集合的属性。"," enumeration values that specifies the access rule type.":"指定访问规则类型的枚举值。","The data type to convert the object to.":"将对象转换为的数据类型。"," object that represents the global catalog server.":"代表全局目录服务器的对象。","The height of the em square box that bounds the character.":"界限角色的EM方形框的高度。"," object that identifies the trustee of the access rule.":"识别访问规则的受托人的对象。"," useful for creating non-changeable objects that have changeable properties.":"对于创建具有多变属性的不变对象。"," object that contains the target and credentials to use for the search. The target of this ":"包含用于搜索的目标和凭据的对象。 这个目标","The zero-based array index at which to begin copying the properties.":"开始复制属性的从零开始的数组索引。"," that represents the point where the text starts.":"这代表了文本开始的点。"," object should be called when a change is made to one or more properties of this object; otherwise, ":"当对该对象的一个或多个属性进行更改时，应调用对象； 否则，"," enumeration values that specifies the inheritance type of the access rule.":"指定访问规则的继承类型的枚举值。"," object is the name of the domain that will be searched for domain controllers.":"对象是将搜索域控制器的域名。"," that has the specified name.":"具有指定的名称。",".  \n  \n An easy implementation of this method can call the ":"。 \n  \n  该方法的简单实现可以调用"," that specifies text formatting information, such as line spacing and alignment.":"这指定文本格式化信息，例如线间距和对齐方式。","The schema GUID of the child object type that can inherit this access rule.":"可以继承此访问规则的子对象类型的架构GUID。"," object that contains the domain controllers found by the search.":"包含搜索发现的域控制器的对象。"," method for the correct data type.":"正确的数据类型的方法。"," that contains the names of the properties in this collection.":" 它包含此集合中属性的名称。"," that represents the rectangle that bounds the text.":"这代表了界限文本的矩形。","The schema GUID of the object to which the access rule applies.":"访问规则应用对象的模式指南。","The name of the site to search for domain controllers.":"搜索域控制器的站点名称。"," method should be called to find the properties of this object; otherwise, ":"应调用方法以找到此对象的属性； 否则，"," by which to transform this ":"通过它来改变这个"," enumeration values that specify the Active Directory Domain Services access rights that are included in this rule.":"指定此规则中包含的Active Directory域服务访问权限的枚举值。"," that receives this collection's property values.":"收到该集合的属性值。"," object that contains the domain controllers that were found by the search.":"包含搜索发现的域控制器的对象。"," that can be used to extract additional information about the environment this converter is being invoked from. This may be ":"可以用来提取有关该转换器的其他信息的其他信息。 这可能是"," before flattening.":"在变平之前。"," enumeration values that specifies the inheritance type for this access rule.":"指定此访问规则的继承类型的枚举值。","The zero-based array index at which to begin copying the property values.":"基于零的数组索引开始复制属性值。",", so you should always check. Also, properties on the context object may return ":"，所以您应该始终检查。 另外，上下文对象上的属性可能会返回","Specifies the maximum permitted error between the curve and its flattened approximation. A value of 0.25 is the default. Reducing the flatness value will increase the number of line segments in the approximation.":"指定曲线及其扁平近似之间的最大允许误差。 值为0.25是默认值。 降低平坦度值将增加近似值中的线段数量。"," object that represents the domain controller that was found by the search.":"代表搜索发现的域控制器的对象。","Specifies an ":"指定","The zero-based index of the property value to retrieve.":"要检索的属性值的基于零的索引。","The type you wish to convert from.":"您希望转换的类型。"," that represents a rectangle that bounds this ":"代表一个构成这个范围的矩形","The name of the site to search for a domain controller.":"搜索域控制器的站点名称。"," object, such as an NTAccount object, that resolves to a security identifier (SID).":"对象，例如NTACCOUNT对象，可以解决安全标识符（SID）。"," to use to perform the conversion":"用于执行转换","The property value that is located at the specified index.":"位于指定索引的属性值。"," that specifies a transformation to be applied to this path before the bounding rectangle is calculated. This path is not permanently transformed; the transformation is used only during the process of calculating the bounding rectangle.":"这指定了在计算边界矩形之前要应用于此路径的转换。 这条路没有永久转变。 仅在计算边界矩形的过程中使用转换。","A collection containing a standard set of valid values, or ":"包含一组标准有效值集的集合，或"," object that contains the replication neighbors for this domain controller.":"包含此域控制器的复制邻居的对象。"," object, which is used to define all the rights that can be set on a directory object, as defined in the ":"对象，用于定义可以在目录对象上设置的所有权利，如"," with which to draw the ":"用它来绘制","The schema name to add to this collection.":"架构名称要添加到此集合中。"," object for the domain controller.":"域控制器的对象。"," object, which contains the combination of one or more audit flags to add to this ":"对象，其中包含一个或多个审核标志的组合来添加到此"," if the collection returned from ":"如果收藏从"," that represents the last point in this ":"这代表了这一点的最后一点"," that contains the schema names to add.":"其中包含要添加的模式名称。"," is an exclusive list of possible values; otherwise, ":"是可能值的独家列表； 否则，"," object that contains the target and credentials to use to retrieve the object. The target of this context must be a domain controller.":"包含用于检索对象的目标和凭证的对象。 此上下文的目标必须是域控制器。",". The allowable flags are ":"。 允许的标志是"," that specifies the location to test.":"指定要测试的位置。","The schema name to search for.":"搜索的模式名称。","The name of the new ":"新名称",". This parameter may not be zero.":"。 此参数可能不为零。"," object that represents the domain controller that was found.":"代表发现的域控制器的对象。"," that receives this collection's schema names.":"收到此系列的模式名称。"," if the specified point is contained within the outline of this ":"如果指定点包含在此大纲中"," object, which contains a combination of one or more audit flags to add to this ":"对象，其中包含一个或多个审核标志的组合来添加到此"," that represents the name of the new ":"代表新的名称"," object that contains the replication connection failures that were recorded by this domain controller.":"包含该域控制器记录的复制连接故障的对象。"," when drawn with the specified ":"用指定的",". This parameter can not be zero.":"。 此参数不能为零。"," that contains this ":"其中包含这个","The zero-based array index at which to begin copying the schema names.":"基于零的数组索引开始复制模式名称。","The distinguished name of the partition for which to retrieve the replication neighbors.":"检索复制邻居的划分的杰出名称。"," for which to test visibility.":"为其测试可见性。"," that contains style information for the font.":"其中包含字体的样式信息。","An enumerator that you can used to iterate through this collection.":"您可以用来通过此系列迭代的枚举者。"," object that contains inheritance information. The allowable flags for this parameter are found in the ":"包含继承信息的对象。 此参数的允许标志在"," if this domain controller is a global catalog server or ":"如果此域控制器是全局目录服务器或"," as drawn with the specified ":"用指定的"," data type object, which is used to define all the rights that can be set on a directory object, as defined in the ":"数据类型对象，用于定义可以在目录对象上设置的所有权利，如","The cell ascent for this ":"细胞上升","The zero-based index of the specified schema name, or -1 if the schema name was not found in the collection.":"指定架构名称的零基索引，或-1如果在集合中找到了架构名称。"," if the specified point is contained within (under) the outline of this ":"如果指定点包含在（下）中的大纲中"," members that specifies which role the domain controller should take ownership of.":"指定域控制器应占有的角色的成员。"," object that identifies the type of child object that can inherit this access rule.":"标识可以继承此访问规则的子对象类型的对象。","The zero-based index into the collection at which to insert the schema name.":"基于零的索引插入插入模式名称的集合中。"," that uses the specified ":"使用指定的"," that represents the point to test.":"这代表了测试的重点。"," object that contains the GUID of the object to which the access permissions apply.":"包含访问权限适用对象的GUID的对象。","The distinguished name of the partition for the domain controller to synchronize.":"域控制器的分区的杰出名称要同步。","The schema name to insert into this collection.":"模式名称插入此集合中。"," if the specified point is contained within this ":"如果指定点包含在此中","The cell descent metric for this ":"细胞下降指标"," object which contains the GUID of the object to which the access permissions apply.":"包含访问权限适用对象的GUID的对象。","The schema name to remove.":"架构名称要删除。"," for which to get the em height.":"为此获得EM高度。","The distinguished name of the partition with which to synchronize the domain controller.":"与域控制器同步的分区的杰出名称。"," if the specified point is contained within this; otherwise, ":"如果指定点包含在其中； 否则，","The zero-based index of the schema name to remove.":"基于零的模式名称的零索引要删除。","The height of the em square.":"EM广场的高度。"," enumeration values that specifies the rights for the audit rule.":"指定审计规则权利的枚举价值。","The name of the server with which to synchronize the partition.":"服务器的名称与分区同步。"," that represents the transformation to apply.":"这代表了要应用的转换。","The position into which the new item was inserted.":"插入新项目的位置。"," enumeration values that specifies the inheritance type of the audit rule.":"指定审计规则的继承类型的枚举值。"," object from which to return ":"从中返回的对象"," members that specifies which role will be transferred to this domain controller.":"指定将转移到该域控制器的成员。"," object such as an NTAccount object that resolves to a security identifier (SID).":"诸如解决安全标识符（SID）的NTACCOUNT对象之类的对象。"," structures that define a parallelogram to which the rectangle defined by ":"定义平行四边形的结构，矩形由此定义","The value to locate in the list.":"要位于列表中的值。"," object that contains the current date and time from this domain controller.":"包含来自此域控制器的当前日期和时间的对象。"," objects available for the specified ":"可用于指定的对象"," bitmask that shows the access privileges to use.":" 显示要使用的访问权限的位掩码。"," if the value is found in the list, otherwise ":"如果在列表中找到值，则"," is transformed. The array can contain either three or four elements. If the array contains three elements, the lower-right corner of the parallelogram is implied by the first three points.":"转变。 阵列可以包含三个或四个元素。 如果阵列包含三个元素，则平行四边形的右下角暗示着前三个点。"," object that indicates whether ACEs are inherited. ":"表示ACE是否继承的对象。"," object that represents the domain that this domain controller is a member of.":"代表该域控制器为成员的域的对象。","The distance between two consecutive lines of text.":"两条连续的文本线之间的距离。","The item to locate in the list.":"要在列表中找到的项目。"," that represents the rectangle that is transformed to the parallelogram defined by ":"代表转换为平行四边形定义的矩形","The zero-based index at which value should be inserted.":"应插入值的基于零的索引。"," if ACEs are inherited; otherwise, ":"如果痤疮是继承的； 否则，"," object that represents the forest that this domain controller is a member of.":"代表该域控制器的森林的对象。","The language in which the name is returned.":"返回名称的语言。"," that specifies a geometric transform to apply to the path.":"这指定了几何变换以应用于路径。"," object that contains inheritance flags on a directory object.":"在目录对象上包含继承标志的对象。","The item to insert into the list.":"要插入列表的项目。","The highest update sequence number (USN) that has been committed to this domain controller.":"最高的更新序列编号（USN）已投入此域控制器。"," that represents the name, in the specified language, of this ":"用指定的语言代表名称"," structures that defines a parallelogram to which the rectangle defined by ":"定义平行四边形的结构，矩形由此定义"," object that contains inheritance propagation flags on a directory object.":"在目录对象上包含继承传播标志的对象。","The string that represents this ":"代表这个的字符串"," enumeration that specifies whether this warp operation uses perspective or bilinear mode.":"指定该翘曲操作是使用透视图还是双线性模式的枚举。","The number of objects in this collection.":"此集合中的对象数。"," object that contains the ACE type.":"包含ACE类型的对象。"," object that contains the inbound replication connections for this domain controller.":"包含此域控制器的入站复制连接的对象。"," objects associated with the current graphics context.":"与当前图形上下文关联的对象。","A value from 0 through 1 that specifies how flat the resulting path is. For more information, see the ":"从0到1的值指定结果路径的平坦程度。 有关更多信息，请参阅"," that corresponds to the ":"对应于","The object that exists at the specified index.":"在指定索引上存在的对象。","The Internet protocol (IP) address of this domain controller in string form.":"该域控制器的Internet协议（IP）地址以字符串形式。"," that represents a generic monospace font.":"这代表了一种通用的单层字体。"," object that indicates if ACEs are inherited. ":"指示ACES是否继承的对象。"," that specifies the width between the original outline of the path and the new outline this method creates.":"这指定了该方法创建的路径原始轮廓与新大纲之间的宽度。"," of properties set on this object.":"在此对象上设置的属性。","The version of the operating system that is in use on this domain controller.":"此域控制器上正在使用的操作系统版本。"," object that contains inheritance flags for a directory object.":"包含目录对象的继承标志的对象。"," that specifies a transform to apply to the path before widening.":"这说明了在拓宽之前将转换应用于路径的转换。"," object that you can use to iterate through this collection.":"您可以使用此集合来迭代的对象。"," object that represents a generic sans serif font.":" 表示通用无衬线字体的对象。"," object that contains the outbound replication connections for this domain controller.":"包含此域控制器的出站复制连接的对象。","A value that specifies the flatness for curves.":"指定曲线平坦度的值。","The ADS_SEARCH_HANDLE value that this collection uses.":"该集合使用的ADS_SERACH_HANDLE值。"," object that contains inheritance propagation flags for a directory object.":" 包含目录对象的继承传播标志的对象。"," that represents a generic serif font.":"这代表了通用的衬线字体。"," members that indicate the roles that this domain controller serves.":"表示该域控制器服务的角色的成员。"," that encapsulates arrays for both the points and types for this ":"这封装了点和类型的数组"," object that is located at the specified index.":"位于指定索引的对象。"," object that contains the GUID of the directory object.":"包含目录对象的GUID的对象。","The name of the site that this domain controller belongs to.":"该域控制器属于的站点的名称。"," that represents the name of this ":"代表这个名称"," objects that represent the path.":"表示路径的对象。"," object that contains the GUID of the inherited directory object.":"包含继承目录对象的GUID的对象。"," that contains the properties that were specified in the ":" 它包含在 ","Array of bytes that contains the comment.":"包含评论的一系列字节。"," delegate that will be used for synchronization notifications.":"将用于同步通知的委托。","An array of bytes that specifies the types of the corresponding points in the path.":"一个字节数组指定路径中相应点的类型。"," object to which this operation applies.":"该操作适用的对象。"," property collection before the search was executed.":"执行搜索之前的属性收集。","This method returns a ":"此方法返回"," to search for in this collection.":"在此集合中搜索。","An integer that specifies the number of elements in the ":"一个整数，指定该元素数量"," that represents the state of this ":"代表了这种状态","The name of the property to sort by. The ":"属性的名称要排序。 这","The DNS name of the forest that the trust is created with.":"信托所创建的森林的DNS名称。"," object such as an NTAccount object, that resolves to a security identifier (SID).":"诸如NTACCOUNT对象之类的对象，可以解决安全标识符（SID）。"," object for which this helper class is to be initialized.":"该辅助类要初始化的对象。"," values. The default is Ascending.":"值。 默认值正在上升。"," at the time of the method call.":" 在方法调用时。"," members that determines the direction of the trust, relative to this forest.":"相对于这个森林，决定信托的方向的成员。"," object that contains the audit flags for this ":"包含此审核标志的对象","Upon return, contains an array of ":"返回后，包含一个数组","The name of the property to sort on. The default is a null reference (":"属性的名称要排序。 默认值是null引用（"," structures that represents the points in the path.":"表示路径中点的结构。"," structure that, together with the ":"结构，以及"," object that represents the forest that the trust is being created with.":"代表信托所建立的森林的对象。"," object that contains the Guido of the directory object.":"包含目录对象的Guido的对象。","Upon return, contains an array of bytes that represents the types of points in the path.":"返回后，包含一个代表路径中点类型的字节数组。"," structure that represent the size of the new ":"代表新大小的结构"," parameter, specifies a scale transformation for the container.":"参数，指定容器的比例转换。"," object that contains the Guido of the inherited directory object.":" 包含继承目录对象的Guido的对象。","Specifies the starting index of the arrays.":"指定数组的起始索引。","The DNS name of the forest that the trust exists with.":"与信任一起存在的林的DNS名称。","The width, in pixels, of the new ":"新的像素的宽度","Member of the ":"成员"," object that represents the forest that the trust exists with.":"代表信托存在的森林的对象。","Specifies the ending index of the arrays.":"指定数组的结尾索引。","The type of access control modification to perform.":"要执行的访问控制修改的类型。","The height, in pixels, of the new ":"新的像素的高度"," enumeration that specifies the unit of measure for the container.":"指定容器的度量单位的枚举。"," that contains the collection of global catalogs that were found.":"其中包含发现的全球目录的集合。","The number of points copied.":"复制点数。"," parameter, specifies a scale transformation for the new graphics container.":"参数为新图形容器指定比例转换。"," if actually modified; otherwise, ":"如果实际修改； 否则，"," object that specifies the resolution for the new ":"指定新分辨率的对象","The name of the site to search.":"搜索网站的名称。"," if the current subpath contains a curve; otherwise, ":"如果当前的子路径包含曲线； 否则，"," if successfully modified; otherwise, ":"如果成功修改； 否则，"," structure that represents the background color of the drawing surface.":"代表图表的背景颜色的结构。","The pixel format for the new ":"新的像素格式"," object to which the points will be copied.":"将要复制点的对象。"," object that contains the collection of global catalogs that were found.":"包含发现的全球目录的对象。","The modification to apply.":"适用的修改。","The point at the upper-left corner of the source rectangle.":"源矩形左上角的点。","The number of points between this marker and the next.":"此标记与下一个标记之间的点数。"," value specifying the location criteria.":"指定位置标准的值。",". This must specify a value that begins with ":"。 这必须指定一个以开始的值"," of the access right.":"访问权利。","The point at the upper-left corner of the destination rectangle.":"目的地矩形左上角的点。"," object for the specified location criteria.":"指定位置标准的对象。","[out] The integer reference supplied to this parameter receives the index of the point that starts a subpath.":"[out]提供给本参数的整数引用接收到启动子路的点的索引。","Integer that specifies the byte offset between the beginning of one scan line and the next. This is usually (but not necessarily) the number of bytes in the pixel format (for example, 2 for 16 bits per pixel) multiplied by the width of the bitmap. The value passed to this parameter must be a multiple of four.":"整数指定一个扫描线和下一条扫描线的开头之间的字节偏移。 这通常是（但不一定）像素格式中的字节数（例如，每个像素为1 16位）乘以位图的宽度。 传递给该参数的值必须是四个的倍数。"," object for the specified site.":"指定网站的对象。","The size of the area to be transferred.":"要转移的区域的大小。"," of the access rule.":"访问规则。","Pointer to an array of bytes that contains the pixel data.":"指向包含像素数据的字节数组。","[out] The integer reference supplied to this parameter receives the index of the point that ends the subpath to which ":"[out]提供给本参数的整数参考接收到结束子路的点的索引"," value that specifies the location criteria.":"指定位置标准的值。","The data stream used to load the image.":"用于加载图像的数据流。"," of the audit rule.":"审计规则。","The x-coordinate of the point at the upper-left corner of the source rectangle.":"源矩形左上角点的x坐标。"," object for the specified site and location criteria.":"指定站点和位置标准的对象。","[out] Receives the point type shared by all points in the group. Possible types can be retrieved from the ":"[out]接收组中所有点共享的点类型。 可能的类型可以从 ","The schema GUID of the type of child objects that can or cannot be created. If this is ":"无法创建或无法创建的子对象类型的模式指南。 如果是","The y-coordinate of the point at the upper-left corner of the source rectangle.":"源矩形左上角的点的Y坐标。"," collection that contains ":"包含的集合"," to use color correction for this ":"为此使用颜色校正","[out] Receives the starting index of the group of points.":"[out]收到一组点的起始索引。",", then the access rule applies to all child types.":"，然后访问规则适用于所有儿童类型。","The bitmap file name and path.":"位图文件名和路径。"," objects that represents trust relationships of the current ":"代表当前信任关系的对象","The x-coordinate of the point at the upper-left corner of the destination rectangle.":"目标矩形左上角的点的X坐标。","The name of the bitmap file.":"位图文件的名称。","[out] Receives the ending index of the group of points.":"[out]收到点数组的结尾索引。","The schema GUID of the type of child objects that can or cannot be deleted. If this is ":"无法删除或无法删除的子对象类型的模式指南。 如果是","The y-coordinate of the point at the upper-left corner of the destination rectangle.":"目的地矩形左上角的点的Y坐标。"," object that represents the current forest.":"代表当前森林的物体。","This method returns the number of data points in the group. If there are no more groups in the path, this method returns 0.":"此方法返回组中的数据点数。 如果路径中没有更多的组，则此方法返回0。","The class used to extract the resource.":"该类用于提取资源。","The name of the new entry.":"新条目的名称。","The y-coordinate of the point at the upper-left corner of the source rectangle":"源矩形左上角的点的y坐标"," object that contains the target and credentials to use to retrieve the object.":"包含用于检索对象的目标和凭证的对象。"," that is to have its data points set to match the data points of the retrieved figure (subpath) for this iterator.":"那就是将其数据点设置为匹配此迭代器的检索图（子路径）的数据点。","Defines the portion of this ":"定义其中的一部分","The name of the schema that is used for the new entry.":"用于新条目的模式的名称。"," object that represents the forest that was retrieved by this method.":"代表该方法检索的森林的对象。"," that determines the color, width, and style of the arc.":"这决定了弧的颜色，宽度和样式。"," to copy. Coordinates are relative to this ":"复印。 坐标是相对于此的"," structure that defines the boundaries of the ellipse.":"定义椭圆边界的结构。"," object that represents the new entry.":"代表新条目的对象。","The DNS name of the ":"DNS名称","[out] Indicates whether the current subpath is closed. It is ":"[out]指示当前的子路径是否关闭。 这是"," enumeration for the destination ":"目的地的枚举"," if the if the figure is closed, otherwise it is ":"如果图形关闭，否则是"," with which the inbound trust relationship exists.":"入站信任关系的存在。","Angle in degrees measured clockwise from the x-axis to the starting point of the arc.":"从X轴到弧的起点的顺时针测量的角度。","Contains the name of the child object for which to search.":"包含要搜索的子对象的名称。"," object with which the trust relationship exists.":"信任关系存在的对象。","The number of data points in the retrieved figure (subpath). If there are no more figures to retrieve, zero is returned.":"检索图中的数据点数（子路径）。 如果没有更多的数据可以检索，则返回零。","A handle to an icon.":"图标的手柄。"," that represents the child object that was found.":"这代表了发现的子对象。","Angle in degrees measured clockwise from the ":"从顺时针测量的角度从"," object for which the trust relationship information is to be obtained.":"要获得信任关系信息的对象。","[out] Receives the starting index of the next subpath.":"[out]接收下一个子路的起始索引。"," parameter to ending point of the arc.":"参数到弧的终点。","A handle to an instance of the executable file that contains the resource.":"包含资源的可执行文件实例的句柄。","The name of the child directory object for which to search.":"为搜索的子目录对象的名称。"," object that represents the trust relationship between this forest and the specified forest.":"代表这座森林与指定森林之间信任关系的对象。","The x-coordinate of the upper-left corner of the rectangle that defines the ellipse.":"定义椭圆的矩形左上角的X坐标。","[out] Receives the ending index of the next subpath.":"[out]接收下一个子路的结尾索引。","The class name of the child directory object for which to search.":"为搜索的子目录对象的类名称。","A string that contains the name of the resource bitmap.":"包含资源位图名称的字符串。","The y-coordinate of the upper-left corner of the rectangle that defines the ellipse.":"定义椭圆的矩形左上角的Y坐标。"," enumeration value that specifies the new operation level for the forest.":"指定森林的新操作水平的枚举价值。","[out] Indicates whether the subpath is closed.":"[out]指示子路是否关闭。"," object that represents the child object that was found.":"代表发现的子对象的对象。","Raise to this level.":"提高到这一水平。","A handle to the GDI bitmap object that this method creates.":"该方法创建的GDI位图对象的句柄。","The number of subpaths in the ":"subpeth的数量","Width of the rectangle that defines the ellipse.":"定义椭圆的矩形宽度。"," object to delete.":"对象要删除。","Height of the rectangle that defines the ellipse.":"定义椭圆的矩形高度。","The number of points in the path.":"路径中的点数。"," structure that specifies the background color. This parameter is ignored if the bitmap is totally opaque.":"指定背景颜色的结构。 如果位图完全不透明，则将忽略此参数。"," object that represents the forest object with which the trust exists.":" 表示存在信任的林对象的对象。"," that specifies which child objects are contained in the ":"这指定了哪些子对象包含在","A Windows handle to an icon with the same image as the ":"窗户处理的图标与具有相同图像的图标"," object with which the inbound trust relationship exists.":"存在入站信任关系的对象。","The number of subpaths in the path.":"路径中的子路数。"," structure that determines the color, width, and style of the curve.":"确定曲线的颜色，宽度和样式的结构。","The x-coordinate of the pixel to retrieve.":"像素的X坐标要检索。","The name of the native Active Directory Domain Services object to bind to.":"本机活动目录域服务对象要绑定到的名称。","The path at which to bind the ":"绑定的路径"," values that represents the pattern drawn by this ":"表示由此绘制的模式的值"," structure that represents the starting point of the curve.":"代表曲线起点的结构。"," if selective authentication is to be enabled; otherwise, ":"如果要启用选择性身份验证； 否则，"," to the directory. The ":"到目录。 这","The y-coordinate of the pixel to retrieve.":"像素的y坐标要检索。"," structure that represents the color of lines drawn by this ":"表示由此绘制的线的颜色的结构"," if SID filtering is to be enabled; otherwise, ":"如果要启用SID过滤； 否则，"," structure that represents the first control point for the curve.":"代表曲线的第一个控制点的结构。"," structure that represents the color of the specified pixel.":"表示指定像素的颜色的结构。"}