{"The key frame to locate in the collection.":"在集合中定位的关键框架。"," to disable tap feedback.":"禁用点击反馈。"," if the back buffer cannot be read.":"如果无法读取后缓冲区。","Has no effect.":"没有效果。","Object being evaluated for conversion.":"对象进行转换。","The set of key states for the specified key.":"指定密钥的密钥状态集。","The type of Direct3D surface. Must be a valid ":"直接3D表面的类型。 必须是有效的"," to enable touch input feedback; ":"启用触摸输入反馈；"," object based on ":"基于对象","The source of input for this device.":"该设备的输入来源。"," if the collection contains ":" 如果集合包含 ","The Direct3D surface to assign as the back buffer.":"Direct3D表面分配为后缓冲区。"," to disable touch input feedback.":"禁用触摸输入反馈。","Identifies the array to which content is copied.":"标识复制内容的数组。","The only supported destination types are ":"唯一支持的目的地类型是","The set of modifier keys.":"一组修饰符键。"," to which the stylus is bound.":"手写笔是绑定的。"," to fall back on software rendering; otherwise, ":" 回退软件渲染；否则, "," that represents the animation's ending value.":"这代表动画的结尾值。"," that represents the stylus currently in use.":"这代表了当前正在使用的手写笔。","The logical keyboard device associated with this event.":"与此事件关联的逻辑键盘设备。","Index position in the array to which the contents of the collection are copied.":"复制集合内容的数个数组中的索引位置。","The duration to wait for the lock to be acquired.":"等待锁定的持续时间。","A frozen instance of ":"冷冻实例"," that is directly beneath the stylus.":"直接在手写笔下方。","The total amount by which the animation changes its starting value.     The default value is ":"动画更改其起始值的总量。 默认值是","The logical keyboard device associated with the event.":"与事件关联的逻辑键盘设备。"," for the key frame. The ":"对于关键框架。 这"," if the lock was acquired; otherwise, ":"如果获得锁； 否则，","The element that previously had focus.":"以前有重点的元素。"," if this instance can be made read-only, or ":"如果可以使此实例仅阅读或"," property that represents the stylus button.":"代表手写笔按钮的属性。","The height of the ":"高度"," represents a Bezier curve which defines animation progress of the key frame.":"代表一个更易的曲线，该曲线定义了关键框架的动画进度。","The name of the stylus button.":"手写笔按钮的名称。","The element that now has focus.":"现在有重点的元素。"," if this instance is now read-only, or ":"如果此实例现在仅阅读，或者",", in measure units. A measure unit is 1/96th inch.":"，以措施单位为单位。 量度单元为1/96英寸。","The two control points that specify the cubic Bezier curve which defines the progress of the key frame.":"指定定义关键帧进度的Cubic Bezier曲线的两个控制点。","The element with focus.":"焦点的元素。"," that represents the stylus of the current ":"代表电流的手写笔"," object to clone and freeze.":"反对克隆并冻结。"," if a front buffer exists; otherwise, ":"如果存在前缓冲区； 否则，","A newly created ":"一个新创建的"," that specifies the desired ":"指定所需的","The previously focused element.":"先前聚焦的元件。"," that can iterate through the collection.":"可以通过收藏来迭代。",", in pixels.":"，以像素为单位。"," represents a Bezier curve that defines animation progress of the key frame.":"表示定义关键框架动画进度的Bezzier曲线。"," of the specified GUID.":"指定的GUID。"," to indicate that interoperation focus was acquired; otherwise, ":"表明获得了互操作重点； 否则，"," within the entire collection, if found; otherwise, ":"在整个系列中，如果发现； 否则，","The two control points that specify the cubic Bezier curve that defines the progress of the key frame.":"指定定义关键帧进度的Cubic Bezier曲线的两个控制点。","The width of the ":"宽度","The index position at which the ":"索引位置"," to associate with this event.":"与此事件相关联。","The time at which this ":"这个时间"," if interoperation focus was acquired; otherwise, ":" 如果获得了互操作焦点；否则, ","The time when the event occurs.":"事件发生的时间。","The Win32 class styles for the window.":"窗口的Win32类样式。","The input source.":"输入源。"," object to insert in the collection.":"对象插入集合中。"," should begin. See the ":"应该开始。 看到","The Win32 styles for the window.":"窗户的Win32样式。"," that raises the event.":"这增加了活动。","The key referenced by the event.":"事件引用的密钥。","Identifies the ":"确定","The length of time for which this timeline plays, not counting repetitions. See the ":"本时间轴弹奏的时间长度，而不是计算重复。 看到","The extended Win32 styles for the window.":"窗户的扩展Win32样式。","The key that is part of dead key composition to create a single combined character.":"是创建单个组合字符的死密钥组成部分的一部分。"," that raises this event.":" 这引发了这一事件。","Index position of the ":"索引位置"," referenced by the event.":"事件引用。","The position of the window's left edge.":"窗户左边缘的位置。","The repeating behavior of this timeline, either as an iteration ":"该时间轴的重复行为，要么作为迭代","The position of the window's upper edge.":"窗户上边缘的位置。","The element to which the stylus is bound.":"手写笔绑定的元素。"," or a repeat ":"或重复","The position into which the new element was inserted, or -1 to indicate that the item was not inserted into the collection,":"插入新元素的位置或-1表示未插入该项目的位置，"," if the key is down; otherwise, ":"如果钥匙下降； 否则，","The width of the window.":"窗户的宽度。",". See the ":"。 看到"," if the input element is captured successfully; otherwise, ":"如果成功捕获输入元素； 否则，","Remarks ":"评论"," if the key is repeated; otherwise, ":"如果重复键； 否则，","The height of the window.":"窗户的高度。","The number of key frames contained in the ":"在","A new, controllable ":"一个新的，可控制的",".  There is no default value.":"。 没有默认值。"," to which the (":"到此（","The name of the window.":"窗口的名称。"," constructed from this ":"由此构建"," if the collection is frozen; otherwise, ":"如果收藏被冻结； 否则，"," if the key is toggled; otherwise, ":"如果钥匙被切换； 否则，",") coordinates are mapped.":"）坐标映射。",". If this ":"。 如果这","The number of bounces. The value must be greater than or equal to zero. Negative values resolve to zero. The default is 3.":"弹跳数。 该值必须大于或等于零。 负值解析为零。 默认值为3。","The handle of the window's parent window.":"窗口的父窗口的句柄。"," if the key is up; otherwise, ":"如果钥匙启动； 否则，"," that represents the position of the stylus, in relation to ":"这代表了手写笔的位置"," that contains child timelines, a tree of ":"其中包含儿童时间表，一棵树","The value that specifies how bouncy the bounce animation is. This value must be positive. The default value is ":"指定弹跳动画的弹力的值。 该值必须是积极的。 默认值是",") coordinates in the ":"）在"," to have the layout manager include the non-client area for sizing; otherwise, ":"让布局管理器包括用于尺寸的非客户区域； 否则，","The state of the key.":"钥匙状态。","The starting value of the animation.":"动画的起始值。"," objects is created with a controllable ":"对象是用可控的"," are mapped.":"被映射。","A structure that contains the parameters that are required to create the window.":"包含创建窗口所需的参数的结构。"," as the root.":"作为根。","The key associated with this gesture.":"与此手势相关的关键。","The destination value of the animation.":"动画的目标值。"," objects that the stylus collected.":"手写笔收集的对象。","The handler implementation (based on the ":"处理程序实施（基于","The length of time the animation takes to play from start to finish, once. See the ":"动画从头到尾播放的时间长度。 看到"," if the root ":"如果根"," to be used by the ":"被","The key associated with the gesture.":"与手势相关的关键。"," delegate) that receives the window messages.":"接收窗口消息的委托）。"," returned should return a ":"返回应返回"," property for more information.":"属性以获取更多信息。"," objects collected from the stylus.":"从手写笔收集的对象。","The modifier keys associated with the gesture.":"与手势关联的修饰符键。","A structure that contains the window handle for this ":"一个包含窗口手柄的结构","Specifies how the animation behaves when it is not active.":"指定动画不活动时的行为。"," from its ":"从它的"," that reports current input for the stylus.":"报告报告了手写笔的当前输入。","The culture specific information.":"文化特定信息。","The provided window handle.":"提供的窗口手柄。"," used by the animation.":"动画使用。"," property so that the ":"属性，以便"," that captured the stylus.":"捕获了手写笔。","The string to display":"显示的字符串","The total amount by which the animation changes its starting value.     The default value is null.":"动画更改其起始值的总量。 默认值为null。"," tree can be interactively controlled; otherwise, ":"树可以交互控制； 否则，"," if the event data matches this ":"如果事件数据与此匹配"," object for the window that is specified by the ":"由","The element the pointer is over.":"指针结束的元素。","The display string for this ":"显示此字符串"," instance to clone.":"实例要克隆。","The easing function applied to this animation.":"宽松功能应用于此动画。"," window handle.":"窗口手柄。","The identifier for the stylus device.":"手写笔设备的标识符。","The starting value of the animation. The default value is null.":"动画的起始值。 默认值为null。","The key associated with the gesture.  The default value is ":"与手势相关的关键。 默认值是","Returns the visual target of the window.":"返回窗口的视觉目标。","The timeline from which to retrieve the desired frame rate.":"从中取回所需帧速率的时间表。"," if the target property's current value should be added to this animation's starting value; otherwise, ":"如果应将目标属性的当前值添加到本动画的起始值中； 否则，"," if the pen is positioned above, yet not in contact with, the digitizer; otherwise, ":"如果笔位于上方，但没有与数字化器接触； 否则，","The modifier keys associated with the gesture. The default value is ":"与手势关联的修饰符键。 默认值是","The event arguments":"事件参数"," if the animation accumulates its values when its ":"如果动画在其值时积累了其值","The desired frame rate of this timeline. The default value is ":"此时间轴的所需帧速率。 默认值是","The message for the mnemonic and associated data.":"助记符和相关数据的消息。"," if the pen is within range of the digitizer; otherwise, ":"如果笔在数字化器的范围内； 否则，","The gesture to evaluate for conversion.":"评估转换的手势。"," property causes it to repeat its simple duration. otherwise, ":"属性使其重复其简单的持续时间。 否则，","The gesture to convert into a string.":"转换为字符串的手势。"," to acquire Win32 focus for the WPF containing window when the user interacts with menus; otherwise, ":"当用户与菜单交互时，以获取包含WPF窗口的Win32焦点； 否则，"," that was created for this ":"为此创造了"," if the secondary tip of the stylus is in use; otherwise, ":"如果使用了手写笔的次级尖端； 否则，","The ending value of the animation. The default value is null.":"动画的结局值。 默认值为null。","The element to associate the manipulator with.":"将操纵器关联的元素。","An enumeration of keyboard input sinks.":"键盘输入水槽的枚举。"," to indicate a stylus is valid; otherwise ":"表明手写笔有效； 否则","The length of a single iteration of this ":"单个迭代的长度"," if the animation adds its output value to the base value of the property being animated instead of replacing it; otherwise, ":"如果动画将其输出值添加到动画属性的基本值中，而不是替换它； 否则，","The object that provides the position of the input that creates or is added to a manipulation.":"提供创建或添加到操作中的输入位置的对象。","The name of the stylus.":"手写笔的名称。"," if the natural duration is unknown.":"如果自然持续时间未知。"," property causes it to repeat its simple duration; otherwise, ":"财产使其重复其简单的持续时间； 否则，","The visual manager.":"视觉管理器。","The maximum number of frames this timeline should generate each second, or ":"该时间表应生成每秒的最大帧数，或"," object representing all of the buttons on the stylus.":"代表手写笔上所有按钮的对象。","The element on which to complete manipulation.":"完成操作的元素。","The window handle.":"窗户手柄。","The zero-based index of the element to get or set":"元素的基于零的索引要获得或设置"," represents the digitizer associated with the current ":"表示与当前关联的数字化器"," if the object has had ":"如果对象有","The element on which there is an active manipulation.":"存在主动操作的元素。"," if the system should control the number of frames.":"如果系统应控制帧数。"," object that receives input.":"接收输入的对象。"," from which this clock should be constructed. Clocks are not created for any child ":"应该从中构建这个时钟。 没有为任何孩子创建时钟"," called on it; otherwise, ":"呼唤它； 否则，","The container that defines the coordinate space.":"定义坐标空间的容器。","A value between 0 and 1, inclusive, that specifies the percentage of the timeline's ":"包括0到1的值，包括时间表的百分比","Device instance that the event is associated with.":"事件与之关联的设备实例。"," objects, if they exist.":"如果对象存在。","The element for which to get the manipulation mode.":"获得操作模式的元素。"," interface; or ":"界面; 或者"," spent accelerating the passage of time from zero to its maximum rate. If the timeline's ":"花费加速了时间从零到最大速率的流逝。 如果时间表","A timestamp used to disambiguate instances of the event.":"时间戳用于消除活动的实例。","The element on which there is a manipulation.":"有操纵的元素。"," has its own external source for time, which may require synchronization with the timing system; otherwise, ":"有时间的时间来源，这可能需要与定时系统同步； 否则，"," property is also set, the sum of ":"还设置了属性"," if no site is assigned. The default is ":"如果未分配网站。 默认值为","The number of times the tablet pen was tapped.":"平板电脑笔的次数被挖掘出来的次数。","An object that describes how a rotation occurs with one point of user input.":"一个描述用户输入一个点旋转如何发生旋转的对象。"," that contains the event data. .":"其中包含事件数据。 。","The current time of this clock if it is active or filling; otherwise, ":"该时钟的当前时间是有效的或填充的； 否则，"," must be less than or equal to 1. The default value is 0.":"必须小于或等于1。默认值为0。","The element to check.":"要检查的元素。"," for the window.":"对于窗口。"," if the timeline plays in reverse at the end of each iteration; otherwise, ":"如果时间轴在每次迭代结束时都会反向播放； 否则，","The stylus to associate with the event.":"与活动相关的手写笔。"," if this is a root clock; otherwise, ":"如果这是根时钟； 否则，"," if a manipulation is associated with the specified element; otherwise, ":"如果操纵与指定元素关联； 否则，","The root visual object of the window.":"窗口的根视觉对象。"," should begin, relative to its parent's ":"应该开始，相对于父母的"," that the (":"那是（","One of the enumeration values. The default value is ":"枚举值之一。 默认值是","The rate at which this clock's time is current progressing, compared to real-world time. If the clock is stopped, this property returns ":"与现实世界的时间相比，这个时钟时间的速度正在当前进展。 如果时钟停止，此属性将返回","The element to remove the associated manipulator from.":"从中删除关联的操作器的元素。",") coordinates are mapped to.":"）坐标被映射到。",". If this timeline is a root timeline, the time is relative to its interactive begin time (the moment at which the timeline was triggered). This value may be positive, negative, or ":"。 如果此时间轴是根时间线，则时间相对于其交互开始时间（触发时间轴的时刻）。 该值可能是正面的，负的或","The current global time for the WPF timing system.":"WPF正时系统的当前全局时间。","; a ":"; 一个",", which specifies that the window is not sized to its content.":"，它指定窗口不符合其内容的尺寸。"," that represents the position of the stylus, based on the coordinates of ":"这代表了手写笔的位置，基于","The object that provides the position of the input.":"提供输入位置的对象。"," if the system uses per-pixel opacity; otherwise, ":"如果系统使用每个像素不透明度； 否则，","This clock's current iteration within its current active period, or ":"此时钟的当前迭代在其当前活动期内或"," value means the timeline never plays. The default value is zero.":"价值意味着时间轴永远不会播放。 默认值为零。"," objects collected in the event.":"事件中收集的对象。","The element with which the manipulation is associated.":"与操作相关的元素。","The message ID.":"消息ID。"," objects collected during an event.":"事件期间收集的对象。"," spent decelerating the passage of time from its maximum rate to zero. If the timeline's ":"花费的时间从最大速率到零减速。 如果时间表"," if this clock is stopped.":"如果该时钟停止。","The message's wParam value.":"消息的WPARAM值。"," if the stylus is in proximity to, but not touching, the digitizer; otherwise, ":"如果手写笔与数字化器接近但不触摸，则； 否则，","The element on which to set the manipulation mode.":"设置操纵模式的元素。","The timeline's simple duration: the amount of time this timeline takes to complete a single forward iteration. The default value is ":"时间轴的简单持续时间：该时间轴完成单个前迭代的时间。 默认值是","The message's lParam value.":"消息的lparam值。"," if this clock is ":"如果这个时钟是"," if the stylus is inverted; otherwise, ":"如果手写笔是倒的； 否则，","The new manipulation mode.":"新的操纵模式。","A value that specifies how the timeline behaves after it reaches the end of its active period but its parent is inside its active or fill period. The default value is ":"一个值指定时间表在达到其活性周期结束后的行为，但其母体在其活动或填充期内的值。 默认值是",", or 0.0 if this clock is active and its ":"，或0.0，如果该时钟处于活动状态，并且"," that represents the stylus.":"这代表了手写笔。","A value that indicates whether the message was handled. Set the value to ":"指示是否处理消息的值。 将值设置为","The element that has the manipulation that the parameter is added to.":"具有添加参数的操作的元素。","The name of this timeline. The default value is ":"此时间轴的名称。 默认值是","; otherwise, a value between 0.0 and 1.0 that indicates the current progress of this Clock within its current iteration. A value of 0.0 indicates no progress, and a value of 1.0 indicates that the clock is at the end of its current iteration.":"; 否则，在其当前迭代中指示该时钟的当前进度的0.0和1.0之间的值。 值为0.0表示没有进展，而值为1.0表示时钟在其当前迭代的末尾。"," for the rendering thread.":"对于渲染线程。","The appropriate return value depends on the particular message. See the message documentation details for the Win32 message being handled.":"适当的返回值取决于特定消息。 有关正在处理的Win32消息，请参见消息文档详细信息。","The parameter to add.":"要添加的参数。","The current state of the clock: ":"时钟的当前状态：","An iteration ":"迭代"," object onto which the stroke is rendered.":"渲染中风的对象。","The element that has an active manipulation.":"具有主动操作的元素。","; otherwise, the current time of this clock.":"; 否则，这个时钟的当前时间。","The window's name.":"窗口的名称。"," that specifies the number of times the timeline should play, a ":"指定时间表应播放的次数"," if this clock belongs to a clock tree with a controllable root clock or if this clock is itself a controllable root; otherwise, ":"如果此时钟属于具有可控根时钟的时钟树，或者该时钟本身是可控的根； 否则，","The window's width, in pixels.":"窗口的宽度，以像素为单位。"," that represents the segment of the stroke to draw.":"这代表了绘制的中风段。","An object that describes the pivot.":"描述枢轴的对象。"," value that specifies the total the length of this timeline's active period, or the special value ":"指定本时间轴活动期的总长度或特殊值的总长度"," or any of its parents is paused; otherwise, ":"或任何父母都暂停了； 否则，",", which specifies that the timeline should repeat indefinitely. The default value is a ":"，指定时间轴应无限期重复。 默认值是","The element on which to begin inertia.":"开始惯性的元素。"," that represents the path of the mouse pointer.":"这代表了鼠标指针的路径。","The natural duration of this clock, as determined by its ":"该时钟的自然持续时间，由其决定","A Brush that specifies the appearance of the current stroke.":"指定当前冲程的外观的刷子。","The window's height, in pixels.":"窗口的高度，以像素为单位。",", which indicates that the timeline plays once.":"，这表明时间轴播放一次。","The unused portion of the direct manipulation.":"直接操纵的未使用部分。","The parent of this clock or ":"这个时钟的父母或","The objects to be tested for equality.":"要测试的对象以保持平等。","The container that the ":"容器"," if this clock is a root.":"如果这个时钟是根。","A finite value greater than 0 that describes the rate at which time progresses for this timeline, relative to the speed of the timeline's parent or, if this is a root timeline, the default timeline speed. The default value is 1.":"一个大于0的有限值，它描述了此时间线的速度，相对于时间线父级的速度，或者，如果这是根时间线，则是默认的时间线速度。 默认值为1。"," that contains information about input from the pen.":"其中包含有关笔输入的信息。"," property is relative to.":"属性相对于。"," if the comparison is equal; otherwise, ":"如果比较相等； 否则，","Collection of elements this instance is based on.":"元素的收集此实例基于。","The object that the application passed to the ":"应用程序传递给的对象"," from which this ":"从中","A collection of objects that represents the touch contacts for the manipulation.":"代表操纵的触摸触点的对象集合。","The structure to be tested for equality.":"要测试平等的结构。"," if the pen's input was correctly routed to the ":"如果笔的输入正确路由到","The initial capacity of the ":"最初的能力","The object to locate.":"要定位的对象。"," if the manipulation was successfully canceled; otherwise, ":"如果成功取消了操作； 否则，"," if the structures are equal; otherwise, ":"如果结构相等； 否则，","The zero-based index position where copying begins.":"复制开始的基于零的索引位置。"," if the pen actually entered the bounds of the element; otherwise, ":"如果笔真的进入了元素的边界； 否则，","The position of the left edge of the window.":"窗户左边缘的位置。","The velocities that are used for the manipulation.":"用于操纵的速度。"," if the pen actually left the bounds of the element; otherwise, ":"如果笔真的离开了元素的边界； 否则，","An object that can iterate the members of the collection.":"一个可以迭代集合成员的对象。"," is equal to this instance; otherwise ":"等于此实例； 否则","The position of the upper edge of the window.":"窗户上边缘的位置。"," event occurs during inertia; ":"事件发生在惯性期间；","The index position of ":"指数位置","The current stylus device.":"当前的手写笔设备。"," was successfully removed; otherwise, ":"成功删除了； 否则，","The width of the window, in device pixels.":"窗口的宽度，设备像素。","The stylus points to be redrawn.":"手写笔指的是重新绘制。","The number of items contained in this instance.":"在这种情况下包含的项目数。"," within this list.  If not found, -1 is returned.":"在此列表中。 如果找不到，则返回-1。"," if the event occurs while the user has contact with the ":"如果事件发生在用户与","The height of the window, in device pixels.":"窗口的高度，设备像素。"," if this instance is read-only; otherwise ":"如果此实例仅阅读； 否则"," that specifies the appearance of the rendered ink.":"这指定了渲染墨水的外观。","The zero-based index position into which ":"基于零的索引位置","The container that defines the coordinates for the manipulation.":"定义操纵坐标的容器。"," to use the value of ":"使用的值","The zero-based index position of the item to remove.":"要删除的项目的基于零的索引位置。","The point from which the manipulation originated.":"操纵起源的点。","The stylus points that are collected from the stylus.":"从手写笔收集的手写笔点。","The index position to access.":"访问索引位置。"," if the layout manager sizing logic should include the nonclient area; otherwise, ":"如果布局管理器的尺寸逻辑应包括非公认区域； 否则，","The total transformation that occurs during the current manipulation.":"在当前操作期间发生的总变换。","The Timeline object at the ":"时间轴对象在 ","The data to pass to the application thread.":"传递到应用程序线程的数据。"," object at the specified ":"指定的对象","The linear motion of the manipulation in device-independent units (1/96th inch per unit).":"操纵单位（单位1/96英寸）中操作的线性运动。","The extended window styles. See CreateWindowEx.":"扩展的窗口样式。 请参阅CreateWindowex。","The stylus points to pass to the application thread.":"手写笔指向传递到应用程序线程。","The seek offset, measured in the target clock's time. This offset is relative to the clock's ":"在目标时钟时间测量的寻求偏移。 此偏移与时钟相关",". If this object is a ":"。 如果这个对象是一个"," if the window size was assigned; otherwise, ":"如果分配了窗口大小； 否则，","The rotation of the manipulation in degrees.":"操作的旋转时间为程度。","The identifier of the current ":"电流的标识符",", depending on the value of ":"，取决于"," it will be added to the ":"它将添加到",", unless the structure was created with provided height and width, in which case the value is ":"，除非以提供的高度和宽度创建结构，否则值为","The time at which the input occurred.":"输入发生的时间。","The amount the manipulation has resized as a multiplier.":"操纵大小作为乘数的数量。","A value that indicates whether the specified offset is relative to the target clock's ":"指示指定偏移是否相对于目标时钟的值","The height of the window, in device pixels. The default value is 1.":"窗口的高度，设备像素。 默认值为1。"," collection; otherwise, an exception will be thrown.":"收藏; 否则，将抛出一个例外。","The amount the manipulation has resized in device-independent units (1/96th inch per unit).":"操纵的量已在独立的单位（每单位1/96英寸）中调整大小。"," controlled by this ":"由此控制","The cached bounds of the element.":"元素的缓存边界。","The message hook for the window.":"窗口的消息挂钩。","A clock for this timeline.":"该时间轴的时钟。"," is active; otherwise, ":"活跃; 否则，","The amount the manipulation has resized.":"操纵大小的数量。","A finite value greater than zero that describes the interactive speed of the target clock. This value is multiplied against the value of the ":"一个大于零的有限值描述了目标时钟的交互速度。 该值乘以","The HWND of the parent window.":"父窗口的hwnd。","Child ":"孩子"," is able to accept input; otherwise ":"能够接受输入； 否则","The portion of the manipulation that represents moving beyond the boundary.":"代表超越边界的操纵部分。"," of the clock's ":"时钟的","The left-edge position of the window. The default is CW_USEDEFAULT, as processed by ":"窗户的左边位置。 默认值为CW_USUSEFAULT，如","The x-coordinate of the ":"X坐标的"," objects of the ":" 的对象 ",". For example, if the timeline's ":"。 例如，如果时间轴","The cumulated changes of the current manipulation.":"当前操作的累积变化。","The upper-edge position of the window. The default is CW_USEDEFAULT, as processed by ":"窗户的上边缘位置。 默认值为CW_USUSEFAULT，如",". The default value is null.":"。 默认值为null。","The most recent changes of the current manipulation.":"当前操纵的最新变化。","The y-coordinate of the ":"的y坐标 "," is 0.5 and the ":"是0.5，","One of the enumeration values that specifies how WPF handles restoring focus for the window. The default is ":"指定WPF如何处理窗口恢复焦点的枚举值之一。 默认值为","The ending value of this animation.":"该动画的结局值。","The rates of the most recent changes to the manipulation.":"操纵最新变化的比率。","The amount of pressure applied to the ":"施加的压力量"," is 3.0, the timeline moves at 1.5 times normal speed (0.5 * 3.0). The default value is 1.0.":"IS 3.0，时间轴以正常速度（0.5 * 3.0）的1.5倍移动。 默认值为1.0。"," if parent windows of the ":"如果父母的窗口","The new animation's ":"新动画的","The object that specifies the behavior of a manipulation during inertia.":"指定惯性过程中操纵行为的对象。"," that specifies the additional properties stored in the ":"指定了存储在","The object defining the characteristics of the new class.":"定义新类特征的对象。"," should be considered the non-client area of the window during layout passes.; otherwise, ":"在布局通过期间，应视为窗户的非客户区域。 否则，","A modifiable clone of this instance. The returned clone is effectively a deep copy of the current object, although some copying might be deferred until necessary for improved performance. The copy's ":"此实例的可修改克隆。 返回的克隆实际上是当前对象的深层副本，尽管某些复制可能会推迟到需要提高性能为止。 副本","The rate of slowdown of expansion inertial movement":"扩张惯性运动的放缓速度","An array of 32-bit signed integers that contains the values of the properties defined in ":"一个32位签名的整数的数组，其中包含定义的属性值","Destination for the modifiable clone of the current object.":"当前对象的可修改克隆的目标。","The rates of changes to the manipulation that occur before inertia starts.":"在惯性开始之前发生的操作的变化速率。"," that represents the children of this ":" 这代表了这个孩子 "," should receive window messages raised by the message pump via the ":"应该收到消息泵通过的窗口消息"," that specifies which property value to get.":"这指定要获得的属性值。"," corresponds to a top-level window; otherwise, the default is ":"对应于顶级窗口； 否则，默认值为","The rate of slowdown of rotational inertial movement.":"旋转惯性运动的放缓速度。",". The default value is a ":". 默认值为 "," property will be false even if the source's ":" 属性将是假的，即使源的 "," to check for in the ":"检查"," with a hexadecimal value of #00000000.":"＃00000000的十六进制值。"," if using per-pixel opacity; otherwise, ":"如果使用每个像素不透明度； 否则，","The rate of slowdown of linear inertial movement.":"线性惯性运动的减速速率。"," is in the current ":"在电流中"," property was true.":"财产是真的。",".  \n  \n .":"。 \n  \n  。"," if using per-pixel transparency; otherwise, ":"如果使用每个像素透明度； 否则，","The center of a single-point manipulation.":"单点操纵的中心。"," that contains the same (x,y) coordinates as ":"包含与（x，y）相同的坐标"," to copy and freeze":"复制和冻结","The destination point of the arc; the start point of the arc is defined as the current point of the ":"弧的目的地； 弧的起点定义为","The window width, in device pixels. The default value is 1.":"窗口宽度，以设备像素为单位。 默认值为1。","The area around the pivot that is used to determine how much rotation and translation occurs when a single point of contact initiates the manipulation.":"枢轴周围的区域用于确定当单个接触点启动操作时发生多少旋转和翻译。","Ending value (also known as \"target value\") for the key frame.":"关键框架的结尾值（也称为“目标值”）。"," that specifies which property value to set.":"这指定要设置的属性值。","The window class style. See Window Class Styles.":"窗口类样式。 请参阅窗口类样式。"," if manipulation was successfully, otherwise, ":"如果成功地操纵，否则，","The x- and y-radius of the arc. The x-radius is specified by the ":"弧的X和Y-Radius。 X-Radius由","Key time for the key frame. The key time determines when the target value is reached which is also when the key frame ends.":"关键框架的关键时间。 关键时间确定何时达到目标值，这也是关键帧结束时。","The window name.":"窗口名称。"," if touch was successfully promoted to mouse events, otherwise, ":"如果触摸成功地晋升为鼠标事件，否则，"," specifies the properties stored in the ":"指定存储在"," property, and the y-radius is specified by the ":"属性，Y-Radius由"," one finger can start a manipulation; otherwise, ":"一根手指可以开始操纵； 否则，","Value between 0 and 1 indicating the amount of pressure the stylus applies to the digitizer's surface as the ":"0到1之间的值表示手写笔的压力量适用于数字化器的表面","The x-axis rotation of the ellipse.":"椭圆的X轴旋转。","The ending value (also known as \"target value\") for the key frame.":"关键帧的结尾值（也称为“目标值”）。","The window style. See the CreateWindowEx function for a complete list of style bits. Defaults: WS_VISIBLE, WS_CAPTION, WS_SYSMENU, WS_THICKFRAME, WS_MINIMIZEBOX, WS_MAXIMIZEBOX, WS_CLIPCHILDREN":"的窗口样式。 有关样式位的完整列表，请参阅CreateWindowEx函数。 默认值：WS_VISIBLE，WS_CAPTION，WS_SYSMENU，WS_THICKFRAME，WS_MINIMIZEBOX，WS_MAXIMIZEBOX，WS_CLIPCHILDREN","A generic IEnumerable of type ":"通用类型","The container that all manipulation events and calculations are relative to. The default is the element on which the event occurred.":"所有操纵事件和计算的容器均相对于。 默认值是事件发生的元素。","Whether the arc should be greater than 180 degrees.":"弧是否应大于180度。","The key time for the key frame. The key time determines when the target value is reached, which is also when the key frame ends.":"关键框架的关键时间。 关键时间确定何时达到目标值，这也是关键帧结束时。","The handle for the window that this object draws to.":"该对象绘制的窗口的句柄。"," that specifies the ":"指定","A value from 0.0 through 1.0 that specifies the percentage of time that has elapsed for this key frame.":"从0.0到1.0的值指定该关键帧经过的时间百分比。"," to draw the arc in a positive angle direction; set to ":"沿正角绘制弧； 调成","An object that describes the pivot for a single-point manipulation.":"描述单点操作的枢轴的对象。","The background color, as a ":"背景颜色，作为"," objects the ":"对象","The speed of linear motion in device-independent units (1/96th inch per unit) per millisecond.":"单位无关的单位线性运动速度（每单位1/96英寸）。"," to draw the arc in a negative angle direction.":"沿负角度绘制弧线。","The value from which to animate.":"从中生成动画的值。"," values that specifies the current render mode. The default is ":"指定当前渲染模式的值。 默认值为"," that specifies the additional properties stored in each ":"指定每个存储在每个","The root visual object of the hosted page.":"托管页面的根视觉对象。"," to stroke the arc when a ":"抚摸弧线","The speed of rotation in degrees per millisecond.":"每毫秒的旋转速度。","The output value of this key frame, given the specified base value and progress.":"给定指定的基本值和进度，该关键帧的输出值。","Key time for the key frame. The key time determines when the target value is reached, which is also when the key frame ends.":"关键框架的关键时间。 关键时间确定何时达到目标值，这也是关键帧结束时。"," that contains copies of the ":"其中包含","The rate at which the manipulation is resized in device-independent units (1/96th inch per unit) per millisecond.":"每毫秒/毫秒以独立于设备的单位（每单位1/96英寸）调整操作的速率。","The transform matrix.":"变换矩阵。"," is used to render the segment; otherwise, ":"用于渲染该细分市场； 否则，","The starting value of the animation. The default value is ":"动画的起始值。 默认值是","The ending value of the animation. The default value is ":"动画的结局值。 默认值是","The element to capture the mouse.":"捕获鼠标的元素。"," objects in the current ":"当前中的对象"," if the arc should be greater than 180 degrees; otherwise, ":"如果弧应大于180度； 否则，","A pointer to the unmanaged bitmap.":"指向非托管位图的指针。","The position at which to insert the ":"插入的位置"," if the element was able to capture the mouse; otherwise, ":"如果元素能够捕获鼠标； 否则，"," created.":"创建。","A pointer to the bitmap's palette map.":"指向位图的调色板地图的指针。","The point to which the arc is drawn. The default value is (0,0).":"绘制弧的点。 默认值为（0,0）。","The path used to generate this animation's output values. The default value is ":"用于生成该动画的输出值的路径。 默认值是","The stylus point collection to convert to a point array.":"用于转换为点数组的手写笔点集合。","The capture policy to use.":"捕获策略要使用。","The size of the source image.":"源图像的大小。","The aspect of this animation's ":"这个动画的方面","The amount (in degrees) by which the ellipse is rotated about the x-axis. The default value is 0.":"椭圆形围绕X轴旋转的量（以度为单位）。 默认值为0。","The elements ":"要素","A point array that contains points that correspond to each ":"包含对应于每个点的点阵列 ","A value of the enumeration that specifies how to handle conversions.":"指定如何处理转换的枚举价值。"," structure that describes the x- and y-radius of the elliptical arc. The ":"描述椭圆形弧的X-和Y-Radius的结构。 这"," that determines its output value. The default value is ":"这决定其输出值。 默认值是"," property specifies the arc's x-radius; its ":"属性指定弧线的X-Radius； 它的"," are in relation to.":"与。"," to intersect with the ":"与","A pointer to the unmanaged icon source.":"指向非托管图标源的指针。","The initial ":"最初的 "," property specifies the arc's y-radius. The default value is 0,0.":"属性指定弧线的Y-Radius。 默认值为0,0。","A pointer to a memory section.":"指向内存部分的指针。","The number of points returned.":"返回的积分数。"," that has a ":" 这有一个 ","The initial key time.":"最初的关键时间。","An integer that specifies the width, in pixels, of the bitmap.":"一个整数，指定位图的宽度，以像素为单位。","A value that specifies the direction in which the arc is drawn. The default value is ":"指定绘制弧的方向的值。 默认值是"," that is a subset of the specified ":"那是指定的子集","The coordinate space in which to calculate the position of the mouse.":"计算小鼠位置的坐标空间。","The easing function.":"宽松功能。"," that the current ":"那个电流","The position of the mouse relative to the parameter ":"小鼠相对于参数的位置","The first control point, which determines the beginning portion of the curve.":"确定曲线的开始部分的第一个控制点。","An integer that specifies the height, in pixels, of the bitmap.":"一个整数，指定位图的高度，以像素为单位。","A value of the enumeration.":"枚举的价值。","The position at which to remove the ":"删除的位置","The easing function applied to the key frame.":"应用于关键帧的缓动函数。","The cursor to set the mouse pointer to.":"光标将鼠标指针设置为。","The second control point, which determines the ending portion of the curve.":"第二个控制点决定了曲线的结尾部分。","The stride of the bitmap.":"位图的大步。","The initial value.":"初始值。","The position at which to set the ":"设置的位置",", if the cursor was set; otherwise, ":"，如果设置了光标； 否则，","The byte offset into the memory stream where the image starts.":"字节偏移到图像启动的内存流中。","The point to which the curve is drawn.":"曲线绘制到的点。","Normalized time (progress) of the animation, which is a value from 0 through 1.":"动画的归一化时间（进度），这是0到1的值。"," to set at the specified position.":"设置在指定位置。","The element captured by the mouse.":"鼠标捕获的元素。"," to stroke the curve when a ":"抚摸曲线","The area of the hosted non-WPF UI to be rendered. If this parameter is null, the entire non-WPF UI is rendered.":"将渲染的托管非WPF UI的区域。 如果此参数为null，则将呈现整个非WPF UI。","The element the mouse pointer is over.":"鼠标指针结束的元素。","One of the enumeration values that specifies how the animation interpolates. The default is ":"指定动画插值的枚举值之一。 默认值为"," that specifies the properties in the ":" 它指定了 ","The first control point of the curve.":"曲线的第一个控制点。","The state of the left mouse button.":"左鼠标按钮的状态。","Contextual information required for conversion.":"转换所需的上下文信息。"," if the animation will automatically flip the sign of the destination quaternion to ensure the shortest path is taken; otherwise, ":"如果动画将自动翻转目标四元的符号，以确保采取最短路径； 否则，"," to intersect.":"相交。","The state of the middle mouse button.":"中间鼠标按钮的状态。","The second control point of the curve.":"曲线的第二个控制点。"," if this type can be converted; otherwise, ":"如果可以转换此类型； 否则，","The number of times the target slides back and forth over the animation destination. This value must be greater than or equal to 0. The default is 3.":"目标在动画目的地上来回滑动的次数。 该值必须大于或等于0。默认值为3。"," that contains the properties that are present if both of the specified ":"如果两个指定的属性都包含存在的属性","A positive number that specifies the stiffness of the spring. The default value is 3.":"一个指定弹簧刚度的正数。 默认值为3。","The override cursor or ":"覆盖光标或","The end point of the curve.":"曲线的终点。","Context information required for conversion.":"转换所需的上下文信息。","The exponent used to determine the interpolation of the animation. The default is 2.":"用于确定动画插值的指数。 默认值为2。"," that specifies the property of the desired ":"指定所需的属性","A double that scales the bitmap.":"缩放位图的双重缩放。"," is not set.":"未设置。","The object being converted to an instance of ":"被转换为实例的对象"," to animate.":"动画。","A collection that contains all of the ":"包含所有的集合",", based on the supplied ":"，根据所提供的","The state of the right mouse button.":"右鼠标按钮的状态。"," if ClearType is active; otherwise, ":" 如果ClearType处于活动状态；否则, "," value to convert from.":"值转换的价值。"," that animates the property.":"使属性动画。"," has the specified ":"已指定","The state of the first extended mouse button.":"第一个扩展鼠标按钮的状态。","The scale that is applied to the bitmap. The default is 1.":"应用于位图的比例。 默认值为1。","A new object, based on ":"一个基于的新对象"," against which to check whether the current ":"可以检查当前是否","Determines how the new ":"确定新的"," if pixel snapping is active; otherwise, ":"如果像素捕捉是活跃的； 否则，","The state of the second extended mouse button.":"第二个扩展鼠标按钮的状态。","The localization category.":"本地化类别。"," will transition from or affect any current animations on the property.":"将从属性上的任何当前动画过渡或影响该属性的任何动画。"," is a subset.":"是子集。","The command associated with the gesture.":"与手势相关的命令。"," to cache and use as the ":" 缓存并用作 ","The category setting of the localization attribute.":"本地化属性的类别设置。","The object to animate.":"动画的对象。","The gesture associated with the command.":"与命令相关的手势。","The number of properties in the ":"中的属性数 ","The modifiability setting of the localization attribute.":"本地化属性的可修改设置。"," if layout is applied; otherwise, ":"如果应用布局； 否则，","The gesture.":"手势。","The timeline with the necessary functionality to animate the property.":"具有必要功能的时间表来动画属性。"," that uniquely identifies the ":"这独特地识别了"," that represents cached content.":"这代表了缓存的内容。","The mouse action.  The default is ":"鼠标动作。 默认值为","The readability setting of the localization attribute.":"本地化属性的可读性设置。","The timeline with the necessary functionality to tailor the new animation.":"具有必要功能的时间表来量身定制新动画。"," to indicate that the property represents a button on the stylus; otherwise, ":"指示该属性代表手写笔上的按钮； 否则，"," to cache and paint with.":"使用缓存和绘画。","The logical Mouse device associated with this event.":"与此事件关联的逻辑鼠标设备。","The child object to add.":"要添加的子对象。","A string representation of this object.":"此对象的字符串表示。","The object specifying the manner in which to interact with all relevant animation sequences.":"对象指定与所有相关动画序列交互方式的方式。","The GUID for the current ":"电流指导","The mouse button whose state is being described.":"描述其状态的鼠标按钮。","The object for which the base value is being requested.":"请求基本值的对象。","The text to add to the object.":"要添加到对象的文本。","Culture-specific formatting information, or ":"特定文化的格式信息，或"," represents a button on the stylus; otherwise, ":"表示手写笔上的按钮； 否则，","The logical mouse device associated with this event.":"与此事件关联的逻辑鼠标设备。","The object representing the base value of ":"代表基本值的对象"," that can be used for localization-globalization API calls that take that type as an argument.":"可用于将该类型作为参数的本地化全球化API调用。"," to base the new ":"为新的"," to use the default formatting of the current culture.":"使用当前文化的默认格式。","The time the event occurred.":"事件发生的时间。"," is associated with at least one of the current object's properties; otherwise ":"与当前对象的至少一个属性相关联； 否则","An RFC 3066 language string, or empty string.":"RFC3066语言字符串或空字符串。"," property is expressed as a value between 0.0 and 1.0. The default value is 1.0.":"属性表示为0.0和1.0之间的值。 默认值为1.0。","The minimum value accepted for the ":"接受的最低价值","The suggested origin value to provide the animation, which is used if the animation does not have its own concept of a start value. If this animation is the first in a composition chain, it is the snapshot value, if one is available, or the base property value, if it is not; otherwise, it is the value returned by the previous animation in the chain with an animation clock that is not ":"提供动画的建议原点值，如果动画没有自己的起始值概念，则使用该动画。 如果此动画是组成链中的第一个动画，则是快照值（如果是可用）或基本属性值（如果不是）； 否则，这是链中先前的动画返回的值，而不是动画时钟","The button associated with this event.":"与此事件关联的按钮。","The suggested destination value to provide the animation, which is used if the animation does not have its own concept of an end value. It is the base value if the animation is in the first composition layer of animations on a property; otherwise, it is the output value from the previous composition layer of animations for the property.":"提供动画的建议目标值，如果动画没有自己的最终值概念，则使用该动画。 如果动画位于属性上的第一个动画层中，则是基本值； 否则，它是该属性的动画的先前组成层的输出值。"," with the provided string as its ":"用提供的字符串作为其","The maximum value accepted for the ":"接受的最大值","The transformation that is applied to the brush using relative coordinates.  The default value is the ":"使用相对坐标应用于刷子的转换。 默认值是","The stylus device associated with this event.":"与此事件关联的手写笔设备。"," transformation.":"转型。","The animation clock that can generate the ":"动画时钟可以生成","The empty language tag version of ":"空语标签版本的","The scale that converts a ":"转换A的量表","The state the button is in.":"按钮所在的状态。","The transformation to apply to the brush. The default value is the ":"适用于刷子的转换。 默认值是","The transformed progress.":"转变的进步。"," property value into its units.":"属性价值为其单位。","The button which was pressed.":"按下的按钮。",", for use in comparison operations.":"，用于比较操作。","The conversion context.":"转换上下文。"," property value into units.":"属性价值为单位。"," object to clone.":"对象克隆。","The string representation of the language tag.":"语言标签的字符串表示。","The number of times the mouse button was clicked.":"单击鼠标按钮的次数。","The type from which to convert.":"转换的类型。","This value is the suggested origin value provided to the animation to be used if the animation does not have its own concept of a start value. If this animation is the first in a composition chain this value will be the snapshot value if one is available or the base property value if it is not; otherwise this value will be the value returned by the previous animation in the chain with an animationClock that is not Stopped.":"如果动画没有自己的起始值概念，则此值是提供给动画的建议的原点值。 如果此动画是组成链中的第一个动画，则该值将是快照值，如果不是一个值，则该值将是基本属性值。 否则，此值将是链中先前动画返回的值，并使用未停止的动画界返回。"," to associate with the event.":"与活动交往。"," if conversion is possible (object is string type); otherwise, ":"如果可能的转换（对象是字符串类型）； 否则，","A type that represents the type you want to convert from.":"代表您要转换的类型的类型。","The button which is being queried.":"正在查询的按钮。","The time the event occurs.":"事件发生的时间。","This value is the suggested destination value provided to the animation to be used if the animation does not have its own concept of an end value. This value will be the base value if the animation is in the first composition layer of animations on a property; otherwise this value will be the output value from the previous composition layer of animations for the property.":"如果动画没有自己的最终值概念，则此值是提供给动画的建议的目标值。 如果动画位于属性上的第一个动画层中，则该值将是基本值； 否则，此值将是属性动画的先前组成层的输出值。","The type you want to convert to.":"您要转换的类型。","The destination type.":"目标类型。","The state of the button.":"按钮的状态。","The object to convert. This is expected to be type ":"要转换的对象。 预计将是类型"," associated with the Tablet PC.":"与平板电脑相关联。","This is the animationClock which can generate the CurrentTime or CurrentProgress value to be used by the animation to generate its output value.":"这是动画界，可以生成当前时间或CurrentProgress值，以生成其输出值。","The culture information that applies to the conversion.":"适用于转换的文化信息。","The total amount by which the animation changes its starting value.     The default is ":"动画更改其起始值的总量。 默认值为","A type that represents the type you want to convert to.":"代表您要转换为的类型。","The position of the mouse pointer, in client coordinates.":"鼠标指针的位置，在客户端坐标中。"," that contains the name of the ":"其中包含","The starting value of the animation. The default is ":"动画的起始值。 默认值为","Returns a new ":"返回一个新的 ","The source in which to obtain the mouse position.":"获得鼠标位置的来源。","The ending value of the animation. The default is ":"动画的结局值。 默认值为","The clock with which to animate the specified property. If ":"为了使指定属性动画的时钟。 如果"," that reports current input for the tablet device.":"报告了平板电脑设备的当前输入。"," object if successful; otherwise, NULL.":"对象如果成功； 否则，null。","The unique identifier for the tablet device on the system.":"系统上平板电脑设备的唯一标识符。","The position of the mouse pointer, in client coordinates, in the specified ":"鼠标指针在客户端坐标中的位置，在指定的","The x-coordinate for the ":"X坐标",", all animations will be removed from the specified property (but not stopped).":"，所有动画将从指定的属性中删除（但不会停止）。","The current culture information.":"当前的文化信息。","The name of the tablet device.":"平板电脑设备的名称。",", all animations will be removed from the specified property (but not stopped). If ":"，所有动画将从指定的属性中删除（但不会停止）。 如果","The frame of reference in which to calculate the position of the mouse.":"计算鼠标位置的参考框架。","The y-coordinate for the ":"的y坐标为 ","The destination type that the ":"目的地类型"," and clock is ":"时钟是","The product identifier for the tablet device.":"平板设备的产品标识符。","The position of the mouse pointer.":"鼠标指针的位置。"," object is converted to.":"对象转换为。","The control point for the ":"的控制点 "," associated with the tablet device.":"与平板电脑设备相关联。",", this method has no effect.":"，这种方法没有效果。","The linear progress to evaluate.":"线性进步要评估。"," if the mouse cursor is set; otherwise, ":"如果设置鼠标光标； 否则，","An object that represents the converted ":"代表转换的对象"," objects that the ":"对象","The calculated spline progress.":"计算出的样条进展。","A value that specifies how the new animation should interact with any current animations already affecting the property value.":"指定新动画应如何与已经影响属性值的任何当前动画进行交互的值。","The element which is captured by the mouse.":"鼠标捕获的元素。","A frozen ":"冷冻"," supports.":"支持。","The animation used to animate the specified property.  \n  \n If the animation's ":"动画用于使指定属性动画。 \n  \n  如果动画的","A string representation of this ":"一个字符串表示","The element that receives the input.":"接收输入的元素。","A solid fill color.":"坚固的颜色。"," for the tablet device.":"对于平板电脑设备。","The mouse device associated with this event.":"与此事件关联的鼠标设备。",", any current animations will be removed and the current value of the property will be held.  \n  \n If ":"，将删除任何当前动画，并将保留该属性的当前值。 \n  \n  如果"," that specifies the type you want to convert from.":"这指定了您要转换的类型。","The Bezier curve's first control point. The point's ":"贝塞尔曲线的第一个控制点。 重点是 "," that provides basic input processing for the tablet device.":"这为平板电脑设备提供了基本的输入处理。","The logical stylus device associated with this event.":"与此事件关联的逻辑手写笔设备。",", all animations will be removed from the property and the property value will revert back to its base value.":"，所有动画将从属性中删除，属性值将恢复为其基本值。"," can perform the conversion; otherwise, ":"可以执行转换； 否则，","The animation used to animate the specified property.  \n  \n If ":"动画用于使指定属性动画。 \n  \n  如果"," values must each be between 0 and 1, inclusive. The default value is (0,0).":" 每个值必须介于0和1之间（包括0和1）。 默认值为(0,0)。","The element to use as the frame of reference for calculating the position of the mouse pointer.":"用于计算鼠标指针位置的参考框架的元素。","A type representing the type to convert to.":"代表要转换的类型的类型。","The x- and y-coordinates of the mouse pointer position relative to the specified object.":"相对于指定对象，鼠标指针位置的X-和Y坐标。"," and the animation's ":"和动画的"," of the tablet device.":" 的平板装置。","The Bezier curve's second control point. The point's ":"Bezier曲线第二控制点。 点","The one-dimensional array that is the destination of elements copied from the collection. The array must have zero-based indexing.":"一维数组是从集合中复制的元素的目的地。 该数组必须具有零基索引。"," that holds information about a specific culture.":"该信息拥有有关特定文化的信息。"," reference, all animations will be removed from the property and the property value will revert back to its base value.  \n  \n If ":"参考，所有动画将从属性中删除，属性值将恢复为其基本值。 \n  \n  如果","The current state of the left mouse button, which is either ":"左鼠标按钮的当前状态，即"," values must each be between 0 and 1, inclusive. The default value is (1,1).":"值必须每个值在0到1之间，包含在内。 默认值为（1,1）。","The current state of the middle mouse button, which is either ":"中间鼠标按钮的当前状态，即",", this method will have no effect if the animation or its ":"，如果动画或其它的方法将无效","The zero-based index in the array parameter where copying begins.":"在阵列参数中，基于零的索引开始复制。"," that is created by converting ":"这是通过转换而创建的"," that represents the same length of time as this instance; otherwise ":"这代表与此实例相同的时间长度； 否则","; otherwise, an exception is raised.":"; 否则，会提出一个例外。"," that is retrieved from the collection.":"从收藏中检索到。","A modifiable clone of this instance. The returned clone is effectively a deep copy of the current object. The clone's ":"此实例的可修改克隆。 返回的克隆实际上是当前对象的深层副本。 克隆人的"," instance, initialized to the value of ":"实例，初始化为","The mouse device associated with this event.  There is no default value.":"与此事件相关联的鼠标设备。  没有默认值。"," that represents information about a culture, such as language and calendar system. Can be ":"代表有关文化的信息，例如语言和日历系统。 可"," object at the specified index within the collection.":"集合中指定索引的对象。","The current state of the right mouse button, which is either ":"正确的鼠标按钮的当前状态，即"," if this method should simply determine whether this instance can be frozen. ":"如果此方法应简单地确定是否可以冷冻此实例。","An integer hash code.":"整数哈希代码。"," to convert to.":"转换。","An input manager to associate with this text composition.":"一个输入管理器，可以与此文本组成相关联。","A string representation of this instance.":"此实例的字符串表示。"," if this instance should actually freeze itself when this method is called.":"如果此方法在调用此方法时实际上应该冻结自身。","The stylus associated with this event.  There is no default value.":"与此事件相关联的手写笔。 没有默认值。","A comma-delimited ":"逗号限制","A source element for this text composition.  The object underlying the source element must implement the ":"此文本组成的源元素。 源元素基础的对象必须实现"," if the if this ":"如果这个","The current state of the first extended mouse button, which is either ":"第一个扩展鼠标按钮的当前状态，即","Boolean value that indicates whether the animation uses spherical linear interpolation to calculate the shortest arc between positions.":"布尔值表示动画是否使用球形线性插值来计算位置之间的最短弧。","A string containing the initial text for the composition.  This parameter will become the value of the ":"包含组成的初始文本的字符串。 此参数将成为","The current state of the second extended mouse button, which is either ":"第二个扩展鼠标按钮的当前状态，即"," value that represents the metrics for the character.":" 表示字符的度量的值。","Identifies the property whose base (non-animated) value should be retrieved.":"确定应检索其基本（非动画）值的属性。","The current value of the animation.":"动画的当前值。"," property in the new class instance.":"新类实例中的属性。"," representing the baseline.":"代表基线。","The action associated with this gesture.":"与此手势相关的动作。","The value that would be returned if the specified property were not animated.":"如果指定的属性没有动画，将返回的值。"," enumerations specifying desired auto-complete behavior for this text composition.":"枚举为此文本组成指定所需的自动完成行为。"," if the object will rotate along the tangent of the path; otherwise, ":"如果物体将沿路径的切线旋转； 否则，"," representing the black box height.":"代表黑匣子高度。","Represents an object that participates in the dependency property system.":"代表参与依赖属性系统的对象。","The modifiers associated with this gesture.":"与此手势相关的修饰符。"," if the animation's rotation angle should accumulate over repetitions; otherwise, ":"如果动画的旋转角应在重复上积聚； 否则，"," enumerations specifying the current auto-complete behavior for this text composition.":"枚举为此文本组成指定当前的自动完整行为。"," to serialize ":"序列化","The input event data to compare with this gesture.":"输入事件数据与此手势进行比较。"," representing the black box width.":"代表黑匣子宽度。"," if the object will accumulate over repeats of the animation; otherwise, ":"如果对象会在动画的重复序列上积聚； 否则，","A string containing the composition text for this text composition.":"包含此文本组成的组成文本的字符串。"," objects is associated with any of this object's dependency properties; otherwise, ":" 对象与此对象的任何依赖项属性相关联；否则, ","The modifier keys associated with this gesture. The default value is ":"与此手势关联的修饰符键。 默认值是","The geometry used to generate this animation's output values. The default is ":"用于生成该动画的输出值的几何形状。 默认值为","The key/value pair representing the character code and associated ":"表示字符代码和关联的键/值对","A string containing any control text associated with this text composition.":"包含与此文本组成关联的任何控件文本的字符串。","The animation that describes this clock's output values and timing behaviors.":"描述该时钟的输出值和时序行为的动画。","The mouse action associated with this gesture. The default value is ":"与此手势相关的鼠标动作。 默认值是"," representing the character code.":"表示字符代码。"," to check if this instance can be frozen; ":"检查此实例是否可以冻结；","The amount the wheel has changed.":"车轮变化的量。","The origin value provided to the clock if its animation does not have its own start value. If this clock is the first in a composition chain it will be the base value of the property being animated; otherwise it will be the value returned by the previous clock in the chain":"如果其动画没有自己的起始值，则提供的原点值。 如果此时钟是组成链中的第一个时钟，则将是正在动画的属性的基本值； 否则，它将是链中上一个时钟返回的值","A string containing the system composition text for this text composition.":"包含此文本组成的系统组成文本的字符串。"," to freeze this instance.":"冻结此实例。"," if the dictionary contains the ":"如果字典包含","A string containing the system text for this text composition.":"包含此文本组成的系统文本的字符串。","The destination value provided to the clock if its animation does not have its own destination value. If this clock is the first in a composition chain it will be the base value of the property being animated; otherwise it will be the value returned by the previous clock in the chain":"如果其动画没有其自己的目标值，则提供了时钟的目标值。 如果此时钟是组成链中的第一个时钟，则将是正在动画的属性的基本值； 否则，它将是链中上一个时钟返回的值","The amount the wheel has changed. This value is positive if the mouse wheel is rotated in an upward direction (away from the user) or negative if the mouse wheel is rotated in a downward direction (toward the user).":"车轮变化的量。 如果将鼠标轮沿向上旋转（远离用户）或鼠标车轮向下旋转（向用户）旋转（向用户）旋转，则此值为正。"," represented by the character code in ":"以字符代码为代表"," array that is the destination of the key frames copied from this ":"数组是从此复制的关键帧的目的地","The routed UI command.  \n  \n ":"路由UI命令。","A string containing the current text for this text composition.":"包含此文本组成的当前文本的字符串。","The current value of this ":"当前值"," if the dictionary contains ":"如果字典包含","The number of key frames contained in this ":"此中包含的关键帧数","The animation that describes this clock's behavior.":"描述该时钟行为的动画。","An empty collection.":"一个空的收藏。","The staging area.":"登台区。","The one-dimensional array that is the destination of the elements that are copied from the ":"一维数组是从该元素复制的元素的目的地"," object associated with this event.":" 与此事件关联的对象。"," if the processing was canceled; otherwise, ":"如果该处理被取消； 否则，","The clock that generates the animated values.":"生成动画值的时钟。"," item was successfully deleted; otherwise ":"项目已成功删除； 否则"," if this collection is read-only; otherwise, ":" 如果此集合是只读的；否则, ","A string containing any control text associated with this event.":"包含与此事件关联的任何控件文本的字符串。","The animated dependency property.":"动画依赖属性。"," to return the natural duration from.":"从中返回自然持续时间。","The input event that is on the top of the staging area stack.":"暂存区堆栈顶部的输入事件。","A string containing any system text associated with this event.":"包含与此事件关联的任何系统文本的字符串。"," if the dictionary contains an entry for ":" 如果字典包含一个条目 "," quantity representing the natural duration.":"代表自然持续时间的数量。","The animated object.":"动画对象。","The input event that was on the top of the staging area stack. This will be ":"登台区堆栈顶部的输入事件。 这将是","A string containing the input text associated with this event.":"一个包含与此事件关联的输入文本的字符串。","A value that indicates how this timeline will behave when one or more of its ":"一个值指示该时间表在其一个或多个时的行为方式的值"," if the dictionary is read-only; otherwise, ":"如果字典是只读的； 否则，"," object containing the text composition associated with this event.":"包含与此事件关联的文本组成的对象。","A clock for this ":"这个时钟 "," children slips. The default value is ":"孩子们滑。 默认值是"," if the staging area is empty.":"如果登台区为空。","A collection of keys of type ":"类型键的集合","The input event to put on the staging area stack.":"放入登台区域堆栈的输入事件。","The Point3Danimation is created with all properties set to their default value.":"Point3Danimation将创建所有属性设置为默认值的属性。","A dependency object to add the event handler to.  The dependency object must be a ":"依赖项对象将事件处理程序添加到。 依赖关系对象必须是一个","A new clock, created from this ":"由此创建的新时钟","A collection of type ":"类型的集合"," instance should actually freeze itself when this method is called. ":"当调用此方法时，实例应实际上冻结自身。","An existing staging area item to promote the state from.":"现有的登台区项目，以促进国家。","A delegate that designates the handler to add.":"指定处理程序要添加的代表。"," should simply return whether it can be frozen.":"应该简单地返回是否可以冷冻。","The origin value provided to the animation if the animation does not have its own start value. If this animation is the first in a composition chain it will be the base value of the property being animated; otherwise it will be the value returned by the previous animation in the chain.":"如果动画没有自己的起始值，则提供给动画的原点值。 如果该动画是组成链中的第一个动画，则将是动画属性的基本价值。 否则，将是链中先前动画返回的值。"," structure whose color values are the results of the addition operation.":"结构的颜色值是加法操作的结果。","The staging area input item that wraps the specified input.":"包装指定输入的登台区域输入项目。"," object to complete.":"对象要完成。","The first color to compare.":"比较的第一种颜色。","The destination value provided to the animation if the animation does not have its own destination value.":"如果动画没有自己的目标值，则提供给动画的目标值。",", this method returns true if the specified ":"，如果指定的话，此方法返回true","The staging area input item.":"登台区输入项目。"," which can generate the ":"可以生成","The second color to compare.":"比较的第二种颜色。"," if the text composition was successfully completed; otherwise, ":"如果文本组成成功完成； 否则，"," can be made unmodifiable, or false if it cannot be made unmodifiable. If ":"如果无法使其无法解码，则可以使其无法解码。 如果","The stylus pointer associated with this event.":"与此事件关联的手写笔指针。"," value to be used by the animation to generate its output value.":"动画要使用的值来生成其输出值。","A dependency object to remove the event handler from.  The dependency object must be a ":"一个依赖项对象，以从中删除事件处理程序。 依赖关系对象必须是一个"," are nearly identical; otherwise, ":" 几乎相同；否则, ","The cursor.":"光标。"," is false, this method returns true if the if the specified ":"是错误的，如果指定的if，此方法将返回tru","The value this animation believes should be the current value for the property.":"该动画认为应该是该属性的当前价值。","A delegate that designates the handler to remove.":"指定要删除的处理程序的委托。"," structure and is identical to the current ":" 结构和是相同的电流 ","The clock that was created for this ":"为此创建的时钟","Declared name for serialization.":"声明为序列化的名称。"," is now unmodifiable, or false if it cannot be made unmodifiable, with the side effect of having made the actual change in frozen status to this object.":"现在是不可修道的，如果无法使其无法解码，则该对象的冻结状态实际更改的副作用。"," object to start.":"对象开始。"," structure to compare to the current ":"与电流进行比较的结构","The animation's natural duration. This method always returns a ":"动画的自然持续时间。 此方法总是返回","The type which is registering the command.":"注册命令的类型。","The current value of this animation.":"此动画的当前值。"," if the text composition was successfully started; otherwise, ":" 如果文本合成已成功启动；否则, "," structure is identical to the current ":"结构与电流相同","The path used to generate this animation's output values. The default value is null.":"用于生成该动画的输出值的路径。 默认值为null。","The type that is registering the command.":"注册命令的类型。"," of 1 second.":"1秒。"," object to update.":"要更新的对象。",". The default is 0.":"。 默认值为0。"," are exactly identical; otherwise, ":"完全相同； 否则，","Default input gestures associated with this command.":"与此命令关联的默认输入手势。","The exponential power of the animation interpolation. This value must be greater or equal to 0. The default is 2.":"动画插值的指数力量。 该值必须更大或等于0。默认值为2。"," if the text composition was successfully updated; otherwise, ":"如果文本组成成功更新； 否则，"," if the defaultDestinationValue parameter of the ":"如果DefaultDestinationValue参数","The alpha channel, ":"alpha频道，","Quaternion to which to animate.":"季节是动画的。","A unique identifier for the touch device.":"触摸设备的唯一标识符。","A user defined data type.":"用户定义的数据类型。"," method is the value of this animation when reaches the end of its simple duration (its clock has a ":"当达到简单持续时间结束时，方法是该动画的值（其时钟有一个",", of the new color.":"，新颜色。","Duration of the QuaternionAnimation.":"Quaternionanimation的持续时间。","The command target.":"命令目标。","The element that captures the touch input.":"捕获触摸输入的元素。"," of 1); otherwise, ":"1）; 否则，","The red channel, ":"红色频道，","Behavior of the timeline outside its active period.":"时间表以外的时间表。"," if the command can execute on the current command target; otherwise, ":" 如果命令可以在当前命令目标上执行；否则, ","The type of property that can be animated by this animation.":"该动画可以动画的属性类型。"," if the element was able to capture the touch; otherwise, ":"如果元素能够捕获触摸； 否则，","The green channel, ":"绿色通道, ","Quaternion that from which to animate.":"四个动画。","User defined parameter to be passed to the handler.":"要传递给处理程序的用户定义参数。","The element that captures the touch.":"捕捉触摸的元素。","The blue channel, ":"蓝色频道，","Normalized time (progress) of the animation.":"动画的规范化时间（进度）。","Quaternion from which to animate.":"四元数从中生成动画。","Element at which to begin looking for command handlers.":"开始寻找命令处理程序的元素。","The element that defines the coordinate space.":"定义坐标空间的元素。"," structure with the specified values.":" 具有指定值的结构。","The total amount by which the animation changes its starting value. The default value is ":"动画更改其起始值的总量。 默认值是","A double that represents the transformed progress.":"表示已转换进度的替身。","The total amount by which the animation changes its starting value. The default is ":"动画更改其起始值的总量。 默认值为","All touch points that were collected between the most recent and previous touch events.":"最近和以前的触摸事件之间收集的所有接触点。","The input gestures.":"输入手势。","The alpha channel for the new color,a value between 0 and 1.":"新颜色的alpha通道，值在0到1之间。","The amplitude of retraction associated with a ":"与A相关的回缩幅度","A collection of values that specify the color channels for the new color. These values map to the ":"指定新颜色的颜色通道的值集合。 这些值映射到","The name of the command.":"命令的名称。","The current position of the touch device relative to the specified element.":"触摸设备相对于指定元素的当前位置。","The object to add as the child of this ":"要添加的对象作为this的子项 "," animation. This value must be greater than or equal to 0.  \n  \n The default value is 1.":"动画。 该值必须大于或等于0。 \n  \n  默认值为1。","The International Color Consortium (ICC) or Image Color Management (ICM) color profile for the new color.":"新颜色的国际色彩联盟（ICC）或图像颜色管理（ICM）颜色配置文件。","The type of the command owner.":"命令所有者的类型。","The origin value provided to the animation if the animation does not have its own start value.":"如果动画没有自己的起始值，则提供给动画的原点值。","The text to add to the ":"要添加到","The capture policy.":"捕获策略。"," red channel, ":"红色频道，","Descriptive text for the command.":"命令的描述文本。"," to cancel the action; otherwise, ":"取消动作； 否则，"," can be made read-only, or ":"可以使只读或","The suggested origin value, used if the animation does not have its own explicitly set start value.":"建议的原点值，如果动画没有自己显式设置的开始值，则使用该值。","The declared name of the command for serialization.":"序列化命令的名称。"," green channel, ":"绿色频道，"," event was handled; otherwise, ":"事件被处理； 否则，"," if it cannot be made read-only.  \n  \n If ":"如果不能将其完全阅读。 \n  \n  如果","The suggested destination value, used if the animation does not have its own explicitly set end value.":"建议的目标值，如果动画没有自己的明确设置最终值，则使用。"," blue channel, ":"蓝色频道，","A collection of gestures to associate with the command.":"与命令相关联的手势集合。"," is now read-only, or ":"现在只读，或者"," that generates the ":"生成","The source that reports input for this device.":"报告此设备输入的来源。","The text that describes the command.  The default is an empty string.":"描述命令的文本。 默认值是一个空字符串。"," used by the host animation.":"主机动画使用。"," structure with the specified values and an alpha channel value of 255.":"具有指定值的结构，α通道值为255。"," if the property value has changed from its default; otherwise, ":" 如果属性值已从默认值更改；否则, ","The element that captured the ":"捕获的元素","An arbitrary key for the data. This cannot be ":"数据的任意键。 这是不可能的","The calculated value of the property, as determined by the current animation.":"由当前动画确定的属性的计算值。"," alpha channel, ":" 阿尔法通道, ","The data for this key, or ":"此密钥的数据，或","The capture policy of the ":"捕获政策的政策"," if the animation accumulates its values when it repeats; otherwise, ":"如果动画重复时会积累其值； 否则，","The type of value produced by this animation.":"该动画产生的值类型。"," structure with the specified values and an alpha channel value of 1.":"指定值和α通道值为1的结构。"," is true, this method returns ":"是的，此方法返回","The data to set for this key. This can be ":"为此键设置的数据。 这可以","The element that the touch contact point is directly over.":"接触接触点直接结束的元素。","A hash code for this ":"哈希代码","A number greater than or equal to 0 that specifies the number of iterations to make.":"大于或等于0的数字，指定要进行的迭代次数。"," if this object can be made read-only, or ":"如果可以使此对象仅阅读，或者","The unique identifier of the ":"独特的标识符","The total length of time that the ":"总长度","The event.":"事件。","An array of color channel values.":"颜色通道值的数组。"," if it cannot be made read-only. If ":"如果不能将其完全阅读。 如果","The event handler to add.":"活动处理程序要添加。"," if the device is active; otherwise, ":"如果设备处于活动状态； 否则，"," should play (its active duration).":"应该玩（其积极的持续时间）。"," to be multiplied.":"乘以。"," is false, this method returns ":"是错误的，此方法返回","The element to capture the stylus to.":"捕获手写笔的元素。"," that represents the same repeat behavior as this instance; otherwise, ":"这代表与此实例相同的重复行为； 否则，","The element that receives input from the ":"从"," if this object is now read-only, or ":"如果此对象现在仅读取，或者","The value to multiply by.":"值乘以。"," if the stylus is captured to ":"如果手写笔被捕获到"," structure whose color values are the results of the multiplication operation.":"结构的颜色值是乘法操作的结果。","The value to compare to this instance.":"与此实例进行比较的值。","The target on which to call the handler.":"打电话给处理程序的目标。"," if it cannot be made read-only, with the side effect of having begun to change the frozen status of this object.":"如果无法将其简单地进行，则开始改变该对象的冷冻状态的副作用。"," on which to determine whether flicks are enabled.":"在哪些方面确定是否启用了轻弹。"," structure to be subtracted from.":"从中减去的结构。"," if both the type and repeat behavior of ":"如果同时的类型和重复行为","The touch that generated the event.":"生成事件的触摸。","The calculated value of the property, as determined by the current instance.":"由当前实例确定的属性的计算值。"," if the specified element has flicks enabled; otherwise, ":"如果指定的元素启用了轻弹； 否则，"," are equal to this instance; otherwise, ":"等于此实例； 否则，"," structure to subtract from ":"从减法的结构","The element that defines the coordinate space. To use WPF absolute coordinates, specify ":"定义坐标空间的元素。 要使用WPF绝对坐标，请指定"," on which to determine whether press and hold is enabled.":"在哪些方面确定是否启用了按下和持有。"," whose natural duration is desired.":" 其自然持续时间是期望的。"," structure whose color values are the results of the subtraction operation.":"其颜色值是减法操作的结果。","The current position of the primary ":"主要的当前位置"," are equal to that of ":" 等于 ","If the last key frame of this animation is a ":"如果此动画的最后一个关键框架是"," relative to the specified element; or ":"相对于指定元素； 或者"," if the specified element has press and hold enabled; otherwise, ":"如果指定的元素具有按下并启用了启用； 否则，"," are different types or the repeat behavior properties are not equal; otherwise ":"是不同的类型，或者重复行为属性不相等； 否则","The string representation of the color. The default implementation represents the ":"颜色的字符串表示。 默认实现代表"," if the primary ":"如果主要",", then this value is used as the ":"，然后将此值用作",";":";"," values in hex form, prefixes with the ":"十六进制形式的值，前缀","The format used to construct the return value.":"用于构建返回值的格式。"," character, and starts with the alpha channel. For example, the ":"角色，并从Alpha通道开始。 例如，","; otherwise it will be one second.":"; 否则将是一秒钟。"," is not active.":"不活跃。","The numeric value representing the number of iterations to repeat.":"代表重复迭代数的数值值。","The string representation of the color.":"颜色的字符串表示。"," on which to determine whether tap feedback enabled.":" 在其上确定tap反馈是否启用。","A collection that contains the current ":"包含电流的集合"," if the property value should be serialized; otherwise, ":"如果应序列化属性值； 否则，"," if the specified element has tap feedback enabled; otherwise, ":"如果指定的元素启用了TAP反馈； 否则，","The total length of time a timeline should play.":"时间轴应该播放的总长度。"," alpha channel value of the color, a value between 0 and 255.":"颜色的alpha通道值，值在0到255之间。"," for each active ":"对于每个活动"," objects that define the animation. The default value is ":"定义动画的对象。 默认值是"," on which to determine whether touch input feedback enabled.":"在这些方面可以确定触摸输入反馈是否启用。"," blue channel value of the ":"蓝色通道值"," that specifies an infinite number of repetitions.":"这指定了无限数量的重复。","The value to animate from.":"要从中动画的价值。"," if touch input feedback is enabled, otherwise ":"如果启用了触摸输入反馈，否则","The time stamp for this event.":"此事件的时间戳记。"," structure, a value between 0 and 255.":" 结构，在0和255之间的值。","A value between 0.0 and 1.0, inclusive, that specifies the percentage of time that has elapsed for this key frame.":"包含在内的0.0到1.0之间的值指定了该关键框架经过的时间百分比。"," if the specified type refers to an iteration count; otherwise, ":"如果指定的类型是指迭代计数； 否则，","The event handler to remove.":"活动处理程序要删除。","The touch device that generated this ":"生成此的触摸设备"," if the specified type refers to a repeat duration; otherwise, ":"如果指定的类型是指重复持续时间； 否则，","The International Color Consortium (ICC) or Image Color Management (ICM) color profile of the color.":"国际颜色联盟（ICC）或图像颜色管理（ICM）颜色曲线。","The output value of this key frame given the specified base value and progress.":"给定指定的基本价值和进度，该关键帧的输出值。"," on which to enable flicks.":"可以启用轻弹。","The location of the touch point.":"接触点的位置。","Type to evaluate for conversion.":"输入以评估转换。","The value to animate from; typically the value of the previous key frame.":"来自动画的价值； 通常是先前的关键帧的值。"," green channel value of the ":"绿色通道值"," to enable flicks; ":"启用轻弹；","The bounds of the area that the finger has in contact with the screen.":"手指与屏幕接触的区域的边界。"," if conversion is supported; otherwise, ":"如果支持转换； 否则，","The time at which the key frame's current value should be equal to its ":"关键帧的当前值应等于其的时间","The last action that occurred by this device at this location.":"该设备在此位置发生的最后一个动作。"," red channel value of the ":"红通道值"," to disable flicks.":" 禁用电影。"," property. The default value is ":"财产。 默认值是","Destination type being evaluated for conversion.":"目的地类型正在评估转换。","The last action that occurred at this location.":"在此位置发生的最后一个动作。"," on which to enable press and hold.":"在其上启用并保持。","The current value for this property.":"此属性的当前值。"," alpha channel value of the ":"alpha通道值"," if conversion is possible; otherwise, ":"如果可以转换； 否则，"," to enable press and hold; ":"启用压力；","Cursor reference to use for interoperation.":"用于互操作的游标引用。"," structure, a value between 0 and 1.":"结构，值在0到1之间。","The key frame's target value, which is the value of this key frame at its specified ":"关键帧的目标值，这是该关键帧在其指定的值 "," to disable press and hold.":"禁用按下。","The Windows Presentation Foundation (WPF) cursor object based on the provided Win32 cursor handle.":"Windows演示基金会（WPF）光标对象基于提供的Win32光标句柄。","The ScRGB red channel value of the ":"SCRGB红色通道值"," to add to the end of the collection.":"添加到集合的结尾。","The display resolution on the x-axis.":"X轴上的显示分辨率。"," on which to enable tap feedback.":"可以启用点击反馈。"," that identifies the location of the desired color profile.":"这标识了所需的颜色配置文件的位置。"," was added.":"加入。","The display resolution on the y-axis.":"Y轴上的显示分辨率。"," to enable tap feedback; ":"启用点击反馈；"," is derived.":"得出。"," that represents the area that changed.":"这代表了变化的区域。"," if the supplied ":"如果提供的"," that is a software copy of the current state of the back buffer; otherwise, ":"这是后缓冲区当前状态的软件副本； 否则，"," is equal to this instance of ":"等于这个实例"," that represents the hash code for the object.":"这代表对象的哈希代码。"}