{" that is the color of the title bar caption of an inactive window.":"那就是不活动窗口标题条标题的颜色。","The value, in dots per inch, for the horizontal resolution supported by this ":"该值以每英寸为单位的点为此支持的水平分辨率"," structure that represents the second control point for the curve.":"代表曲线的第二个控制点的结构。","The y-coordinate, in hundredths of an inch, of the hard margin at the top of the page.":"页面顶部的硬边缘的Y坐标为百分之一英寸。"," object that encapsulates the GUID that specifies the category of the parameter stored in this ":"对象封装了指定该参数类别的GUID的对象"," structure that represents the ending point of the curve.":"代表曲线终点的结构。","The value, in dots per inch, for the vertical resolution supported by this ":"该值以每英寸为单位的垂直分辨率以每英寸为单位"," if the page should be printed in landscape orientation; otherwise, ":"如果应以景观取向打印页面； 否则，"," that contains the file name of the font to add.":"其中包含要添加的字体的文件名。","An integer that indicates the number of elements in the array of values stored in this ":"一个整数，指示在此存储的值数组中的元素数量"," if the clipping region of this ":"如果剪切区域"," that determines the color, width, and style of the curve.":" 这决定了曲线的颜色、宽度和样式。"," that represents the margins, in hundredths of an inch, for the page. The default is 1-inch margins on all sides.":"这代表了该页面的边缘，以百分之一英寸的范围。 默认值是各方1英寸的边缘。","The memory address of the font to add.":"要添加字体的内存地址。"," if the visible portion of the clipping region of this ":"如果剪切区域的可见部分","The x-coordinate of the first control point of the curve.":"曲线第一个控制点的X坐标。"," enumeration that indicates the data type of the values stored in this ":"指示存储在此中的值的数据类型的枚举","The memory length of the font to add.":"要添加字体的内存长度。"," that represents the size of the paper. The default is the printer's default paper size.":"这代表纸张的大小。 默认值是打印机的默认纸张尺寸。","An integer that specifies the number of ":"一个指定数量的整数","The y-coordinate of the first control point of the curve.":"曲线的第一个控制点的y坐标。","This property specifies a value for the scaling between world units and page units for this ":"此属性为此指定了世界单位和页面单元之间的缩放值"," object with which this ":"与之相关的对象"," structure that contains a GUID for this ":"包含GUID的结构"," that specifies the source of the paper. The default is the printer's default paper source.":"这指定了论文的来源。 默认值是打印机的默认纸张源。"," values other than ":"值以外的值"," object fills interiors.":"物体填充内部。","The x-coordinate of the second control point of the curve.":"曲线第二控制点的X坐标。"," representing the length and width, in hundredths of an inch, of the area the printer is capable of printing in.":"代表打印机能够打印的区域的长度和宽度（以百分之一英寸为单位）。"," enumeration":"枚举"," equivalent to this ":"等同于此","The y-coordinate of the second control point of the curve.":"曲线第二个控制点的y坐标。"," enumeration that specifies how this ":"指定这一点的枚举"," that specifies the printer resolution for the page. The default is the printer's default resolution.":"这指定了页面的打印机分辨率。 默认值是打印机的默认分辨率。"," structure that represents the dither origin for 8-bits-per-pixel and 16-bits-per-pixel dithering and is also used to set the origin for hatch brushes.":"代表每个像素8位和每个像素抖动的抖动原点的结构，也用于设置舱口刷的原点。","The hash code of this ":"哈希代码"," that represents the printer settings associated with the page.":"这表示与页面关联的打印机设置。","The x-coordinate of the ending point of the curve.":"曲线终点的X坐标。","The gamma correction value used for rendering antialiased and ClearType text.":"用于呈现抗逆转录和清除型文本的伽马校正值。"," object is tiled.":"物体是瓷砖。"," structure that contains a GUID that represents this ":"结构包含代表这一点的GUID","The name of the paper.":"纸的名称。","The y-coordinate of the ending point of the curve.":"曲线终点的y坐标。"," that represents the geometric world transformation for this ":"代表了几何世界的转变"," object that contains additional information about the image used by this ":"包含有关此图像的其他信息的对象","The page dimension.":"页面维度。","The width of the paper, in hundredths of an inch.":"纸的宽度，一英寸。"," structure that represents a bounding rectangle for the visible clipping region of this ":"代表该可见剪切区域的边界矩形的结构"," object this method creates, cast as an ":"对象此方法创建，铸造为"," structures that represent the points that determine the curve. The number of points in the array should be a multiple of 3 plus 1, such as 4, 7, or 10.":"代表确定曲线的点的结构。 数组中的点数应为3加1的倍数，例如4、7或10。","The height of the paper, in hundredths of an inch.":"纸的高度，一英寸。","Internal pointer that specifies data for the callback method. This parameter is not passed by all ":"内部指针指定回调方法的数据。 此参数并非所有人传递","The resolution dimension.":"分辨率维度。"," object by which to multiply the geometric transformation.":"乘以几何变换的对象。"," that determines the color, width, and height of the curve.":"这决定了曲线的颜色，宽度和高度。"," overloads. You can test for its absence by checking for the value ":"超载。 您可以通过检查值来测试它的缺席","The time dimension.":"时间维度。","The name of the type of paper.":"纸张类型的名称。"," structures that define the spline.":"定义样条的结构。"," enumeration that specifies the order in which to multiply the two matrices.":"指定乘以两个矩阵的顺序的枚举。"," if it decides that the ":"如果它决定","An integer representing one of the ":"代表其中一个的整数"," enumeration that specifies whether to append or prepend the rotation matrix.":"指定是附加还是预先置换旋转矩阵的枚举。","An element of ":"一个元素","Value greater than or equal to 0.0F that specifies the tension of the curve.":"大于或等于指定曲线张力的0.0F的值。"," values, or a custom value.":"值或自定义值。"," method should prematurely stop execution. Otherwise it returns ":"方法应过早停止执行。 否则它将返回"," enumeration that determines how the curve is filled. This parameter is required but ignored.":"确定曲线如何填充的枚举。 需要此参数，但被忽略。"," that specifies the category for which the color key is cleared.":"这指定了清除颜色键的类别。","The amount by which to scale the transformation in the x direction.":"在X方向上缩放转换的数量。","The integer value representing one of the ":"整数值代表其中之一"," method should continue execution.":"方法应继续执行。"," enumeration that determines how the curve is filled. This parameter is required but is ignored.":"确定曲线如何填充的枚举。 需要此参数，但被忽略。","The amount by which to scale the transformation in the y direction.":"在y方向上缩放转换的数量。"," that specifies the category for which the color-adjustment matrix is cleared.":"这指定了清除颜色调整矩阵的类别。"," values or a custom value.":"值或自定义值。"," enumeration that specifies the type of metafile record.":"指定元数据记录类型的枚举。","Offset from the first element in the array of the ":"偏离了该数组中的第一个元素"," that specifies the category for which gamma correction is disabled.":"这指定了禁用伽马校正的类别。"," enumeration that specifies whether to append or prepend the scaling matrix.":"指定是附加或预先预示缩放矩阵的枚举。","The name of the paper source.":"纸张来源的名称。","Set of flags that specify attributes of the record.":"指定记录属性的标志集。"," that specifies the category for which the ":"指定了","The dimension by which to translate the transformation in the x direction.":"在X方向上转换转换的尺寸。"," parameter to the starting point in the curve.":"参数到曲线中的起点。","The image of the printed page.":"印刷页面的图像。","Number of bytes in the record data.":"记录数据中的字节数。"," setting is cleared.":"设置已清除。","The dimension by which to translate the transformation in the y direction.":"在y方向上转换转换的尺寸。","Number of segments after the starting point to include in the curve.":"起点之后的段数，包括在曲线中。"," that specifies the category for which the output channel setting is cleared.":"这指定了清除输出通道设置的类别。","The size of the printed page, in hundredths of an inch.":"印刷页的大小，一英寸。","Pointer to a buffer that contains the record data.":"指向包含记录数据的缓冲区。"," structures that represent the points that define the curve.":"表示定义曲线的点的结构。"," object that represents the image with which this ":"代表此图像的对象"," representing the printed page.":"代表印刷页面。"," that specifies the category for which the output channel profile setting is cleared.":"这指定了清除输出通道配置文件设置的类别。"," that determines the color, width, and style of the ellipse.":"这决定了椭圆的颜色，宽度和样式。","Return ":"返回"," object fills shapes.":"对象填充形状。"," that specifies the size of the printed page, in hundredths of an inch.":"这说明了印刷页的大小，以百分之一英寸的形式。"," that specifies the category for which the remap table is cleared.":"这指定了清除重新映射表的类别。","Width of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形的宽度。"," if you want to continue enumerating records; otherwise, ":"如果您想继续枚举记录； 否则，"," that specifies the category for which the threshold is cleared.":"这指定了清除阈值的类别。"," object that defines a geometric transformation that applies only to fills drawn by using this ":"定义仅适用于通过使用此填充的几何变换的对象"," that contains the pages of a ":"其中包含一个页面"," object this class creates, cast as an object.":"对象此类创建，铸造为对象。","Height of the bounding rectangle that defines the ellipse.":"定义椭圆的边界矩形的高度。"," from which to load the newly sized icon.":"从中加载新尺寸的图标。"," as a series of images.":"作为一系列图像。"," enumeration that specifies how fills drawn by using this ":" 指定如何使用this绘制填充的枚举 "," structure that specifies the location and size of the resulting image on the display surface. The image contained in the ":"指定显示表面上所得图像的位置和大小的结构。 图像包含在"," that on input contains the palette to be adjusted, and on output contains the adjusted palette.":"输入包含要调整的调色板，并且输出包含调整后的调色板。"," that represents the document being previewed.":"这代表正在预览的文档。"," structure that specifies the height and width of the new ":"指定新的高度和宽度的结构"," object are tiled.":"物体是瓷砖。"," that contains data about how to preview a page in the print document.":"其中包含有关如何在打印文档中预览页面的数据。"," parameter is scaled to the dimensions of this rectangular area.":"参数缩放到该矩形区域的尺寸。","The icon to load the different size from.":"图标加载不同的大小。"," that specifies the category whose adjustment settings will be applied to the palette.":"这指定了将其调整设置应用于调色板的类别。","The name of a file that contains a 16 by 16 bitmap.":"包含16 x 16位图的文件的名称。","The x-coordinate of the upper-left corner of the drawn image.":"绘制图像的左上角的X坐标。","The low color-key value.":"低色钥匙值。"," that contains data about how to preview the print document.":"其中包含有关如何预览打印文档的数据。"," whose defining assembly is searched for the bitmap resource.":"将其定义组件搜索以获取位图资源。","The width of the new icon.":"新图标的宽度。","The y-coordinate of the upper-left corner of the drawn image.":"绘制图像的左上角的Y坐标。","The high color-key value.":"高色值。"," that contains data about how to preview a page in the print document. Initially, the ":"其中包含有关如何在打印文档中预览页面的数据。 最初，","The height of the new icon.":"新图标的高度。","The name of the embedded bitmap resource.":"嵌入式位图资源的名称。"," structure that specifies the location and size of the resulting image. The image is not scaled to fit this rectangle, but retains its original size. If the image is larger than the rectangle, it is clipped to fit inside it.":"指定所得图像的位置和大小的结构。 图像不缩放以适合该矩形，而是保留其原始尺寸。 如果图像大于矩形，则将其剪裁以适合其内部。"," property of this parameter will be ":"此参数的属性将是","The data stream from which to load the ":"从中加载的数据流"," that specifies the category for which the color key is set.":"这指定了设置颜色键的类别。"," is both a ":"都是一个"," structure that represents the location of the upper-left corner of the drawn image.":"代表绘制图像左上角的位置的结构。","The stream that contains the icon data.":"包含图标数据的流。"," object and is identical to this ":"对象，与此相同",". The value returned from this method will be used to set this property.":"。 从该方法返回的值将用于设置此属性。","The color-adjustment matrix.":"颜色调整矩阵。","Array of three ":"三个阵列","The desired size of the icon.":"图标的所需尺寸。"," object does not already have a small image, this method searches for a bitmap resource in the assembly that defines the type of the object specified by the component parameter. For example, if you pass an object of type ControlA to the component parameter, then this method searches the assembly that defines ControlA.":"对象尚未有一个小图像，此方法在汇编中搜索一个位图资源，该资源定义了组件参数指定的对象的类型。 例如，如果将“ ControlA”类型对象传递给组件参数，则此方法搜索定义ControlA的程序集。"," that represents a page from a ":"代表一个页面","The grayscale-adjustment matrix.":"灰度调整矩阵。"," structures that define a parallelogram.":"定义平行四边形的结构。","The data stream from which to load the icon.":"从中加载图标的数据流。","The small ":"小"," that contains data about how to print the document.":"其中包含有关如何打印文档的数据。"," that specifies the type of image and color that will be affected by the color-adjustment and grayscale-adjustment matrices.":"这指定了将受颜色调整和灰度调整矩阵影响的图像和颜色的类型。"," enumeration that specifies the units of measure used by the ":"指定措施单位的枚举","The width, in pixels, of the icon.":"图标的宽度，像素。","Specifies whether this method returns a large image (":"指定此方法是否返回大图（"," if the print preview uses anti-aliasing; otherwise, ":"如果打印预览使用抗偏置； 否则，"," that specifies the category for which the color-adjustment and grayscale-adjustment matrices are set.":"这指定了设置颜色调整和灰度调整矩阵的类别。","The height, in pixels, of the icon.":"图标的高度，像素。",") or a small image (":"）或小图像（"," that specifies recoloring and gamma information for the ":"这指定了重新彩色和伽马信息"," that represents the document currently being printed.":"这代表当前正在打印的文档。","). The small image is 16 by 16, and the large image is 32 by 32.":"）。 小图像为16 x 16，大图像为32 x 32。"," that specifies the type of image and color that will be affected by the color-adjustment matrix.":"这指定了将受颜色调整矩阵影响的图像和颜色的类型。","The file to load the ":"加载的文件"," delegate that specifies a method to call during the drawing of the image. This method is called frequently to check whether to stop execution of the ":"该委托指定在图像绘制过程中呼叫的方法。 此方法经常被调用以检查是否停止执行"," object does not already have a small image, this method searches for a bitmap resource in the assembly that defines the type specified by the type parameter. For example, if you pass typeof(ControlA) to the type parameter, then this method searches the assembly that defines ControlA.":"对象尚未有一个小图像，此方法搜索了汇编中定义类型参数指定的类型中的位图资源。 例如，如果将typeof（ControlA）传递到类型参数，则此方法搜索定义ControlA的程序集。","The name and path to the file that contains the icon data.":"包含图标数据的文件的名称和路径。"," that specifies the default page settings for the document.":"这指定了文档的默认页面设置。"," that specifies the category for which the color-adjustment matrix is set.":"这指定了设置颜色调整矩阵的类别。"," object does not already have a small image, this method searches for a bitmap resource in the assembly that defines the type specified by the component type. For example, if you pass typeof(ControlA) to the type parameter, then this method searches the assembly that defines ControlA.":"对象尚未有一个小图像，此方法搜索了汇编中定义组件类型指定的类型的位图资源。 例如，如果将typeof（ControlA）传递到类型参数，则此方法搜索定义ControlA的程序集。"," method according to application-determined criteria.":" 方法根据应用确定的标准。","The document name to display while printing the document. The default is \"document\".":"打印文档时要显示的文档名称。 默认值为“文档”。","The name and path to the file that contains the ":"包含文件的名称和路径","The gamma correction value.":"伽马校正值。","Value specifying additional data for the ":"为指定其他数据的值"," object does not already have a small image, this method searches for an embedded bitmap resource in the assembly that defines the type specified by the component type. For example, if you pass typeof(ControlA) to the type parameter, then this method searches the assembly that defines ControlA.":"对象尚未有一个小图像，此方法搜索了汇编中嵌入的位图资源，该资源定义了由组件类型指定的类型。 例如，如果将typeof（ControlA）传递到类型参数，则此方法搜索定义ControlA的程序集。"," if the graphics origin starts at the page margins; ":"如果图形来源从页面边距开始；","The desired width of the ":"所需的宽度"," enumeration that specifies the category for which the gamma value is set.":"指定设置伽马值的类别的枚举。"," delegate to use when checking whether to stop execution of the ":"检查是否停止执行时要使用","The desired height of the ":"所需的高度","This method searches for an embedded bitmap resource in the assembly that defines the type specified by the t parameter. For example, if you pass typeof(ControlA) to the t parameter, then this method searches the assembly that defines ControlA.":"此方法在定义由t参数指定的类型的程序集中搜索嵌入的位图资源。 例如，如果将typeof(ControlA)传递给t参数，则此方法将搜索定义ControlA的程序集。"," if the graphics origin is at the top-left corner of the printable page. The default is ":"如果图形来源位于可打印页面的左上角。 默认值为"," that specifies the category for which color correction is turned off.":"这指定了关闭颜色校正的类别。"," structure that represents the upper-left corner of the drawn image.":"代表绘制图像的左上角的结构。"," that specifies the assembly in which to look for the resource.":"这指定了寻找资源的组件。","Specifies whether this method returns a large image (true) or a small image (false). The small image is 16 by 16, and the large image is 32 x 32.":"指定此方法是返回大图（true）还是小图像（false）。 小图像为16 x 16，大图像为32 x 32。"," that specifies the output channel.":"指定输出通道。"," that guides the printing process. The default is a new instance of the ":"这指导印刷过程。 默认值是","The resource name to load.":"加载的资源名称。"," object based on the retrieved bitmap.":"基于检索到的位图的对象。"," structure that specifies the location and size of the drawn image.":" 指定绘制图像的位置和大小的结构。"," that specifies the category for which the output channel is set.":"这指定了设置输出通道的类别。"," that specifies where and how the document is printed. The default is a ":"这指定了文档的打印位置和方式。 默认值为"," value that represents the error message.":"代表错误消息的值。","An object that can be cast to an ":"可以施放到一个的对象"," structure that specifies the location and size of the drawn image. The image is scaled to fit the rectangle.":"指定绘制图像的位置和大小的结构。 将图像缩放以适合矩形。","The path name of a color-profile file. If the color-profile file is in the %SystemRoot%\\System32\\Spool\\Drivers\\Color directory, this parameter can be the file name. Otherwise, this parameter must be the fully qualified path name.":"颜色框文件的路径名。 如果颜色框文件在％SystemRoot％\\ System32 \\ Spool \\ drivers \\ color Directory中，则该参数可以是文件名。 否则，此参数必须是完全合格的路径名。"," with its properties set to their default values.":" 其属性设置为默认值。","The path to the file that contains an image.":"包含图像的文件的路径。"," that specifies the category for which the output channel color-profile file is set.":"这指定了设置输出通道颜色框文件的类别。"," property, which represents the cause of the current exception.":"属性，代表当前异常的原因。","The x-coordinate of the upper-left corner of the portion of the source image to draw.":"绘制源图像部分的左上角的X坐标。"," representation of the image that is contained in the specified file.":"指定文件中包含的图像的表示。"," that contains information about the ":"其中包含有关","The y-coordinate of the upper-left corner of the portion of the source image to draw.":"绘制源图像部分左上角的Y坐标。"," value of the file that caused this error.":"引起此错误的文件的值。","An array of color pairs of type ":"一对彩色对类型","A Windows handle to an icon.":"Windows将图标处理到图标。",". Each color pair contains an existing color (the first value) and the color that it will be mapped to (the second value).":"。 每个颜色对包含现有颜色（第一个值）及其将映射到（第二个值）的颜色。"," that represents the name the file that caused the exception.":"这代表了导致异常的文件的名称。","The horizontal printer resolution, in dots per inch, if ":"水平打印机分辨率，以每英寸点为单位","Width of the portion of the source image to draw.":"绘制源图像部分的宽度。"," to save to.":"保存到。","The file IO permissions for the package.":"包装的文件IO权限。","; otherwise, a ":"; 否则，","Height of the portion of the source image to draw.":"绘制源图像部分的高度。"," that specifies the category for which the color-remap table is set.":"这指定了设置颜色显示表的类别。","A string that describes the ":"描述的字符串","The uniform resource identifier (URI) of the new part.":"新部分的统一资源标识符（URI）。","A real number that specifies the threshold value.":"一个指定阈值的实际数字。","The vertical printer resolution, in dots per inch.":"垂直打印机分辨率，每英寸点。"," enumeration that specifies the units of measure used to determine the source rectangle.":"指定用于确定源矩形的度量单位的枚举。","The Windows handle for the icon.":"Windows句柄的图标。","The content type of the data stream.":"数据流的内容类型。","A threshold value from 0.0 to 1.0 that is used as a breakpoint to sort colors that will be mapped to either a maximum or a minimum value.":"从0.0到1.0的阈值值用作分类颜色的断点，该颜色将映射到最大值或最小值。"," that specifies recoloring and gamma information for ":"这为重新涂上和伽马信息指定"," structure that specifies the width and height of this ":"指定此的宽度和高度的结构"," that contains information from a printer.":"其中包含来自打印机的信息。","Width of the drawn image.":"绘制图像的宽度。","The new created part.":"新创建的部分。"," that specifies the category for which the color threshold is set.":"这指定了设置颜色阈值的类别。"," to indicate the origin at the margins; otherwise, ":"指示边缘的起源； 否则，"," that specifies the type you want to convert to.":"这指定了您要转换为的类型。","Height of the drawn image.":"绘制图像的高度。"," that specifies how repeated copies of an image are used to tile an area.":"这指定了如何使用图像的重复副本将区域瓷砖瓷砖。","The URI of the new part.":"新部分的URI。"," that contains printer information from the ":"其中包含来自","If this method succeeds, it returns the ":"如果此方法成功，它将返回","The compression option for the data stream, ":"数据流的压缩选项，"," structure that specifies the upper-left corner of the drawn image.":"指定绘制图像的左上角的结构。"," object that specifies the color of pixels outside of a rendered image. This color is visible if the mode parameter is set to ":"对象指定渲染图像之外的像素的颜色。 如果将模式参数设置为"," to retrieve a graphics object for.":"检索图形对象。"," that it created by converting the specified object. Otherwise, it throws an exception.":"它通过转换指定的对象而创建的。 否则，它会引发异常。"," compression.":"压缩。"," and the source rectangle passed to ":"源矩形传递给"," that specifies the upper-left corner of the drawn image. The X and Y properties of the rectangle specify the upper-left corner. The Width and Height properties are ignored.":"这指定了绘制图像的左上角。 矩形的X和Y属性指定左上角。 宽度和高度属性被忽略。"," to retrieve a ":"检索一个"," object that specifies formatting conventions used by a particular culture.":"指定特定文化使用的格式约定的对象。","The uniform resource identifier (URI) for the part being created.":"为创建部分的统一资源标识符（URI）。"," in which to draw the image.":"在其中绘制图像。"," is larger than the image itself.":"比图像本身大。","The object to convert. This object should be of type icon or some type that can be cast to ":"要转换的对象。 此对象应为类型图标或某种类型的类型"," to specify the origin at the margins; otherwise, ":"在边缘指定原点； 否则，","The created part.":"创建的部分。","The type to convert the icon to.":"将图标转换为的类型。","A color object that specifies the color of pixels outside of a rendered image. This color is visible if the mode parameter is set to ":"一个颜色对象，指定渲染图像之外的像素的颜色。 如果将模式参数设置为"," that determines the color, width, and style of the line.":"这决定了行的颜色，宽度和样式。","This parameter has no effect. Set it to ":"该参数无效。 将其设置为"," structure that represents the first point to connect.":"结构表示连接的第一个点。","A handle to a ":"一个手柄 ","The uniform resource identifier (URI) of the target part.":"目标部分的统一资源标识符（URI）。","This method returns the converted object.":"此方法返回转换后的对象。"," object that the ":"对象"," structure that represents the second point to connect.":" 表示要连接的第二点的结构。","Indicates if the target part is ":"指示目标部分是"," representing the handle of a device context.":"表示设备上下文的手柄。"," object in the array contains information about one of the built-in image decoders.":" 数组中的对象包含有关内置图像解码器之一的信息。","The x-coordinate of the first point.":"第一点的X坐标。"," structure's handle corresponds to.":"结构的手柄对应于。"," to the package.":"到包。","A string that contains the name of the file from which to create the ":"一个包含文件的名称的字符串"," object in the array contains information about one of the built-in image encoders.":"数组中的对象包含有关内置图像编码器之一的信息。","The image to print.":"要打印的图像。","The y-coordinate of the first point.":"第一点的y坐标。","A URI that uniquely defines the role of the relationship.":"独特地定义关系作用的URI。"," structure that contains a GUID that identifies a specific codec.":"包含标识特定编解码器的GUID的结构。"," to use color management information embedded in the image file; otherwise, ":"使用图像文件中嵌入的颜色管理信息； 否则，"," if the printer supports printing the specified image; otherwise, ":" 如果打印机支持打印指定的图像；否则, ","The x-coordinate of the second point.":"第二点的X坐标。","The package-level relationship to the specified part.":"与指定部分的软件包级关系。","The GDI bitmap handle from which to create the ":"从中创建的GDI位图手柄","A string that contains the name of the codec.":"包含编解码器名称的字符串。"," if the printer supports printing the specified image format; otherwise, ":"如果打印机支持打印指定的图像格式； 否则，","The y-coordinate of the second point.":"第二点的y坐标。","A unique XML identifier.":"唯一的XML标识符。","A string that contains the path name of the DLL that holds the codec.":"包含保存编解码器的DLL的路径名的字符串。","A handle to a GDI palette used to define the bitmap colors if the bitmap specified in the ":"如果在"," if the printer supports double-sided printing; otherwise, ":"如果打印机支持双面打印； 否则，"," that determines the color, width, and style of the line segments.":"这决定了线段的颜色，宽度和样式。","The URI of the part to delete.":"删除零件的URI。"," parameter is not a device-independent bitmap (DIB).":"参数不是独立于设备的位图（DIB）。","A string that contains the file name extension(s) used in the codec.":"包含编解码器中使用的文件名扩展名（IS）的字符串。"," if the printed document is collated; otherwise, ":"如果打印文档已整理； 否则，"," structures that represent the points to connect.":" 表示要连接的点的结构。"," to delete.":"仪式。"," that contains the data for this ":"其中包含数据","The number of copies to print. The default is 1.":"要打印的副本数。 默认值为1。","A 32-bit value used to store additional information about the codec.":"用于存储有关编解码器的附加信息的32位值。"," that determines the color, width, and style of the path.":"这决定了路径的颜色，宽度和样式。","The uniform resource identifier (URI) of the part to return.":"要返回的零件的统一资源标识符（URI）。","A string that describes the codec's file format.":"描述编解码器文件格式的字符串。"," to use color management information embedded in the data stream; otherwise, ":" 以使用嵌入在数据流中的颜色管理信息；否则, "," that represents the default page settings for this printer.":" 这表示此打印机的默认页面设置。"," that determines the color, width, and style of the pie shape.":"这决定了馅饼形状的颜色，宽度和样式。","The part with the specified ":"指定的部分"," structure that contains a GUID that identifies the codec's format.":"包含标识编解码器格式的GUID的结构。"," to validate the image data; otherwise, ":"验证图像数据； 否则，"," values. The default is determined by the printer.":" 价值观。 默认值由打印机决定。"," structure that represents the bounding rectangle that defines the ellipse from which the pie shape comes.":"代表定义饼形出现的椭圆形的边界矩形的结构。","The uniform resource identifier (URI) of the part to retrieve.":"要检索的零件的统一资源标识符（URI）。"," values indicating the unit of measure for the bounding rectangle.":"表示边界矩形的度量单位的值。","A string that contains the codec's Multipurpose Internet Mail Extensions (MIME) type.":"包含编解码器多功能Internet邮件扩展（MIME）类型的字符串。","The requested part; or ":"请求的部分； 或者","The page number of the first page to print.":"要打印的第一页的页码。"," that represents the bounds of the image, in the specified unit.":"这代表指定单元中图像的边界。","Angle measured in degrees clockwise from the x-axis to the first side of the pie shape.":"从x轴到饼形的第一侧顺时针测量的角度。","A two dimensional array of bytes that can be used as a filter.":"可以用作过滤器的二维字节数组。",", if a part with the specified ":"，如果有指定的部分","A GUID that specifies the image encoder.":"指定图像编码器的GUID。"," that represents the names of all printers installed on the computer.":" 这表示计算机上安装的所有打印机的名称。","A two dimensional array of bytes that represents the signature of the codec.":"代表编解码器签名的字节的二维数组。"," is not in the package.":"不在包装中。","Angle measured in degrees clockwise from the ":"以顺时针角度测量的角度 "," that contains an array of ":" 它包含一个数组 "," designates the default printer; otherwise, ":"指定默认打印机； 否则，"," parameter to the second side of the pie shape.":"参数到派形状的第二侧。"," objects. Each ":"对象。 每个"," elements that are contained in the package.":" 包中包含的元素。","The version number of the codec.":"编解码器的版本号。"," if the printer is a plotter; ":"如果打印机是绘图仪；","The x-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse from which the pie shape comes.":"边界矩形左上角的X坐标，该矩形定义了派形状的椭圆形。"," contains information about one of the parameters supported by the specified image encoder.":"包含有关指定图像编码器支持的参数之一的信息。","An array of all the parts that are contained in the package.":"包装中包含的所有零件的数组。"," structure that specifies a particular image format.":"指定特定图像格式的结构。"," if the printer is a raster.":"如果打印机是栅格。","The y-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse from which the pie shape comes.":"边界矩形左上角的y坐标，用于定义饼图形状来自的椭圆。"," that specifies the identity of the dimension type.":"这指定了维度类型的身份。"," of the relationship to return.":"返回的关系。"," object that is equivalent to this ":"等效于此的对象"," property designates a valid printer; otherwise, ":"属性指定有效的打印机； 否则，","Width of the bounding rectangle that defines the ellipse from which the pie shape comes.":"定义派形状的椭圆形的边界矩形的宽度。","The number of frames in the specified dimension.":"指定维度中的帧数。","The package-level relationship with the specified ":"包装级的关系与指定的","A hash code that represents this object.":"表示该对象的哈希代码。","The angle, in degrees, that the portrait orientation is rotated to produce the landscape orientation.":"肖像方向旋转以产生景观方向的角度。","Height of the bounding rectangle that defines the ellipse from which the pie shape comes.":"定义派形状的椭圆形的边界矩形的高度。"," member that specifies the format for which to find the size.":"指定要找到大小的格式的成员。","A collection of all the package-level relationships that are contained in the package.":"包含在软件包中的所有软件包级关系的集合。"," object that indicates the bitmap image format.":"表示位图图像格式的对象。","The maximum number of copies that the printer enables the user to print at a time.":"打印机使用户一次打印的最大副本数量。"," to match and return in the collection.":"匹配并返回集合。"," object that indicates the enhanced metafile image format.":"表示增强的Metafile图像格式的对象。"," that determines the color, width, and style of the polygon.":" 这决定了多边形的颜色、宽度和样式。","The color depth of the specified pixel format.":"指定像素格式的颜色深度。"," that can be selected in a ":"可以在","The ID of the property item to get.":"要获取的属性项目的ID。"," object that indicates the Exif format.":"表示EXIF格式的对象。"," structures that represent the vertices of the polygon.":"代表多边形顶点的结构。","A collection of package-level relationships that match the specified ":"匹配指定的软件包级关系的集合","The minimum ":"最低"," this method gets.":"此方法得到。"," object that indicates the GIF image format.":"表示GIF图像格式的对象。","The IO stream on which to open the package.":"可以打开包装的IO流。"," that represents the paper sizes that are supported by this printer.":"这代表了该打印机支持的纸张尺寸。"," that determines the color, width, and style of the rectangle.":"这决定了矩形的颜色，宽度和样式。","The opened package.":"打开的包裹。"," structure that represents this ":"代表这一点的结构","The width, in pixels, of the requested thumbnail image.":"请求的缩略图图像的宽度（以像素为单位）。"," that represents the paper source trays that are available on this printer.":"这代表了该打印机上可用的纸源托盘。"," structure that represents the rectangle to draw.":"代表要绘制的矩形的结构。"," object that indicates the Windows icon image format.":"指示Windows图标格式的对象。","The file mode in which to open the package.":"打开包装的文件模式。","The height, in pixels, of the requested thumbnail image.":"所请求的缩略图图像的高度，像素。","The x-coordinate of the upper-left corner of the rectangle to draw.":"矩形的左上角的X坐标。","The name of the printer to use.":"使用打印机的名称。","The file access in which to open the package.":"可以在其中打开包的文件访问。"," object that indicates the JPEG image format.":"表示JPEG图像格式的对象。"," delegate.  \n  \n Note You must create a delegate and pass a reference to the delegate as the ":"代表。 \n  \n  注意，您必须创建一个委托，并将对委托的引用作为"," that represents the resolutions that are supported by this printer.":"这代表了该打印机支持的分辨率。","The y-coordinate of the upper-left corner of the rectangle to draw.":"矩形左上角的Y坐标。","The path and file name of the package.":"软件包的路径和文件名。"," object that indicates the format of a bitmap in memory.":"表示内存中位图格式的对象。"," parameter, but the delegate is not used.":"参数，但不使用委托。","Width of the rectangle to draw.":"矩形绘制的宽度。","The file name, when printing to a file.":"文件名，当打印到文件时。","The file sharing mode in which to open the package.":"可以打开包装的文件共享模式。"," object that indicates the PNG image format.":"表示PNG图像格式的对象。","Must be ":"一定是"," object that indicates the TIFF image format.":"表示TIFF图像格式的对象。"," of the part to check for.":"要检查的零件。"," if the printing output is sent to a file; otherwise, ":"如果将打印输出发送到文件； 否则，","Height of the rectangle to draw.":"矩形的高度绘制。"," that represents the thumbnail.":"这代表缩略图。"," if a part with the specified ":"如果有指定的部分","The width of the rectangle to draw.":"矩形绘制的宽度。"," if this printer supports color; otherwise, ":"如果此打印机支持颜色； 否则，"," object that indicates the Windows metafile image format.":" 指示Windows图元文件图像格式的对象。"," contains alpha information; otherwise, ":"包含alpha信息； 否则，"," is in the package; otherwise, ":"在包装中； 否则，","The number of the last page to print.":"要打印的最后一页的数量。","The height of the rectangle to draw.":"矩形的高度绘制。"," is canonical; otherwise, ":"是规范的； 否则，","A handle to an enhanced metafile.":"增强的元素的手柄。"," of the relationship to check for.":"需要检查的关系。"," enumeration to test.":"枚举进行测试。","A zero-based array that receives the items copied from the ":"一个基于零的数组，该数组接收从"," to delete the enhanced metafile handle when the ":"删除增强的元手柄时"," that determines the color, width, and style of the outlines of the rectangles.":"这决定了矩形轮廓的颜色，宽度和样式。"," if a package-level relationship with the specified ":"如果包装级的关系与指定的"," is extended; otherwise, ":"被扩展； 否则，"," is deleted; otherwise, ":"被删除； 否则，"," structures that represent the rectangles to draw.":"代表要绘制的矩形的结构。","The index at which to start copying items.":"开始复制项目的索引。","The handle to a device context.":"设备上下文的手柄。"," values: ":"值：","String to draw.":"绘制的字符串。","The ID of the property item to remove.":"要删除的属性项目的ID。","A zero-based array that receives the items copied from the collection.":"一个基于零的数组，该数组接收从集合中复制的项目。"," that specifies the format of the ":"指定了","The core properties of the package.":"软件包的核心属性。"," member that specifies the type of rotation and flip to apply to the image.":"指定旋转类型和翻转以应用于图像的成员。"," that defines the text format of the string.":"定义字符串的文本格式。","An enumerator associated with the collection.":"与该集合关联的枚举者。","A descriptive name for the new ":"新的名称"," of the part.":"部分。"," that determines the color and texture of the drawn text.":"这决定了绘制文本的颜色和纹理。","The number of different paper sizes in the collection.":"集合中不同纸张尺寸的数量。"," where the image will be saved.":"将保存图像的位置。","The URI of the part, relative to the parent ":"零件的URI，相对于父母","A windows handle to a ":"窗户处理","The destination array for the contents of the collection.":"集合内容的目的地阵列。"," that specifies parameters used by the image encoder.":"这指定图像编码器使用的参数。"," structure that specifies the upper-left corner of the drawn text.":"指定绘制文本的左上角的结构。"," that specifies the format of the saved image.":"这指定了保存图像的格式。","The index at which to start the copy operation.":"启动复制操作的索引。"," to delete the handle to the new ":"删除新的手柄"," root.":"根。"," that specifies formatting attributes, such as line spacing and alignment, that are applied to the drawn text.":"这指定应用于绘制文本的格式属性，例如线间距和对齐。","A string that contains the name of the file to which to save this ":"一个包含文件名的字符串保存此文件的名称","The number of different paper sources in the collection.":"集合中不同纸张来源的数量。","The MIME content type of the part data stream.":"零件数据流的MIME内容类型。"," that represents the rectangle that bounds the new ":"代表界限新的矩形"," to use for this ":"为此"," structure that specifies the location of the drawn text.":"指定绘制文本的位置的结构。","The number of available printer resolutions in the collection.":"集合中可用的打印机分辨率的数量。"," that specifies the unit of measure for ":"这指定了措施单位","The x-coordinate of the upper-left corner of the drawn text.":"绘制文本的左上角的X坐标。","The MIME content type of the part's data stream.":"零件数据流的MIME内容类型。"," that contains the frame to add.":"其中包含要添加的框架。","The string to add to the collection.":"添加到集合中的字符串。"," that contains a descriptive name for the new ":"其中包含新的名称","The y-coordinate of the upper-left corner of the drawn text.":"绘制文本的左上角的Y坐标。","The compression option of the part data stream.":"零件数据流的压缩选项。","The array for items to be copied to.":"要复制的物品的数组。"," that holds parameters required by the image encoder that is used by the save-add operation.":"保存了保存ADD操作所使用的图像编码器所需的参数。","The URI of the target part.":"目标部分的URI。","A Windows handle to a device context.":"Windows处理设备上下文。"," that represents the container this method restores.":"代表容器此方法还原。","One of the enumeration values. For example, ":"枚举值之一。 例如，","The index of the active frame.":"活动帧的索引。","The number of strings in the collection.":"集合中的字符串数。"," that represents the file name from which to create the new ":"代表创建新的文件名"," structure that specifies the location of the upper-left corner of the drawn metafile.":"指定绘制元元素左上角的位置的结构。","Always returns 0.":"总是返回0。","The unit to convert from.":"要转换的单元。"," if the target part is inside the ":"如果目标部分在"," that represents the file name of the new ":"代表新的文件名"," delegate that specifies the method to which the metafile records are sent.":"委托指定了发送元记录的方法。"," to be stored.":"存储。"," if the target is a resource outside the ":"如果目标是以外的资源","The unit to convert to.":"要转换的单元。"," structure that represents the rectangle that bounds the new ":"代表构成新的矩形的结构","The integer representing a bitwise combination of ":"整数代表一定的位组合","Internal pointer that is required, but ignored. You can pass ":"需要的内部指针，但被忽略了。 你可以通过","The role of the relationship.":"关系的作用。","The value being converted.":"值转换的值。","A Windows handle to this enhanced ":"窗户处理此增强的","An array of GUIDs that specify the dimensions of frames within this ":"一系列指定框架尺寸的GUIDS"," used to paint the item.":"用于绘画物品。"," for this parameter.":"对于此参数。","The part-level relationship between this ":"这之间的零件级关系","The handle to the enhanced ":"增强的手柄","The area between the margins.":"边缘之间的区域。"," that specifies image attribute information for the drawn image.":"这为绘制图像指定图像属性信息。"," from most significant to least significant.":"从最重要到最不重要的。"," for which a header is returned.":"为此返回标题。"," to the target ":"到目标","The total area of the paper.":"纸的总面积。","The handle to the ":"手柄","The horizontal resolution, in pixels per inch, of this ":"水平分辨率，以每英寸像素为单位"," structure that specifies the portion of the metafile, relative to its upper-left corner, to draw.":"指定元位相对于其上左上角的部分的结构。"," if the print job should be canceled; otherwise, ":"如果应该取消打印作业； 否则，"," or external resource.":"或外部资源。"," that represents the color palette used for this ":"代表用于此的调色板"," enumeration that specifies the unit of measure used to determine the portion of the metafile that the rectangle specified by the ":"指定用于确定矩形指定的元素部分的测量单位的枚举"," for which to return a header.":"为此返回标头。"," used to paint the page.":"用于绘画页面。","A unique ID for the relationship.":"关系的独特ID。"," parameter contains.":"参数包含。"," for which a header is retrieved.":"为此检索标题。"," structure that represents the width and height of this ":"代表此的宽度和高度的结构"," if an additional page should be printed; otherwise, ":"如果应该打印额外的页面； 否则，"," structures that define a parallelogram that determines the size and location of the drawn metafile.":"定义平行四边形的结构，该平行四边形决定绘制的元素的大小和位置。"," of the relationship to delete.":"删除的关系。"," that represents the pixel format for this ":"代表此的像素格式","Element of the ":"元素","The MIME type of the part content.":"零件内容的MIME类型。","The rectangular area, measured in hundredths of an inch, that represents the portion of the page inside the margins.":"矩形区域以百分之一英寸的形式测量，代表边缘内部的页面部分。"," structures that specifies the portion of the metafile, relative to its upper-left corner, to draw.":"指定元位相对于其上左上角的部分的结构。","An array of the property IDs, one for each property item stored in this image.":"属性ID的数组，一个存储在此图像中的每个属性项目的数组。","The relationship that matches the specified ":"与指定的关系匹配的关系"," that specifies the type of metafile record being played.":"这指定了正在播放的元记录的类型。","The rectangular area that represents the total area of the page.":"代表页面总面积的矩形区域。"," structure that specifies the location and size of the drawn metafile.":"指定绘制元素的位置和大小的结构。"," objects, one for each property item stored in the image.":"对象，一个存储在图像中的属性项目。","A set of flags that specify attributes of the record.":"一组指定记录属性的标志。","A collection of all the relationships that are owned by the part.":"部件所拥有的所有关系的集合。","The page settings for the current page.":"当前页面的页面设置。"," structure that specifies the rectangle to exclude from the clip region.":"指定矩形以排除夹子区域的结构。"," that represents the file format of this ":"代表此文件格式"," that specifies the region to exclude from the clip region.":"这指定了从剪辑区域排除的区域。","The number of bytes in the record data.":"记录数据中的字节数。"," of the relationships to locate and return in the collection.":"在收藏中找到和返回的关系。","The page settings for the page to be printed.":"要打印的页面的页面设置。"," structure that represents the width and height, in pixels, of this image.":"代表此图像的宽度和高度的结构。"," that determines the characteristics of the fill.":"这决定了填充的特征。"," that provides additional data about the image.":"提供有关图像的其他数据。","A collection of the relationships that match the specified ":"匹配指定的关系的集合","An array of bytes that contains the record data.":"包含记录数据的字节数组。"," enumeration that determines how the curve is filled.":"确定曲线如何填充的枚举。"," that represents the document being printed.":"这代表正在打印的文档。"," that contains data about how to print a page in the document.":"其中包含有关如何在文档中打印页面的数据。","The content data stream for the part.":"该零件的内容数据流。","The vertical resolution, in pixels per inch, of this ":"垂直分辨率，以每英寸像素为单位"," is device dependent; otherwise, ":"是设备依赖的； 否则，"," structure that represents the bounding rectangle that defines the ellipse.":" 表示定义椭圆的边界矩形的结构。"," that contains data about how to print a page in the document. Initially, the ":"其中包含有关如何在文档中打印页面的数据。 最初，","The width, in pixels, of this ":"以像素为单位的宽度","The I/O mode in which to open the content stream.":"打开内容流的I/O模式。"," is in the Windows enhanced metafile format; otherwise, ":"在Windows增强的Metafile格式中； 否则，"," that represents the path to fill.":"这代表了填充的路径。",". The value returned from the ":"。 从","The content stream of the part.":"零件的内容流。"," method should prematurely stop execution; otherwise, it returns ":"方法应过早停止执行； 否则，它返回"," structure that represents the bounding rectangle that defines the ellipse from which the pie section comes.":"代表定义饼段来定义椭圆的边界矩形的结构。"," method will be used to set this property.":"方法将用于设置此属性。"," is in the Windows enhanced metafile format or the Windows enhanced metafile plus format; otherwise, ":"在Windows增强的元数据格式或Windows增强的Metafile Plus格式中； 否则，","The access permissions to use in opening the content stream.":"打开内容流的访问权限。"," object that specifies the method that is called when the animation frame changes.":"指定动画帧更改时称为方法的对象。","Angle in degrees measured clockwise from the x-axis to the first side of the pie section.":"从x轴到饼状部分的第一侧顺时针测量的角度。"," object that represents a page from a ":"代表一个页面的对象"," is in the Windows enhanced metafile plus format; otherwise, ":"在Windows增强的Metafile Plus格式中； 否则，"," parameter to the second side of the pie section.":"参数到PIE部分的第二侧。"," object to test.":"对象进行测试。"," that defines the new ":"定义了新的","The content stream for the part.":"零件的内容流。"," is in the Dual enhanced metafile format; otherwise, ":"处于双重增强的元素格式； 否则，","The x-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse from which the pie section comes.":"边界矩形左上角的X坐标，该矩形定义了派截面的椭圆形。","The content data stream of the part.":"零件的内容数据流。"," if the specified image contains time-based frames; otherwise, ":"如果指定的图像包含基于时间的帧； 否则，"," supports only the Windows enhanced metafile plus format; otherwise, ":"仅支持Windows增强的Metafile Plus格式； 否则，"," that defines the interior of the new ":"定义了新的内部","The y-coordinate of the upper-left corner of the bounding rectangle that defines the ellipse from which the pie section comes.":"边界矩形左上角的Y坐标，该矩形定义了派截面的椭圆形。"," is in the Windows metafile format; otherwise, ":"在Windows Metafile格式中； 否则，"," object to stop animating.":"对象停止动画。"," if this part owns a relationship with the specified ":"如果该部分与指定的关系","Width of the bounding rectangle that defines the ellipse from which the pie section comes.":"定义派截面的椭圆形的边界矩形的宽度。"," structure that defines the interior of the new ":"定义新内部的结构"," object for which to update frames.":"要更新帧的对象。"," is in the Windows placeable metafile format; otherwise, ":"在Windows可放置的Metafile格式中； 否则，"," to complement this ":"补充这一点","Height of the bounding rectangle that defines the ellipse from which the pie section comes.":"定义饼截面的椭圆形的边界矩形的高度。","The compression option of the part content stream.":"零件内容流的压缩选项。","A formatter context. This object can be used to get more information about the environment this converter is being called from. This may be ":"格式化上下文。 该对象可用于获取有关此转换器的更多信息。 这可能是"," structure to complement this ":"补充这一点的结构"," that bounds the associated ":"界限关联"," structures that represent the vertices of the polygon to fill.":"代表多边形的顶点的结构。","The MIME type of the content data stream for the part.":"该零件的内容数据流的MIME类型。","The set of properties that should be exposed for this data type. If no properties should be exposed, this can return ":"该数据类型应公开的一组属性。 如果不应该暴露财产，则可以返回","The horizontal resolution, in dots per inch, of the associated ":"相关的水平分辨率，每英寸点。"," enumeration that determines the style of the fill.":"确定填充方式的枚举。"," object to complement this ":" 反对补充这一点 "," that specifies the context for this type conversion.":"这指定了此类型转换的上下文。","The vertical resolution, in dots per inch, of the associated ":"相关的垂直分辨率，每英寸点。"," that represents a drawing surface.":"这代表图表。"," structure that represents the rectangle to fill.":"代表要填充的矩形的结构。","The parent package of the part.":"零件的父包。"," that represents the type to which you want to convert this ":"这代表您要转换的类型","The size, in bytes, of the enhanced metafile plus header file.":"增强的Metafile Plus标头文件的大小，字节。"," if the interior of region is identical to the interior of this region when the transformation associated with the ":"如果区域的内部与该区域的内部相同，当","The URI of the part relative to the package root.":"相对于包装根的零件的URI。","The x-coordinate of the upper-left corner of the rectangle to fill.":"矩形的左上角的X坐标填充。"," object that specifies formatting conventions for a particular culture.":"为特定文化指定格式惯例的对象。","The logical horizontal resolution, in dots per inch, of the associated ":"相关联的逻辑水平分辨率（以每英寸点数为单位） "," parameter is applied; otherwise, ":"应用参数； 否则，","An enumerator for iterating through the ":"通过迭代的枚举者","The y-coordinate of the upper-left corner of the rectangle to fill.":"矩形左上角的Y坐标填充。","A collection that contains a standard set of valid values, or ":"包含一组标准有效值的集合，或 "," to exclude from this ":"排除在这个","The logical vertical resolution, in dots per inch, of the associated ":"相关的逻辑垂直分辨率，每英寸点。"," elements in the collection.":"集合中的元素。"," method should be called to find a common set of values the object supports.":"应调用方法以找到对象支持的共同值。","Width of the rectangle to fill.":"矩形的宽度填充。"," structure to exclude from this ":" 从这个排除的结构 ","The size, in bytes, of the associated ":"相关的大小，字节","The category of the content that is contained in the ":"内容中包含的内容类别","The pixel height of the ":"像素的高度","Height of the rectangle to fill.":"矩形的高度填充。","A handle to an existing ":"现有的手柄"," enumeration that represents the type of the associated ":"代表相关类型的枚举","The type of content that is contained in the ":"内容中包含的内容类型"," structures that represent the rectangles to fill.":" 表示要填充的矩形的结构。"," that specifies the format of the pixel information in the associated ":"这指定了关联中的像素信息的格式","The version number of the associated ":"关联的版本号"," on which this ":"在哪个","The date and time the ":"日期和时间","Reserved. Do not use.":"预订的。 不使用。"," that contains the WMF header file for the associated ":"其中包含关联的WMF标头文件"," that represents the area to fill.":"这代表了要填充的区域。"," is drawn.":"绘制。"," enumeration that specifies whether the method returns immediately or waits for any existing operations to finish.":"指定该方法是立即返回还是等待任何现有操作完成的枚举。"," was initially created.":"最初是创建的。","The size, in bytes, of the header file.":"标题文件的大小，字节。","The address of the first pixel data in the bitmap.":"位图中第一像素数据的地址。","Handle to a device context.":"处理设备上下文。"," structure that represents the bounding rectangle for this ":"代表边界矩形的结构","The stride width, in bytes, of the ":"大步的宽度，字节","The size, in bytes, of the largest record in the associated ":"相关的最大记录的大小，字节"," on the specified drawing surface.":"在指定的图纸表面上。","The individual or entity that created the ":"创建的个人或实体","This method returns a new ":"此方法返回新的","The pixel width of the ":"像素的宽度","The maximum number of objects that exist in the ":"在"," that represents the information that describes this ":"代表描述这一点的信息"," for the specified device context.":"对于指定的设备上下文。"," structure to which to convert.":"要转换的结构。"," that represents a geometric transformation to apply to the region.":"这代表了适用于区域的几何变换。"," object at the same time.":"同时对象。"," and its content.":" 及其内容。","Handle to a device.":"处理设备。","A description of the content contained in the ":"对包含的内容的描述","Always 0.":"总是0。","The values of the elements for the new ":"新元素的值"," structures that approximate this ":" 近似于此的结构 "," for the specified device context and device.":"对于指定的设备上下文和设备。","A value that unambiguously identifies the ":"一个明确识别的价值","The row of the element.":"元素的行。","Handle to a window.":"处理窗口。","The version number of the header format.":"标题格式的版本编号。"," after the specified matrix transformation is applied.":"在应用指定的矩阵转换之后。","The column of the element.":"元素的列。","A delimited set of keywords to support searching and indexing the ":"一组划界集以支持搜索和索引的关键字集"," for the specified window handle.":"对于指定的窗口手柄。","The integer that represents the ID of the property.":"表示属性ID的整数。"," to intersect with this ":" 与此相交 ","The element at the specified row and column.":"指定行和列的元素。"," and content.":" 和内容。"," representing the cumulative graphics context.":"代表累积图形上下文。","An integer that represents the length (in bytes) of the ":"一个代表长度（字节）的整数"," structure to intersect with this ":"与此相交的结构","The element at the 0 row and 0 column of this ":"该元素在此的0行和0列"," content language.":"内容语言。","Internal pointer that specifies the handle to the palette.":"指定调色板句柄的内部指针。"," byte array.":"字节阵列。"," if the interior of this ":"如果这个内部","The element at the 0 row and first column of this ":"该元素的0行和第一列的元素","The user who last modified the ":"上次修改的用户","Handle to the device context associated with this ":"处理与此关联的设备上下文","An integer that defines the type of data contained in ":"一个定义包含的数据类型的整数"," is empty when the transformation associated with ":"当转换与之关联时为空","The element at the 0 row and second column of this ":"在此的0行和第二列的元素"," structure for which to find a match.":"找到匹配的结构。"," content was last printed.":"内容是最后印刷的。","A byte array that represents the value of the property item.":"代表属性项目值的字节数组。"," is applied; otherwise, ":"被申请;被应用; 否则，","The element at the 0 row and third column of this ":"该元素在此的0行和第三列"," structure that represents the nearest color to the one specified with the ":"结构代表最近颜色的结构"," was last changed.":" 最后一次改变。","The y-coordinate of the lower-right corner of the bounding rectangle of the metafile image on the output device.":"输出设备上元图映像的边界矩形的右角的y坐标。"," is infinite when the transformation associated with ":"当与之相关的转换是无限的","The element at the 0 row and fourth column of this ":"该元素在此的0行和第四列","The revision number of the ":"修订号"," structure to intersect with the current clip region.":"与当前夹区相交的结构。"," structure to test.":"测试结构。","The x-coordinate of the upper-left corner of the bounding rectangle of the metafile image on the output device.":"输出设备上元图像的边界矩形的左上角的X坐标。","The topic of the ":"主题"," that represents a graphics context.":"这代表图形上下文。","The element at the first row and 0 column of this ":"第一行和0列的元素","The x-coordinate of the lower-right corner of the bounding rectangle of the metafile image on the output device.":"输出设备上元图映像的边界矩形的右角的X坐标。"," to intersect with the current region.":" 以与当前区域相交。","The name given to the ":"给出的名称","The element at the first row and first column of this ":"这个第一行和第一列的元素 ","The y-coordinate of the upper-left corner of the bounding rectangle of the metafile image on the output device.":"输出设备上元图像的边界矩形的左上角的Y坐标。"," structure to test for visibility.":"测试可见性的结构。"," when any portion of ":" 当任何部分 ","The version number of the ":"版本编号","The checksum value for the previous ten ":"前十个校验和值","The element at the first row and second column of this ":"第一行和第二列的元素"," when any portion of the ":"当该部分的任何部分"," if the point specified by the ":"如果指定的点由"," s in the header.":"s在标题中。","The element at the first row and third column of this ":"第一行和第三列的元素","A string that identifies the relationship.":"识别关系的字符串。"," when the specified point is contained within this ":"当指定点包含在此中时","The handle of the metafile in memory.":"内存中的元素手柄。"," parameter is contained within the visible clip region of this ":"参数包含在此的可见夹区域内","The x-coordinate of the upper-left corner of the rectangle to test.":"矩形的左上角的X坐标进行测试。","The package that contains this relationship.":"包含这种关系的软件包。","The element at the first row and fourth column of this ":"这个第一行和第四列的元素 ","The number of twips per inch.":"每英寸的旋转数量。"," if the rectangle specified by the ":"如果矩形由","The x-coordinate of the point to test for visibility.":"要测试可见性的点的 x 坐标。","The y-coordinate of the upper-left corner of the rectangle to test.":"矩形左上角的Y坐标进行测试。","The qualified type name of the relationship.":"关系的合格类型名称。","The element at the second row and 0 column of this ":"第二行和0列的元素","A value indicating presence of a placeable metafile header.":"表示存在可放置元标头的值。","The width of the rectangle to test.":"矩形的宽度进行测试。","The y-coordinate of the point to test for visibility.":"要测试可见性的点的y坐标。"," that owns the relationship.":"拥有关系。","The element at the second row and first column of this ":"第二行和第一列的元素"," that determines the fill properties of this ":"决定了这一点的填充属性","The height of the rectangle to test.":"矩形的高度进行测试。"," if the point defined by the ":"如果点由","An enumeration value that indicates whether ":"枚举价值，指示是否","The element at the second row and second column of this ":"第二行和第二列的元素"," parameters is contained within the visible clip region of this ":"参数包含在此的可见夹区域内"," that determines the characteristics of this ":"决定了这一点的特征"," when any portion of the specified rectangle is contained within this ":"当其中包含指定矩形的任何部分","The element at the second row and third column of this ":"第二行和第三列的元素","The width of the new ":"新的宽度"," to unite with this ":"团结起来"," references a resource ":" 引用资源 ","The x-coordinate of the upper-left corner of the rectangle to test for visibility.":"矩形左上角的X坐标以测试可见性。","The element at the second row and fourth column of this ":"第二行和第四列的元素"," structure to unite with this ":"结合在一起","The URI of the target resource.":"目标资源的URI。"," structure that indicates the color of this ":"指示此颜色的结构","The y-coordinate of the upper-left corner of the rectangle to test for visibility.":"矩形左上角的Y坐标以测试可见性。","The element at the third row and 0 column of this ":"第三行和0列的元素"," with this ":"有了这个","A value indicating the width of this ":"表示宽度的值","Do not use - use ":"不要使用 - 使用","The element at the third row and first column of this ":"第三行和第一列的元素"," structure to ":"结构","Width of the rectangle to test for visibility.":"要测试可见性的矩形的宽度。"," that can be cast to a ":"可以施放到","The uniform resource identifier (URI) of the ":"统一资源标识符（URI）","The element at the third row and second column of this ":"第三行和第二列的元素"," structure that represents the color of this brush.":"代表此刷子的颜色的结构。","Height of the rectangle to test for visibility.":"矩形的高度测试可见性。"," object by which to multiply the transformation matrix.":"乘以转换矩阵的对象。","=\"/\") that owns the relationship.":"=“/”）拥有关系。"," object from which to initialize the new ":"从中初始化新的对象","The element at the third row and third column of this ":"第三行和第三列的元素"," by which to multiply the transformation matrix.":"通过它乘以转换矩阵。"," if the rectangle defined by the ":"如果矩形由",", either by relationship ":"，要么通过关系","The element at the third row and fourth column of this ":"第三行和第四列的元素"," enumeration for the new ":"新的枚举","The order in which to perform the multiplication operation.":"执行乘法操作的顺序。","String to measure.":"弦。","The element at the fourth row and 0 column of this ":"第四行和0列的元素","A value that indicates the language of the text.":"指示文本语言的值。","The factor by which to scale the transformation in the x-axis direction.":"在X轴方向上缩放转换的因素。"," or relationship ":"或关系"," structure that specifies the layout rectangle for the string.":"指定字符串布局矩形的结构。","The element at the fourth row and first column of this ":"第四行和第一列的元素","The factor by which to scale the transformation in the y-axis direction.":"在y轴方向上缩放转换的因素。","The qualification string that is used to select the relationships based on the ":"用于选择基于关系的关系的资格字符串","The number of spaces between the beginning of a text line and the first tab stop.":"文本行的开头和第一个选项卡停止之间的空间数。"," that represents formatting information, such as line spacing, for the string.":"这代表了字符串的格式化信息，例如线间距。","The package from which to select the relationships based on the selection criteria.":"根据选择标准从中选择关系的软件包。","The element at the fourth row and second column of this ":"第四行和第二列的元素","An array of distances (in number of spaces) between tab stops.":"选项卡之间的一个距离数组（在空间数中）停止。"," that represents the cap style to use at the beginning of lines drawn with this ":"这代表了在此绘制的线条开头使用的帽子样式","This method returns an array of ":"此方法返回一个数组","A list of relationships that match the selection parameters specified to the ":"与指定的选择参数匹配的关系列表","The element at the fourth row and third column of this ":"第四行和第三列的元素"," that represents the cap style to use at the end of lines drawn with this ":"这代表了在此绘制的线条结束时使用的帽子样式"," objects, each of which bounds a range of character positions within the specified string.":"对象，每个对象都在指定的字符串中范围内的一个字符位置范围。","A National Language Support (NLS) language identifier that identifies the language that will be used when local digits are substituted for western digits. You can pass the ":"国家语言支持（NLS）语言标识符，标识当地数字代替西方数字时将使用的语言。 你可以通过","The selection criteria based on the ":"基于"," that represents the cap style to use at the beginning or end of dashed lines drawn with this ":"这代表了在此绘制的虚线开始或结尾处使用的帽子样式"," object as the NLS language identifier. For example, suppose you create a ":"对象为NLS语言标识符。 例如，假设您创建一个","The element at the fourth row and fourth column of this ":"第四行和第四列的元素"," structure that represents the size, in the units specified by the ":"表示大小的结构，以","The selector type of ":"选择类型的类型"," object by passing the string \"ar-EG\" to a ":"对象通过将字符串“ AR-EG”传递到A"," structure that make up this ":"构成这个的结构"," that represents the alignment for this ":"这代表了这一点的一致性"," property, of the string specified by the ":"属性，由","The root package URI (\"/\") or part ":"root软件包URI（“/”）或零件"," constructor. If you pass the ":"构造函数。 如果您通过"," that determines attributes of this ":"决定了这一点的属性","The following flag values are valid:  \n  \n 0x00000001  \n The color values in the array contain alpha information.  \n  \n 0x00000002  \n The colors in the array are grayscale values.  \n  \n 0x00000004  \n The colors in the array are halftone values.":"以下标志值有效： \n  \n  0x00000001 \n  阵列中的颜色值包含alpha信息。 \n  \n  0x00000002 \n  阵列中的颜色是灰度值。 \n  \n  0x00000004 \n  阵列中的颜色是半半突值。"," parameter as drawn with the ":"参数与"," constructor as the owner of the relationship.":"构造者作为关系的所有者。"," property of that ":"该财产的财产"," structure that represents the color of this ":"代表此颜色的结构","A globally unique identifier that identifies an image encoder parameter category.":"标识图像编码器参数类别的全球唯一标识符。"," defines the text format of the string.":"定义字符串的文本格式。"," object along with ":"对象以及","The first pack URI.":"第一包URI。","An array of real numbers that specifies the compound array. The elements in the array must be in increasing order, not less than 0, and not greater than 1.":"一个指定化合物数组的实数数组。 阵列中的元素必须按序列增加，不少于0，而不大于1。"," structure that represents the upper-left corner of the string.":"表示字符串的左上角的结构。","The GUID that identifies an image encoder parameter category.":"标识图像编码器参数类别的GUID。"," method, then Arabic-Indic digits will be substituted for western digits at display time.":"方法，然后在展示时间将阿拉伯印度数字代替西方数字。","The second pack URI.":"第二包URI。"," that represents the cap used at the end of lines drawn with this ":"代表在此绘制的线末端使用的盖"," object that encapsulates the globally unique identifier of the parameter category.":"封装参数类别的全局唯一标识符的对象。"," structure that specifies the maximum layout area for the text.":"指定文本的最大布局区域的结构。"," enumeration that specifies how digits are displayed.":"指定数字显示方式的枚举。"," that represents the cap used at the beginning of lines drawn with this ":"代表在此绘制的线开始时使用的盖","A signed integer indicating the relationship between ":"签名的整数，指示","An 8-bit unsigned integer that specifies the value stored in the ":"一个8位未签名整数，指定存储在该值中的值"," property, of the string specified in the ":"属性，在"," structures that specifies the ranges of characters measured by a call to the ":"指定字符范围的结构由调用到","The URI of the first ":"第一个的URI"," values that represents the cap style used at the beginning and end of the dashes that make up dashed lines drawn with this ":"代表在构成用虚线的破折号开始和结尾处使用的盖式样式的值","A byte that specifies the value stored in the ":"一个指定存储的值的字节","Number of characters in the string.":"字符串中的字符数。","The number of spaces between the beginning of a line of text and the first tab stop.":"文本线开始和第一个选项卡停止之间的空间数。","The URI of the second ":"第二个URI","The distance from the start of a line to the beginning of a dash pattern.":"从线开始到仪表板模式的开头的距离。","An array of 8-bit unsigned integers that specifies the values stored in the ":"8位未签名整数的数组指定存储在该值中的值","An array of distances between tab stops in the units specified by the ":"选项卡之间的距离数组停止在由","Number of text lines in the string.":"字符串中的文本行数。"," enumeration that specifies the horizontal  alignment of the string.":"指定字符串的水平对齐的枚举。","An array of real numbers that specifies the lengths of alternating dashes and spaces in dashed lines.":"一个实数数组，指定了虚线中交替的破折号和空间的长度。","A value that indicates the relationship between ":"一个指示之间关系的价值","An array of bytes that specifies the values stored in the ":"一个字节数组，指定存储在"," structure that represents the size of the string, in the units specified by the ":"代表字符串大小的结构，在由"," that represents the style used for dashed lines drawn with this ":"这代表了用于绘制的虚线的样式"," enumeration value that specifies how to substitute characters in a string that cannot be displayed because they are not supported by the current font.":"指定如何在字符串中替换字符的枚举值，因为当前字体不支持它们，因此无法显示它们。","The URI of the referenced ":"引用的URI","A 16-bit integer that specifies the value stored in the ":"一个16位整数，指定存储在"," enumeration that contains formatting information.":"包含格式信息的枚举。"," values that represents the cap style used at the end of lines drawn with this ":"代表在此绘制的行末尾使用的盖式样式的值"," property, of the ":"财产，"," object. Must be nonnegative.":"目的。 必须是无负的。","The pack URI for the ":"包装的包装"," that defines the format of the string.":"这定义了字符串的格式。"," that represents the join style for the ends of two consecutive lines drawn with this ":"这代表了两条连续线的末端的联接样式","The generic default ":"通用默认值","An array of 16-bit integers that specifies the values stored in the ":"16位整数的数组指定存储在该值中的值"," referenced by the given ":"给定","Maximum width of the string in pixels.":"像素中字符串的最大宽度。","The limit of the thickness of the join on a mitered corner.":"连接厚度的极限在斜切角上。","A generic typographic ":"通用印刷"," object. The integers in the array must be nonnegative.":"目的。 阵列中的整数必须是无负的。"," in the package.":"在包装中。"," enumeration that specifies the style of lines drawn with this ":"列举说明该线的风格","Maximum width of the string.":"字符串的最大宽度。"," object, the default is ":"对象，默认值为","An integer that specifies the number of values stored in the ":"一个整数，指定存储在","The pack URI of the given ":"给定的包装"," enumeration that represents the vertical line alignment.":"代表垂直线对准的枚举。","4x4 ":"远足"," values that represents the cap style used at the beginning of lines drawn with this ":"代表在此绘制的行开始时使用的帽子样式的值","A \"#\" reference identifying an element within the package part.":"一个“＃”参考标识包部分中的元素。"," enumeration that indicates how text drawn with this ":"指示如何绘制文字的枚举"," object. The ":" 对象。 该 "," that multiplies the world transformation.":"这使世界变革倍增。"," that represents the geometric transformation for this ":"代表了这一点的几何变换"," enumeration that specifies the data type of the values stored in the ":"指定存储在该值中的数据类型的枚举"," object is trimmed when it exceeds the edges of the layout rectangle.":"当对象超过布局矩形的边缘时，将修剪它。"," enumeration that determines the order of the multiplication.":"确定乘法顺序的枚举。"," properties are set to this value.":"属性设置为此值。","The pack URI that identifies the specified package, package part, and fragment.":"标识指定的包、包部件和片段的包URI。"," that specifies the settings for a printer.":" 指定打印机的设置。"," that is the color of the background of the active window's title bar.":"那就是活动窗口标题栏的背景的颜色。","A pointer to an array of values of the type specified by the ":"指向由","Handle to a device context obtained by a previous call to the ":"处理先前呼叫的设备上下文","The left margin, in hundredths of an inch.":"左边边缘，一英寸一英寸。"," method of this ":"这个方法"," within the package.":"包裹内。"," is the color of the text of a ToolTip.":"是工具提示文本的颜色。","The right margin, in hundredths of an inch.":"右边缘，一百英寸。","A formatted ":"格式"," that represents the state to which to restore this ":"这代表了要恢复的状态","A 32-bit integer that represents the numerator of a fraction. Must be nonnegative.":"一个代表分数分子的32位整数。 必须是无负的。","The name of the system font you need a font object for.":"您需要字体对象的系统字体的名称。","Angle of rotation in degrees.":"旋转角度为单位。","The top margin, in hundredths of an inch.":"最高边缘，一百英寸。"," URI to normalize.":"URI正常化。","A 32-bit integer that represents the denominator of a fraction. Must be nonnegative.":"一个代表分数分母的32位整数。 必须是无负的。"," if the specified name matches a value in ":"如果指定的名称匹配一个值","The normalized form of the given ":"给定的归一化形式"," enumeration that specifies whether the rotation is appended or prepended to the matrix transformation.":"指定旋转是将旋转附加还是预先添加到矩阵转换的枚举。","The bottom margin, in hundredths of an inch.":"底部边缘，一百英寸。","A 32-bit integer that represents the numerator of the smallest fraction in the range. Must be nonnegative.":"一个32位整数，代表该范围内最小分数的分子。 必须是无负的。"," that is used to display text in the title bars of windows.":"它用于在Windows的标题栏中显示文本。"," that represents the saved state of this ":"这代表了保存的状态","A duplicate of this object.":"该对象的重复。","The pack URI from which to return the URI of the ":"从中返回URI的包装URI","A 32-bit integer that represents the denominator of the smallest fraction in the range. Must be nonnegative.":"一个32位整数，代表该范围内最小分数的分母。 必须是无负的。","Scale factor in the x direction.":"x方向的比例因子。","The object to which to compare this ":"比较此的对象"," of the system. The value returned will vary depending on the user's operating system and the local culture setting of their system.":"系统。 返回的值将根据用户的操作系统和系统的本地文化设置而有所不同。"," from the specified ":"从指定的","A 32-bit integer that represents the numerator of the largest fraction in the range. Must be nonnegative.":"一个32位整数，代表该范围内最大分数的分子。 必须是无负的。","Scale factor in the y direction.":"沿y方向的比例因子。"," that can be used for dialog boxes and forms, depending on the operating system and local culture setting of the system.":"可以用于对话框和表单，具体取决于系统的操作系统和本地文化设置。","A hash code based on the left, right, top, and bottom margins.":"基于左，右，顶部和底部边距的哈希代码。","The pack URI from which to return the ":"从中返回的包装","An array of 32-bit integers that specifies the numerators of the fractions. The integers in the array must be nonnegative.":"一个32位整数的数组指定分数的分子。 阵列中的整数必须是无负的。"," that is used for icon titles.":"这用于图标标题。"," properties of both margins have the same value; otherwise, ":"两个边缘的属性都有相同的值； 否则，"," enumeration that specifies whether the scaling operation is prepended or appended to the transformation matrix.":"指定缩放操作是预先预先或附加到转换矩阵上的枚举。","An array of 32-bit integers that specifies the denominators of the fractions. The integers in the array must be nonnegative. A denominator of a given index is paired with the numerator of the same index.":"一个32位整数的数组指定分数的分母。 阵列中的整数必须是无负的。 给定索引的分母与同一索引的分子配对。"," in the given ":"在给定"," to indicate if the ":"指示是否"," that is used for menus.":"这用于菜单。"," that represents the new clip region.":"这代表了新的剪辑区域。","An array of 32-bit integers that specifies the numerators of the minimum values for the ranges. The integers in the array must be nonnegative.":"32位整数的数组指定范围最小值的分子。 阵列中的整数必须是无负的。"," points to a package instead of a ":"指向包裹而不是"," that is used for message boxes":"用于消息框"," properties of both margins are not equal; otherwise, ":"两个边缘的性质都不相等； 否则，"," enumeration that specifies the combining operation to use.":"指定要使用的组合操作的枚举。"," to return the URI for the associated ":"返回关联的URI","An array of 32-bit integers that specifies the denominators of the minimum values for the ranges. The integers in the array must be nonnegative.":"一个32位整数的数组指定范围最小值的分母。 阵列中的整数必须是无负的。"," that is used to display text in the title bars of small windows, such as tool windows.":"它用于在小窗口的标题栏中显示文本，例如工具窗口。","The left margin width, in hundredths of an inch.":"左边缘宽度，一英寸。"," from which to take the new clip region.":"从中可以采取新的剪辑区域。"," that is used to display text in the status bar.":"用于在状态栏中显示文本。","An array of 32-bit integers that specifies the numerators of the maximum values for the ranges. The integers in the array must be nonnegative.":"32位整数的数组指定范围的最大值的分子。 阵列中的整数必须是无负的。"," that specifies the clip region to combine.":"这指定了要组合的夹区。"," object that contains the default application icon.":"包含默认应用程序图标的对象。","The right margin width, in hundredths of an inch.":"右边缘宽度，一英寸。"," part associated with the ":" 与 ","An array of 32-bit integers that specifies the denominators of the maximum values for the ranges. The integers in the array must be nonnegative.":"一个32位整数的数组指定范围最大值的分母。 阵列中的整数必须是无负的。"," object that contains the system asterisk icon.":"包含系统星号图标的对象。","The top margin width, in hundredths of an inch.":"最高边缘宽度，一英寸一英寸。"," structure that represents the new clip region.":"代表新剪辑区域的结构。"," identified by ":"确定","A 64-bit integer that specifies the value stored in the ":"一个64位整数，指定存储的值"," structure to combine.":"结构结合。"," object that contains the system error icon.":"包含系统错误图标的对象。"," if an object can perform the conversion; otherwise, ":"如果对象可以执行转换； 否则，","The URI of the source part.":"源部分的URI。"," object. Must be nonnegative. This parameter is converted to a 32-bit integer before it is stored in the ":"目的。 必须是无负的。 此参数在存储在32位整数中之前已将其存储在","The relative URI from ":"来自"," object that contains the system exclamation icon.":"包含系统感叹标图标的对象。","Member from the ":"来自"," that provides the language to convert to.":"这提供了要转换的语言。","The URI of the relationship part to return the ":"关系部分的URI归还","A 64-bit integer that represents the smallest number in a range of integers. Must be nonnegative. This parameter is converted to a 32-bit integer before it is stored in the ":"一个64位整数，代表一系列整数中最小的数字。 必须是无负的。 此参数在存储在32位整数中之前已将其存储在"," to which to convert the value.":"要转换值。"," enumeration that specifies the destination coordinate space.":"指定目标坐标空间的枚举。"," object that contains the system hand icon.":"包含系统手印图标的对象。","A 64-bit integer that represents the largest number in a range of integers. Must be nonnegative. This parameter is converted to a 32-bit integer before it is stored in the ":"一个64位整数，代表一系列整数中最大的数字。 必须是无负的。 此参数在存储在32位整数中之前已将其存储在"," from the relationship with the specified ":"从与指定的关系"," enumeration that specifies the source coordinate space.":"指定源坐标空间的枚举。"," object that contains the system information icon.":"包含系统信息图标的对象。"," representing the specified ":" 表示指定的 ","An array of 64-bit integers that specifies the values stored in the ":"64位整数的数组指定存储在该值中的值","The URI to check for a ":"URI检查一个"," object that contains the system question icon.":"包含系统问题图标的对象。"," structures that represents the points to transformation.":"代表转换点的结构。",". This method always returns ":"。 此方法总是返回"," part.":"部分。"," object. The integers in the array must be nonnegative. The 64-bit integers are converted to 32-bit integers before they are stored in the ":"目的。 阵列中的整数必须是无负的。 在将64位整数转换为32位整数之前，然后将其存储在"," structures that represent the points to transform.":"代表要转换点的结构。"," object that contains the shield icon.":"包含屏蔽图标的对象。","An array of 64-bit integers that specifies the minimum values for the integer ranges. The integers in the array must be nonnegative. The 64-bit integers are converted to 32-bit integers before they are stored in the ":"64位整数的数组指定整数范围的最小值。 阵列中的整数必须是无负的。 在将64位整数转换为32位整数之前，然后将其存储在"," identifies a ":"识别","The x-coordinate of the translation.":"翻译的X坐标。"," object that contains the system warning icon.":"包含系统警告图标的对象。","An array of 64-bit integers that specifies the maximum values for the integer ranges. The integers in the array must be nonnegative. The 64-bit integers are converted to 32-bit integers before they are stored in the ":"64位整数的数组指定整数范围的最大值。 阵列中的整数必须是无负的。 在将64位整数转换为32位整数之前，然后将其存储在"," that describes the printer to use.":" 这描述了要使用的打印机。","The y-coordinate of the translation.":"翻译的y坐标。"," object that contains the Windows logo icon.":"包含Windows徽标图标的对象。"," part; otherwise, ":"部分; 否则，"," object. A maximum value of a given index is paired with the minimum value of the same index.":"目的。 给定索引的最大值与相同索引的最小值配对。","A copy of this object.":"该对象的副本。"," enumeration that specifies whether the translation is prepended or appended to the transformation matrix.":"指定翻译是预先预先或附加到转换矩阵上的枚举。","The URI of the source part, or \"/\" to designate the ":"源部分的URI或“/”指定"," that is the color of the Windows desktop.":"那就是Windows桌面的颜色。"," that specifies the value stored in the ":"指定存储在","The handle to a Win32 ":"Win32的手柄"," that limits the portion of this ":"这限制了这部分","The relative URI to the target part.":"目标部分的相对URI。"," that is the color of the border of an inactive window.":"那就是不活动窗口的边界的颜色。","A string showing the various property settings for the ":"一个显示各种属性设置的字符串"," that is currently available for drawing.":"目前可用于绘图。","The URI of the target part resolved between the specified ":"目标部分的URI在指定的"," structure that represents a bounding rectangle for the clipping region of this ":"代表剪切区域的边界矩形的结构"," that represents the length and width, in hundredths of an inch, of the page.":"这代表了页面的长度和宽度，分别为百分之一英寸。","The access mask of this rule. The access mask is a 32-bit collection of anonymous bits, the meaning of which is defined by the individual integrators":"此规则的访问面具。 访问掩码是一个32位的匿名位，其含义由单个集成商定义"," if the page should be printed in color; otherwise, ":"如果该页面应彩色打印； 否则，","This property specifies a member of the ":"此属性指定了"," attribute that the ":"属性",". The default is determined by the printer.":"。 默认值由打印机确定。"," property that the ":"属性","The x-coordinate, in hundredths of an inch, of the left-hand hard margin.":"X坐标，左手边缘的百分之一英寸。","The value of the property that the ":"财产的价值"," object as a Boolean object.":"对象是布尔对象。","The name of the property, which is an array of type ":"属性的名称，这是类型的数组",", that the ":"，那是"}