{" of the package.":"包装。","A CodeDOM provider associated with the language provider configuration.":"与语言提供商配置关联的编码提供商。"," that identifies the checksum algorithm to use.":"这标识了要使用的校验和算法。"," in the collection if found; otherwise, -1.":"在收藏中发现； 否则，-1。","The position in the collection to start copying from.":"集合中开始复制的位置。","A CodeDOM provider associated with the language provider configuration and specified options.":"与语言提供商配置和指定选项相关联的编码提供商。","A byte array that contains the checksum data.":"包含校验和数据的字节数组。","The signature that is deleted.":"删除的签名。"," that you can use to enumerate the ":"您可以用来枚举"," that indicates the data type to reference.":"这表明要参考的数据类型。"," object and its value is the same as this instance; otherwise, ":"对象及其值与此实例相同； 否则，","A byte array that contains the data for the checksum calculation.":"一个字节阵列包含校验和计算的数据。","The X.509 certificate to use in signing each part; or ":"用于签署每个部分的X.509证书； 或者","The name of the data type to reference.":"要参考的数据类型的名称。"," if the object is thread safe; otherwise, ":"如果对象是线程安全的； 否则，","An array of file name extensions supported by the language provider.":"语言提供商支持的文件名扩展名数组。"," to prompt the user to select an installed certificate.":"提示用户选择已安装的证书。","The contents of the comment.":"评论的内容。","An instance of the data type to reference.":"参考数据类型的实例。","The name of the printer that is bound to the new ":"绑定到新的打印机的名称","A 32-bit signed integer hash code for the current ":"当前的32位签名整数哈希代码"," to store the certificate in the package; otherwise, ":"将证书存储在包装中； 否则，"," that indicates the data type of the variable.":"这表示变量的数据类型。"," if the comment is a documentation comment; otherwise, ":"如果评论是文档评论； 否则，","The Print Schema version to use in the ":"在"," instance, suitable for use in hashing algorithms and data structures such as a hash table.":"实例，适用于哈希算法和数据结构（例如哈希表）。","A string containing the comment text.":"包含注释文本的字符串。"," that indicates the type of the variable.":"这表示变量的类型。"," and DEVMODE conversion.":"和DevMode转换。","Flags that indicate what dependent parts must be excluded from the signing.":"指示必须从签名中排除哪些依赖部分的标志。","An array of language names supported by the language provider.":"语言提供商支持的一系列语言名称。"," that indicates the comment.":"这表示评论。"," that indicates the initialization expression for the variable.":"这表明该变量的初始化表达式。"," that contains information about the signature.":"其中包含有关签名的信息。"," array that contains the DEVMODE structure.":"包含DevMode结构的数组。","The zero-based index where the item should be inserted.":"基于零的索引应插入该项目。","The name of the data type of the variable.":"变量的数据类型的名称。"," instance that represents the configured language provider type.":"代表配置的语言提供商类型的实例。","Flags that indicate what dependent parts are excluded from the signing.":"标志表示从签名中排除哪些依赖部分的标志。","The new managed ":"新的管理"," that indicates the custom attributes for the generated assembly.":"这表示生成的组件的自定义属性。","The data type for the variable.":"变量的数据类型。"," object containing end directives.":"包含最终指令的对象。"," buffer containing the DEVMODE structure to convert.":"缓冲区包含要转换的DevMode结构。"," if the language provider implementation type is configured on the computer; otherwise, ":"如果语言提供商实现类型是在计算机上配置的； 否则，","The ID to assign to the signature.":"为签名分配的ID。","The data type of the variable.":"变量的数据类型。","Flags that indicate what dependent parts to exclude from the signing.":"标志着指示从签名中排除的依赖部分。"," value that specifies whether the new ":"指定新的价值","The names of the assemblies to reference.":"参考组件的名称。"," that indicates the namespaces that the compile unit uses.":"这表示编译单元使用的名称空间。"," to verify that ":"验证这一点","The name of the local variable to reference.":"本地变量的名称。"," to include debug information; ":"包括调试信息；"," that contains the file names of the referenced assemblies.":"其中包含引用组件的文件名。"," applies to a page, a document, or an entire print job.":"适用于页面，文档或整个打印作业。"," that indicates the compiler options.":"这表示编译器选项。"," before signing; otherwise, ":"签名前； 否则，","A value that identifies whether to use the user default or printer default DEVMODE as the base DEVMODE.":"标识使用用户默认值还是打印机默认DevMode作为基本Devmode的值。"," object containing start directives.":"包含起始指令的对象。"," to exclude debug information.":"排除调试信息。","The command arguments.":"命令参数。"," array that contains the new DEVMODE structure.":"包含新的DevMode结构的数组。","The core properties of the ":"的核心特性"," that indicates the expression to evaluate.":"这表明要评估的表达。","Any additional command-line arguments for the compiler.":"编译器的任何其他命令行参数。"," value that specifies whether the conversion of the ":"指定是否转换的价值"," for reading the document.":"用于阅读文档。"," object that indicates the compiler options.":"指示编译器选项的对象。"," containing the statements to execute if the condition is ":"如果条件为，则包含要执行的语句"," if the package is readable; otherwise, ":"如果包装是可读的； 否则，"," should be done at the scope of a page, a document, or an entire print job.":"应在页面，文档或整个打印作业的范围内完成。"," object that indicates the source to compile.":"指示编译源的对象。"," that indicates the condition to evaluate.":"这表明要评估的条件。","The results of compilation.":"汇编的结果。"," if the package can be signed; otherwise, ":"如果可以签署包裹； 否则，"," buffer that represents the new DEVMODE structure.":"表示新的DevMode结构的缓冲区。","The name of the core assembly that contains basic types.":"包含基本类型的核心程序集的名称。"," to evaluate ":"评估"," if the package is writable; otherwise, ":"如果包裹是写作的； 否则，","The maximum Print Schema version that ":"最大打印模式版本"," objects that indicates the source to compile.":"表示编译源的对象。"," containing the statements to execute if the conditional expression evaluates to ":"如果条件表达式评估为","A collection that contains the file paths of .NET Framework resources to include in the generated assembly.":"包含.NET框架资源的文件路径的集合，其中包含在生成的汇编中。"," objects that represent the signatures that are associated with the package.":"表示与软件包关联的签名的对象。"," can support.":"可以支持。"," if an executable should be generated; otherwise, ":"如果应生成可执行文件； 否则，","The file name to compile.":"要编译的文件名。"," that contains the base constructor arguments.":"其中包含基本构造函数。"," that represents the thumbnail image that is associated with the document.":"这代表与文档关联的缩略图图像。"," that represents the property values of the ":"代表了"," if the compiler should generate the output in memory; otherwise, ":"如果编译器应在内存中生成输出； 否则，","An array of strings that indicates the file names of the files to compile.":"一系列字符串，指示要编译的文件的文件名。"," that contains the chained constructor arguments.":"其中包含链接的构造函数。","The typeface data to obfuscate.":"字体数据要混淆。"," that represents the height of the imageable area in pixels (1/96 of an inch).":"这代表了像素（1/96英寸）中可成像区域的高度。","The source code string to compile.":"源代码字符串要编译。"," if debug information should be generated; otherwise, ":"如果应该生成调试信息； 否则，"," that specifies the reference to a value type.":"这指定了对值类型的引用。","A collection that contains the file paths of .NET Framework resources that are referenced by the source.":"包含源引用的.NET框架资源的文件路径的集合。"," that represents the width of the imageable area in pixels (1/96 of an inch).":"这代表了像素（1/96英寸）中可成像区域的宽度。","An array of strings containing the source code to compile.":"包含编译源代码的一系列字符串。","The globally unique identifier (GUID) to use to obfuscate the ":"用于混淆的全球唯一标识符（GUID）"," object representing a data type that has a default value.":"代表具有默认值的数据类型。"," that represents the distance from the top edge of the page to the top of the imageable area in pixels (1/96 of an inch).":"这代表了从页面的顶部边缘到像素（1/96英寸）的可成像区域顶部的距离。","A command arguments string.":"命令参数字符串。","The name of the main class.":"主类的名称。"," if the font is obfuscated; otherwise, ":" 如果字体被混淆；否则, "," that indicates the data type of the delegate.":"这表示委托的数据类型。"," that represents the distance from the left edge of the page to the left edge of the imageable area in pixels (1/96 of an inch).":"这表示从页面的左边缘到像素（1/96英寸）的可成像区域的左边缘的距离。"," if text that uses this font can be changed or edited; otherwise, ":"如果使用此字体的文本可以更改或编辑； 否则，","The command arguments to use to generate a response file, or ":"用于生成响应文件的命令参数，或"," that indicates the object containing the event-handler method.":"这表示包含事件处理程序方法的对象。","The name of the output assembly.":"输出组件的名称。","The width, in pixels, which are 1/96 inch units.":"宽度，像素为1/96英寸。"," if there are no response file arguments.":"如果没有响应文件参数。"," for the part.":"对于部分。","A collection that contains the assembly names that are referenced by the source to compile.":"包含源代表编译的汇编名称的集合。","The height, in pixels, which are 1/96 inch units.":"高度，像素为1/96英寸。","The name of the event-handler method.":"事件处理方法的名称。"," for reading or writing the resource.":"用于阅读或编写资源。","The array of strings to join.":"一系列琴弦加入。","A collection that contains the temporary files.":"包含临时文件的集合。","The name of the event handler method.":"事件处理程序方法的名称。","The name of the page size for paper (or other media), for example, ":"例如，纸张（或其他媒体）的页面大小的名称，例如","A starting absolute URI.":"起始的绝对URI。"," if warnings should be treated as errors; otherwise, ":"如果应将警告视为错误； 否则，","The separator to use.":"的分离器来使用。"," that indicates the target object.":"这表示目标对象。"," that represents the page size for paper or other media.":" 表示纸张或其他介质的页面大小。"," of the resource that is relative to the specified absolute ":"相对于指定绝对的资源","The concatenated string.":"串联的字符串。"," objects that indicate the parameters.":"表示参数的对象。","The user token to use.":"要使用的用户令牌。"," that represents the page height, in pixels, which are 1/96 inch units.":"这代表页面高度，以像素为1/96英寸的单位。"," that indicates the results of compilation.":"这表明了汇编的结果。","The cultural information of the signature.":"签名的文化信息。","The warning level at which the compiler aborts compilation.":"编译器中止编译的警告级别。"," that indicates the parameters to pass to the event handling methods attached to the event.":"这表明要传递到事件附加的事件处理方法的参数。"," value that names the page size.":"重视该名称页面大小。","A Win32 resource file that will be linked into the compiled assembly.":"Win32资源文件将链接到编译的组件中。"," if uncommitted changes exist; otherwise, ":"如果存在不承诺的更改； 否则，"," that indicates the event to invoke.":"这表明要调用的事件。","The line to process.":"要处理的行。"," that represents the page width, in pixels, which are 1/96 inch units.":"这代表页面宽度，像素为1/96英寸。"," with which to manage and store references to intermediate files generated during compilation.":"借此来管理和存储在编译过程中生成的中间文件的引用。"," that represents the intention agreement; for example, \"I have read and agree.\" The default value is ":"代表意图协议； 例如，“我已经阅读并同意。” 默认值是"," that indicates the source to compile.":"这表示编译的来源。"," that indicates the field direction of the expression.":" 表示表达式的字段方向。","The horizontal resolution in dots per inch.":"每英寸点的水平分辨率。"," that indicates the compiled assembly.":"这表示编译的组件。"," that represents the signer, for example, \"Mary Jones, Marketing Dept.\" The default value is ":"这代表签名人，例如“玛丽·琼斯（Mary Jones），营销部”。 默认值是","An array of strings that indicates the file names to compile.":"一系列字符串，指示要编译的文件名。"," that indicates the code expression to represent.":"这表明要表示的代码表达式。","The vertical resolution in dots per inch.":"每英寸点的垂直分辨率。"," that indicates the errors and warnings resulting from compilation, if any.":"这表明汇编引起的错误和警告（如果有）。","A string that indicates the source code to compile.":"指示要编译的源代码的字符串。","A (":"一个 （","A value representing the resolution.":"代表分辨率的值。"," that indicates the field direction for this direction expression.":"这表示此方向表达式的场方向。","The compiler's return value.":"编译器的返回值。","An array of strings that indicates the source code to compile.":"一系列字符串，指示要编译的源代码。",") ":"）"," that indicates the expression to represent.":"这表明表示表示。"," that contains the property values of the ":"其中包含"," that represents the deadline by which the signer must sign the package. The default value is ":"这表示签名者必须签署包裹的截止日期。 默认值是"," that contains the output messages.":"其中包含输出消息。"," object with which to initialize the collection.":"用来初始化集合的对象。","The name of the compiler executable.":"编译器可执行文件的名称。"," value that represents the level of page resolution.":"代表页面分辨率级别的值。","The path of the assembly, or ":"组件的路径，或"," that represents the jurisdiction, for example, \"State of Utah, United States.\" The default value is ":"这代表了管辖权，例如“美国犹他州”。 默认值是","The index position at which the new element was inserted.":"插入新元素的索引位置。","The file name extension to use for source files.":"用于源文件的文件名扩展名。"," if the assembly was generated in memory.":"如果组件是在内存中生成的。"," value that represents a horizontal page resolution.":"代表水平页面分辨率的值。"," that represents the ID of the signature definition. The default value is ":"这代表签名定义的ID。 默认值是"," object that indicates the settings for the compilation.":"表示编译设置的对象。"," object containing the ":"包含的对象","The command to execute.":"执行的命令。","A nullable ":"一个无效的"," that indicates the code to compile.":"这表示要编译的代码。"," that represents the location in the package where a visible request for a signature appears. The default value is ":" 它表示包中显示签名的可见请求的位置。 默认值为 "," object to search for in the collection.":"目的是在集合中搜索。"," value that represents a vertical page resolution.":"代表垂直页面分辨率的值。"," object that indicates the results of the compilation.":"表示汇编结果的对象。","The token to start the compiler process with.":"代币以启动编译器流程。","The resource ID of the ":"的资源ID","The index in the array at which to begin inserting collection objects.":"数组中开始插入集合对象的索引。"," representation of the scaling range.":"缩放范围的表示。","An array of the names of the files to compile.":"要编译的文件名称的数组。"," resource stream to acquire.":"资源流要获取。","A reference to a string that will store the compiler's message output.":"对字符串的引用，该字符串将存储编译器的消息输出。","The index position in the collection of the specified object, if found; otherwise, -1.":"如果找到了指定对象的集合中的索引位置； 否则，-1。"," object that indicates the results of compilation.":"表示汇编结果的对象。","A reference to a string that will store the name of the error or errors encountered.":"对字符串的引用，该字符串将存储遇到的错误或错误的名称。"," value that represents a percentage.":"代表百分比的值。","The XML Paper Specification (XPS) resource stream for the ":"Xml纸张规格(XPS)资源流 ","The zero-based index position where the specified object should be inserted.":"应插入指定对象的从零开始的索引位置。"," object that indicates the compiler settings for this compilation.":"指示此编译的编译器设置的对象。","An XML ":"XML"," objects that represent the linkable targets for a page.":"表示页面的可链接目标的对象。","The return value from the compiler.":"编译器的返回值。"," at the index position.":"在索引位置。","An array of source code strings to compile.":"编译的一系列源代码字符串。"," for the current page.":"对于当前页面。","The name of the event to reference.":"事件的名称参考。","The directory to start the process in.":"目录启动该过程。"," that describes printer capabilities and conforms to the Print Schema.":"这描述了打印机功能并符合打印模式。"," that can be used for compilation of ":"可以用于编译","The zero-based index of the collection to access.":"基于零的集合索引访问。"," for an ":"为"," value that specifies the maximum number of copies that a printer can print. Returns ":"指定打印机可以打印的最大副本数量的值。 返回"," based source code representations.":"基于源代码表示。","The current directory.":"当前目录。"," for the statement.":"对于声明。"," if the device driver does not report a maximum.":"如果设备驱动程序未报告最大值。","An object that provides information about how a print job prints.":"提供有关打印作业方式的信息的对象。"," object that indicates the settings for compilation.":"表示编译设置的对象。","The string for which to create an escaped identifier.":"为其创建逃脱标识符的字符串。"," that indicates the expression for the statement.":"这表明了该语句的表达。"," value indicating the height, in pixels, which are 1/96 inch increments, of the area on a page that the printer is capable of printing.":"值表示高度的像素为1/96英寸的增量，即打印机能够打印的页面上的区域。","The uniform resource identifier (URI) of the resource.":"资源的统一资源标识符（URI）。","The escaped identifier for the value.":"逃脱的标识符为该值。","The file name of the file that contains the source code to compile.":"包含要编译的源代码的文件的文件名。","A name for the relationship.":"关系的名称。"," that indicates the object that contains the field.":"这表示包含字段的对象。","The file names of the files to compile.":"要编译的文件的文件名。"," value indicating the width, in pixels, which are 1/96 inch increments, of the area on a page that the printer is capable of printing.":"值表示打印机能够打印的页面上的区域的宽度为1/96英寸的宽度。"," that can be used to generate ":"可以用来生成","A string containing the field name.":"包含字段名称的字符串。"," object that specifies the distance, in pixels (units of 1/96 inch), of the upper-left corner of the imageable area. The vertical distance is measured from the top edge of the paper and the horizontal distance is measured from the left edge. The return value also specifies the width and height of the imageable area. If the printer driver does not report an imageable area, then this property is null.":"对象在可成像区域的左上角指定距离，以像素为单位（1/96英寸单位）。 垂直距离是从纸的顶部边缘测量的，水平距离是从左边缘测量的。 返回值还指定了可成像区域的宽度和高度。 如果打印机驱动程序不报告可成像区域，则此属性为空。","The uniform resource identifier (URI) of the font.":"字体的统一资源标识符（URI）。","The source code to compile.":"编译的源代码。"," to use to output.":"用于输出。"," that indicates the object that contains the field to reference.":"这表示包含要引用的字段的对象。","The source code strings to compile.":"源代码字符串要编译。"," values specifying the print media, such as card stock, label, plain, or photographic.":"指定印刷媒体的值，例如卡片，标签，平原或摄影。","The ID of the resource that is released.":"释放的资源的ID。","The file name to output to.":"要输出的文件名。","The name of the label at which to continue program execution.":"继续执行程序的标签的名称。"," of the current document.":"当前文档。"," to output code to.":" 以输出代码到。"," objects. Each value represents a page resolution as a qualitative value, a dots-per-inch value, or both.":"对象。 每个值代表页面分辨率作为定性值，每个英寸值或两者兼而有之。","A string that indicates the name of the label at which to continue program execution.":"一个指示继续程序执行的标签名称的字符串。"," that can be used to parse source code. The base implementation always returns ":" 这可以用来解析源代码。 基本实现总是返回 "," of the current page.":"当前页面。"," object with ":"对象"," that indicates the namespace to generate code for.":"这表示要生成代码的名称空间。","The target object.":"的目标对象。","The language name.":"语言名称。","The type of object that is a candidate for conversion.":"对象的类型是转换的候选者。"," containing the CodeDOM elements to translate.":"包含要翻译的编码元素。"," properties holding ":"属性持有","The index or indexes of the indexer expression.":"索引表达式的索引或索引。"," if objects of the specified type can be converted; otherwise, ":"如果可以转换指定类型的对象； 否则，","A CodeDOM provider that is implemented for the specified language name.":"为指定语言名称实施的编码提供商。"," that indicates the indexer object.":"这表示索引对象。"," that indicates the type to generate code for.":"这表明要生成代码的类型。"," values that represent percentages.":" 表示百分比的值。","The type of object that you want to convert a color to.":"要转换颜色的对象的类型。","A collection of provider options from the configuration file.":"来自配置文件的提供商选项的集合。"," containing the loop initialization statement.":"包含循环初始化语句。"," values representing the options that a printer supports for printing more than one page per side.":"代表打印机支持以打印多个页面的选项的值。","A text representation of the specified type for the language this code generator is designed to generate code in. For example, in Visual Basic, passing in type System.Int32 will return \"Integer\".":"该语言的指定类型的文本表示形式该代码生成器旨在在In中生成代码。","The language and culture that are used during the conversion.":"转换过程中使用的语言和文化。","A CodeDOM provider that is implemented for the specified language name and options.":"为指定的语言名称和选项实施的编码提供商。"," containing the expression to test for exit condition.":" 包含要测试退出条件的表达式。"," that is interpreted as an HRESULT, a coded numerical value that is assigned to a specific exception.":"这被解释为HRESULT，是一个分配给特定异常的编码数值。","The value to test for being a valid identifier.":"测试成为有效标识符的值。","The string for which to generate a valid identifier.":"为其生成有效标识符的字符串。"," containing the per-cycle increment statement.":"包含每个周期增量语句。","The object that is converted.":"转换的对象。","A collection of strings that name the attributes that your program successfully committed.":"命名您程序成功承诺的属性的字符串集合。"," that can be used to read the code to be compiled.":"可以用来读取要编译的代码。","The object you want to convert.":"您要转换的对象。"," containing the statements within the loop.":"包含循环中的语句。","A valid identifier for the specified value.":"指定值的有效标识符。","A path to the temporary directory to use for storing the temporary files.":"用于存储临时文件的临时目录的路径。","A collection of strings that name the attributes that your program was unable to commit.":"命名您程序无法提交的属性的字符串集合。","The type that ":"类型"," for which to generate code.":"为其生成代码。"," that indicates the per cycle increment statement.":"这表明每个周期增量语句。"," of the designated type.":"指定类型。","A description of the error condition.":"错误条件的描述。"," if the temporary files should be kept after use; ":" 如果临时文件在使用后应保留; ","An object of the type for which you need property descriptions.":"您需要属性描述的类型的对象。"," that indicates the loop initialization statement.":"这表示循环初始化语句。"," to which the output code is sent.":" 向其发送输出代码。","The object that generated the exception.":"生成异常的对象。","An array of attributes that filter the returned collection to exclude irrelevant properties.":"一系列属性，这些属性过滤返回的集合以排除无关的属性。"," if the temporary files should be deleted.":"如果应删除临时文件。"," that indicates the options to use for generating code.":"这表示用于生成代码的选项。"," that contains the property descriptions that are exposed for the component; or ":"其中包含针对组件暴露的属性描述； 或者"," that indicates the statements within the loop.":"这表示循环中的语句。","Stores all the data that is used to serialize the object.":"存储用于序列化对象的所有数据。","The file name extension for the auto-generated temporary file name to add to the collection.":"自动生成的临时文件名的文件名扩展名添加到集合中。"," if no property descriptions are returned.":"如果未返回属性说明。"," object that indicates the expression for which to generate code.":"指示生成代码的表达式的对象。"," that indicates the expression to test.":"这表明要测试的表达式。","Describes the context of the serialized stream, including the source and the destination.":"描述序列化流的上下文，包括源和目的地。","The object to be serialized.":"要序列化的对象。"," to which output code is sent.":"发送输出代码。","A file name with the specified extension that was just added to the collection.":"刚刚添加到集合中的指定扩展名的文件名。"," to associate with the label.":"与标签关联。","The underlying condition that triggered the ":"触发 "," that represents the URI of the color context.":" 表示颜色上下文的URI。"," that indicates the statement associated with the label.":"这表明与标签关联的语句。"," if the file should be kept after use; ":"如果使用后应保留文件；"," object that indicates the member for which to generate code.":"指示生成代码的成员的对象。"," of strings that identify the ":"识别的字符串","The type of object to convert.":"要转换的对象的类型。","The file name of the associated file.":"关联文件的文件名。"," object that indicates the namespace for which to generate code.":"指示要生成代码的名称空间的对象。"," if the file should be deleted.":" 如果文件应该被删除。"," attributes that were successfully committed.":"成功承诺的属性。","The line number to store a reference to.":"存储参考的行号。","The type of object that you want to convert a glyph run to.":"要转换字形的对象的类型。","The name of the file to add to the collection.":"要添加到集合的文件的名称。"," containing the CodeDOM elements for which to generate code.":"包含生成代码的编码元素。"," attributes that your program was unable to commit.":"您的程序无法提交的属性。"," that indicates the data type or types that the member event implements.":"这表明成员事件实施的数据类型或类型。","The type that you want ":"您想要的类型","The array of strings to copy to.":"要复制的字符串数组。"," object that indicates the type for which to generate code.":"指示生成代码的类型的对象。"," converted to.":"转换成。"," reference to the ":"引用"," that indicates the data type that the event privately implements.":"这表明事件私下实施的数据类型。","The index of the array to begin copying to.":"阵列的索引开始复制。"," of the designated type. As implemented in this class, this must be a ":"指定类型。 正如本课程实现的那样，这必须是"," representing the settings of all configured ":"表示所有配置的设置"," that indicates the delegate type that handles the event.":"这表示处理事件的代表类型。"," that threw the exception.":"抛出了例外。"," that contains the collection's members.":"其中包含该系列的成员。","The name of the print queue hosting the print job that caused the exception.":"打印队列的名称托管了引起例外的打印作业。","A language name.":"语言名称。",". It expresses the uniform resource identifier (URI) of the font subset that is used by the ":"。 它表达了字体子集的统一资源标识符（URI）","An object that indicates the type of the field.":"指示字段类型的对象。","The full path to the base file name, without a file name extension, on the temporary directory path, that is used to generate temporary file names for the collection.":"基本文件名的完整路径，没有文件名扩展名，在临时目录路径上，该路径用于生成集合的临时文件名。","The name of the print job that caused the exception.":"引起例外的打印作业名称。","An object that you need property descriptions for.":"您需要属性描述的对象。"," object populated with settings of the configured ":"填充有配置的设置的对象","The initialization expression for the field.":"该场的初始化表达式。","The number of files in the collection.":"集合中的文件数。","The ID number of the print job that caused the exception.":"引起异常的打印作业的ID号。","An array of attributes that filter the returned collection in order to exclude irrelevant properties.":"一系列属性，这些属性过滤返回的集合以排除无关的属性。"," for the specified type, or ":"对于指定类型或"," that indicates the interfaces implemented by this method.":"这表明该方法实现的接口。"," if the files should be kept; otherwise, ":"如果要保留文件； 否则，"," for the specified type cannot be found.":"对于指定的类型找不到。","The type of object that you want to convert to a ":"要转换为一个对象的类型"," that indicates the method parameters.":"这表示方法参数。","The underlying cause of the exception.":"例外的根本原因。","The temporary directory to store the temporary files in.":"存储临时文件的临时目录。"," if the conversion is possible; otherwise, ":"如果可以转换； 否则，","The underlying error that caused the ":"导致的基本错误","A file name extension.":"文件名扩展名。"," that indicates the data type of the interface with the method that the private method whose declaration is represented by this ":"这指示了接口的数据类型，该方法的私人方法的声明是由此表示的","The object that you want to convert.":"您要转换的对象。","The component that will act as the owner of the application settings object.":"将充当应用程序设置对象的所有者的组件。"," that uniquely identifies separate instances of the wrapper class.":"唯一标识包装类的单独实例。"," that identifies the print job.":"这可以识别打印作业。","A language name associated with the file name extension, as configured in the ":"与文件名扩展程序关联的语言名称，如在"," implements.":"工具。"," that names the print job.":"该名称打印作业。"," containing the name of the settings property whose value is to be returned.":"包含要返回值的设置属性的名称。"," that indicates the data type of the value returned by the method.":"这表明该方法返回的值的数据类型。"," compiler configuration settings.":"编译器配置设置。"," of the designated type. As implemented in this class, the object must be a ":"指定类型。 正如该类实现的那样，对象必须是"," that specifies the name of the ":"指定了"," containing the value of the specified ":"包含指定的值"," that indicates the custom attributes.":"这表示自定义属性。"," that indicates the type to return.":"这表明要返回的类型。",". The object expresses the uniform resource identifier (URI) of the serialized image.":"。 该对象表示序列化图像的统一资源标识符（URI）。","The name of the printer that was being accessed when the error occurred.":"发生错误时正在访问的打印机的名称。"," that indicates the statements within the method.":"这表明该方法中的语句。"," associated with the settings group.":"与设置组相关联。","An array of attributes that are used to filter the returned collection in order to exclude irrelevant properties.":"用于过滤返回的集合以排除无关属性的一系列属性。","A text representation of the specified type, formatted for the language in which code is generated by this code generator. In Visual Basic, for example, passing in a ":"指定类型的文本表示形式，该语言是针对该代码生成器生成代码的语言的格式。 例如，在Visual Basic中，通过","The exception message that was sent by the printer driver or unmanaged print system component that triggered the exception.":"触发异常的打印机驱动程序或不受管理的打印系统组件发送的异常消息。"," that contains the type parameters for the generic method.":"其中包含通用方法的类型参数。"," containing the name of the property to access.":"包含要访问的属性名称。","The object to save.":"要保存的对象。"," type will return \"Integer\".":" 类型将返回\"整数\"。"," that names the printer.":"该名称打印机。"," statements for the member property.":"会员财产的陈述。","If found, the value of the named settings property; otherwise, ":"如果发现，则指定设置属性的值； 否则，","The XML Paper Specification (XPS) document that the packaging policy applies to.":"包装策略适用的XML纸规范（XPS）文档。"," implementation is configured for the specified file name extension; otherwise, ":"为指定的文件名扩展程序配置了实现； 否则，","The name of the print server that was being accessed when the error condition occurred.":"发生错误条件时访问的打印服务器的名称。","The order in which to interleave document elements.":"交织文档元素的顺序。"," containing all the ":"包含所有"," collection is non-zero, or if the value of this property has been set to ":"收集是非零的，或者如果已将此属性的值设置为","The underlying condition that caused the ":"导致"," implementation is configured for the specified language; otherwise, ":"为指定语言配置了实现； 否则，"," objects used in the current wrapper.":"当前包装器中使用的对象。","The resource identifier of the color context.":"颜色上下文的资源标识符。"," collection is non-zero; otherwise, ":"收集非零； 否则，","The value to verify as a valid identifier.":"验证为有效标识符的值。","The data that is used to serialize the object.":"用于序列化对象的数据。"," of property values.":"属性值。"," that indicates the data types the property implements.":"这表明数据键入属性实施。","The resource stream for the ":"资源流的"," parameter is a valid identifier; otherwise, ":"参数是有效的标识符； 否则，"," that names the print server.":"该名称打印服务器。"," that indicates the declaration expressions for the property.":"这表明该财产的声明表达式。"," objects used by the settings properties of the current settings wrapper.":"当前设置包装器的设置属性使用的对象。","The resource stream for the current ":"当前的资源流"," object that is used to read the code to be parsed.":"用于读取要解析的代码的对象。","A string that describes the error condition.":"描述错误条件的字符串。","The identifier of the XML Paper Specification (XPS) font.":"XML纸规范（XPS）字体的标识符。"," that indicates the data type of the interface, if any, the property, if private, implements.":"这表明接口的数据类型（如果有的话）（如果有的话）实现。"," containing the settings key for the current settings group.":"包含当前设置组的设置密钥。"," that contains a representation of the parsed code.":"其中包含解析代码的表示。","The underlying error condition that caused the exception.":"导致异常的基本误差条件。","The key for which to get the value.":"获得值的关键。"," that indicates the data type of the property.":"这表示属性的数据类型。","The resource stream for the XML Paper Specification (XPS) font that has the specified ":"具有指定的XML纸规范（XPS）字体的资源流"," object that indicates the type of code generation support to verify.":"指示代码生成支持的对象要验证。","The type of the object to return.":"要返回的对象的类型。","The exception message sent by the printer driver or unmanaged print system component that caused the exception.":"引起异常的打印机驱动程序或不受管理的打印系统组件发送的异常消息。"," that indicates the target object with the method to invoke.":"这表明具有调用方法的目标对象。","The resource identifier of the XML Paper Specification (XPS) image.":"XML Paper Specification(XPS)图像的资源标识符。"," if the specified code generation support is provided; otherwise, ":"如果提供了指定的代码生成支持； 否则，","The value of the specified key.":"指定密钥的值。","An XML stream that describes a print job and conforms to the Print Schema.":"XML流，描述打印作业并符合打印模式。","The identifier of the resource dictionary.":"资源词典的标识符。"," objects that indicate the parameters to call the method with.":"指示使用该方法的参数的对象。","A file name extension corresponding to the extension of the source files of the current language. The base implementation always returns ":"与当前语言源文件扩展相对应的文件名扩展名。 基本实施始终返回","A configuration file that provides additional settings or overrides the settings specified in the ":"提供其他设置或覆盖在此处指定的设置的配置文件"," that indicates the method to invoke.":"这表示调用的方法。"," for the current page content.":"对于当前页面内容。"," object that describes the print ticket with XML that conforms to the Print Schema.":"用XML描述符合打印架构的XML的对象。","The string to write on the new line.":"在新行上写入的字符串。"," objects that indicate the parameters with which to invoke the method.":"表示调用该方法的参数的对象。","A collection of key/value pairs that contains the application settings from the configuration file.":"关键/值对的集合，其中包含来自配置文件的应用程序设置。","The string to create an escaped identifier for.":"为创建逃脱标识符的字符串。","The XML writer for the current ":"电流的XML作者"," that indicates the parameters to invoke the method with.":"这表示使用该方法的参数。"," that holds the saved ":" 保存保存 ","The type of object that will be validated.":"将要验证的对象的类型。","The print ticket to store as part of the XML Paper Specification (XPS) document.":"作为XML纸规范（XPS）文档的一部分存储的打印票。"," that indicates the object to target.":"这表明目标对象。","A string to create a valid identifier for.":"用于创建有效标识符的字符串。"," value indicating whether the printer collates its output.":"值表示打印机是否整理了其输出。","The name of the method to call.":"呼叫方法的名称。"," used as the delegate.":"用作代表。","The uniform resource identifier (URI) of the resource to associate with the current page.":"资源的统一资源标识符（URI）与当前页面相关联。","A valid identifier for the value.":"值的有效标识符。"," value that specifies how many copies to print.":"值指定要打印多少副本。"," values that specify the ":"指定的值"," parameter matches the type used as the first parameter when creating an instance of ":"参数匹配用作第一个参数的类型，创建一个实例","The identifying name of the ":"识别名称的名称"," value indicating whether the device substitutes device-based fonts for computer-based fonts for the current print job.":"值指示该设备是否将基于设备的字体替换为基于计算机的字体作为当前打印作业。"," that indicates the expression to generate code for.":"这表示要生成代码的表达式。","The name of the method to reference.":"参考方法的名称。","The value of an object.":"对象的值。"," value indicating what sort of two-sided printing, if any, the printer uses for the print job.":"值指示打印机用于打印作业的两边打印（如果有的话）。"," that indicates the statement to generate code for.":"这表示要生成代码的语句。"," that represents the method to reference.":"这代表了参考的方法。"," that associates the current page with the specified resource.":"这将当前页面与指定的资源相关联。"," of the current validator attribute instance.":"当前验证器属性实例。"," that indicates the end of the attribute block to generate code for.":"这表明属性块的结束是为生成代码的结束。"," value indicating what input tray is used and whether it is chosen manually or automatically.":"值表示使用了哪些输入托盘以及是手动或自动选择的。"," containing the type arguments for the current code ":"包含当前代码的类型参数","The uniform resource identifier (URI) of the restricted font to associate with the current document.":"限制字体的统一资源标识符（URI）与当前文档关联。"," containing all the client settings found in the current configuration section.":"包含当前配置部分中发现的所有客户端设置。"," value indicating how the printer handles content that has color or shades of gray.":"值表示打印机如何处理具有颜色或灰色阴影的内容。","The identifier of the XML Paper Specification (XPS) font that you want to release.":"您要发布的XML纸规范（XPS）字体的标识符。"," that indicates the return value.":"这表示返回值。"," that indicates the start of the attribute block to generate code for.":"这表明属性块的开始生成代码。","A string value.":"字符串值。"," value that specifies the needed level of quality.":"指定所需质量水平的价值。","The class member to generate code for.":"班级成员生成代码。"," that indicates the value to return for the return statement, or ":"这表明返回帐单返回的值，或","The URI of the current fixed document.":"当前固定文档的URI。","An array of strings to add to the collection.":"一系列字符串添加到集合中。"," value that specifies whether the printer uses borderless printing.":"指定打印机是否使用无边界打印的值。","The URI of the current fixed page.":"当前固定页面的URI。","The text writer to output code to.":"文本作者输出代码。"," if the statement is part of a subroutine.":"如果该语句是子例程的一部分。","The stream that contains the resource.":"包含资源的流。","The index in the collection at which the new element will be added.":"将添加新元素的集合中的索引。","The options to use when generating the code.":"生成代码时要使用的选项。","The name of the namespace being declared.":"命名空间的名称被声明。"," object that represents the page size by using a name, dimensions, or both.":"使用名称，尺寸或两者都代表页面大小的对象。"," that indicates the comments for the namespace.":"这表示名称空间的评论。"," value specifying the print media, such as card stock, label, plain, or photographic.":"指定印刷媒体的价值，例如卡片，标签，平原或摄影。","The statement to generate code for.":"为生成代码的语句。","The value of the new element to add to the collection.":"新元素要添加到集合中的价值。"," that contains the XML Paper Specification (XPS) resource.":"其中包含XML纸规范（XPS）资源。"," that indicates the namespace import directives used by the namespace.":"这表明名称空间使用的名称空间导入指令。","The string to remove.":"删除的字符串。"," value specifying last-page-first printing or first-page-first printing.":"值指定最后一页首次打印或第一页优先打印。"," to indicate that the serialization was canceled before completion; otherwise, ":"指示在完成之前取消了序列化； 否则，","The expression to generate code for.":"为生成代码的表达式。","The name of the namespace.":"名称空间的名称。"," has been modified; otherwise, ":"已修改； 否则，"," value specifying how page content is oriented, for example, ":"值指定页面内容的定向，例如","A user-supplied object that provides additional data to the event handler.":"用户提供的对象，为事件处理程序提供其他数据。"," that indicates the types contained in the namespace.":"这表明名称空间中包含的类型。","The compile unit to generate code for.":"编译单元生成代码。","An exception, if any, that interrupted the serialization operation.":"一个例外（如果有）中断了序列化操作。"," if the specified string element in the ":"如果在"," value that represents the resolution as a qualitative value, a dots-per-inch value, or both.":"代表分辨率为定性值的值，每个英寸值或两者兼而有之。",", if it is found, in the collection; otherwise, -1.":"，如果在收藏中找到了； 否则，-1。","The constructor to generate code for.":"为生成代码的构造函数。","The index of the string element in the collection.":"集合中字符串元素的索引。","An object that provides methods for acquiring serialization readers and writers for different parts of an XML Paper Specification (XPS) document.":"提供用于获取XML纸规范（XPS）文档不同部分的序列化读取器和作家的方法的对象。"," value that represents the number of pages that print on each printed side of a sheet of paper.":"代表在一张纸的每个印刷侧打印的页面数量的值。","The zero-based index where the new item should be inserted.":"应插入新项目的基于零的索引。"," to specify batch mode; otherwise, ":"指定批处理模式； 否则，","A string element in the collection.":"集合中的字符串元素。","The type of the object that this constructor constructs.":"该构造器构造的对象的类型。"," value indicating how a printer presents multiple pages per sheet.":"值表示打印机如何显示每张纸多个页面。","The XAML serialized object to save.":"XAML序列化对象保存。","The name of the namespace to import.":"要导入的名称空间的名称。","The decimal value to generate code for.":"为生成代码的小数值。"," used for type conversions.":"用于类型转换。"," value indicating the level of photo quality.":"值表示照片质量水平。"," that indicates the context of the statement.":"这表示语句的上下文。","The number of pages or documents to process at a time for font subsetting.":"一次处理字体子集的页面或文档数量。"," used during conversion.":"在转换过程中使用。","The reference to generate code for.":"引用生成代码的参考。"," that indicates the collection members.":"这表示收集成员。"," value specifying how a printer staples the output.":"值指定打印机如何列入输出。","One of the enumeration values that specifies the font-subsetting policy.":"指定字体掩体策略的枚举值之一。","The comma-separated ":"逗号分隔"," if the value is in the list; otherwise, ":"如果值在列表中； 否则，","The code directives to generate code for.":"为生成代码的代码指令。"," value specifying how a printer handles TrueType fonts.":"值指定打印机如何处理truetype字体。"," if the manager is in batch mode; otherwise, ":"如果经理处于批处理模式； 否则，"," containing the converted value.":"包含转换值。"," if it is found in the list; otherwise, -1.":"如果在列表中找到； 否则，-1。","The value to generate code for.":"生成代码的值。"," is also returned if the object passed is not a ":"如果通过的对象不是一个","The object that is saved.":"保存的对象。","The conversion type.":"转换类型。","The number of namespaces in the collection.":"集合中的名称空间数。","The entry point for the code.":"代码的入口点。",".  This property always returns ":"。 此属性总是返回","An object that specifies the scope of the ":"指定范围的对象 "," representing the converted ":"代表转换的"," values that indicates either that no conflict occurred or that at least one conflict occurred but was resolved. The default is ":" 指示未发生冲突或至少发生了一个冲突但已解决的值。 默认值为 ","The code that declares the type.":"声明类型的代码。","Either the total number of pages or the number of documents in the print job. Which applies depends on the scope of the ":"页面总数或打印作业中的文档数量。 适用于"," parameter, which is a ":"参数，这是一个"," containing user data for the current object.":"包含当前对象的用户数据。","The member event to generate code for.":"成员事件生成代码。"," that defines how the printer handles a print job.":"这定义了打印机如何处理打印作业。","A valid and viable ":"有效且可行的"," that indicates the data type of the object to create.":"这表明要创建对象的数据类型。","The type of the object that this event occurs on.":"此事件发生的对象的类型。","The path to the section to be returned.":"要返回的路段的路径。"," part of an XPS package.":"XPS软件包的一部分。"," value that indicates the scope of the ":"表示范围的值"," objects that indicates the parameters to use to create the object.":"指示用于创建对象的参数的对象。","The code expression to generate code for.":"代码表达式生成代码。"," element in an XPS package.":"XPS软件包中的元素。"," that represents the total number of pages or the number of documents.":"这代表页面的总数或文档数量。"," if the requested section does not exist.":"如果请求的部分不存在。","The name of the data type of object to create.":"要创建对象的数据类型的名称。","The field to generate code for.":"为生成代码的字段。","The path name of the ":"路径名称的名称","The definition that is added.":"添加的定义。","A value that specifies whether the change in progress is an additional page completed or an additional document completed.":"指定更改的值是完成的附加页面还是已完成的附加文档。","The data type of the object to create.":"要创建对象的数据类型。","The end of the line pragma to generate code for.":"Pragma行的结尾为生成代码。","The URI of the page.":"页面的URI。","A value that specifies the total number of pages or the number of documents that are serialized at the time of the event.":"指定事件时序列化的页面总数或文档数量的值。"," specified, or ":"指定，或"," to the data type of the object to create.":"到要创建对象的数据类型。"," if the requested section group does not exist.":"如果请求的部分组不存在。","The start of the line pragma to generate code for.":"Pragma线生成代码的开始。","A value that specifies the percentage of the total serialization job that is complete.":"一个指定完整序列化作业百分比的值。","The definition that is removed.":"删除的定义。"," that indicates the parameters to use when creating the object.":"这表明创建对象时要使用的参数。","The member method to generate code for.":"为生成代码的成员方法。","A user-supplied object that provides additional information for the event handler.":"用户提供的对象，为事件处理程序提供其他信息。"," value that determines which property values to save.":"确定要保存的属性值的值。"," that represents the document location in the sequence.":"这代表序列中的文档位置。","An object that indicates the type of the parameter to declare.":"指示要声明的参数类型的对象。","The type of the object that this method occurs on.":"此方法发生的对象的类型。","The total pages or documents have been serialized at the point when the event occurred.":"在事件发生时，总页面或文档已被序列化。"," to save even if the configuration was not modified; otherwise, ":"即使没有修改配置，也要保存； 否则，"," element, if one exists, and its child elements.":"元素，如果存在及其子元素。","The namespace to generate code for.":"为生成代码的名称空间。","The name of the parameter to declare.":"要声明的参数名称。","The scope of the progress indicator.":"进度指标的范围。","A collection of fixed page readers, one reader for each page in the ":"固定页面读者的集合，每个页面的读者","The output stream that the returned serializer is to write to.":"返回的序列化器要写入的输出流。","The path and file name to save the configuration file to.":"将配置文件保存到的路径和文件名。"," that contains the default printing options for the document; or ":"其中包含文档的默认打印选项； 或者","The type of the parameter to declare.":"要声明的参数的类型。","The namespace import to generate code for.":"命名空间导入以生成代码。","An output writer that serializes XPS content to the specified ":"将XPS内容序列到指定的输出作者"," configuration section that applies to this ":"适用于此的配置部分"," if no print ticket exists for the document.":"如果文档没有打印票。","The compile unit to generate namespaces for.":"编译单元生成命名空间。","An object that indicates the custom attributes.":"指示自定义属性的对象。"," of signature definitions, typically one for every person who signed or will sign the document.":"签名定义，通常适用于签署或签署文件的每个人。","The standard file name extension (including the leading period) for XPS documents.":"XPS文档的标准文件名扩展名（包括领先期）。","A delegate that transforms type strings. The default value is ":"转换类型字符串的委托。 默认值是","An object that indicates the direction of the field.":"指示字段方向的对象。","The property to generate code for.":"为生成代码的属性。"," configuration-section object representing the ":"配置截面对象表示"," that represents the image.":"代表图像。","The type of the parameter.":"参数的类型。","The public name for serializers that the factory produces.":"工厂生产的序列化程序的公共名称。","The type of the object that this property occurs on.":"该属性发生的对象的类型。","The physical path to the configuration file represented by this ":"由此表示的配置文件的物理路径","The primitive data type instance to represent the value of.":"原始数据类型实例表示值。"," that represents the URI for the document.":"这代表了文档的URI。","The manufacturer's name.":"制造商的名字。"," if there is a configuration file; otherwise, ":"如果有配置文件； 否则，","The URI of the fixed document.":"固定文档的URI。","The literal code fragment compile unit to generate code for.":"所述字面代码片段编译单元生成代码。"," that indicates the object that contains the property to reference.":"这表示包含要引用的属性的对象。","The manufacturer's Web site.":"制造商的网站。"," containing the locations defined within this ":"包含此处定义的位置","The member to generate code for.":"成员生成代码。"," if the configuration file has an XML namespace; otherwise, ":"如果配置文件具有XML名称空间； 否则，"," readers, one for each document in a ":"读者，每个文档中的一个","The name of the property to reference.":"要参考的属性名称。","The context, which includes source and destination, of the serialized stream.":"序列化流的上下文，包括源和目的地。","The class constructor to generate code for.":"类构造函数生成代码。","The root section group for this ":"为此的根部组组"," that contains the default printing options for the sequence; or ":"其中包含序列的默认打印选项； 或者","The context, which includes the source and destination, of the serialized stream.":"包括序列化流的源和目的地的上下文。","The name for the region.":"该地区的名称。","The end of the class to generate code for.":"班级生成代码的结尾。","The underlying error that caused the exception.":"导致例外的基本错误。"," collection representing the collection of section groups for this ":"代表该部分组的集合的集合",", if no print ticket exists for the document.":"，如果文档没有打印票。","The name of the region.":"该地区的名称。"," object that contains the provider options from the configuration file.":"从配置文件中包含提供商选项的对象。"," that represents the URI for the sequence.":"这代表了序列的URI。","A collection of the sections defined by this ":"由此定义的部分集合","The namespace to generate classes for.":"为其生成类的命名空间。","An instance of the C# ":"C＃的实例"," that indicates the event to detach the event handler from.":" 这指示要分离事件处理程序的事件。","A writer for outputting the new ":"输出新的作家","The start of the class to generate code for.":"课程开始生成代码的开始。","The name of the targeted version of the .NET Framework. The default value is ":".NET框架的目标版本的名称。 默认值是"," to generate code for.":"生成代码。"," that indicates the event handler to remove.":"这表明事件处理程序要删除。",", which indicates that the current version is targeted.":"，这表明当前版本是针对的。","The type whose name will be returned.":"将返回其名称的类型。","The image type to write.":"要写的图像类型。"," to use when generating the code.":"生成代码时使用。"," that indicates the event to remove a listener from.":"这表明事件从中删除侦听器。","The name of the data type reference.":"数据类型参考的名称。"," that represents a default printing configuration for the sequence.":"这代表了该序列的默认打印配置。","The type of the property collection to create.":"要创建的属性集合的类型。","The literal code fragment to represent.":"文字代码片段代表。","The type of object to retrieve a type converter for.":"要检索类型转换器的对象的类型。","The value to test for conflicts with valid identifiers.":"测试与有效标识符冲突的价值。","The name that substitutes the standard name \"add\" for the configuration item.":"为配置项目替换标准名称“ add”的名称。"," that is being written.":"那是写的。"," that indicates the position of the code fragment.":"这表示代码片段的位置。","The file name extension to use for generated source code files.":"用于生成的源代码文件的文件名扩展名。"," if the value is a valid identifier; otherwise, ":"如果值是有效的标识符； 否则，","The name that replaces the standard name \"clear\" for the configuration item.":"替换配置项目的标准名称“ clear”的名称。","The image type of the thumbnail to add.":"要添加的缩略图的图像类型。","The literal code fragment.":"文字代码片段。","An instance of the Visual Basic ":"Visual Basic的实例 ","The zero-based position of the ":"基于零的位置","The literal expression to represent.":"代表的文字表达。","The type of the collection element.":"集合元素的类型。","The string to test for validity.":"测试有效性的字符串。","The URI of the resource.":"资源的URI。","The literal string.":"字符串。"," that indicates special features of the language.":"这表示语言的特殊功能。"," if the specified string is a valid identifier; otherwise, ":"如果指定的字符串是有效的标识符； 否则，","The name that replaces the standard name \"remove\" for the configuration element.":"替换配置元素的标准名称“删除”的名称。","The name of the parameter to reference.":"参考参数的名称。","The attribute argument to generate code for.":"为生成代码的属性参数。","The literal code fragment of the statement to represent.":"语句的字面代码片段来表示。","The URI of the font.":"字体的URI。"," object used for type conversions.":"用于类型转换的对象。"," indicating the data type of the array to create.":"指示要创建数组的数据类型。","The attributes to generate code for.":"生成代码的属性。","The font that has the specified Uri.":"具有指定URI的字体。","The literal code fragment statement.":"文字代码片段语句。"," if the conversion is allowed; otherwise, ":"如果允许转换； 否则，","An expression that indicates the number of indexes of the array to create.":"表示要创建数组的索引数量的表达式。","The literal code fragment for the type member.":"类型成员的文字代码片段。","The URI of the image.":"图像的URI。","One of the enumeration values that indicates the attribute of the field.":"指示字段属性的枚举值之一。"," object used for type conversion.":"用于类型转换的对象。"," that indicates the data type of the array to create.":" 它指示要创建的数组的数据类型。"," that reads from the configuration file.":"从配置文件读取。"," object that indicates the context of the code statement.":"指示代码语句上下文的对象。","The image that has the specified Uri.":"具有指定Uri的图像。","The expressions to generate code for.":"生成代码的表达式。","An array of expressions to use to initialize the array.":"用于初始化数组的表达式数组。"," to serialize only the collection key properties; otherwise, ":"仅序列化集合密钥属性； 否则，","The resource that has the specified Uri.":"具有指定URI的资源。"," object that contains the objects to add to the collection.":"包含要添加到集合的对象的对象。"," to insert a new line after each item; otherwise, ":"在每个项目之后插入新行； 否则，","The object to compare with.":"与之比较的对象。","The number of indexes of the array to create.":"要创建数组的索引数。","The URI of the resource dictionary.":"资源词典的URI。","The index of the specified object, if it is found, in the collection; otherwise, -1.":"集合中的指定对象的索引； 否则，-1。","One of the enumeration values that specifies the attributes.":"指定属性的枚举值之一。"," if the object to compare with is equal to the current ":"如果要比较的对象等于电流","The name of the data type of the array to create.":"要创建数组的数据类型的名称。","The resource dictionary that has the specified Uri.":"具有指定URI的资源词典。","The identifier to output.":"输出的标识符。"," that indicates the exception to throw.":"这表明投掷的例外。","The data type of the array to create.":"要创建数组的数据类型。"," that includes every ":"其中包括每个","A unique value representing the current ":"代表电流的唯一值"," that indicates the type of the array.":"这表示数组的类型。","One of the enumeration values that indicates the member access modifier to generate code for.":"指示成员访问修饰符生成代码的枚举值之一。"," representing an instance of the exception to throw.":"表示要投掷的例外实例。"," that is on the page.":"那在页面上。","The transformed version of the assembly name. If no transformer is available, the ":"汇编名称的转换版本。 如果没有变压器可用，","One of the enumeration values that indicates the member scope modifier to generate code for.":"指示成员范围修改器生成代码的枚举值之一。"," that indicates the initialization values.":"这表示初始化值。"," objects that indicate the statements to try.":"表示要尝试的语句的对象。"," parameter value is returned unchanged. The ":"参数值返回不变。 这","The operator to generate code for.":"运算符生成代码。"," that represents the page number.":"这代表页码。","The number of indexes in the array.":"数组中的索引数。"," objects that indicate the clauses to catch.":"表示捕获条款的对象。"," if no transformer is available.":"如果没有变压器可用。"," that contains the default printing options for the page; or ":"其中包含页面的默认打印选项； 或者","The parameter declaration expressions to generate code for.":"参数声明表达式生成代码。"," that indicates the size of the array.":"这表示数组的大小。"," objects that indicate the finally statements to use.":"表示最终要使用的语句的对象。","The transformed version of the specified type name. If no transformer is available, the ":"指定类型名称的转换版本。 如果没有变压器可用，"," that indicates the array the indexer targets.":"这表明数组索引目标。"," exists for the page.":"该页面存在。"," that indicates the catch clauses to use.":"这表明要使用的捕获条款。","The type to generate code for.":"生成代码的类型。"," if the element has been modified; otherwise, ":"如果元素已修改； 否则，"," that indicates the finally statements.":"这表示最后的语句。"," that represents the URI for the page.":"这代表了页面的URI。","One of the enumeration values that indicates the type attributes to generate code for.":"指示要生成代码的类型属性的枚举值之一。","The index or indexes to reference.":"索引或索引参考。","The name of the unrecognized attribute.":"未识别属性的名称。","The new color context resource that was added.":"添加的新颜色上下文资源。"," if the type is a struct; otherwise, ":"如果类型是结构； 否则，","The value of the unrecognized attribute.":"未识别属性的价值。"," that indicates the index or indexes of the indexer expression.":"这表示索引表达式的索引或索引。"," that indicates the statements to try.":"这表明要尝试的语句。","The new font resource that was added.":"添加的新字体资源。"," if the type is an enum; otherwise, ":"如果类型是枚举； 否则，"," when an unknown attribute is encountered while deserializing; otherwise, ":"当避免时遇到未知属性时； 否则，","The name for the new type.":"新类型的名称。"," that represents the array being indexed.":"这代表索引的数组。"," to obfuscate the font; otherwise, ":"混淆字体； 否则，"," object that indicates the base types of the type.":"表示类型的基本类型的对象。","The name of the unknown subelement.":"未知子元素的名称。","The name for the object.":"对象的名称。","The variable to assign to.":"分配的变量。"," to prevent modification of any text that uses the font; otherwise, ":"防止修改任何使用该字体的文本； 否则，"," being used for deserialization.":"被用于避难所。"," if the type is a class or reference type; otherwise, ":"如果类型是类或参考类型； 否则，","The MIME type of the image to add.":"要添加的图像的MIME类型。","The converted string.":"转换的字符串。"," that indicates the object or reference to assign to.":"这表示要分配的对象或引用。"," when an unknown element is encountered while deserializing; otherwise, ":"当避免时遇到未知元素时； 否则，"," that indicates the object or reference to assign.":"这表示要分配的对象或引用。","The new image resource that was added to the page":"已添加到页面的新图像资源"," if the type is an enumeration; otherwise, ":"如果类型是枚举； 否则，","The type of code generation support to test for.":"代码生成的类型支持要测试。","The name of the required attribute that was not found.":"未找到所需属性的名称。","The string to generate a valid identifier for.":"为生成有效标识符的字符串。","The type of image to add to the page.":"要添加到页面的图像类型。"," that indicates the event to attach an event handler to.":"这表明将事件处理程序附加到的事件。"," if the type is an interface; otherwise, ":"如果类型是接口； 否则，","The type of resource to add.":"要添加的资源类型。","The CodeDOM compilation unit to generate code for.":"编码汇编单元生成代码。"," that will be used to serialize the ":" 这将用于序列化 "," that indicates the new event handler.":"这表示新事件处理程序。"," if the class or structure declaration is a partial representation of the implementation; ":"如果类或结构声明是实施的部分表示；","The options to use for generating code.":"用于生成代码的选项。","The absolute path of the resource to add, or ":"要添加资源的绝对路径，或"," that indicates the object that contains the event.":"这表示包含事件的对象。","The parent node of the configuration element.":"配置元素的父节点。"," if the declaration is a complete implementation of the class or structure. The default is ":"如果声明是班级或结构的完整实现。 默认值为","The statement that contains the CodeDOM elements to translate.":"包含要翻译的编码元素的语句。","The new XML Paper Specification (XPS) resource that was added.":"添加的新XML纸张规范（XPS）资源。","The name of the event to attach an event handler to.":"将事件处理程序附加到的事件的名称。"," that writes to the configuration file.":"该写入配置文件。"," object that indicates the class members.":"指示类成员的对象。"," that was added to the page.":"添加到页面上。","The value to test.":"测试的值。"," that indicates the new event handler to attach.":" 这指示要附加的新事件处理程序。"," object that indicates the attributes of the type.":"指示类型属性的对象。"," if any data was actually serialized; otherwise, ":"如果任何数据实际上是序列化的； 否则，"," that represents the value of the argument.":"这代表了论点的价值。","The image type of the thumbnail image to add to the page.":"缩略图图像的图像类型要添加到页面上。","The new thumbnail image resource that was added.":"添加的新缩略图图像资源。"," to be written.":"要写。","The capabilities to test the generator for.":"测试发电机的能力。"," that contains the type parameters for the type declaration.":"其中包含类型声明的类型参数。","The name of the attribute property the argument applies to.":"该参数适用的属性属性的名称。","A list of strings that identify the ":"标识的字符串列表","The name of the delegate.":"代表的名字。"," if the specified capabilities are supported; otherwise, ":"如果支持指定的功能； 否则，"," hyperlink points that are contained in the page.":"页面中包含的超链接点。","The name of the attribute property the argument is for.":"该参数的属性属性名称。"," if writing was successful; otherwise, ":" 如果写作成功；否则, ","The identifier to validate.":"验证的标识符。"," that indicates the parameters of the delegate.":"这表示委托的参数。","The element property to set.":"要设置的元素属性。"," that indicates the value for the attribute argument.":"这表示属性参数的值。","The zero-based page number of this page.":"本页的从零开始的页码。"," that indicates the return type of the delegate.":"这表示委托的返回类型。","The identifier to test for validity as an identifier.":"测试有效性作为标识符的标识符。"," if the locks on the property should be ignored; otherwise, ":"如果应忽略属性上的锁； 否则，"," objects with which to initialize the collection.":"用来初始化集合的对象。","The URI of the fixed page.":"固定页面的URI。","An object to test for invalid identifiers.":"测试无效标识符的对象。"," values used to indicate the attributes of the member. The default value is ":"用于指示成员属性的值。 默认值是"," for writing XML markup to the page.":"将XML标记写入页面。"," with which to initialize the collection.":"用它来初始化集合。"," at the current level containing a merged view of the properties.":"在当前级别，包含属性的合并视图。"," that indicates the comments for the member.":"这表示会员的评论。"," that contains the objects to add to the collection.":"其中包含要添加到集合的对象。"," if this is the top level.":"如果这是最高级别。","The action that the packaging process is currently performing.":"包装过程当前执行的操作。","The code type declaration for the current class.":"当前类的代码类型声明。"," that indicates the custom attributes of the member.":"这表明会员的自定义属性。","The number of simultaneous times that the specified ":"指定的同时时间数","The current member of the class.":"班级的当前成员。"," if the collection contains the specified object; otherwise, ":" 如果集合包含指定的对象；否则, "," object that indicates the location of the type member declaration.":"表示类型成员声明的位置的对象。","One of the enumeration values that determines which property values to include.":"确定要包括哪些属性值的枚举值之一。","The index of the array at which to begin inserting.":"开始插入的数组的索引。"," occurred.":"发生了。","The name of the current member.":"当前成员的名称。"," that indicates the data type for the ":"这指示了数据类型","The top-level ":"顶级","The index of the specified object, if found, in the collection; otherwise, -1.":"集合中指定对象的索引； 否则，-1。","The current class name.":"当前的班级名称。"," that represents the part of the packaging process that is currently occurring.":"这代表了当前发生的包装过程的一部分。","The name of the data type for the ":"数据类型的名称"," instance that the current ":"实例是当前"," that represents the number of simultaneous times that the action that is identified in ":"这代表了在","The zero-based index where the specified object should be inserted.":"应插入指定对象的基于零的索引。","The number of spaces to indent for each indentation level.":"每个凹痕水平的缩进空间数量。","The data type of the data type of the ":"数据类型的数据类型"," instance belongs to.":"实例属于。"," if the current object is a class; otherwise, ":"如果当前对象是类； 否则，"," has occurred.":"已经发生了。","The index of the collection to access.":"访问集合的索引。"," that contains the non-customizable information and functionality of the ":"其中包含不可维护的信息和功能"," that indicates the data type referenced by the ":"这表明由","The URI of the page on which to display the signature.":"显示签名的页面的URI。","false if the ":"如果是错误的"," at each valid index.":"在每个有效索引处。"," if the current object is a delegate; otherwise, ":"如果当前对象是代表； 否则，","The X page coordinate for the digital signature.":"X页面坐标用于数字签名。"," expression. This property will never return ":"表达。 该属性将永远不会返回","The property to access.":"要访问的属性。"," that identifies the attribute.":"这可以识别属性。"," if the current object is an enumeration; otherwise, ":"如果当前对象是枚举； 否则，","The specified property, attribute, or child element.":"指定的属性，属性或子元素。","The Y page coordinate for the digital signature.":"Y页面协调数字签名。",", and defaults to the ":"，默认为"," that contains the arguments for the attribute.":"其中包含属性的参数。"," to access.":"访问。"," if the current object is an interface; otherwise, ":" 如果当前对象是接口；否则, "," that identifies the ":"这确定了","The associated digital signature for the package.":"包装的相关数字签名。"," object that contains the constraints for the type parameter.":"包含类型参数约束的对象。"," if the current object is a value type or struct; otherwise, ":"如果当前对象是值类型或结构； 否则，"," that indicates the custom attributes of the type parameter. The default is ":"这表示类型参数的自定义属性。 默认值为","The specified property, attribute, or child element":"指定的属性，属性或子元素","The associated package.":"关联的软件包。","The index in the collection of the specified object, if found; otherwise, -1.":"如果找到了指定对象的集合中的索引； 否则，-1。","The token that represents ":"代表的令牌"," if the type parameter has a constructor constraint; otherwise, ":"如果类型参数具有构造函数约束； 否则，"," on the left of the operator.":"在操作员的左侧。"," of locked attributes (properties) for the element.":"该元素的锁定属性（属性）。"," enumeration values that specify the result of the verification attempt.":"指定验证尝试结果的枚举值。","The name of the type parameter. The default is an empty string (\"\").":"类型参数的名称。 默认值是一个空字符串（“”）。","An object that indicates the options for the code generator to use.":"指示代码生成器使用的选项的对象。"," indicating the type of operator.":"指示操作员的类型。"," of locked elements.":"锁定元素。","The zero-based index at which the new element was inserted.":"插入新元素的基于零的索引。","The certificate of authenticity for the signer.":"签名人的真实性证书。","The text writer to use for output.":"用于输出的文本作者。"," on the right of the operator.":"在操作员的右侧。"," if the element is locked; otherwise, ":"如果元素被锁定； 否则，","The name of a data type for which to add the ":"为添加的数据类型的名称","A bitwise combination of the enumeration values that specify the result of the verification attempt.":"指定验证尝试结果的枚举值的位组合。"," if blank lines should be inserted; otherwise, ":"如果应该插入空白行； 否则，"," that indicates the left operand.":"这表示左操作数。","A certificate of authenticity.":"真实性证书。"," of properties for the element.":"元素的属性。"," object to the collection.":"对象集合。"," that indicates the type of operator in the expression.":"这表明表达式中的运算符类型。",". By default, the value of this property is ":"。 默认情况下，此属性的值为"," object is contained in the collection; otherwise, ":"集合中包含对象； 否则，"," if changing the properties of the document invalidates the signature; otherwise, ":"如果更改文档的属性，则签名无效； 否则，"," comparer to use.":"使用的比较。"," that indicates the right operand.":"这表示正确的操作数。","A string containing the bracing style to use.":"包含用于使用的支撑样式的字符串。","The GUID of the signature.":"签名的指导。","The zero-based index of the specified ":"指定的基于零的索引"," to throw an exception if the ":"如果是例外"," if an else should be appended; otherwise, ":"如果应该附加其他； 否则，"," that indicates the destination type of the cast.":"这表示演员的目的地类型。"," specified is already contained in the ":"指定已包含在"," object in the collection if found; otherwise, -1.":"集合中的对象如果发现； 否则，-1。",". The default value of this property is ":"。 该属性的默认值是"," if the X.509 certificate of the signer is embedded in the document ":"如果签名人的X.509证书已嵌入文档中"," to cast.":"铸造。","The zero-based index of the collection object to access.":"收集对象的基于零的索引访问。","The index location at which to add the specified ":"添加指定的索引位置","A string containing the characters to use for indentations.":"一个包含用于凹痕的字符的字符串。"," if the signature is invalidated if an additional digital signature is applied; otherwise, ":"如果签名无效，则如果应用了额外的数字签名； 否则，","The name of the destination type of the cast.":"演员的目的地类型的名称。","The index location of the ":"索引位置"," that represents the type of the type parameter.":"这代表类型参数的类型。","A URL string that identifies the signature type. The default signature type is ":"标识签名类型的URL字符串。 默认签名类型是","The name associated with the object to retrieve.":"与要检索的对象关联的名称。","The destination data type of the cast.":"演员的目标数据类型。"," with the specified key; otherwise, ":"使用指定的键； 否则，"," array that contains the encrypted hash value of the signature.":"包含签名的加密哈希值的数组。","The name of the type to reference.":"参考类型的名称。","The object associated with the specified name. If no object associated with the specified name exists in the collection, ":"与指定名称关联的对象。 如果集合中没有与指定名称相关联的对象，"," that indicates the code to cast.":"这表明要施放的代码。","An array that contains the keys for all of the ":"一个包含所有键的数组"," if not all valid XPS parts have been signed in the document.":"如果不是所有有效的XPS零件，则已在文档中签名。","The code type reference option, one of the ":"代码类型参考选项，其中之一"," that indicates the destination type to cast to.":"这表明要投放的目的地类型。"," to generate the members in the order in which they occur in the member collection; otherwise, ":"以成员收集中出现的顺序生成成员； 否则，","The X.509 certificate of the signer; or ":"签名人的X.509证书； 或者","The index location for the ":"索引位置","The name of the type of the elements of the array.":"数组元素类型的名称。","The name of the local variable declared in the catch clause for the exception. This is optional.":"对于异常，在捕获子句中声明的本地变量的名称。 这是可选的。"," that is used to read the code to be parsed.":"用于读取要解析的代码。","The number of dimensions of the array.":"数组的尺寸数。"," when there is no certificate embedded in the document package.":"当文档软件包中没有证书时。"," that indicates the type of exception to catch.":"这表明要捕获的异常类型。","The key for the specified ":"指定的关键"," containing the code model produced from parsing the code.":"包含通过解析代码产生的代码模型。"," to reference.":"参考。","The date and time when the pages, document, or document sequence was signed.":"签署页面，文档或文档序列的日期和时间。"," for the specified index location.":"对于指定的索引位置。"," objects that represent the contents of the catch block.":"表示捕获块内容的对象。"," that indicates the type of the array elements.":"这表示数组元素的类型。","The key of the element to check.":"要检查的元素的关键。","The file name of the file that the compiler was compiling when it encountered the error.":"编译器遇到错误时正在编译的文件名称。","The target XPS package for the ":"目标XPS软件包"," that indicates the type of the exception to handle.":"这表明要处理的异常类型。"," with the specified key has been removed; otherwise, ":"用指定的键已删除； 否则，","The line of the source of the error.":"错误源的线。","The target package for the ":"目标包","The name of the type being referenced.":"被引用的类型的名称。","The name for the exception variable that the ":"异常变量的名称","The column of the source of the error.":"错误源的列。","The package compression option.":"包装压缩选项。"," containing the type arguments for the current ":"包含当前类型的参数","Array to which to copy the contents of the ":"来复制内容的数组"," clause handles.":"子句处理。","The uniform resource identifier (URI) for the document as a string.":"文档作为字符串的统一资源标识符（URI）。","The error number of the error.":"错误的错误编号。","The name of a data type for which to add a ":"为添加一个数据类型的名称","Index location at which to begin copying.":"索引位置开始复制。"," containing the statements within the catch block.":"包含捕获块中的语句。"," with a specified name.":"带有指定名称。","The path and file name of the target ":"目标的路径和文件名"," to the collection.":"到收藏。","The error message text.":"错误消息文本。"," object at each valid index.":"每个有效索引处的对象。"," to return the key for.":"返回钥匙。","The file I/O mode in which to open the ":"文件I/O模式可以打开","The path to the checksum file.":"校验和文件的路径。","A string representation of the compiler error.":"编译器错误的字符串表示。","The data type for which to add a ":"添加一个数据类型","The XML Paper Specification (XPS) fixed-document sequence writer for this ":"XML纸张规范（XPS）固定文档序列作者"," that acts as the key for the specified ":"这是指定的关键","The error number as a string.":"错误编号作为字符串。","The column number of the source file where the compiler encountered the error.":"编译器遇到错误的源文件的列号。","The format of the image.":"图像的格式。"," which is used to iterate through the ":"用来迭代通过","The file name of the source file that contains the code which caused the error.":"包含导致错误的代码的源文件的文件名。","The newly added ":"新添加","A unique value representing the ":"代表","The XPS document to write.":"要写的XPS文档。"," if the error is a warning; otherwise, ":"如果错误是警告； 否则，"," current instance.":"当前实例。"," to use for writing the XML Paper Specification (XPS) document.":"用于编写XML纸规范（XPS）文档。","The name of the element to verify.":"要验证的元素的名称。","The line number of the source file where the compiler encountered the error.":"编译器遇到错误的源文件的行号。"," if the element exists in the collection; otherwise, ":"如果该元素存在于集合中； 否则，","The index in the array at which to start copying.":"阵列中开始复制的索引。"," can be removed from this ":"可以从中删除","The zero-based index where the compiler error should be inserted.":"应插入编译器误差的基于零的索引。"," if the collection contains errors; otherwise, ":"如果该集合包含错误； 否则，"," if any contained element has been modified; otherwise, ":"如果任何包含的元素已修改； 否则，"," if the collection contains warnings; otherwise, ":"如果该系列包含警告； 否则，"," instance that contains the compiler options and settings configured for the language provider.":"包含为语言提供商配置的编译器选项和设置的实例。"}