{"The assembly that contains the CLR namespace and types to map to the XML namespace.":"包含CLR名称空间的组件和要映射到XML名称空间的类型。"," if the dependency property on which this metadata exists potentially affects the measure pass specifically on its parent element; otherwise, ":"如果该元数据存在的依赖性属性可能会针对其母元素专门影响量度通过； 否则，","Position of the ":"位置","The height of the menu bar.":"菜单栏的高度。"," on which to set the ":" 在其上设置 "," if the dependency property on which this metadata exists affects rendering; otherwise, ":"如果该元数据存在的依赖性属性会影响渲染； 否则，","The CLR  namespace in the assembly that contains the relevant types.":"包含相关类型的组件中的CLR名称空间。"," reference to the content object that is being navigated to; otherwise, ":"引用正在导航到的内容对象； 否则，"," if the dependency property on which this metadata exists binds two-way by default; otherwise, ":"如果该元数据存在的依赖关系默认情况下，依赖性属性绑定了双向； 否则，","The height of the caption area.":"标题区域的高度。","The height of a menu bar button.":"菜单栏按钮的高度。","The CLR namespace.":"CLR名称空间。"," object that is associated with the back navigation history entry for the page being navigated from.":"与后面导航历史记录条目相关联的对象，该页面正在导航。","A value that describes the amount that corners are rounded.":"一个描述拐角处圆润的值。","A value of the enumeration, other than ":"枚举的价值除外","The XML processing context to base the new ":"XML处理上下文以基于新的","The width of a menu bar button.":"菜单栏按钮的宽度。","The optional data ":"可选数据","A uniform thickness of -1 in all cases.":"在所有情况下，均匀厚度为-1。","The XAML parser context to convert to an ":"XAML解析器上下文转换为"," if the property value is inheritable; otherwise, ":"如果财产价值是可以继承的； 否则，","The height of a bitmap.":"位图的高度。"," that was passed when navigation started.":"这是在导航开始时通过的。","The width of the glass border around a window.":"窗户周围的玻璃边界的宽度。"," if data binding is supported on the dependency property to which this metadata applies; otherwise, ":"如果支持该元数据应用的依赖项属性的数据绑定； 否则，","The converted XML parser context.":"转换后的XML解析器上下文。"," value that is ":"值是"," if left-aligned; otherwise, ":" 如果左对齐;否则, ","A bitwise combination of the enumeration values that specify which edges of the frame are not owned by the client.  \n  \n The registered default is ":"枚举值的位组合，该值指定了帧的哪个边缘，但客户端不拥有哪个边缘。 \n  \n  注册默认值为"," if the property does not support data binding; otherwise, ":"如果属性不支持数据绑定； 否则，"," if the navigator that is specified by ":"如果由"," when fade animation is enabled; otherwise, ":"启用淡出动画时； 否则，","The context to convert to an ":"要转换为 ","The width of the border that is used to resize a window.":"用于调整窗口大小的边框的宽度。"," is servicing this navigation. Otherwise, ":"正在为此导航提供服务。 否则，"," if journaling should be performed on the dependency property that this metadata is applied to; otherwise, ":"如果应对该元数据应用的依赖性属性进行日记； 否则，","The XML parser context.":"XML解析器上下文。","The menu height.":"菜单高度。"," is returned, such as during a nested ":"返回，例如嵌套期间"," if the property value inheritance should span across certain content boundaries; otherwise, ":"如果属性值继承应跨越某些内容边界； 否则，"," if hit-testing is enabled on the caption buttons; otherwise, ":"如果在标题按钮上启用了命中测试； 否则，","The base URI, as a string.":"基本URI，作为字符串。","The pop-up animation property.":"弹出动画属性。"," if changes to sub-property values do not affect rendering if changed; otherwise, ":"如果更改子属值如果更改，则不会影响渲染； 否则，"," navigation.":"导航。"," component of the size changed; otherwise, ":"大小的组成部分更改； 否则，","The delay time.":"延迟时间。","The type mapper to use when mapping XAML elements to CLR types.":"将XAML元素映射到CLR类型时要使用的类型映射器。","The string name.":"字符串名称。"," value that indicates the type of navigation that is occurring.":" 指示正在发生的导航类型的值。"," string value.":"字符串值。","The context of the ":"的背景","The menu width, in pixels.":"菜单宽度，以像素为单位。","The XAML namespace dictionary.":"XAML名称空间词典。"," that is the navigator that raised this event":"那是提出此事件的导航器","A string array that contains the command line arguments that were passed to the application from either the command prompt or the desktop. If no command line arguments were passed, the string array as zero items.":"一个字符串数组，其中包含从命令提示符或桌面传递给应用程序的命令行参数。 如果没有传递命令行参数，则字符串数组为零项。"," where this template is applied.":"应用此模板的位置。","The character for ":"角色"," if the minimize window animations feature is enabled; otherwise, ":"如果启用了最小化窗口动画功能； 否则，","The element associated with the specified name.":"与指定名称关联的元素。"," object that is to be applied to the content being navigated to.":"将应用于要导航的内容的对象。","The object value to set on the property where the markup extension provided value is evaluated.":"评估标记扩展值的属性上设置的对象值。","The height of a grid cell for a minimized window.":"最小化窗口的网格单元的高度。"," or this context.":"或此上下文。","The root element of the content. Calling this multiple times returns separate instances.":"内容的根元素。 多次呼吁此返回单独的实例。","The resource key for a resource.":"资源的资源密钥。"," for the content being navigated to. If navigating to an object, ":"因为要导航到的内容。 如果导航到对象，","An object that will be the root of the serialized tree.":"将成为序列化树的根的对象。","The width of a grid cell for a minimized window.":"最小化窗口的网格单元的宽度。","The name to register.":"注册的名称。"," object that is used to request the specified content.":"用于请求指定内容的对象。","The type to which the style will apply.":"样式适用的类型。","The height of a minimized window.":"最小化窗口的高度。","The name identifier for the object being requested.":"要请求对象的名称标识符。","A markup object that enables navigating through the tree of objects.":"一种标记对象，可在对象树中进行导航。","The style to base this style on.":"以这种样式为基础的样式。","The serialization manager.":"序列化经理。","The width of a minimized window.":"最小化窗口的宽度。","The object, if found. Returns ":"如果发现对象。 返回","The root element of the target page's content.":"目标页面内容的根元素。"," if the converter can perform the conversion; otherwise, ":"如果转换器可以执行转换； 否则，","The data object.":"数据对象。","The width of the rectangle, in pixels.":"矩形的宽度，像素。","The object to map to the specified ":"要映射到指定的对象 "," if no object of that name was found.":"如果找不到该名称的对象。","The conversion result.":"转换结果。","A defined style that is the basis of the current style. The default value is ":"定义的样式是当前样式的基础。 默认值是"," if the navigation was initiated inside the current frame; ":"如果导航是在当前框架内启动的；","The height of the rectangle, in pixels.":"矩形的高度，像素。","The converter object, or possibly an unconverted source.":"转换器对象，或可能是未转换的源。"," if this template has optimized content; otherwise, ":"如果此模板具有优化的内容； 否则，","The minimum height of a window.":"窗户的最小高度。"," if the style is sealed; otherwise ":"如果样式密封； 否则","The XML writer implementation to use as basis for the ":"XML作者实施以用作","The resources that can be used within the scope of this template.":"可以在此模板范围内使用的资源。","The minimum tracking height of a window.":"窗户的最小跟踪高度。","The resources that can be used within the scope of this style.":"可以在此样式范围内使用的资源。"," if the parent navigator is also navigating.":" 如果父导航器也在导航。","The XAML writer mode.":"XAML作者模式。","A reference to the object that records or plays the XAML nodes for the template.":"对记录或播放模板XAML节点的对象的引用。","The target type for this style.":"此样式的目标类型。","The created object.":"创建的对象。","The navigator that raised the event.":"举起活动的导航员。","The root node of the template.":"模板的根节点。","The minimum tracking width of a window.":"窗口的最小跟踪宽度。","The name of the property that is of type ":"类型的属性名称","Contains all the information that is required to serialize or deserialize the object.":"包含序列化或应对对象的所有需要的所有信息。","The minimum width of a window.":"窗口的最小宽度。","The URI of the target page.":"目标页面的URI。","The number of device-independent pixels (96 pixels-per-inch).":"独立于设备的像素（每英寸96个像素）的数量。"," this attribute is specifying.":"此属性是指定的。","The height of a rectangle used for a mouse-hover event.":"用于鼠标悬挂事件的矩形的高度。","The source and destination of a serialized stream.":"序列化流的来源和目的地。","The initial value of this instance of ":"此实例的初始值","The Web response.":"网络响应。","The initial exception that occurred.":"发生的初始例外。"," set to the color of the active window's border. The returned brush's ":"设置为活动窗口边框的颜色。 返回的刷子"," that was raised as the result of a failed navigation.":"这是由于导航失败而提出的。"," held by this instance of ":"由这种情况","The time, in milliseconds, that the mouse must be in the hover rectangle to generate a mouse-hover event.":"以毫秒为单位的时间，鼠标必须在悬停矩形中以生成鼠标悬停事件。",", so it cannot be modified.":"，因此无法修改。","The line number where the exception occurred.":"发生异常的线号。"," if the specified object has the same value and ":"如果指定的对象具有相同的值，并且","The width of a rectangle used for a mouse-hover event.":"用于鼠标悬挂事件的矩形的宽度。"," that was passed when navigation commenced.":"这是在导航开始时通过的。","The position in the line at which the exception occurred.":"发生例外的线路中的位置。"," used to paint the active window's border. This brush's ":"用于绘制活跃的窗户边框。 这是刷子"," as the current instance; otherwise, ":"作为当前实例； 否则，"," if the exception is handled; otherwise, ":"如果处理例外； 否则，","The serialization information object to add the serialization data to.":"序列化信息对象将序列化数据添加到。","The height of the screen.":"屏幕的高度。"," structure to compare with the current instance.":"与当前实例进行比较的结构。","The color of the active window's border.":"活动窗的边框的颜色。","The width of the screen.":"屏幕的宽度。","The parser context base URI.":"解析器上下文基础URI。"," (default).":"（默认）。"," has the same value and ":"具有相同的值和"," of the active window's border.":"活动窗的边框。"," for the content that could not be navigated to.":"对于无法导航的内容。","The height of the border.":"边界的高度。","The relevant XAML ":"相关的XAML"," have the same value and ":"具有相同的价值和"," set to the background color of the active window's title bar. The returned brush's ":"设置为活动窗口标题栏的背景颜色。 返回的刷子"," object that was used to request the specified content. If navigating to an object, ":"用于请求指定内容的对象。 如果导航到对象，","The scroll height, in pixels.":"滚动高度，像素。","The XAML name of the object.":"对象的XAML名称。"," that was returned after attempting to download the requested the specified content. If the navigation failed, ":"尝试下载请求的指定内容后返回。 如果导航失败，"," used to paint the background of the active window's title bar. This brush's ":"用于绘制Active Window标题栏的背景。 这个刷子"," do not have the same value and ":"没有相同的价值和","The scroll width, in pixels.":"滚动宽度，以像素为单位。"," object that represents the WPF schema context settings for a ":"代表WPF架构上下文设置的对象","The background color of the active window's title bar.":"活动窗口标题栏的背景颜色。"," representation of the current ":"电流的表示","The number of bytes that have been read.":"已读取的字节数。"," if the fade effect is enabled; otherwise, ":" 如果启用了淡入淡出效果；否则, ","The resource key for the background ":"背景的资源密钥","The XAML to load, in stream form.":"以流形式加载的XAML。","A instance of ":"一个实例","The maximum number of bytes.":"最大字节数。"," if the user requires an application to present information visually where it typically presents the information only in audible form; otherwise ":"如果用户需要一个应用程序以直观的方式显示信息通常仅以听觉形式呈现信息； 否则","The object at the root of the created object tree.":"在创建对象树的根部的对象。","The caption height, in pixels.":"标题高度，像素。"," of the active window's title bar.":" 活动窗口的标题栏。","The navigator that raised the event":"举起活动的导航员"," that represents the value of the current instance.":" 表示当前实例的值。","The stream that contains the XAML input to load.":"包含要加载的XAML输入的流。","Cultural specific information that should be respected during conversion.":"在转换过程中应尊重的文化特定信息。"," set to the background color of the color of the text in the active window's title bar. The returned brush's ":"设置为Active Window的标题栏中文本颜色的背景颜色。 返回的刷子"," in content that is hosted by a navigator.":"在由导航器托管的内容中。","The caption width, in pixels.":"标题宽度，以像素为单位。","Context information used by the parser.":"解析器使用的上下文信息。","The width of the icon.":"图标的宽度。"," that paints the text in the active window's title bar. This brush's ":"在活动窗口的标题栏中绘制文本。 这个刷子","The type for which this template is intended.":"该模板的意图类型。"," for the navigator whose content contains the specified ":"对于包含指定的内容的导航器","The object that is the root of the created object tree.":"是创建对象树的根的对象。","The height of the caption button.":"标题按钮的高度。","The number of alternating item containers for the next level of items.":"下一级项目的交替项目容器的数量。"," object. This is expected to be initialized with input XAML.":"目的。 预计将使用输入XAML初始化。","The color of the active window's title bar.":"活动窗的标题栏的颜色。","; can be ":";可 ","The width of the caption button.":"标题按钮的宽度。"," of the text in the active window's title bar.":"Active Window的标题栏中的文本。"," that is copied to each child item.":"这是复制到每个子项目的。"," that has already loaded the XAML input to load in XML form.":"这已经加载了XAML输入以以XML形式加载。"," when the feature is enabled; otherwise, ":"启用该功能时； 否则，"," in some cases.":"在某些情况下。"," set to the color of the application workspace. The returned brush's ":"设置为应用程序工作空间的颜色。 返回的刷子","The stream containing the XAML input to load.":"包含XAML输入的流。"," if hot tracking of a stylus is enabled; otherwise ":"如果启用了手写笔的热跟踪； 否则"," that is applied to the item container for each child item.":"该物品适用于每个子项目的项目容器。","An object that contains the content to navigate to.":"包含要导航的内容的对象。"," that paints the application workspace. This brush's ":"绘制应用程序工作空间。 这个刷子"," if the functionality of the left and right mouse buttons are swapped; otherwise ":"如果交换了左和右鼠标按钮的功能； 否则","A stream containing the XAML input to load.":"包含XAML输入的流。"," that chooses which style to use as the ":"选择哪种样式用作"," if a navigation is not canceled; otherwise, ":"如果未取消导航； 否则，","The color of the application workspace.":"应用程序工作区的颜色。","The height of a border.":"个边框的高度。","The root of the created object tree.":"创建对象树的根。","The width of a border.":"边界的宽度。"," of the application workspace.":"应用程序工作区。","An object that contains data to be used for processing during navigation.":"一个包含在导航期间用于处理的数据的对象。","An existing  ":"现有","A composite string that specifies how to format the items in the next level of the data hierarchy if they are displayed as strings.":"一个复合字符串指定如何在数据层次结构的下一个级别中格式化项目，如果它们显示为字符串。"," set to the face color of a three-dimensional display element. The returned brush's ":"设置为三维显示元件的面部颜色。 返回的刷子","Download content into a partial trust security sandbox (with the default Internet zone set of permissions, if ":"将内容下载到部分信任安全沙箱中（如果有默认的Internet区域，则"," if ToolTip animation is enabled; otherwise, ":"如果启用了工具提示动画； 否则，"," property on a generated ":"生成的财产"," that has already loaded/read the XAML input.":"已经加载/读取XAML输入。"," if there is at least one entry in back navigation history; otherwise, ":"如果背部导航历史记录至少有一个条目； 否则，"," that paints the face of a three-dimensional display element. This brush's ":"这绘制了三维显示元素的脸部。 这个刷子"," if a fade effect is used; ":"如果使用褪色效果；"," if there is at least one entry in forward navigation history; otherwise, ":"如果向前导航历史记录至少有一个条目； 否则，","The input XAML, as a single text string.":"输入XAML，作为单个文本字符串。"," (such as a ":"（比如一个"," if a slide effect is used.":"如果使用幻灯片效果。","The face color of a three-dimensional display element.":"三维显示元素的面部颜色。","An object that is a reference to the object that contains the current content.":"是对包含当前内容的对象的引用的对象。","The array of assembly names the ":"组装数组名称","), to indicate how to display items from the next level in the data hierarchy.":"），指示如何在数据层次结构中的下一个级别显示项目。","A system value for the pop-up animation property.":"弹出动画属性的系统值。"," if at least one entry has been added to back navigation history, or ":"如果至少添加了一个条目以返回导航历史记录或","The resource key for the face ":"面部的资源密钥"," object to apply to the ":"对象适用于"," should use.":"应该使用。"," if there are not entries or the ":"如果没有条目或"," if all UI effects are enabled; ":"如果启用了所有UI效果；"," of a three-dimensional display element.":"三维显示元素的元素。"," if there are no entries in forward navigation history, or the ":"如果前进导航历史记录没有条目，或","), to indicate how to select a template to display items from the next level in the data hierarchy.":"），指示如何选择模板以从数据层次结构中的下一个级别显示项目。"," if they are disabled.":"如果它们被禁用。","The array of namespace maps the ":"名称空间的数组地图"," set to the shadow color of a three-dimensional display element. The returned brush's ":"设置为三维显示元素的阴影颜色。 返回的刷子","The element name, which is unique in the namescope and can be used as an identifier for certain operations.":"元素名称，在名称范围中是唯一的，可以用作某些操作的标识符。","The prefix for the XML namespace.":"XML名称空间的前缀。","The URI for the content that was last navigated to, if navigated to by using a URI; otherwise, ":"如果使用URI导航到，则上次导航到的内容的URI;否则, ","The converted object, or an empty string.":"转换的对象或一个空字符串。"," that paints the shadow of a three-dimensional display element. This brush's ":" 即描绘三维显示元件的阴影。 这把刷子的 ","The color theme name.":"颜色主题名称。","The CLR  namespace that contains the types to map.":"包含要映射类型的CLR名称空间。"," if at least one entry has been added to forward navigation history, or null if there are no entries or the ":"如果至少添加了一个条目到远期导航历史记录，或者没有条目或","The shadow color of a three-dimensional display element.":"三维显示元素的阴影颜色。","The theme name.":"主题名称。","Element from which to get the attached property.":"从中获取附加属性的元素。","The assembly that contains the CLR  namespace.":"包含CLR名称空间的组件。","The navigation service used by this ":"此使用的导航服务","The resource key for the shadow ":"影子的资源密钥","The element to write the attached property to.":"将附件属性写入的元素。","The height of the thumb.":"拇指的高度。"," if the navigation UI is displayed; otherwise, ":"如果显示导航UI； 否则，"," set to the dark shadow color of a three-dimensional display element. The returned brush's ":"设置为三维显示元素的深色阴影颜色。 返回的刷子","The type to access.":"访问类型。"," that paints the dark shadow of a three-dimensional display element. This brush's ":"这描绘了三维显示元素的深色阴影。 这个刷子","The width of a scroll bar.":"滚动条的宽度。","Element on which to set the attached property.":"设置附件属性的元素。","The URI for the current content, or the content that is currently being navigated to.":"当前内容或当前正在导航的内容的URI。"," if the internal type can be accessed; otherwise, ":"如果可以访问内部类型； 否则，","The dark shadow color of a three-dimensional display element.":"三维显示元素的深色阴影颜色。","The property value to set":"设置的属性值","The height of the virtual screen.":"虚拟屏幕的高度。"," return value (":"返回值（","The resource key for the dark shadow ":"黑暗阴影的资源密钥","The specified XML namespace prefix.":"指定的XML名称空间前缀。","Property value to set.":"要设置的属性值。","A screen coordinate, in pixels.":"屏幕坐标，以像素为单位。"," that indicates whether a page function should not be added to navigation history. The default value is ":"这表明是否不应将页面函数添加到导航历史记录中。 默认值是","The \"local\" name of the XAML element to obtain the mapped ":"XAML元素的“本地”名称以获取映射"," set to the light color of a three-dimensional display element. The returned brush's ":"设置为三维显示元件的浅色。 返回的刷子","The element to which to write the attached property.":"编写附件属性的元素。","The width of the virtual screen.":"虚拟屏幕的宽度。","The target URI.":"目标URI。","The number of lines.":"线数。"," that paints the light area of a three-dimensional display element. This brush's ":"绘制了三维显示元件的光面积。 这个刷子"," for. Local in this context means as mapped versus the provided ":"为了。 在这种情况下本地的意思是映射与所提供的","The element on which to set the attached property to.":"将附件属性设置为的元素。","The target name.":"目标名称。","The light color of a three-dimensional display element.":"三维显示元素的浅色。","The parent window.":"父窗口。","The height of a caption button.":"标题按钮的高度。"," for the object, or ":"对于对象或","The name of the handler.":"处理程序的名称。","The resource key for the highlight ":"亮点的资源密钥"," window.":"窗户。","The object that is raising the event.":"提出事件的对象。","The width of a caption button.":"标题按钮的宽度。"," if no mapping could be resolved.":"如果无法解析映射。","The highlight color of a three-dimensional display element.":"三维显示元素的亮点。","A structure that contains the window handle.":"包含窗口手柄的结构。","The short name of the assembly without an extension or path specified (equivalent to ":"组件的简短名称，没有指定的扩展名或路径（相当于","The height of a caption area.":"标题区域的高度。","The navigator (":"导航器（"," that paints the highlight of a three-dimensional display element. This brush's ":"这描绘了三维显示元素的亮点。 这个刷子","The degree to which the corners of a window are rounded.":"窗户的角落的程度是圆形的。","The window's position.":"窗户的位置。","The file path of the assembly. The assembly path must be a full file path containing a file extension.":"组件的文件路径。 汇编路径必须是包含文件扩展名的完整文件路径。","The color of text in a three-dimensional display element.":"三维显示元素中文本的颜色。",") that will host the content that is navigated to.":"）将托管已导航到的内容。"," that paints text in a three-dimensional display element. This brush's ":"在三维显示元素中绘制文本。 这个刷子","The brush that paints the glass window frame.":"绘制玻璃窗框架的刷子。","The default type mapper.":"默认类型映射器。"," instance has been disposed; otherwise, ":"实例已被处置； 否则，","The URI for the content that is being navigated to.":"要导航到的内容的URI。","The color that is used to paint the glass window frame.":"用于油漆玻璃窗框架的颜色。","The element to be serialized. Typically, this is the root element of a page or application.":"要序列化的元素。 通常，这是页面或应用程序的根元素。","The size of the non-client area of the window, in device-independent units (1/96th of an inch).":"窗户的非客户区域的大小，独立于设备的单位（1/96的1英寸）。"," of text in a three-dimensional display element.":" 三维显示元素中的文本。","An object that can be cast to ":"可以强制转换为的对象 ","The value to be returned.":"要返回的值。","A XAML string that can be written to a stream or file. The logical tree of all elements that fall under the provided ":"可以写入流或文件的XAML字符串。 所提供的所有元素的逻辑树","The size of the resizing border around the window, in device-independent units (1/96th of an inch).":"窗口周围的调整大小边框的大小，独立于设备的单位（1/96的1英寸）。","The color of the desktop.":"桌面的颜色。","The value that is returned by the page function.":"页面函数返回的值。","A script object that provides access to the HTML window object, custom script functions, and global variables for the HTML page, if the XAML browser application (XBAP) is hosted in a frame; otherwise, ":"如果XAML浏览器应用程序（XBAP）托管在框架中，则提供对HTML窗口对象，自定义脚本函数和全局变量的访问的脚本对象； 否则，"," element will be serialized.":"元素将被序列化。"," that paints the desktop. This brush's ":"涂上桌面。 这个刷子"," structure that receives the work area coordinates, expressed as virtual screen coordinates.":" 接收工作区域坐标的结构，表示为虚拟屏幕坐标。","Destination stream for the serialized XAML information.":"序列化XAML信息的目标流。"," if the application is browser hosted; otherwise, ":"如果该应用程序是托管的； 否则，","Provides contextual information about a component, such as its container and property descriptor.":"提供有关组件的上下文信息，例如其容器和属性描述符。"," of the desktop.":"桌面。","The template binding extension of this expression instance.":"此表达式实例的模板绑定扩展。"," instance as the destination where the serialized XAML information is written.":"实例是编写序列化XAML信息的目的地。"," for the location from which a XAML browser application (XBAP) application was launched; otherwise, ":"对于启动XAML浏览器应用程序（XBAP）应用程序的位置； 否则，","The right side color in the gradient.":"梯度中的右侧颜色。","A collection that holds a standard set of valid values. For this implementation, those values are ":"具有标准有效值集的集合。 对于此实现，这些值是"," implementation that provides a format context.":"提供格式上下文的实施。","A custom serialization implementation.":"自定义序列化实现。","A string representation of the script object, if the object can be converted; otherwise, a string representation of the object's default property or method.":"如果可以转换对象，则脚本对象的字符串表示； 否则，对象的默认属性或方法的字符串表示。"," that is the color of the right side of the gradient of an active window's title bar. This brush's ":"那就是活动窗口标题栏梯度右侧的颜色。 这个刷子","This implementation always returns ":"此实现总是返回","The desired type of the conversion's output.":"转换输出的所需类型。","Writer to use to write the serialized XAML information.":"用来编写序列化XAML信息的作者。","The binder provided by the call site.":"呼叫网站提供的活页夹。","The resource key for the right-side ":"右侧的资源密钥","A property path that either describes a path to a common language runtime (CLR) property, or a single dependency property.":"描述公共语言运行时(CLR)属性或单个依赖项属性路径的属性路径。","The object to obtain the ":"获得的对象","The index to be retrieved.":"要检索的索引。"," if this converter can perform the requested conversion; otherwise, ":"如果此转换器可以执行请求的转换； 否则，"," in the gradient of an active window's title bar.":"在Active Window的标题栏的梯度中。","A string that specifies the ":"一个指定的字符串"," property from.":"属性来自。",". Only a ":"。 只有一个","The method result.":"方法结果。"," used to paint the background of the inactive window's title bar. This brush's ":"用于绘制无活动窗口标题栏的背景。 这个刷子",", in a tokenized format.":"，以令牌化格式。"," object. If a null reference is passed, the current culture is assumed.":"目的。 如果传递了零参考，则假定当前文化。","The arguments to pass to the default method.":"传递到默认方法的参数。"," in the gradient of an inactive window's title bar.":"在不活动窗口标题栏的梯度中。"," property for the specified object.":" 指定对象的属性。","Always return ":"总是返回","An array of objects that sets the ":"设置的对象数组","The desired type to convert to.":"所需的类型要转换为。","The method result":"方法结果"," attached property value from.":"附加的属性值。","The string that describes the path.":"描述路径的字符串。","The color of disabled text.":"残疾文本的颜色。","The identifier of the property being bound.":"属性的标识符是约束的。"," attached property for the specified object.":"指定对象的附加属性。","The value to set for the member.":"为会员设置的值。","The parameter list.":"参数列表。"," that paints disabled text. This brush's ":"绘制残疾文本。 这个刷子","An object that can provide services for the markup extension. May be ":"可以为标记扩展提供服务的对象。 或许","The window handle of the parent window.":"父窗口的窗口句柄。"," of disabled text.":"残疾文本。","The string value to set.":"要设置的字符串值。","The handle to the child Win32 window to create.":"儿童Win32窗口创建的手柄。"," in this implementation.":" 在本实施中。",". This is expected to be a string.":". 这应该是一个字符串。","The background color of selected items.":"选定项目的背景颜色。","The expression that supports the binding.":"支持结合的表达式。","The XML namespace definition in string form.":"字符串形式的XML命名空间定义。"," if called from an explicit disposer and ":"如果是从明确的处理器中调用的，并且","The destination type. This is expected to be the ":"目标类型。 预计将是","The converter implementation. This value defaults to ":"转换器实现。 此值默认为"," dictionary in string form.":"字典形式。"," that paints the background of selected items. This brush's ":"绘制所选项目的背景。 这个刷子","The converted destination ":"转换的目的地","The original DPI scale setting.":"原始的DPI秤设置。","The window handle of the hosted window.":"托管窗口的窗口手柄。","The string to use for an XML space.":"用于XML空间的字符串。"," and is typically provided as an optional parameter of the binding.":" 并且典型地被提供为绑定的可选参数。"," of selected items.":"选定的项目。","The object that called ":"调用的对象 ","The message to act upon.":"要采取行动的信息。","The dictionary on which to base the new ":"以新的为基础的词典","The color of the text of selected items.":"选定项目文本的颜色。","The parameter being bound as referenced by the converter implementation. The default value is ":"该参数被绑定为转换器实现的引用。 默认值是","The requested rectangular space.":"请求的矩形空间。","Information that may be relevant to handling the message. This is typically used to store small pieces of information, such as flags.":"可能与处理消息相关的信息。 这通常用于存储小块信息，如标志。","The prefix of the XAML namespace to be added.":"要添加XAML名称空间的前缀。","Identifier of the dependency property being bound.":"依赖属性的标识符是约束的。","The name of the key to add.":"要添加的密钥的名称。"," that paints the text of selected items. This brush's ":"绘制所选项目的文本。 这个刷子","The XAML namespace URI the prefix maps to.":"XAML名称空间URI前缀映射到。","The value of the resource to add.":"要添加的资源的价值。","Information that may be relevant to handling the message. This is typically used to reference an object.":"可能与处理消息有关的信息。 这通常用于引用对象。"," of a selected item's text.":"选定项目的文本。","The initiating reader that is then returned on calls to ":"然后在电话中返回的启动读者","The prefix of this XML namespace.":"此XML名称空间的前缀。"," contains a key-value pair with the specified key; otherwise, ":"包含一个带有指定键的键值对； 否则，","Whether events resulting should be marked handled.":"是否应标记所产生的事件。","The color used to designate a hot-tracked item.":"用于指定热跟踪物品的颜色。","The one-dimensional array that is the destination of the ":"一维数组是目的地","Service provider for required services.":"服务提供商提供所需的服务。","The XML namespace URI the prefix maps to.":"XML名称空间URI前缀映射到。"," that paints hot-tracked items. This brush's ":"绘制了热跟踪的物品。 这个刷子","The window handle of the child window.":"子窗的窗户手柄。","A specialized enumerator for the ":"专门的枚举者","The root object for the node stream of the input ":"输入的节点流的根对象","The prefix key to search for.":"搜索的前缀键。"," that designates a hot-tracked item.":"这指定了一个热跟踪的项目。","The key of the resource to get.":"获取资源的关键。"," if the requested prefix key is in the dictionary; otherwise, ":"如果要求的前缀密钥在字典中； 否则，","The path to an application's deployment manifest.":"应用程序部署的途径表现出来。",". Specifically, this is a ":"。 具体来说，这是一个","The value of the requested resource.":"请求资源的价值。","The color of an inactive window's border.":"不活动窗口的边框的颜色。","The array to copy the table data into.":"将表数据复制到的数组。","The input value to commit for deferred loading.":"用于提交递延加载的输入值。"," denotes an error; ":"表示错误；"," if the resource can be saved and used later; otherwise, ":"如果资源可以保存并以后使用； 否则，"," that paints the border of an inactive window. This brush's ":"那粉刷了一个不活动的窗户的边界。 这个刷子","The zero-based index in the destination array where copying starts.":"在启动复制的目标数组中基于零的索引。"," value that specifies the type of this template.":"指定此模板类型的值。"," denotes another condition such as a warning.":"表示另一种条件，例如警告。"," of an inactive window's border.":"一个不活动的窗户的边界。","Key of the entry to remove.":"输入的钥匙要删除。","Description of the error.":"错误的描述。","The namespace that corresponds to the default XML namespace if one exists; otherwise, ":"如果存在，则与默认的XML名称空间相对应的名称空间； 否则，"," if the two instances are identical; otherwise, ":"如果两个实例是相同的； 否则，","The current number of entries in the base dictionary.":"基本词典中的当前条目数。","The string title of the error page.":"错误页面的字符串标题。","The background color of an inactive window's title bar.":"不活动窗口标题栏的背景颜色。"," if the invalidations cause ":"如果无效"," handler,":"处理程序，","The assembly in which the template is defined.":"定义模板的组件。"," that paints the background of an inactive window's title bar. This brush's ":"这描绘了不活动窗口标题栏的背景。 这个刷子","The dictionary enumerator for this dictionary.":"该词典的词典枚举。"," objects to reevaluate their choice of template; otherwise, ":"重新评估其选择模板的对象； 否则，","The enumerator for this dictionary.":"该词典的枚举者。"," of an inactive window's title bar.":"一个不活动的窗户的标题栏。"," that specifies the type of object that the template is used to display, or a string that specifies the XML tag name for the XML data that the template is used to display.":" 指定模板用于显示的对象类型，或指定模板用于显示的XML数据的XML标记名称的字符串。"," if the hash table is fixed-size; otherwise, ":"如果哈希表为固定大小； 否则，","Path to an associated error file. May be an empty string.":"通往关联的错误文件的路径。 可能是一个空字符串。","The color of the text of an inactive window's title bar.":"不活动窗口标题栏文本的颜色。","The pre-defined name of the part.":"零件的预定名称。"," if the hash table is read-only; otherwise, ":"如果哈希表是只读的； 否则，"," handler to handle refresh of error page.":"处理程序以处理错误页面的刷新。","The prefix to retrieve the XAML namespace for.":"检索XAML名称空间的前缀。","A link for support information.":"支持信息的链接。","The desired key to get or set.":"所需的密钥来获取或设置。","The requested XAML namespace URI.":"请求的XAML命名空间URI。"," that paints the text of an inactive window's title bar. This brush's ":"这描绘了不活动窗口标题栏的文字。 这个刷子","The type of the named part this attribute is identifying.":"该属性正在识别的指定部分的类型。"," of the text of an inactive window's title bar.":"一个不活动窗口的标题栏的文字。","An enumerable set of ":"一组","Total bytes downloaded thus far.":"到目前为止，总字节下载了。","Value of the key.":"钥匙的值。"," that the state belongs to.":"国家属于。"," values. To get the prefix strings specifically, get the ":"值。 要专门获得前缀字符串，请获取","Total bytes that need to be downloaded for the application.":"需要为应用程序下载的总字节。","The color used to highlight an inactive selected item.":"用于突出显示不活动的项目的颜色。"," value from each value returned.":"每个值返回的值。","The collection of merged dictionaries.":"合并词典的集合。","The name of the state that the control can be in.":"控件可以进入的状态名称。","Name of the application that originates the progress page.":"源自进度页面的应用程序的名称。"," that paints the background of an inactive selected item. This brush's ":"绘制了不活动的项目的背景。 这个刷子","The source location of an external resource dictionary.":"外部资源词典的源位置。","The XAML namespace prefix to look up.":"XAML名称空间前缀要查找。","The assembly name string.":"汇编名称字符串。","The color of an inactive selected item's text.":"不活动的项目文本的颜色。","The application deployment manifest path.":"应用程序部署表现路径。"," if access to ":"如果访问","The XAML namespace URI that corresponds to the specified prefix if it exists in this ":"如果存在于此，则与指定前缀相对应的XAML名称空间URI。","The object value to set on the property where the extension is applied.":"要在应用扩展名的属性上设置的对象值。"," that paints a an inactive selected item's text. This brush's ":"绘制了不活动的项目文本。 这个刷子","The publisher identifying string.":"发布者识别字符串。","An object that can be used to synchronize access to ":"可用于同步访问的对象","The XAML namespace URI to look up.":"XAML名称空间URI查找。","The callback reference.":"回调引用。"," that paints the background of the ":"画的背景","The location of theme-specific resources.":"特定于主题的资源的位置。","The collection of all values.":"所有值的集合。","A WPF window object.":"WPF窗口对象。"," control. This brush's ":"控制。 这个刷子","The XML prefix that corresponds to the given namespace; otherwise, ":"与给定名称空间相对应的XML前缀； 否则，","The location of generic, not theme-specific, resources.":"通用而非特定于主题的资源的位置。"," that represents the HWND.":"这代表了HWND。","The text color for the ":"文字颜色","A service implementation that provides the desired value.":"提供所需值的服务实现。","The prefix key to remove.":"前缀键要删除。"," of the generic ":"通用","Calling this method always returns the instance itself.":"调用此方法总是返回实例本身。"," that paints the text in a ":"将文字描绘成一个","The Windows Presentation Foundation (WPF) window handle (HWND).":"Windows演示基金会（WPF）窗口手柄（HWND）。"," if the size is fixed; otherwise, ":"如果尺寸固定； 否则，"," of the theme specific ":"特定于主题的","The owner window handle (HWND).":"所有者窗口手柄（HWND）。","Specific information from the serialization process.":"来自序列化过程的特定信息。"," of the text in a ":"文字中的文字"," if access to this dictionary is thread-safe; otherwise, ":"如果访问该词典是线程安全的； 否则，","The uniform length applied to all four sides of the bounding rectangle.":"均匀的长度应用于边界矩形的所有四个侧面。"," if conversion to the ":"如果转换为","The context at the time the exception was thrown.":"抛出例外情况的上下文。","The background color for a menu bar.":"菜单栏的背景颜色。"," is possible; otherwise, ":"可能 否则，","The prefix from which to get or set the associated XML namespace URI.":"获取或设置关联XML名称空间URI的前缀。","The thickness for the left side of the rectangle.":"矩形左侧的厚度。","A possible descriptive message.":"可能的描述性消息。"," that paints the background of a menu bar. This brush's ":"绘制菜单栏的背景。 这个刷子","The thickness for the upper side of the rectangle.":"矩形上侧的厚度。","Represents culture-specific information that is maintained during a conversion.":"表示在转换期间维护的特定于区域性的信息。","The corresponding XAML namespace URI.":"对应的XAML命名空间URI。","The key that was not found.":"找不到的钥匙。"," of a menu bar.":" 一个菜单栏。","Identifies the object that is being converted to ":"标识要转换为的对象","The resource key.":"资源密钥。","The thickness for the right side of the rectangle":"矩形右侧的厚度","The prefix from which to get or set the associated namespace.":"获取或设置关联名称空间的前缀。","The color of a menu's background.":"菜单背景的颜色。","The reference stream.":"参考流。","The thickness for the lower side of the rectangle.":"矩形下部的厚度。","The corresponding XML namespace URI.":"相应的XML名称空间URI。","Describes context information of a component, such as its container and ":"描述组件的上下文信息，例如其容器和","The Multipurpose Internet Mail Extensions (MIME) content type of the stream.":"流的多功能Internet邮件扩展（MIME）内容类型。"," that paints the background of a menu. This brush's ":"绘制菜单的背景。 这个刷子","The collection of all the keys in the dictionary.":"字典中所有键的集合。","The Multipurpose Internet Mail Extensions (MIME) content type.":"多功能Internet邮件扩展（MIME）内容类型。"," of a menu.":"菜单。","A hash code for this instance of ":"此实例的哈希代码","Identifies culture-specific information, including the writing system and the calendar that is used.":"标识特定文化的信息，包括写作系统和所使用的日历。"," if the dictionary is sealed; otherwise, ":"如果词典被密封； 否则，","The other structure to compare.":"比较的另一个结构。"," that is being converted.":"那是在转换。","The color used to highlight a menu item.":"用于突出显示菜单项的颜色。","The stream for the resource.":"资源的流。"," that represents the width, in pixels, of the lower side of the bounding rectangle for this instance of ":"代表边界矩形下侧的宽度，以像素为单位","A collection of all the values in the ":"在"," that paints a highlighted menu item. This brush's ":"绘制突出显示的菜单项。 这个刷子","Previous value of the property, prior to the event being raised.":"事件提出之前，该物业的先前价值。","The data type that this instance of ":"此实例的数据类型 "," of a highlighted menu item.":"突出显示的菜单项。","The visual that was hit.":"受到打击的视觉。",". A pixel is equal to 1/96 of an inch. The default is 0.":"。 像素等于1/96英寸。 默认值为0。","Current value of the property at the time of the event.":"事件时属性的当前价值。"," is being converted to.":"正在转换为。"," enumeration values. The default value is ":"枚举值。 默认值是","The color of a menu's text.":"菜单文本的颜色。"," that represents the width, in pixels, of the left side of the bounding rectangle for this instance of ":"代表边界矩形的左侧的宽度，以像素为单位"," that represents the element whose attached property you want to retrieve.":"这代表了您要检索的附件属性的元素。","Identifier of the routed event that this arguments class carries information for.":"该参数类的路由事件的标识符携带信息。"," starts. The default is ":"开始。 默认值为",". a pixel is equal to 1/96 on an inch. The default is 0.":"。 像素在一英寸上等于1/96。 默认值为0。"," that paints a menu's text. This brush's ":"绘制菜单的文字。 这个刷子","The generic value. In a practical implementation of the ":"通用值。 在实际实施中"," that began the ":"那开始了"," value that represents the localization attribute.":" 表示本地化属性的值。"," that represents the width, in pixels, of the right side of the bounding rectangle for this instance of ":"代表边界矩形的右侧的宽度，用于此实例",", the generic type of this property is replaced with the constrained type of the implementation.":"，该属性的通用类型被实现的约束类型所取代。"," of a menu's text.":" 菜单的文本。"," value that represents the localization comment.":"代表本地化评论的值。"," that represents the width, in pixels, of the upper side of the bounding rectangle for this instance of ":"代表了边界矩形上侧的宽度，以像素为单位"," you want to interactively control. The default value is ":"您想交互控制。 默认值是","The background color of a scroll bar.":"滚动条的背景颜色。","The event data. Specific event definitions will constrain ":"事件数据。 特定事件定义将限制"," should be serialized; otherwise, ":"应该序列化； 否则，","The source type that the type converter is evaluating for conversion.":"类型转换器正在评估转换的源类型。"," that represents the element whose attached property you want to set.":"这表示您要设置的附件属性的元素。"," that paints the background of a scroll bar. This brush's ":"这绘制了滚动条的背景。 这个刷子","A positive or negative value that specifies the amount by which the storyboard should move forward or backward from the seek origin ":"表明故事板应从寻求起源前进或向后向后移动的数量的正值或负值"," if the type converter can create an instance of ":"如果类型转换器可以创建一个实例"," to a type, with the type parameter of the constraint matching the type parameter constraint of a delegate implementation.":"到类型，具有匹配委托实现的类型参数约束的约束类型参数。"," that specifies the localization attributes.":"这指定了本地化属性。"," of a scroll bar.":"滚动条。","The position from which this seek operation's ":"寻求操作的位置"," value that indicates why the session ended.":"值表示会话为何结束。"," from the specified type; otherwise, ":"从指定类型； 否则，"," that specifies the localization comments.":"这指定了本地化评论。","The background color in the client area of a window.":"窗口客户区域中的背景颜色。"," is applied. The default value is ":"被申请;被应用。 默认值是"," object with the event arguments.":"对象具有事件参数。"," that paints the background of a window's client area. This brush's ":"这绘制了窗户客户区域的背景。 这个刷子","The type for which the type converter is evaluating this instance of ":"类型转换器评估此实例的类型","The UI element to bring into view.":"UI元素可以看到。"," if the type converter can convert this instance of ":"如果类型转换器可以转换此实例","The speed ratio for the ":"的速度比为 "," of a window's client area.":"窗口的客户区域。","The object to start searching from. This object must be either a ":"开始搜索的对象。 这个对象必须是"," to apply the ":"应用",". The default value is 1.0.":"。 默认值为1.0。","The context information for a type.":"类型的上下文信息。","The value to apply to the property.":"适用于属性的价值。","The name of the object to find.":"要查找的对象的名称。","The two control points that specify the cubic  Bezier curve which defines the progress of the key frame.":"指定定义关键帧进度的Cubic Bezier曲线的两个控制点。","The color of a window frame.":"一个窗框的颜色。","The name of the child node this ":"孩子节点的名称","The type that is created when the type converter converts an instance of ":"当类型转换器转换一个实例时创建的类型"," that paints a window frame. This brush's ":"绘制一个窗框。 这个刷子","The object with the matching name, if one is found; returns ":"如果找到一个匹配名称的对象； 返回","An object contained within the same name scope as the targets of this storyboard's animations. Animations without a ":"与本故事板动画的目标相同名称范围内包含的对象。 没有一个动画"," is intended for.":"是为了。"," that returns the property value of the element. The default value is ":"返回元素的属性值。 默认值是"," of a window frame.":"窗框。"," are applied to ":"应用于"," property is evaluated with respect to the element this style or template is being applied to (the styled parent or the templated parent).":"对属性进行了有关该样式或模板的元素的评估，将应用于（样式的父母或模板父母）。"," if no matching name was found in the logical tree.":"如果在逻辑树上找不到匹配的名称。"," will be applied. The default value is null.":"将被应用。 默认值为null。"," if the storyboard should be interactively controllable; otherwise, ":"如果故事板应该可以交互控制； 否则，","The object from which to start processing the logical tree. This is expected to be either a ":"开始处理逻辑树的对象。 预计这是","The color of the text in the client area of a window.":"窗口客户端区域中文本的颜色。","The size of the collection.":"集合的大小。"," if this object is in a read-only state and cannot be changed; otherwise, ":"如果此对象处于仅读取状态，则不能更改； 否则，","The behavior the new animation should use to interact with any current animations.":"新动画应使用的行为与任何当前动画进行交互。","The enumerable collection of immediate child objects from the logical tree of the specified object.":"从指定对象的逻辑树中枚举直接子对象的集合。"," object is found in the collection; otherwise, ":"对象在集合中找到； 否则，"," that paints the text in the client area of a window. This brush's ":"这将文本绘制在窗口的客户端区域中。 这个刷子","The value of any ":"任何价值","The object from which to start processing the logical tree.":"开始处理逻辑树的对象。","An object contained within the same name scope as the targets of this storyboard's animations. Animations without a specified ":"与本故事板动画的目标相同名称范围内包含的对象。 没有指定的动画","The one-dimensional array that is the destination of the items that are copied from the collection. The array must use zero-based indexing.":"一维数组是从集合中复制的项目的目的地。 数组必须使用基于零的索引。"," of text in a window's client area.":"窗口客户区域中的文字。"," transforms that are applied to the ":"应用于","The enumerable collection of immediate child objects starting from ":"从","The window to close.":"关闭的窗口。","Declares whether the animation is controllable (can be paused) once started.":"声明动画是否可以控制（可以暂停）。"," where copying starts.":"复制开始的地方。"," of an ":"一个"," in the logical tree.":"在逻辑树中。","The window to maximize.":"最大化的窗口。","The object to which the specified ":"指定的对象"," object is found in the collection; otherwise, -1.":"对象在集合中找到； 否则，-1。"," must be inserted.":"必须插入。","The window to minimize.":"窗口最小化。"," has been applied. Animations without a ":"已应用。 没有一个动画","The object to find the parent object for. This is expected to be either a ":"找到父对象的对象。 预计这是"," before it is rendered.":"在渲染之前。","The window to restore.":"还原的窗口。"," object to remove from the collection.":"从集合中删除的对象。","The requested parent object.":"请求的父对象。","The final rendered ":"最后的渲染","The template to animate.":"动画模板。"," if item is successfully removed; otherwise, ":"如果项目成功删除； 否则，"," has been applied.  Animations without a ":"已应用。 没有一个动画","The window to have its system menu displayed.":"显示其系统菜单的窗口。","The x-coordinate for the start point of the line. The default is ":"线路起点的X坐标。 默认值为","The object on which to start listening for the pertinent ":"开始聆听相关的对象","The location of the system menu.":"系统菜单的位置。","The current global speed, or 0 if the clock is stopped.":"当前的全局速度，如果停止时钟，则为0。",". This method also returns false if item was not found in the ":"。 如果在","Throws an exception in all cases.":"在所有情况下都引发例外。","The x-coordinate for the end point of the line. The default is ":"线路终点的X坐标。 默认值为","The object specified when the ":"当对象指定"," object that is at the specified index.":"在指定索引处的对象。","A command that closes a window.":"关闭窗口的命令。","The converted object. If the conversion is successful, this is a ":"转换的对象。 如果转换成功，这是一个","The y-coordinate for the start point of the line. The default is ":"线路起点的Y坐标。 默认值为","A command that maximizes a window.":"最大化窗口的命令。"," method was called. This object contains the ":"调用方法。 此对象包含","The object that is at the specified index.":"指定索引处的对象。","The source string to convert.":"要转换的源字符串。","The y-coordinate for the end point of the line. The default is ":"线路终点的Y坐标。 默认值为","A 32-bit unsigned integer hash code.":"32位未签名的整数哈希代码。","A command that restores a window.":"还原窗口的命令。"," that represents the referenced event handler.":"这代表了引用的事件处理程序。"," objects that were created for this storyboard and its children.":"为这个故事板及其孩子创建的物体。","A description of the shape to be drawn.":"描述要绘制的形状。"," instances are not equivalent; otherwise, ":"实例不是等效的； 否则，","A command that displays the system menu.":"显示系统菜单的命令。"," enumeration values. The default is ":"枚举值。 默认值为","The unique connection ID for event wiring purposes.":"事件接线目的的唯一连接ID。","The current global speed, or ":"当前的全球速度，或 ","A font family.":"一个字体家庭。"," if the property is animated; otherwise, ":"如果属性是动画的； 否则，"," structures that describe the vertex points of the polygon. The default is a null reference (":"描述多边形的顶点点的结构。 默认值是null引用（","The target for event wiring.":"事件接线的目标。","A resource key.":"资源密钥。"," if the clock is stopped.":"如果时钟停止。"," structures that describe the vertex points of the ":"描述顶点点的结构","The full name of the assembly that contains BAML to be localized.":"包含要本地化的BAML的组件的全名。"," if the value resulted from a ":" 如果该值由 ","; otherwise, a value between 0.0 and 1.0 that indicates the current progress of this clock within its current iteration. A value of 0.0 indicates no progress, and a value of 1.0 indicates that the clock is at the end of its current iteration.":"; 否则，在其当前迭代中指示该时钟的当前进度的0.0和1.0之间的值。 值为0.0表示没有进展，而值为1.0表示时钟在其当前迭代的末尾。","A font size.":"字体尺寸。",". The default is a null  reference (":"。 默认值是null引用（"," implementation applied to a dependency property; otherwise, ":"实施适用于依赖属性； 否则，","The full class name of the element that you want to retrieve localizability information for.":"您要检索本地化信息的元素的完整类名称。","A font style.":"字体样式。","An object that contains the localizability information for the specified assembly and element.":"包含指定程序集和元素的本地化信息的对象。"," if the value was set by the ":"如果值是由","The current state of the clock created for this storyboard: ":"为此故事板创建的时钟的当前状态：","The transform that is applied to this ":"适用于此的转换","A collection of text decorations.":"文本装饰的集合。","The name of the property that you want to retrieve localizability information for.":"您要检索本地化信息的属性名称。","A font weight.":"字体重量。","The x-axis radius of the ellipse that is used to round the corners of the rectangle.":"用来绕矩形的角落的椭圆形的X轴半径。"," if the value came from an evaluated expression; otherwise, ":"如果该值来自评估的表达； 否则，"," if this storyboard's clock is ":"如果这个故事板的时钟是","An object that specifies whether and how the property can be localized.":"指定属性是否可以定位的对象。","A collection of text decoration.":"文本装饰的集合。","The y-axis radius of the ellipse that is used to round the corners of the rectangle. The default is ":"用来绕矩形拐角处的椭圆形的Y轴半径。 默认值为","A storyboard that defines the appearance of the control when it is in the state that is represented by the ":"一个故事板，当控件处于由 ","; otherwise, the current time of the storyboard's clock.":";否则，故事板的时钟的当前时间。","The full class name.":"完整的类名。","The final rendered shape.":"最终的渲染形状。","The element that is transitioning states if the ":"转换状态的元素，如果 ","A multiplier.":"个乘数。"," created for this ":"为此创建","The full name of the assembly that contains the class.":"包含类的组件的全名。"," is in a ":"在一个","The final evaluated size of the ":"最终评估的尺寸 "," is paused; otherwise, ":"被暂停； 否则，","The name of the tag.":"标签的名称。","A border width.":"边界宽度。","The maximum ":"最大值","The full class name associated with the tag.":"与标签关联的完整班级名称。","The state that the element is transitioning to or has transitioned to.":"该元素正在过渡或已过渡到的状态。","The caption height.":"标题高度。","The timeline from which to retrieve the ":"从中检索 "," object that is drawn during the rendering pass of this ":"在此过程中绘制的对象","The dependency object targeted by ":"依赖关系对象是由","The state that the element is transitioning to or has transitioned from.":"该元素正在过渡或已过渡的状态。"," that describes how the shape's interior is painted. The default is ":"这描述了形状的内饰是如何绘制的。 默认值为","The localizable value.":"可本质的值。","The caption width.":"标题宽度。"," that is applied to the geometry of a ":"应用于","The name of the dependency object targeted by ":"依赖关系对象的名称由","The caret width.":"套件宽度。","Comments used for localizing.":"评论用于本地化。","The root element that contains the ":"包含的根元素","The dependency object from which to get the ":"从中获得的依赖关系对象","The string category of the resource.":"资源的字符串类别。"," prior to when it is drawn.":"在绘制之前。","A Boolean value; ":"布尔值；"," if client area animation is enabled, ":"如果启用了客户区域动画，"," if the resource should be modifiable; otherwise, ":"如果资源应修改； 否则，"," that is currently applied to the control.":"目前适用于控件。"," outline is painted. The default is ":"大纲被绘制。 默认值为","The property targeted by ":"所针对的物业 "," for enabled; otherwise, ":"启用; 否则，","The collection of mutually exclusive ":"互斥的集合","A positive or negative value that describes the amount by which the timeline should move forward or backward.":"一个正值或负值，描述时间表应向前或向后移动的数量。"," values that specify the pattern of dashes and gaps.":"指定破折号和间隙模式的值。"," if the resource should be visible for translation purposes because it is potentially readable as text in the UI; otherwise, ":" 如果出于翻译目的，资源应该是可见的，因为它可能在UI中作为文本可读；否则, ","One of the enumeration values for ":"枚举价值之一"," object test for equality.":"对象测试平等。","A pop-up animation value.":"弹出动画值。","A positive or negative value that describes the amount by which the timeline should move forward or backward from the specified ":"一个正值或负值，描述时间表应从指定的数量向前或向后移动","The visual state manager that transitions between the states of a control.":"在控制状态之间过渡的视觉状态经理。","The position from which ":"位置"," objects that is associated with the specified object.":"与指定对象关联的对象。"," that represents the distance within the dash pattern where a dash begins.":"这代表了仪表板开始的仪表板模式内的距离。","The cursor height.":"光标高度。"," is equal to this object; otherwise, ":"与此对象相等； 否则，","A finite value greater than zero that is the new interactive speed ratio of the storyboard. This value is multiplied against the storyboard's ":"有限值大于零，即情节板的新交互式速度比率。 这个值乘以故事板的"," if the shadow is enabled; otherwise, ":"如果启用了阴影； 否则，","The state to transition to.":"过渡到的国家。","The localization category, as a value of the enumeration.":"本地化类别，作为枚举的值。","The limit on the ratio of the miter length to the ":"斜切长度比率的极限"," value to determine the storyboard's effective speed. This value does not overwrite the storyboard's ":"确定故事板的有效速度的价值。 这个值不会覆盖故事板的"," element. This value is always a positive number that is greater than or equal to 1.":"元素。 该值始终是一个大于或等于1的正数。","The localization comment string.":"本地化评论字符串。"," to use a ":"使用一个","The cursor width.":"光标宽度。"," property. For example, calling this method and specifying an interactive speed ratio of 3 on a storyboard with a ":" 财产。 例如，调用此方法并在具有 "," object to transition between states; otherwise, ":"目的是在状态之间过渡； 否则，","The localizable content string.":"可本质的内容字符串。"," outline.":"大纲。"," if dragging of full windows is enabled; otherwise, ":" 如果启用了完整窗口的拖动；否则, ","The name of the category the ":"类别的名称"," if the control successfully transitioned to the new state; otherwise, ":"如果控件成功过渡到新状态； 否则，"," of 0.5 gives the storyboard an effective speed of 1.5.":"0.5的有效速度为1.5。"," if the resource is modifiable; otherwise, ":"如果资源可修改； 否则，"," if the drop shadow effect is enabled; otherwise, ":"如果启用了阴影效果； 否则，"," that should target the specified dependency object.":"这应该针对指定的依赖项对象。"," is grouped with. The default is ":" 与之分组。 默认值为 ","The border height.":"边界高度。","The control to transition between states.":"状态之间转换的控制。"," if the resource is visible for translation; otherwise, ":"如果可见资源用于翻译； 否则，","The dependency object to target.":"依赖关系对象。","The list of Jump List items that could not be added to the Jump List by the Windows shell.":"Windows Shell无法添加到跳跃列表中的跳跃列表项列表。","The name of the state to transition to.":"过渡到国家的名称。","The border width.":"边界宽度。","The Uid of an element that has a localizable resource.":"具有可本质资源的元素的UID。","The name of the dependency object to target.":"依赖关系对象的名称要目标。","The representation of the state to transition to.":"过渡到国家的代表。","The list of reasons why the rejected Jump List items could not be added to the Jump List.":"拒绝跳跃列表项目的原因列表无法添加到跳跃列表中。","The class name of a localizable resource in binary XAML (BAML).":"二进制XAML（BAML）中可本质资源的类名称。"," if the flat menu appearance is set; otherwise, ":"如果设置了平坦的菜单外观； 否则，"," event occurred on.":"事件发生。","The list of Jump List items that have been removed by the user since ":"自从用户删除的跳跃列表项列表以来"," with which to associate the specified dependency property.":" 与之关联指定的依赖项属性。","The edge height.":"边缘高度。","The property name of a localizable resource in BAML.":"BAML中可本地资源的属性名称。","The state that the control is transitioning from.":"控制权正在过渡的状态。"," was last called.":"最后打电话。","A path that describe the dependency property to be animated.":"描述要动画的依赖性属性的路径。","The edge width.":"边缘宽度。","The object to compare for equality.":"比较平等的对象。","The state that the control is transitioning to.":"控制权正在过渡到的状态。","A flash count.":"闪光计数。","The element to set the ":"要设置的元素","The list of Jump List items that have been removed by the user since the ":"自从用户删除的跳跃列表项列表以来","The other instance of ":"另一个实例"," method was last called.":"方法是最后调用的。","The control that is transitioning states.":"过渡状态的控制。","The height of the client area.":"客户区域的高度。"," to set on ":" 出发 ","The class name component of this ":"此类的类名称"," objects that are displayed in the Jump List.":"跳跃列表中显示的对象。"," to transition from.":"从过渡。","The type of script command that was raised.":"提出的脚本命令的类型。","The width of the client area.":"客户区域的宽度。","The property name component of this ":"This的属性名称组件 ","The time that it takes to move from one state to another.":"从一个状态转移到另一个状态所需的时间。","A value that indicates whether frequently used items are displayed in the Jump List.":"指示是否在跳转列表中显示频繁使用的项目的值。"," that specifies the text to display.":"指定要显示的文本。"," if the gradient effect is enabled; otherwise, ":"如果启用了梯度效应； 否则，","The Uid component of this ":"此的UID组件","A value that indicates whether recently used items are displayed in the Jump List.":"指示跳转列表中是否显示最近使用的项目的值。"," value that specifies which message box button is clicked by the user.":"用户单击了哪个消息框按钮的值。","A custom mathematical formula that is used to transition between states.":"用于在状态之间过渡的自定义数学公式。","A key for the resource.":"资源的关键。"," if the HIGHCONTRASTON option is selected; otherwise, ":"如果选择了HighContraston选项； 否则，"," that specifies the title bar caption to display.":"指定标题栏字幕显示。","The path to add to the Jump List.":"添加到跳跃列表的路径。"," that occurs when the transition occurs.":"发生过渡时发生。","The width of the arrow bitmap.":"箭头位图的宽度。","An object that contains the resource.":"包含资源的对象。"," value that specifies which button or buttons to display.":"值指定要显示的按钮或按钮。"," to add to the Jump List.":"添加到跳跃列表中。"," to transition to.":"过渡到。","The application associated with the ":"与","The resource key to find.":"要查找的资源密钥。","The height of the scroll bar.":"滚动条的高度。"," value that specifies the icon to display.":"指定要显示的图标的值。"," was successfully activated; otherwise, ":"成功激活； 否则，"," value that specifies the default result of the message box.":"指定消息框的默认结果的值。"," object associated with the specified application.":"与指定应用程序关联的对象。","The width of the thumb.":"拇指的宽度。"," object contains a resource with the specified key; otherwise, ":"对象包含带有指定密钥的资源； 否则，"," that reflects the final size that the window should use to arrange itself and its children.":"这反映了窗户应用来安排自己及其子女的最终尺寸。"," value object that specifies the options.":"指定选项的值对象。"," to associate with the application.":"与应用程序关联。"," if hot tracking is enabled; otherwise, ":" 如果启用了热跟踪；否则, ","An array of objects to hold the data.":"一系列对象保存数据。"," that reflects the actual size that was used.":"这反映了所使用的实际尺寸。"," that represents the owner window of the message box.":"这代表了消息框的所有者窗口。","The grid height.":"网格高度。"," objects displayed in the Jump List. The default is an empty collection.":" 跳转列表中显示的对象。 默认值为空集合。","The starting index value.":"起始索引值。","The dependency object.":"依赖关系对象。"," objects. The default is an empty collection.":" 物体。 默认值为空集合。","A specialized ":"专业"," if frequently used items are displayed in the Jump List; otherwise, ":"如果经常使用的项目显示在跳跃列表中； 否则，","The grid width.":"的网格宽度。"," reference to the host window.":"引用主机窗口。"," that can iterate the contents of the dictionary.":"可以迭代字典的内容。"," owned by the navigator responsible for the content to which this ":"由导航员拥有的，负责此内容的内容"," if recently used items are displayed in the Jump List; otherwise, ":"如果最近使用的项目显示在跳跃列表中； 否则，","The icon height.":"图标高度。","The key for the resource to be removed.":"删除资源的关键。"," that reflects the available size that this window can give to the child. Infinity can be given as a value to indicate that the window will size to whatever content is available.":"这反映了此窗口可以给孩子的可用尺寸。 可以给出无穷大的值，以指示窗口将大小到可用的任何内容。"," is being applied.":"正在应用。","The path to the file to be included in the Jump List.":"将包含在跳跃列表中的文件的路径。"," that receives the copied items.":"收到复制的物品。","The width of an icon cell.":"图标单元的宽度。","The path to the application. The default is ":"应用程序的路径。 默认值为"," that specifies how the content to which the ":"这说明了如何"," that reflects the size that this window determines it needs during layout, based on its calculations of children's sizes.":"这反映了此窗口在布局期间确定其在儿童大小的计算中所需的大小。","The object value to add to the ":"要添加到的对象值","The arguments passed to the application on startup. The default is ":"参数传递给了启动申请。 默认值为"," if icon-title wrapping is enabled; otherwise ":"如果启用了图标指标包装； 否则","A reference to the root of the old content tree.":"对旧内容树的根的引用。"," is being applied was navigated to.":"正在应用被驾驶到。","The key  to locate in the dictionary.":"位于字典中的关键。","The text displayed in the tooltip for the task. The default is ":"工具提示中显示的文本用于任务。 默认值为","The height of an icon cell.":"图标单元的高度。"," name of the content that is stored in navigation history.":"导航历史记录中存储的内容的名称。","A reference to the root of the new content tree.":"引用新内容树的根。","The number of localizable resources.":"可本质资源的数量。","The zero-based index of the icon, or -1 if no icon is used. The default is 0.":"图标的基于零的索引，如果不使用图标，则-1。 默认值为0。","The URI fragment. If you set the property to an empty string, the top of the content will be navigated to by default.":"URI碎片。 如果将属性设置为一个空字符串，则默认情况下将将内容的顶部导航到。","The key value of the resource.":"资源的关键值。","The previous parent. Set to null if the ":"以前的父母。 设置为null如果","The icon width.":"图标宽度。"," if the navigation has been handled; otherwise, ":"如果处理导航； 否则，","The path to a resource that contains the icon. The default is ":"包含图标的资源的路径。 默认值为"," value of type ":"类型的值"," if glass window frames are being used; otherwise, ":"如果使用玻璃窗框架； 否则，","A collection that contains all the keys in the object.":"包含对象中所有键的集合。","The text displayed for the task in the Jump List. The default is ":"在跳跃列表中为任务显示的文本。 默认值为"," that refers to the navigator (Internet Explorer, ":"这是指导航器（Internet Explorer，"," that specifies whether the activity was accepted (":"指定活动是否被接受（"," if the Input Method Manager/Input Method Editor features are enabled; otherwise, ":"如果启用了输入方法管理器/输入方法编辑器功能； 否则，","The key of the root element, if it is localizable. Otherwise, the value is set to ":"根元素的关键，如果它是可本质的。 否则，将值设置为",".) that is navigating to the content fragment.":"。）正在导航到内容片段。","The working directory of the application on startup. The default is ":"启动应用程序的工作目录。 默认值为"," if the current operating system is Windows XP Media Center Edition; otherwise, ":"如果当前操作系统是Windows XP Media Center Edition； 否则，",") or canceled (":"）或取消（","The item with the specified key.":"带有指定键的项目。","An instance of a custom ":"自定义的实例","The text for the taskbar item tooltip. The default is an empty string.":"任务栏项目工具提示的文本。 默认值是一个空字符串。"," if drop-down menus are right-aligned; otherwise, ":"如果下拉菜单正确地对齐； 否则，","A collection that contains all the values in the object.":"包含对象中所有值的集合。","). The return value is the value of the ":"）。 返回值是","The image that is displayed over the program icon in the taskbar button. The default is ":"在任务栏按钮中通过程序图标显示的图像。 默认值为"," class that is to be associated with content in navigation history.":"与导航历史记录中的内容相关联的类。"," if the system is enabled for Hebrew and Arabic languages; otherwise, ":"如果启用了希伯来语和阿拉伯语的系统； 否则，"," if the enumerator successfully advances to the next element. If there are no remaining elements, this method returns ":"如果枚举者成功发展到下一个元素。 如果没有剩余元素，则此方法返回"," property before a window closes.":"窗口关闭之前的属性。","An enumeration value that indicates how the progress indicator is displayed in the taskbar button. The default is ":"指示如何在任务栏按钮中显示进度指标的枚举值。 默认值为","The serialization information.":"序列化信息。","An object containing the key and value of the entry at the current position.":"一个包含当前位置的条目的密钥和值的对象。"," if a mouse is installed; otherwise, ":"如果安装了鼠标； 否则，"," if the window supports transparency; otherwise, ":"如果窗口支持透明度； 否则，","A value that indicates the fullness of the progress indicator in the taskbar button. The default is 0.":"一个值表示任务栏按钮中进度指示器充分度的值。 默认值为0。"," if the installed mouse has a vertical scroll wheel; otherwise, ":"如果已安装的鼠标具有垂直滚轮； 否则，","The key of the current entry.":"当前条目的关键。","The element from which to get the attached property value.":"获取所附属性值的元素。"," objects that are associated with the ":"与"," if Pen Computing extensions are installed; otherwise, ":"如果安装了笔计算扩展； 否则，"," object that represents the icon.":"代表图标的对象。","The value of the current entry.":"当前条目的值。"," attached property of the journal entry for the specified element.":"指定元素的期刊条目的附加属性。","A value that specifies the part of the application window's client area that is displayed in the taskbar thumbnail. The default is an empty ":"指定“任务栏缩略图”中显示的“应用程序窗口客户端区域”一部分的值。 默认值为空"," if the window is active; otherwise, ":"如果窗口处于活动状态； 否则，"," if the current session is remotely controlled; otherwise, ":"如果当前的会话是远程控制的； 否则，","The data that is required to serialize the target object.":"序列化目标对象所需的数据。","A file stream that contains the BAML input to be localized.":"包含要本地化的BAML输入的文件流。","The command to invoke when this thumbnail button is clicked. The default is ":"单击此缩略图按钮时要调用的命令。 默认值为","The position of the window's left edge, in logical units (1/96th of an inch).":"窗户左边缘的位置，逻辑单元（1/96的1英寸）。"," if the calling process is associated with a Terminal Services client session; ":"如果通话过程与终端服务客户端会话相关联；","Reads the localized XML comments associated with this BAML input.":"读取与此BAML输入相关的局部XML注释。"," a window's logical child elements.":"窗口的逻辑子元素。","The element on which to set the attached property value.":"设置附件属性值的元素。","The text to display for the thumbnail button tooltip. The default is an empty string.":"显示缩略图按钮工具提示的文本。 默认值是一个空字符串。"," if the calling process is associated with the Terminal Server console session.":"如果调用过程与终端服务器控制台会话关联。","A copy of the localizable resources from a BAML stream, in the form of a ":"从BAML流的本地资源的副本，以A的形式"," if the thumbnail closes; otherwise, ":"如果缩略图关闭； 否则，"," to keep the journal entry in memory; otherwise, ":"将日记入口保持在记忆中； 否则，"," that contains references to the windows for which this window is the owner.":"其中包含对本窗口为所有者的窗口的引用。"," if the computer has a low-end (slow) processor; otherwise, ":"如果计算机具有低端（慢）处理器； 否则，"," object that represents the owner of this ":"代表所有者的对象","Required event arguments.":"所需的事件参数。","The image that is displayed on the thumbnail button. The default is ":"缩略图按钮上显示的图像。 默认值为","The name to be assigned to the attached property.":"要分配给附件属性的名称。"," if the current operating system is Windows XP Tablet PC Edition; otherwise, ":"如果当前操作系统是Windows XP Tablet PC版本； 否则，"," value specifying the resize mode.":"指定调整大小模式的值。"," if a border and highlight is displayed around the thumbnail button; otherwise, ":"如果在缩略图按钮周围显示边框和亮点； 否则，","The stream that will receive the updated BAML.":"将收到更新的BAML的流。","The window height.":"窗口高度。"," object that is associated with this journal entry. If one is not associated, ":"与此期刊条目关联的对象。 如果一个没有关联，"," that specifies the size and location of a window before being either minimized or maximized.":"在最小化或最大化之前，它指定窗口的大小和位置。","The resource updates to be applied to the source BAML.":"用于应用于源BAML的资源更新。"," if the thumbnail button is enabled; otherwise, ":"如果启用了缩略图按钮； 否则，","The name of the journal entry.":"期刊条目的名称。"," if menu access keys are always underlined; ":"如果菜单访问键始终被下划线；","The error condition encountered by ":"遇到的错误条件"," if the user can interact with the thumbnail button; otherwise, ":"如果用户可以与缩略图按钮进行交互； 否则，"," if a window is activated when first shown; otherwise, ":"如果首次显示窗口，则激活窗口； 否则，","The URI of the content that was navigated to, or ":"导航到或"," if they are underlined only when the menu is activated by the keyboard.":"如果仅在键盘激活菜单时强调它们。","An enumeration value that specifies the display state of the thumbnail button. The default is ":"指定缩略图按钮的显示状态的枚举值。 默认值为",", as a value of the enumeration.":"，作为枚举的价值。"," if the window has a task bar button; otherwise, ":"如果窗口有一个任务栏按钮； 否则，"," if no URI is associated with the entry.":"如果没有URI与条目关联。","The key associated with the resource that generated the error condition.":"与生成错误条件的资源相关的密钥。","A converted value.":"转换值。","The new instance of the collection.":"集合的新实例。","The keyboard repeat-delay setting.":"键盘重复延迟设置。",". Does not apply when the window is hosted in a browser.":"。 当窗口托管在浏览器中时，不应用。","The new instance of this class.":"此类的新实例。","The Windows 7 taskbar thumbnail for the ":"Windows 7任务栏缩略图","The value produced by the binding target.":"结合目标产生的值。"," if the user relies on the keyboard; otherwise, ":"如果用户依靠键盘； 否则，","A formatting tag name. Assign a non-empty value to this parameter to indicate inline formatting.":"格式标签名称。 为此参数分配一个非空值以指示内联格式。","The associated element's localizability attribute.":"关联元素的本地化属性。","The type of the binding source property.":"绑定源属性的类型。"," that contains the window's title.":"其中包含窗口的标题。","The input element from which to read the property value.":"读取属性值的输入元素。","The keyboard repeat-speed setting.":"键盘重复速度设置。"," from which to read the property value.":"从中读取属性值。","An array of two navigation stacks.":"两个导航堆栈的数组。","The position of the window's top, in logical units (1/96\").":"窗口顶部的位置，逻辑单元（1/96”）。"," if the smooth-scrolling effect is enabled; otherwise, ":"如果启用了平滑滚动效果； 否则，","The formatting tag string.":"格式标签字符串。"," that is attached to the specified ":"附在指定的"," that can be used to enumerate the merged list of navigation history stacks if neither passed navigation stack is ":"如果没有通过的导航堆栈是","The window width.":"窗口宽度。"," if the window is topmost; otherwise, ":"如果窗口最高； 否则，","The mapping prefix for the XML namespace.":"XML名称空间的映射前缀。",", otherwise.":"， 否则。","The maximum window height.":"最大窗口高度。"," value that specifies the top/left position of a window when first shown. The default is ":"首先显示窗口的顶部/左位置的值。 默认值为","The maximum window width.":"最大窗口宽度。"," that determines whether a window is restored, minimized, or maximized. The default is ":"这决定了是否恢复，最小化或最大化窗口。 默认值为"," (restored).":"（恢复）。"," if menu animation is enabled; otherwise, ":"如果启用了菜单动画； 否则，"," that specifies a window's border style. The default is ":"这指定了窗户的边界风格。 默认值为"," objects in the collection are copied to.":"集合中的对象被复制到。"}