{"Text string":"文本字符串","The elements to select.":"要选择的元素。","The style that is used when rendering the row header. The registered default is ":"渲染行标头时使用的样式。 注册默认值为","One of the enumeration values that specifies which grid lines are shown in the ":"指定网格线的枚举值之一显示在"," is pressed; otherwise, ":"被压； 否则，"," control that implements this ":"控制实现这一点","One of the enumeration values that indicates the visibility of row and column headers. The registered default is ":"指示行和列标题可见性的枚举值之一。 注册默认值为","The template that is used to display the row header or ":"用于显示行标头的模板或","The strokes to select.":"选项要选择。"," if the submenu of the ":"如果子菜单"," view.":"看法。","The converter that converts a ":"转换的转换器","A template selector for choosing the row header template. The registered default is ":"用于选择行标头模板的模板选择器。 注册默认值为","The bounds of the selection after it is moved or resized.":"选择后的界限。"," if the menu should suspend animations on its popup; otherwise, ":"如果菜单应将动画暂停在其弹出窗口上； 否则，"," that is associated with the collection.":"这与集合有关。","The brush that is used to draw the horizontal grid lines in the ":"用于绘制水平网格线的刷子"," if the row is in editing mode; otherwise, ":"如果行处于编辑模式； 否则，"," to display.":"显示。","A custom object that provides logic and returns an item container.":"提供逻辑并返回项目容器的自定义对象。","The bounds of the selection before the user moved or resized it.":"在用户移动或调整大小之前，选择的界限。"," object to assign.":"分配的对象。",". The registered default is a black ":"。 注册默认值是黑色"," is a placeholder for a new item or for an item that has not been committed; otherwise, ":"是新物品或尚未投入的物品的占位符； 否则，","The resource key for a style applied to a ":"应用于A的样式的资源密钥","The collected ":"收集的","The object on which the ":"对象","One of the enumeration values that specifies the visibility of horizontal scroll bars in the ":"指定水平滚动条的可见性的枚举值之一",".  \n  \n The registered default is ":"。 \n  \n  注册默认值为"," must be serialized; otherwise, ":"必须序列化； 否则，"," if the submenu in which this ":"如果在此的子菜单","The event target.":"事件目标。"," if the row is selected; otherwise, ":"如果选择该行； 否则，"," is located should not close when this item is clicked; otherwise, ":"单击此项目时，位置不应关闭； 否则，","A string that indicates the number of columns in the ":"一个指示列数的字符串"," if the rows and cells are read-only; otherwise, ":" 如果行和单元格是只读的；否则, ","The stroke that was added to the ":"添加到","The data item that the row represents. The registered default is ":"行代表的数据项。 注册默认值为"," is a header of a submenu.":"是子菜单的标题。"," if columns can be reordered; otherwise, ":"如果可以重新排序列； 否则，","The maximum width of the columns and headers in the ":"列和标头的最大宽度","The stroke that is about to be erased.":"即将删除的中风。","The template that defines the panel to use for the layout of cells in the row. The registered default is ":"定义面板的模板用于行中的单元格。 注册默认值为"," is a submenu.":"是子菜单。"," that is used to define the display properties for column headers. The default value is ":"用于定义列标题的显示属性。 默认值是",", in device-independent units (1/96th inch per unit). The registered default is ":"，在独立的单位（每单位1/96英寸）中。 注册默认值为","The template that is used to visually indicate an error in row validation, or ":"用于视觉上指示行验证中错误的模板，或","The new strokes of the ":"新笔触"," for the column headers in a ":"对于圆柱标题"," is a header of a top-level menu.":"是顶级菜单的标题。","The minimum width of the columns and headers, in device-independent units (1/96th inch per unit). The registered default is 20. For more information about what can influence the value, see ":"圆柱和标头的最小宽度，独立于设备的单元（单位1/96英寸）。 注册默认值为20。有关可能影响该值的内容的更多信息，请参阅","The data item for the row for which the event occurred.":"事件发生的行的数据项。"," when it is a top-level ":"当它是顶级","A composite string that specifies how to format the column headers of the ":"一个复合字符串，指定如何格式化的列标题","The minimum height constraint of rows, in device-independent units (1/96th inch per unit). The registered default is 0.0. For more information about what can influence the value, see ":"行无关的单位（单位1/96英寸）的行的最小高度约束。 注册默认值为0.0。 有关影响价值的内容的更多信息，请参阅","The previous strokes of the ":"以前的笔画 "," value of the column that contains the first selected cell in the row.":"该列的值包含该行中的第一个选定单元格。","The margin for the new item row.  \n  \n The registered default is 0. For more information about what can influence the value, see Dependency Property Value Precedence.":"新项目行的边距。 \n  \n  注册默认值为0。有关可能影响该值的更多信息，请参见依赖关系属性值优先级。"," that can invoke commands.":"可以调用命令。"," if they are displayed as strings. The default is ":"如果将它们显示为字符串。 默认值为","The visual of a ":"视觉","The horizontal offset of the scrollable columns. The registered default is 0.0. For more information about what can influence the value, see ":"可滚动列的水平偏移。 注册默认值为0.0。 有关影响价值的内容的更多信息，请参阅"," the menu selects different item containers; otherwise, ":"菜单选择不同的项目容器； 否则，"," value of the column that contains the last selected cell in the row.":"该列的值包含该行中的最后一个选定单元格。"," to use to display the column headers as part of the ":"用于显示列标题作为一部分"," that specifies the appearance of the dynamically rendered ink.":"这指定了动态渲染墨水的外观。","Values produced by the source binding.":"源结合产生的值。","The brush that paints the background of a row. The registered default is ":"绘制一排背景的刷子。 注册默认值为","A value that indicates whether the row for which the event occurred represents the column headers.":"指示事件发生的行是否表示列标题的值。"," object that determines the data template to use for each column header. The default value is ":"确定要用于每个列标头的数据模板的对象。 默认值是","The visual of the ":"视觉","The converter that converts a Boolean value to a ":"将布尔值转换为一个的转换器","The data format in which to serialize the cell values.":"在其中序列化单元格值的数据格式。","Type of the target. Type that the source will be converted into.":"目标类型。 键入源将转换为。"," to detach.":"分离。","An object that represents the content that appears as a tooltip when the mouse pointer is paused over one of the column headers. The default value is not defined.":"当鼠标指针在列标题之一上暂停时，表示作为工具提示的内容的对象。 默认值未定义。","The template that is used to display the row details. The registered default is ":"用于显示行详细信息的模板。 注册默认值为","The formatted string.":"格式化的字符串。","Converter parameter.":"转换器参数。",". The default value is the ":"。 默认值是","Culture information.":"文化信息。"," that represents the area that is clipped when ":"这代表了当","The template selector that is used for the row details. The registered default is ":"用于行详细信息的模板选择器。 注册默认值为"," values that represent the text values of the cells being copied.":" 表示要复制的单元格的文本值的值。"," in the current theme.":"在当前主题中。","Converted value.":"转换值。","The strokes that the ":"笔触","One of the enumeration values that specifies the visibility of row details. The registered default is ":"指定行详细信息可见性的枚举值之一。 注册默认值为","The size to use to arrange the child elements.":"用于安排子元素的大小。"," if the row represents the column headers; otherwise, ":"如果行表示列标题； 否则，"," that references the style for each ":"引用了每个样式"," displays.":"显示。","The rendered width of the row header, in device-independent units (1/96th inch per unit). The registered default is 0.0. For more information about what can influence the value, see ":"行无关的单元（单位1/96英寸）以行为标头的呈现宽度。 注册默认值为0.0。 有关影响价值的内容的更多信息，请参阅","The row for which the event occurred.":"事件发生的行。",". The default value references the default style for a ":"。 默认值引用了"," that represents the arranged size of the page.":"这代表了页面的布置大小。","The zero-based index at which the object is added or -1 if the item cannot be added.":"如果无法添加项目，则添加对象或-1的基于零的索引。","The style applied to all row headers in the ":"该样式适用于所有排标题"," control in the current theme.":"控制当前主题。","The row details section as a framework element.":"行详细信息部分作为框架元素。","The available area that the window can give to its children.":"窗户可以给孩子的可用区域。"," to indicate that the item belongs to this collection and passes the active filter; otherwise, ":"指示该项目属于此集合并传递活动过滤器； 否则，","The template for the row headers. The registered default is ":"行标头的模板。 注册默认值为"," that is the actual size of the window. The method may return a larger value, in which case the parent may need to add scroll bars.":"那就是窗口的实际尺寸。 该方法可能会返回更大的值，在这种情况下，父母可能需要添加滚动条。","The column that is being sorted.":"正在分类的列。"," that references the ":" 这是指 ","The template selector for row headers. The registered default is ":"行标头的模板选择器。 注册默认值为","The zero-based index in the destination array.":"目标数组中的基于零的索引。","A new editing element that is bound to the column's ":"绑定到列的新编辑元素"," control for a ":"控制","The width of the row header column, in device-independent units (1/96th inch per unit). The registered default is ":"行无关的单元（单位1/96英寸）的行式列的宽度。 注册默认值为","The previous parent. Set to ":"前的父母。 设置为 ","The zero-based index at which the item is located.":"该项目所在的基于零的索引。",". The default value is the style for the ":"。 默认值是","The height of the rows, in device-independent units (1/96th inch per unit). The registered default is ":"行的高度，独立于设备的单位（每单位1/96英寸）。 注册默认值为"," did not have a previous parent.":"没有以前的父母。","A new, read-only element that is bound to the column's ":"一个绑定到列的新的，仅读取的元素","The item at the specified zero-based index in this view.":"此视图中指定的基于零索引的项目。"," object of a ":"a的对象"," uses to paint its background.":"用来绘制其背景。","The style applied to all rows in the ":"该样式应用于所有行","The template that is used to display the contents of a cell that is in editing mode. The registered default is ":"用于显示在编辑模式的单元格的内容的模板。 注册默认值为","The object to look for in the collection.":"在集合中寻找的对象。","A string that identifies the object as a ":"将对象识别为一个的字符串","The style selector for the rows. The registered default is ":"行的样式选择器。 注册默认值为","The object that determines which template to use to display the contents of a cell that is in editing mode. The registered default is ":"确定用于显示在编辑模式的单元格的内容的对象。 注册默认值为","An object that contains the content of a ":"一个包含一个内容的对象","The index of the item in the collection, or -1 if the item does not exist in the collection.":"集合中项目的索引，或-1，如果该项目在集合中不存在。"," object and displays the value of the ":"对象并显示","The template to use to display the contents of a cell that is not in editing mode. The registered default is ":"用于显示不在编辑模式的单元格内容的模板。 注册默认值为"," that is the font family for the content of a ":"那是字体族的内容","The template that is used to visually indicate an error in row validation. The registered default is ":"用于直观地指示行验证中的错误的模板。 注册的默认值为 ","The object that determines which template to use. The registered default is ":"确定要使用哪种模板的对象。 注册默认值为"," to indicate that the resulting ":"表明结果","The current width of the column. The default is zero (0.0).":"列的当前宽度。 默认值为零（0.0）。","The rules that are used to validate the data in each row.":"用于验证每行数据的规则。","A new, read-only text block control that is bound to the column's ":"一个绑定到列的新的，仅读取的文本块控件","The font size for the content of a ":"A内容的字体大小 ","The zero-based index of the item to set as the ":"该项目的基于零的索引，将其设置为"," that is used to format a column cell. The default is ":"它用于格式化列单元格。 默认值为","The font family of the content for cells in the column. The registered default is ":"列中细胞内容的字体家族。 注册默认值为"," command that indicates the intention to select all cells in the ":"指示选择所有单元格的命令"," uses to paint its foreground. The default is ":"用来绘制其前景。 默认值为"," instance is retained in navigation history; otherwise, ":"实例保留在导航历史记录中； 否则，"," that provides ":"提供的"," to indicate that the specified item belongs to this view or there is no filter set on this collection view; otherwise, ":"指示指定的项目属于此视图，或者在此集合视图上没有过滤器设置； 否则，","The list of cells that are currently selected.":"当前选择的单元格列表。","The font size of the content of cells in the column. The registered default is ":"列中单元格内容的字体大小。 注册默认值为"," selection for column cells. The default is ":"选择柱单元。 默认值为","The object that was added to the collection.":"添加到集合中的对象。"," for the logical child elements of a ":"对于逻辑的子元素","The font style of the content of cells in the column. The registered default is ":"列中单元格内容的字体样式。 注册默认值为","The specified data item type that displays in the column. The default is ":"在列中显示的指定数据项类型。 默认值为","One of the enumeration values that specifies how rows and cells are selected in the ":"指定如何选择行和单元格的枚举值之一"," if the listener handled the event; otherwise, ":"如果听众处理活动； 否则，"," object that the host of the page is using to manage navigation, or ":" 页面主机用于管理导航的对象，或 ","The font weight of the contents of cells in the column. The registered default is ":"色谱柱中细胞内容的字体重量。 注册默认值为","One of the enumeration values that specifies whether rows, cells, or both can be selected in the ":"指定行，单元格还是两者都可以选择的枚举值之一","The object to use for the column header. The default is ":"用于列标题的对象。 默认值为 "," if this view supports filtering; otherwise, ":"如果此视图支持过滤； 否则，"," if the host does not support navigation.":"如果主机不支持导航。","The brush that is used to draw the vertical grid lines in the ":"用于绘制垂直网格线的刷子","The brush that is used to paint the contents of cells in the column. The registered default is ":"用于绘制列中细胞内容物的刷子。 注册默认值为"," that defines the display properties for the column header. The default is ":"这定义了列标题的显示属性。 默认值为","One of the enumeration values that specifies the visibility of vertical scroll bars in the ":"指定垂直卷轴可见性的枚举值之一"," if the collection supports grouping; otherwise, ":"如果该系列支持分组； 否则，"," if the navigation UI of a host ":"如果主机的导航UI"," to use to display the column header. The default is ":"用于显示列标题。 默认值为"," if this view support sorting; otherwise, ":"如果此视图支持排序； 否则，","The data object for which to select the template.":"选择模板的数据对象。","The title of the ":"标题","The name of the property bound to the generated column.":"绑定到生成列的属性的名称。","The data-bound object.":"数据结合对象。"," object that provides data template selection for each ":"为每个提供数据模板选择的对象","The number of items in the collection or 0 if the collection is uninitialized or if there is no collection in the ":"集合中的项目数量或0，如果集合是非初始化的，或者如果没有集合","The type of the property bound to the generated column.":"属性的类型绑定到生成的列。","The height of a window that directly hosts a ":"直接托管的窗口的高度"," mode.":"模式。","The width of the column. The default is ":"列的宽度。 默认值为","The style that is used when rendering the calendar.":"呈现日历时使用的样式。","The generated column.":"生成的列。","The title of a window that directly hosts the ":"直接主持的窗口的标题",", which automatically sizes to the largest column item that is not the column header.":"，它自动尺寸到不是列标题的最大列项目。","The current object in the view or ":"视图中的当前对象或","The last date to display.":"最后显示的日期。","The width of a window that directly hosts a ":"直接托管的窗口的宽度","An object that contains metadata for the property.":"一个包含属性元数据的对象。"," if the collection is uninitialized or if there is no collection in the ":"如果该集合是非初始化的，或者是否没有集合","The position to place the new ":"放置新的位置","The column that contains the cell to be edited.":"包含要编辑的单元格的列。","The page that is printed or processed.":"打印或处理的页面。"," mode.  \n  \n By default, the first item of the collection starts as the current item.":"模式。 \n  \n  默认情况下，集合的第一项开始于当前项目。","The first date to display.":"第一个日期显示。","The row that contains the cell to be edited.":"包含要编辑的单元格的行。","The original position of the ":"原始位置","The first page of the range.":"范围的第一页。","The ordinal position of the current item within the view or -1 if the collection is uninitialized or if there is no collection in the ":"当前项目在视图中的序数位置或-1，如果集合是非初始化的，或者如果没有集合"," is open; otherwise, ":"开了; 否则，","The last page of the range.":"范围的最后一页。","Information about the user gesture that caused the cell to enter edit mode.":"有关导致单元格进入编辑模式的用户手势的信息。","The event arguments.":"事件参数。"," objects. The collection is indexed by the group levels.":"对象。 该集合由小组级别索引。","The format that is used to display the selected date. The default is ":"用于显示所选日期的格式。 默认值为","The top-level groups that are constructed according to the ":"根据","The previous binding.":"先前的绑定。","The object tested.":"对象测试。","The position at which the new ":"新的位置","The text displayed by the ":"由"," if the object is of type ":"如果对象是类型"," replaces the old ":" 取代旧的 ","The binding that the column has been changed to.":"该列已更改为的绑定。"," if the current item of the view is beyond the end of the collection; otherwise, ":"如果视图的当前项目超出了集合的末尾； 否则，","The initial exception from the ":"来自"," and is equal to this ":"并且等于这个"," to place at the specified position.":"位于指定位置。"," if the current item of the view is beyond the beginning of the collection; otherwise, ":"如果视图的当前项目超出了集合的开头； 否则，","The value that was passed to the delegate.":"传递给代表的价值。","The text that caused the ":"引起的文字"," tested.":"测试。","Information about the change in the size of the ":"有关变化大小的信息"," if grouping data in real time is enabled; ":"如果启用实时分组数据；"," if cells in the column cannot be edited based on rules from the data grid; otherwise, ":"如果无法根据数据网格的规则编辑列中的单元格； 否则，","The hash code value for the ":"哈希代码值","The exception associated with the validation failure.":"与验证失败相关的例外。","The cell to update.":"要更新的单元格。"," if sorting data in real time is enabled; ":"如果启用实时分类数据；","The dependency property.":"依赖属性。","A string that represents the range of pages in the format \"":"表示格式中页面范围的字符串“","The text that caused the validation failure.":"导致验证失败的文本。","The 1-based page number of the first page in the range.":"该范围内第一页的1基页编号。","The zero-based index of the item.":"项目的零索引。","The name of the column property that has changed.":"已更改的列属性的名称。"," enumeration value that specifies the current role of the column.":"指定列的当前角色的枚举值。"," if the exception should be thrown; otherwise, ":"如果应该抛出例外； 否则，","The 1-based page number of the last page in the range.":"范围内最后一页的1基页编号。","The object retrieved or the object that is being set to the specified index.":"检索的对象或正在设置为指定索引的对象。","The object that represents the data binding for the column. The default is ":"表示列的数据绑定的对象。 默认值为","The area that is available for the column header row.":"可用于列标题行的区域。"," this element uses to arrange its child content.":"该元素用来安排其子女内容。"," if the collection needs to be refreshed; otherwise, ":"如果需要刷新该系列； 否则，","The logical parent element of the collection to be created.":"要创建的集合的逻辑父元素。"," for the column header row.":"对于列标题行。","An object that represents the binding.":"代表绑定的对象。"," element and its child.":"元素及其孩子。"," object that is the underlying collection or the user-provided ":"是基础集合或用户提供的对象","An ordered collection of elements that have the specified logical parent.":"具有指定逻辑父的元素的有序集合。","The style that is used when rendering an editing element. The registered default is ":"渲染编辑元素时使用的样式。 注册默认值为","The amount of area that is available to display the column header row.":"可用于显示列标题行的可用区域数量。","Index position of the child element.":"子元素的索引位置。"," is read only; otherwise, ":"仅阅读； 否则，",". For information about what can influence the value, see ":"。 有关可能影响价值的信息，请参阅","The child element at the specified ":"指定的子元素"," child.":"孩子。"," object for this column header row.":"此列标题行的对象。","The index of the desired item.":"所需项目的索引。"," if columns can be moved by the drag-and-drop operation of a column header; otherwise, ":"如果可以通过列标题的拖放操作移动列； 否则，"," child of the parent ":"父母"," of the element.":"元素。","The style that is used when rendering a display-only element. The registered default is ":"呈现仅显示元素时使用的样式。 注册默认值为","Returns the element corresponding to the item at the given index within the ":"返回与在给定索引的项目中对应的元素","The maximum size that the cell can occupy.":"单元可以占据的最大尺寸。","The element for which to retrieve the ":"检索的元素","The single child element of a ":"一个单一的子元素"," to use for the column header container. The default is ":"用于列标题容器。 默认值为"," or returns ":"或返回"," for the column header row. The default is ":"对于列标题行。 默认值为","The final size of the control.":"控件的最终尺寸。"," position of the element.":"元素的位置。"," if the item is not realized.":"如果未实现该项目。","An enumerator that can be used to iterate the logical child elements of a ":"可以用来迭代逻辑子元素的枚举者","A composite string that specifies how to format the column headers if they are displayed as strings. The default is ":"如果将列标头显示为字符串，则指定如何格式化列标头的复合字符串。 默认值为","The old column definition.":"旧列定义。","The old property value.":"旧的属性值。","The number of visual child elements.":"视觉子元素的数量。"," item to find the ":" 要查找的项目 ","The new column definition.":"新列定义。"," that is used to display the column header content. The default is ":"用于显示列标题内容。 默认值为"," that identifies a shared-size group.":"这标识了共享大小的组。"," that corresponds to the given item. Returns ":"这与给定的项目相对应。 返回"," object to draw.":"要绘制的对象。","The drawing instructions for the cell.":"单元格的绘图说明。"," that chooses the ":"选择"," if the item does not belong to the item collection, or if a ":"如果该项目不属于项目集合，或者","The column that the cell is in.":"单元格中的列。"," to use to display each column header. The default is ":"用于显示每个列标题。 默认值为","The element on which to apply the property value.":"应用属性值的元素。"," this element uses to arrange its child elements.":"该元素用来安排其子元素。"," if the cell is in edit mode; otherwise, ":"如果单元格处于编辑模式； 否则，"," has not been generated for it.":"尚未生成它。","The order on the z-plane in which this element appears.":"该元素出现的z平面上的顺序。","An object that represents the content of a tooltip for the column headers.":"代表列标题工具提示内容的对象。","A maximum ":"最大"," if the cell cannot be put in edit mode; otherwise, ":"如果无法将单元格放入编辑模式； 否则，","The area to use to display the ":"用于显示的区域"," collection should be serialized; otherwise, ":"收集应序列化； 否则，","An object that manages the ":"管理的对象"," to not exceed.":"不超过。"," if the cell is selected; otherwise, ":" 如果小区被选中；否则, "," that is used to display the ":"用于显示"," that represents the element size you want.":"这代表了您想要的元素大小。"," collection is only serialized if it is not empty and not ":"收集仅在不空的情况下序列化"," that corresponds to the item to the index to be returned.":"这对应于要返回的索引的项目。","The data item for the row that contains the cell for which the event occurred.":"包含事件发生的单元格的行的数据项。","The maximum area to use to display the ":"用于显示的最大区域"," if the last child element stretches to fill the remaining space; otherwise ":"如果最后一个子元素伸展以填补剩余空间； 否则",". This default value is ":"。 此默认值是","The column that contains the cell for which the event occurred.":"包含事件发生的单元格的列。"," of the area that displays the ":"显示的区域"," if the orientation of the ":"如果方向"," index to an item that corresponds to the specified, generated ":"对应于指定的，生成的项目的索引","The text value of the cell for which the event occurred.":"事件发生的单元格的文本值。","The maximum number of pages to fit in the current ":"最多适合当前的页面"," is in one dimension; otherwise, ":"在一个维度； 否则，","A string that shows the ":"一个显示的字符串"," or -1 if ":" 或-1如果 ","The row that contains the cell for which the event occurred.":"包含事件发生的单元格的行。","An ordered collection of ":"有序的集合"," if the collection of ":" 如果收集 "," to search the current level of hierarchical items; ":"搜索当前分层项目的级别；","The object that represents the content of a row.":"表示行内容的对象。"," objects. This property has no default value.":"对象。 该属性没有默认值。","The element that the cell displays in editing mode.":"单元格以编辑模式显示的元素。"," elements changed after the last call to ":"最后一次通话后，元素发生了变化"," to recursively search hierarchical items.":"递归搜索分层项目。","The event information.":"事件信息。"," that corresponds to the item to be returned.":"对应于要退回的项目。"," is an items host; otherwise, ":"是一个主机； 否则，","A value that indicates whether the edit was canceled or committed.":"指示编辑是被取消还是投入的值。"," elements that are currently displayed in the ":"当前显示在","The final area within the parent that the ":"父母内的最后一个区域"," that is the item which corresponds to the specified, generated ":"那是与指定的，生成的项目"," of the panel. This property has no default value.":"面板。 该属性没有默认值。","The data item for the row that contains the cell.":"包含单元格的行的数据项。","The object to make visible.":"使可见的对象。"," should use to arrange itself and its children.":"应该用来安排自己及其子女。","The column that contains the cell.":"包含单元格的列。","The number of child ":"孩子人数"," has not been generated, ":"尚未产生，","The rectangular region of the ":"矩形区域","The cell for which information is to be generated.":"要生成信息的单元格。","A DependencyObject that is the container element which is used to display the next item.":"依赖项视频对象是用于显示下一个项目的容器元素。","The actual sized used by the ":"实际尺寸","A brush that describes the color of the password box's caret.":"描述密码框的颜色的刷子。"," to make visible.":"使可见。"," if the comparison object represents the same cell; otherwise, ":"如果比较对象表示相同的单元格； 否则，","The associated item.":"关联的项目。","Is true if the returned DependencyObject is newly generated (realized); otherwise, false.":"如果返回的依赖项是新生成的（已实现的），则为真实； 否则，错误。"," has focus and selected text; otherwise, ":"有重点和选择的文本； 否则，","A hash code for the structure.":"该结构的哈希代码。","The associated property.":"相关属性。","The number of the page to be viewed.":"要查看的页面的编号。","The index of desired item.":"所需项目的索引。","An integer specifying the maximum length, in characters, for passwords to be handled by this ":"一个整数，指定最大长度，字符，以便由此处理密码","The first structure to compare.":"第一个比较的结构。","The number of pages to fit across the content area.":"适合整个内容区域的页面数量。","The property to remove.":"要删除的属性。",".  \n  \n A value of zero (0) means no limit.  \n  \n The default value is 0 (no length limit).":"。 \n  \n  零（0）的值无需限制。 \n  \n  默认值为0（无长度限制）。","A GeneratorPosition object that maps to the item at the specified index.":"在指定索引处映射到项目的生成对象。","The page number to position to.":"要定位的页码。","The second structure to compare.":"比较的第二个结构。","A string representing the password currently held by the ":"一个代表当前持有密码的字符串",".  \n  \n The default value is ":"。 \n  \n  默认值是","The item that has the specified property associated with it.":"具有与之关联的指定属性的项目。"," if the control can zoom out more; otherwise, ":"如果控件可以缩小更多； 否则，","The panel for which to return an appropriate ItemContainerGenerator.":"返回适当的ItemContaNergonerator的面板。"," if the two structures represent the same cell; otherwise, ":"如果两个结构代表相同的单元格； 否则，","An ItemContainerGenerator appropriate for use by the specified panel.":"适用于指定面板使用的ItemContaNergenerator。"," if the control can zoom in more; otherwise, ":"如果控件可以放大更多； 否则，","The property whose value to return.":"归还价值的属性。","A masking character to echo when the user enters text into the ":"当用户将文本输入到"," if the two structures do not represent the same cell; otherwise, ":"如果两个结构不代表相同的单元格； 否则，","The value of the specified property that is associated with the specified item.":"与指定项目关联的指定属性的值。"," if the control can move down more in the document; otherwise, ":"如果控件可以在文档中移动更多； 否则，"," if the structure has valid information; otherwise, ":"如果结构有有效的信息； 否则，",". The default value is a bullet character (●).":"。 默认值是子弹字符（●）。","An Int32 that is the index which maps to the specified GeneratorPosition.":"INT32是将索引映射到指定的生成器位置的索引。"," if the document is at the bottom.":"如果文档在底部。","A secure string representing the password currently held by the ":"一个安全的字符串，代表当前持有的密码","The container to prepare. Normally, container is the result of the previous call to GenerateNext.":"准备的容器。 通常，容器是先前调用GenerateNext的结果。","The item to associate the value and property with.":"将价值和属性关联的项目。","The maximum size that the panel can occupy.":"面板可以占据的最大尺寸。"," if the control can move more left in the document; otherwise, ":"如果控件可以在文档中移动更多； 否则，","Removes one or more generated (realized) items.":"删除一个或多个生成的（已实现的）项目。","A brush that highlights selected text.":"突出显示选定文本的画笔。","The property that is associated with the specified item.":"与指定项目关联的属性。","The final size and placement of the panel.":"面板的最终尺寸和位置。","The brush used for selected text.":"用于选定文本的刷子。"," if the document is at the leftmost edge.":"如果文档处于最左边的边缘。","The Int32 number of elements to remove, starting at ":"int32要删除的元素数，从","The available ":"可用","The index of the item that should become visible.":"应该可见的项目的索引。","The value of the associated property.":"相关属性的价值。","A GeneratorPosition that specifies the position of the item to start generating items at.":"一个发电机位置，指定项目开始生成项目的位置。"," if the control can move more to the right in the document; otherwise, ":"如果控件可以在文档中向右移动更多； 否则，","The desired size of the panel.":"面板所需的大小。","An object that represents the sizes of the control's viewport and cache.":"表示控件视口和缓存大小的对象。"," to use to lay out the content of the ":"用来布置内容","A GeneratorDirection that specifies the direction which to generate items.":"一个指定生成项目的方向的生成方向。"," if the document is at the rightmost edge.":"如果文档处于最右边的边缘。","An object that represents the desired size of the control's header.":"表示控件标头的所需大小的对象。","The object that raised the ":"提出的对象","An IDisposable object that tracks the lifetime of the generation process.":"一个可跟踪生成过程寿命的可构想对象。","The computed size of the ":"的计算大小 "," if the control can move up more in the document; otherwise, ":"如果控件可以在文档中移动更多； 否则，"," if the control's layout pass occurs at a lower priority; otherwise, ":"如果控件的布局通过在较低的优先级出现； 否则，","The specified index for the child element.":"儿童元素的指定索引。","A Boolean that specifies whether to start at a generated (realized) item.":"布尔值指定是否从生成的（已实现）项目开始。","The cell that will contain the generated element.":"将包含生成元素的单元格。"," child element that is at the specified index.":"在指定索引处的子元素。","An object that represents the desired size of the control's items.":"代表控件项目所需大小的对象。"," if the document is at the topmost edge.":"如果文档处于最高边缘。","The index of the first element to reuse. ":"重复使用的第一个元素的索引。","The upper ":"上层"," that displays the items of the control.":"显示控件的项目。","The overall vertical height of the paginated content specified in device independent pixels.  The default is 0.0.":"设备独立像素中指定的分页式内容的总垂直高度。 默认值为0.0。","The data item represented by the row that contains the intended cell.":"由包含预期单元格的行表示的数据项。"," limit of the ":"限制"," must refer to a previously generated (realized) item.":"必须参考先前生成的（已实现的）项目。","A new check box control that is bound to the column's ":"绑定到该列的新的复选框控件"," if the owning ":"如果拥有","The current horizontal width of the content layout area specified in device independent pixels.  The default is 0.0.":"设备独立像素中指定的内容布局区域的当前水平宽度。 默认值为0.0。","A new, read-only check box control that is bound to the column's ":"一个绑定到该列的新的，仅阅读的复选框控件","The number of elements to reuse, starting at ":"重复使用的元素数量，从"," control, based on the size of its ":"控制，基于它的大小","The routed command that performs the ":"执行的路由命令"," if the listener handled the event.":"如果听众处理活动。"," should virtualize its items; otherwise, ":"应该虚拟化其项目； 否则，","The background color for the ":"背景颜色","The element that the column displays for a cell in editing mode.":"列在编辑模式下为单元格显示的元素。","The current horizontal scroll position specified in device independent pixels.  The initial default is 0.0.":"设备独立像素中指定的当前水平滚动位置。  初始默认值为0.0。","The collection of items that belong to this ":"属于此的物品的集合","The number of alternating ":"交替的数量"," to use as the bullet. The default is ":"用作子弹。 默认值为","Information about the user gesture that is causing a cell to enter editing mode.":"有关导致单元格进入编辑模式的用户手势的信息。"," value that represents the generation status of the ":"代表代表生成状态的价值","The style that is applied to the ":"适用于","The horizontal space between displayed pages specified in device independent pixels.  The default is 10.0.":"在设备独立像素中指定的显示页面之间的水平空间。  默认值为10.0。","The unedited value.":"未编辑的价值。","The enumerator that provides access to the logical child elements of the ":"提供访问逻辑子元素的枚举者","The default key of the ":"默认键"," generated for each item. The default is ":"为每个项目生成。 默认值为","The maximum number of page columns to be displayed.  The default is 1.":"要显示的最大页面列数。 默认值为1。","The number of visual elements that are defined for the ":"定义的视觉元素数量","An object that represents the style.":"代表样式的对象。","The type for which this template is designed.":"该模板设计的类型。"," if drop-shadow borders are displayed; otherwise, ":"如果显示掉落阴影边界； 否则，","The data for ":"数据","The default style of the group.":"组的默认样式。"," if the hosted controls support three states; ":"如果托管控件支持三个州；","The object for which to select the template.":"选择模板的对象。","A composite string that specifies how to format the header if it is displayed as a string.":"如果将标题显示为字符串，则指定如何格式化标头的复合字符串。","The current vertical scroll position offset in device independent pixels.  The default is 0.0.":"当前的垂直滚动位置在设备独立像素中偏移。 默认值为0.0。","Specifies the size changes.":"指定尺寸变化。"," if they support two states. The default is ":"如果他们支持两个州。 默认值为","The vertical space between displayed pages in device independent pixels.  The default is 10.0.":"设备独立像素中显示的页面之间的垂直空间。 默认值为10.0。"," object that is used to display the group header. The default is ":"用于显示组标头的对象。 默认值为","When the ":"当。。。的时候","The container for the items.":"物品的容器。","The data item for the row that contains the cell being copied.":"包含要复制的单元格的行的数据项。","The template. The default implementation returns ":"模板。 默认实现返回","The column that contains the cell being copied.":"包含要复制的单元格的列。"," to not display empty groups; otherwise, ":"不显示空的组； 否则，","The vertical size of the scrollable content area  in device independent pixels.  The default is 0.0.":"设备独立像素中的可滚动内容区域的垂直尺寸。  默认值为0.0。"," event occurs. The default value is ":" 事件发生。 默认值为 ","The horizontal size of the scrollable content area in device independent pixels.  The default is 0.0.":"设备独立像素中可滚动内容区域的水平尺寸。 默认值为0.0。","The object to add as a child.":"小时候添加的对象。","The text value of the cell being copied.":"被复制的单元格的文本值。"," object that creates the panel used to layout the items.":"创建用于布局项目的面板的对象。","A command to invoke when this button is pressed. The default value is ":"按下此按钮时调用的命令。 默认值为 ","The zoom percentage expressed as a value, 5.0 to 5000.0.  The default is 100.0, which corresponds to 100.0%.":"缩放百分比表示为5.0至5000.0。 默认值为100.0，对应于100.0％。","The container element.":"容器元素。","Group whose style is to be selected.":"要选择其样式的组。","Parameter to pass to the ":"参数传递给"," instance to compare with the current ":" 实例与当前比较 ","The value (from the binding target) to check.":"值（从绑定目标）进行检查。"," to return the container for.":"返回容器。","Element on which to raise a command.":"要提出命令的元素。","Level of the group.":"小组的水平。"," if the current and specified ":"如果当前并指定"," values that defines which direction the content window opens. The default is ":"定义内容窗口打开哪个方向的值。 默认值为"," if the control is enabled; otherwise, ":"如果启用了控件； 否则，","The element to return the container for.":"返回容器的元素。"," instances have the same ":"实例有相同的"," if the content window is expanded; otherwise, ":"如果内容窗口扩展； 否则，","The appropriate group style.":"适当的小组样式。","The container that belongs to the specified ":"属于指定的容器"," is activated; otherwise ":"被激活； 否则","Old value of the ":"旧价值","The appropriate ":"适当的"," property values; otherwise, ":"属性值； 否则，"," if this button represents a year or month that contains selected dates; otherwise, ":"如果此按钮代表包含选定日期的一年或月； 否则，","New value of the ":"新价值"," that owns the given element, if ":"拥有给定元素，如果"," implementation for this control.":"该控件的实现。"," instance to be compared.":"比较的实例。"," property is not ":"财产不是"," if this button represents a day that is not in the currently displayed month, or a year that is not in the currently displayed decade; otherwise, ":"如果此按钮代表当前显示的一个月或当前展示的十年不在一年中的一天； 否则，",", returns the closest container that belongs to any ":"，返回属于任何的最接近的容器","The page number to go to.":"页码要转到。"," instances do not have the same ":"实例没有相同的"," if the date unavailable; otherwise, ":"如果日期不可用； 否则，","A header object. The default is ":"标头对象。 默认值为","The container that belongs to the current ":"属于电流的容器"," object that contains the arguments associated with the ":"包含与之关联的参数的对象","A data template. The default is ":"数据模板。 默认值为"," that owns the given element or ":"拥有给定元素或","The original, unedited value in the cell being edited.":"正在编辑的单元格中的原始未编辑值。"," if the button is highlighted; otherwise, ":"如果突出显示按钮； 否则，"," routed event.":"路由事件。","A data template selector object. The default is ":"数据模板选择器对象。 默认值为"," if no such container exists.":"如果没有这样的容器。"," if no validation errors are found; otherwise, ":"如果找不到验证错误； 否则，"," if the button represents a day that is not in the currently displayed month; otherwise, ":" 如果按钮表示不在当前显示的月份中的一天；否则, "," object containing arguments associated with the ":"包含与之关联的参数的对象","A string that represents this object.":"代表此对象的字符串。","The object from which to get the ":"从中获取的对象","The data item that is represented by the row that contains the intended cell.":"由包含预期单元格的行表示的数据项。"," level can be decreased; otherwise, ":"水平可以降低； 否则，"," if the date is selected; otherwise, ":"如果选择日期； 否则，"," if the control has a header; otherwise, ":"如果控件有标题； 否则，","The element that is used to display the given item.":"用于显示给定项目的元素。"," level can be increased; otherwise, ":"水平可以提高； 否则，","A new editing element that is bound to the ":"绑定到的新编辑元素","An object that labels the ":"标记的对象"," if the date is the current date; otherwise, ":"如果日期是当前日期； 否则，","The host element.":"主机元素。"," property value of the column.":"列的属性值。"," displays selected text when the ":"显示选定的文本当","The resource key for the ":"资源密钥",". A header can be a string or a ":". 标头可以是字符串或 "," that the specified element hosts items for, or ":"指定元素托管项目或","A data template used to display a control's header. The default is ":"用于显示控件标头的数据模板。 默认值为"," that displays the days of the week.":"这显示了一周的日子。","A new read-only element that is bound to the ":"一个绑定到的新读元素"," does not have focus; otherwise, ":"没有专注； 否则，","A data template selector. The default is ":"数据模板选择器。 默认值为","The item to check.":"要检查的项目。","The cell content; or ":"细胞含量； 或者"," that is relative to the ":"那是相关的"," displays selected text when the text box does not have focus; otherwise, ":"在文本框没有焦点时显示选定的文本； 否则，","An enumerator. The default is ":"枚举者。 默认值为"," where the upper-left corner of the ":"左上角"," if the item is (or is eligible to be) its own container; otherwise, ":"如果物品是（或有资格成为）自己的容器； 否则，","The maximum allowable zoom level for the ":"最大允许的缩放级别","The size of the cache before and after the viewport.":"视口前后缓存的大小。",", if the cell is not found.":"，如果找不到细胞。"," is placed.":"放置。","The container element to return the ":"容器元素返回",", interpreted as a percentage. The default is 200.0 (a maximum zoom of 200%).":"，被解释为一个百分比。 默认值为200.0（最大变焦为200％）。"," along which a ":"a","The type of unit that is used by the ":"由","The row that contains the intended cell.":"包含预期单元格的行。"," that owns the specified container element.":"它拥有指定的容器元素。"," is equal to this ":"等于这个","The minimum allowable zoom level for the ":"最小允许的缩放级别"," control moves when it is obstructed by a screen edge.":"当控制被屏幕边缘阻塞时，控制会移动。","The name of the column property that changed.":"更改的列属性的名称。","Information about the change.":"有关更改的信息。"," if the structures have the same values; otherwise, ":"如果结构具有相同的值； 否则，","The item of interest.":"感兴趣的项目。","The area that displays the items of the control.":"显示控件项目的区域。",", interpreted as a percentage. The default is 80.0 (a minimum zoom of 80%).":"，被解释为一个百分比。 默认值为80.0（最低缩放为80％）。"," if cells in the column cannot be edited based on rules from the ":"如果无法根据规则编辑列中的单元格","The hash code for this structure.":"该结构的哈希代码。"," for the base implementation.":"用于基础实现。","The data context for the selected element.":"所选元素的数据上下文。","The size of the header, in logical units.":"标头的大小，以逻辑单位。","The selected content of the ":"所选择的内容 "," if the structures do not have the same values; otherwise, ":"如果结构没有相同的值； 否则，","A brush that highlights the selected text.":"突出显示所选文本的刷子。","The text to add.":"要添加的文本。","An object that represents the content of the cell.":"代表单元格内容的对象。","The size of the header, in device-independent units (1/96th inch per unit).":"标头的尺寸，独立于设备的单位（单位1/96英寸）。"," that is used to position a ":"用于定位","The string representation of the object.":"对象的字符串表示。"," if the specified object is equal to this object; otherwise, ":"如果指定的对象等于此对象； 否则，","The content to paste into the cell.":"粘贴到单元格的内容。"," control. The default value is (0,0).":"控制。 默认值为（0,0）。","The number of alternating item containers in the ":"交替的项目容器的数量","When returned by a derived class, the unedited cell value. This implementation returns ":"当由派生类返回时，未编辑的单元格值。 此实施返回"," if the specified objects are unequal; otherwise, ":"如果指定的对象不平等； 否则，","The direction in which to move a ":"移动一个方向","The opacity of the ":"的不透明度 ","The size of the control's child items, in logical units.":"控件的子项目的大小，逻辑单元。","The path to a value on the source object. This can be any path, or an XPath such as \"@Name\". The default is an empty string (\"\").":"源对象上值的路径。 这可以是任何路径，也可以是XPATH，例如“ @name”。 默认值是一个空字符串（“”）。"," control when the ":"控制何时","The width of the column in device-independent units (1/96th inch per unit). The registered default is 0. For information about what can influence the value, see ":"列的宽度独立单位（每单位1/96英寸）。 注册默认值为0。有关可能影响该值的信息，请参见",". The default is 0.4.":"。 默认值为0.4。","The size of the control's child items that are in the viewport, in logical units.":"在逻辑单元中，对控件的子项目的大小。"," objects that define the appearance of each level of groups.":"定义每个组级别外观的对象。"," if the user can drag the column header to a new position; otherwise, ":"如果用户可以将列标题拖到新位置； 否则，","The current zoom level, interpreted as a percentage. The default is 100.0 (a zoom level of 100%).":"当前的缩放水平，被解释为一个百分比。 默认值为100.0（缩放水平为100％）。"," is obscured by screen boundaries.":"被屏幕边界所掩盖。","The size of the control's child items that are in the cache before the viewport, in logical units.":"在逻辑单元中，在视口前缓存中控制的子项目的大小。","A method that enables you to provide custom selection logic for a ":"一种使您能够为A提供自定义选择逻辑的方法"," computed from the ":"根据"," if the user can resize the column; otherwise, ":"如果用户可以调整列的大小； 否则，","The current zoom increment, interpreted as a percentage. The default is 10.0 (zoom increments by 10%).":"当前的变焦增量，被解释为一个百分比。 默认值为10.0（缩放增量增量10％）。","The size of the control's child items that are in the cache after the viewport, in logical units.":"在逻辑单元中，观看口之后，控制器中控制的子项目的大小。"," to apply to each group in a collection.":"适用于集合中的每个组。"," if the user can sort the column; otherwise, ":"如果用户可以对列进行排序； 否则，"," property values.":"属性值。","A page number to check for as a valid jump target.":"要检查的页码作为有效的跳跃目标。","The style that is used to render cells in the column. The registered default is ":"用于在列中渲染单元格的样式。 注册默认值为","The size of the control's child items, in device-independent units (1/96th inch per unit).":"对控件的子项目的大小，独立于设备的单位（每单位1/96英寸）。"," if the items count is greater than 0; otherwise, ":"如果项目计数大于0； 否则，","An array of possible ":"一系列可能的"," control that contains this column.":"包含此列的控制。"," is able to jump to the specified page number; otherwise, ":"能够跳到指定的页码； 否则，","The size of the control's child items that are in viewport, in device-independent units (1/96th inch per unit).":"在视口，独立的单位（每单位1/96英寸）中，对控件的子项目的大小。"," if a control is using grouping; otherwise, ":"如果控件使用分组； 否则，","The zero-based position of the column, as it is displayed in the associated ":"列的基于零的位置，因为它显示在关联中"," positions for the ":"位置"," if text searches are case-sensitive; otherwise, ":"如果文本搜索对病例敏感； 否则，"," object containing the arguments associated with the ":"包含与之相关的参数的对象","The size of the control's child items that are in the cache before the viewport, in device-independent units (1/96th inch per unit).":"在视口前，在远离设备独立的单元（每单位1/96英寸）中，对控件的子项目的大小。",". The registered default is -1. For information about what can influence the value, see ":"。 注册默认值为-1。 有关可能影响价值的信息，请参阅"," control relative to the ":" 控制相对于 "," that is copied to each item in the ":"它被复制到","The size of the control's child items that are in the cache after the viewport, in device-independent units (1/96th inch per unit).":"在视口之后，控制器中的控制子项目的大小，独立于设备的单位（每单位1/96英寸）。","Provides data about the event.":"提供有关事件的数据。","The style object to apply to the column header during a drag operation. The registered default is ":"在拖动操作过程中，将样式对象应用于列标题。 注册默认值为","The data item. This value is not used.":"数据项。 此值不使用。"," that is associated with the control. The default is ":"这与控件有关。 默认值为"," if the specified object ":"如果指定的对象"," values that specifies the viewing mode to switch to.":"指定要切换的查看模式的值。","The column header content. The registered default is ":"列标题内容。 注册默认值为","The available size that this element can give to child elements.":"此元素可以给儿童元素提供的可用大小。"," values that specifies the desired viewing mode.":"指定所需查看模式的值。"," that is applied to the container element generated for each item. The default is ":"该应用于为每个项目生成的容器元件。 默认值为","The control's child items that are in the cache after the viewport, in logical units.":"观看口之后，在逻辑单元中，控制器中的控制器项目。","A string value that represents the formatting pattern. The registered default is ":"表示格式模式的字符串值。 注册默认值为","The size of the control, up to the maximum specified by constraint.":"控件的大小，直到约束指定的最大值。","The style that is used to render the column header; or ":"用于渲染列标题的样式； 或者"," object that contains logic that chooses the style to use as the ":"包含选择样式的逻辑的对象","The control's child items that are in the cache before the viewport, in logical units.":"在逻辑单元中，在视口前缓存中的控件的子项目。"," can jump to the next page of content; otherwise, ":"可以跳到内容的下一页； 否则，","The drawing instructions for the cells. This context is provided to the layout system.":"细胞的绘图说明。 此上下文提供给布局系统。","The collection that is used to generate the content of the ":"用于生成内容的集合","The cell to prepare.":"准备的细胞。"," can jump to the previous page of content; otherwise, ":"可以跳到内容的上一页； 否则，","The control's child items that are in the viewport, in logical units.":"控件在视口上以逻辑单位为单位的子项目。"," that defines the panel to use for the layout of the items. The default value for the ":"这定义了用于布局的面板。 默认值","The data item that the row represents.":"行代表的数据项。",", to use the ":"，使用 ","The size of the control's child items that are in the viewport, in device-independent units (1/96th inch per unit).":"在视口上，控制室中的子项目的大小，独立于设备的单位（每单位1/96英寸）。"," that hosts the content to be displayed by the ":"托管要显示的内容","A new automation peer for this column header.":"此列标题的新自动化对等。"," that specifies a ":"指定a"," setting. The registered default is ":"环境。 注册默认值为","The size used to arrange the control.":"用于安排控件的大小。"," to enable the ":"启用","A collection that is used to generate the content of the ":"用于生成内容的集合"," if the user can click this column header to sort the ":"如果用户可以单击此列标题以对"," routed command; otherwise, ":"路由命令； 否则，","The size that the image should not exceed.":"图像不应超过的大小。","The object that defines the visual representation of the column header. The registered default is ":"定义列标题的视觉表示的对象。 注册默认值为"," by the associated column; otherwise, ":"通过关联的列； 否则，","A composite string that specifies how to format the items in the ":"一个复合字符串，指定如何格式化项目中的项目","The object that selects the template. The registered default is ":"选择模板的对象。 注册默认值为"," to indicate that single-page viewing mode is available; otherwise, ":"指出单页查看模式可用； 否则，"," if they are displayed as strings.":"如果将它们显示为字符串。","The column associated with this column header.":"与此列标头关联的列。"," if the column is auto-generated; otherwise, ":"如果列是自动生成的； 否则，"," to indicate that ":"表明这一点"," that specifies the visualization of the data objects. The default is ":"这指定了数据对象的可视化。 默认值为","The image's desired size.":"图像所需的大小。","The style key for floating column headers.":"浮动柱标题的样式键。"," if the column cannot be scrolled horizontally; otherwise, ":"如果无法水平滚动列； 否则，","A custom ":"一个习俗"," is available as a viewing mode; otherwise, ":"可作为查看模式使用； 否则，","The style key for the drop location indicator.":"Drop位置指示器的样式密钥。"," if cells in the column cannot be edited; otherwise, ":"如果无法编辑列中的单元格； 否则，","The previous DPI scale setting":"以前的DPI量表设置","An enumerator for the logical children.":"逻辑儿童的枚举者。"," object that provides logic and returns a ":"提供逻辑并返回的对象","The maximum column width, in device-independent units (1/96th inch per unit). The registered default is ":"最大柱宽度，独立于设备的单元（单位1/96英寸）。 注册默认值为","The display position of associated column relative to the other columns in the ":"相关列相对于其他列的显示位置","The new DPI scale setting":"新的DPI量表设置","An enumerator for the logical child objects of the ":"用于逻辑子对象的枚举者","The maximum allowable ":"最大允许"," object that represents the template.":"代表模板的对象。"," used to render the control.":"用于渲染控件。"," if the associated column is prevented from scrolling horizontally; otherwise, ":"如果相关的列是防止水平滚动的； 否则，","The minimum column width, in device-independent units (1/96th inch per unit). The registered default is 20. For information about what can influence the value, see ":"最小列宽，以设备无关单位为单位（每单位1/96英寸）。 注册的默认值为20。 有关影响值的内容的信息，请参阅 "," level for the ":"级别的水平","A value that represents the direction for sorting. The registered default is ":"代表排序方向的值。 注册默认值为","The element this template is applied to. This must be an ":"该模板应用于该元素。 这一定是","A base URI for the ":"一个基础URI","The brush used to paint column header separator lines.":"用来绘制柱标题分离器线的刷子。",", interpreted as a percentage. The default is 200.0 (maximum zoom of 200%).":"，被解释为一个百分比。 默认值为200.0（最大变焦为200％）。","The path of the data-item member to sort by. The registered default is an empty string (\"\"). For information about what can influence the value, see ":"数据项目成员要排序的路径。 注册默认值为一个空字符串（“”）。 有关可能影响价值的信息，请参阅","The UI visibility of the column header separator lines. The default is ":"列标题分离器线的UI可见性。 默认值为","The source of the drawn image. The default value is ":"绘制图像的来源。 默认值是","Computed size used to arrange the content.":"用于安排内容的计算大小。","The minimum allowable ":"最小允许","An enumeration value that specifies the column visibility. The registered default is ":"指定列可见性的枚举值。 注册默认值为","Size of content.":"内容的大小。","The new item added to the ":"新项目添加到","The sort direction of the column or ":"列的排序方向或",", interpreted as a percentage. The default is 80.0 (minimum zoom of 80%).":"，被解释为一个百分比。 默认值为80.0（最小缩放为80％）。","The new item added to the grid.":"新项目添加到网格中。","A structure that represents the column width or automatic sizing mode. The registered default is ":"表示列宽度或自动尺寸模式的结构。 注册默认值为"," if unsorted.":"如果未分类。","Constraint size is an \"upper limit.\" The return value should not exceed this size.":"约束大小是“上限”。 返回值不应超过此尺寸。","The source for the event.":"事件的来源。","The column related to the event.":"该列与事件有关。","The current number of display pages for the content hosted by the ":"当前的显示页面的显示页面，用于托管的内容","The desired size.":"所需的尺寸。","The rendered size of the column header.":"列标题的渲染尺寸。","The final area within the parent that this element should use to arrange itself and its children.":"该元素应该用来安排自己及其子女的父母内部的最后一个区域。","An object that represents the column related to the event.":"代表与事件相关的列的对象。","The page number for the currently displayed page.":"当前显示的页面的页码。","Value of the old template.":"旧模板的值。","The clipping geometry.":"剪辑几何形状。"," values that specifies the viewing mode. The default is ":"指定查看模式的值。 默认值为","The column that is being moved.":"正在移动的列。","The actual size used.":"使用的实际尺寸。","Value of the new template.":"新模板的值。"," child to return.":"孩子返回。"," if the reordering operation is stopped before completion; otherwise, ":"如果在完成之前停止了重新排序操作； 否则，","The current zoom level, interpreted as a percentage. The default value 100.0 (zoom level of 100%).":"当前的缩放水平，被解释为一个百分比。 默认值100.0（缩放水平为100％）。"," if the contents of the Clipboard can be pasted in; otherwise, ":"如果剪贴板的内容可以粘贴到； 否则，"," that receives focus when the user presses the access key. The default is ":"当用户按访问键时，这将获得焦点。 默认值为","The child.":"孩子。","The control that is used to display a dragged column header.":"用于显示拖动列标题的控件。","The current zoom increment, interpreted as a percentage. The default is 10.0 (zoom increment of 10%).":"当前缩放增量，解释为百分比。 默认值为10.0（缩放增量为10%）。","The element used to display a specified item.":"用于显示指定项目的元素。","A new automation peer for this presenter.":"这个主持人的新自动化对等。","The element of which to get the bottom property.":"获取底部属性的元素。"," to indicate that selection is enabled; otherwise, ":"指示启用了选择； 否则，","The control that is used to display the drop location indicator during a column drag operation.":"用于在列拖动操作过程中显示滴度位置指示器的控件。","Provides data for the ":"提供数据","The number of visual children.":"视觉孩子的数量。","The bottom coordinate of the dependency object.":"依赖项对象的底部坐标。"," to indicate that the toolbar is visible; otherwise, ":"表明该工具栏是可见的； 否则，","Object to scroll.":"对象滚动。","The previous, unedited value in the cell being edited.":"先前的未经编辑的值编辑的未经编辑值。","The drawing instructions for the row details. This context is provided to the layout system.":"行详细信息的绘图说明。 此上下文提供给布局系统。","A collection of gestures that the ":"一系列手势"," object that represents application-defined state that is associated with a specific piece of content.":"代表与特定内容相关的应用程序定义状态的对象。"," that contains the content to navigate to.":"其中包含要导航的内容。"," recognizes.":"认识。"," if validation fails; otherwise, ":"如果验证失败； 否则，","The old parent element. May be ":"旧的父元素。 可能是 ","Collection of items to be selected.":"要选择的项目收集。"," if navigation is not canceled; otherwise, ":"如果未取消导航； 否则，","The element of which to get the left property.":"获取左财产的要素。","A new combo box control that is bound to the column's ":"一个绑定到该列的新组合框控件"," to indicate that the element did not have a visual parent previously.":"表明该元素以前没有视觉母体。"," if all items have been selected; otherwise, ":"如果选择了所有项目； 否则，"," that contains data to be used for processing during navigation.":"其中包含在导航期间用于处理的数据。","The left coordinate of the dependency object.":"依赖项对象的左坐标。","A new, read-only combo box control that is bound to the column's ":"一个新的，仅读取的组合框控件，该控件绑定到该列的","The available size that this element can give to child elements. Indicates an upper limit that child elements should not exceed.":"此元素可以给儿童元素提供的可用大小。 指示儿童元素不应超过的上限。","The item that is initially selected when ":"最初选择的项目"," object initialized with the URI for the desired content.":"用URI初始化所需内容的对象。","The element of which to get the right property.":"获得正确属性的要素。"," if the combo boxes in the column cannot be edited; otherwise, ":"如果无法编辑列中的组合框； 否则，","The size that the ":"大小","The most recent ":"最近的","Returns a collection of the currently selected items.":"返回当前选择的项目的集合。","The right coordinate of the dependency object.":"依赖项对象的正确坐标。","The default value of the ":"默认值"," determines it needs during layout, based on its calculations of child object allocated sizes.":"根据其对子对象分配的大小的计算，确定布局中的需求。"," selection.":"选择。"," in back navigation history, if there is one.":"在后退导航历史记录中，如果有。","The path to a value on the source object. The registered default is an empty string (\"\"). For information about what can influence the value, see ":"源对象上值的路径。 注册默认值为一个空字符串（“”）。 有关可能影响价值的信息，请参阅"," if the item is selected; otherwise, ":"如果选择该项目； 否则，","A new automation peer for this row header.":"该行标头的新自动化对等。","The collection of selected strokes.":"选定中风的集合。"," if the content should be serialized; otherwise, ":"如果内容应序列化； 否则，","A collection that is used to generate the content of the combo box control. The registered default is ":"用于生成组合框控件内容的集合。 注册默认值为","The smallest rectangle that encompasses all selected strokes and elements.":"最小的矩形包含所有选定的笔触和元素。"," container to clear.":"清除容器。","The brush used to paint row header separator lines.":"用来绘制行排式分离器线的刷子。"," if at least one entry has been added to back navigation history. If there are not entries, or the ":"如果至少添加了一个条目以返回导航历史记录。 如果没有条目或","The binding for the selected item.":"所选项目的绑定。","The element of which to get the top property.":"获得顶级属性的要素。","The UI visibility of the row header separator lines. The default is ":"行标头分离器线的UI可见性。 默认值为","The object that the ":"对象"," does not own its own navigation history, ":"没有自己的导航历史记录","The top coordinate of the dependency object.":"依赖关系对象的顶部坐标。","The binding for the selected value.":"所选值的绑定。","The object to evaluate.":"评估的对象。"," that represents the desired size of the element.":"这表示元素的所需大小。","The base uniform resource identifier (URI) of the ":"基础统一资源标识符（URI）","The path to get the selected value. The registered default is an empty string (\"\"). For information about what can influence the value, see ":"获取选定值的路径。 注册默认值为一个空字符串（“”）。 有关可能影响价值的信息，请参阅","The zero-based index of the requested child element in the collection.":"集合中请求的子元素的基于零的索引。","An object that is a ":"一个对象","The old size of the viewport.":"视口的旧尺寸。","The binding for the text of the currently selected item.":"当前选择项目的文本的绑定。"," if there is at least one entry in back navigation history; ":"如果背部导航历史记录至少有一个条目；"," or that can be converted into one.":"或者可以转换为一个。","The requested child element. This should not return ":"请求的子元素。 这不应该返回","The new size of the viewport.":"视口的新尺寸。","The key for the style.":"风格的关键。"," if there are no entries in back navigation history or the ":"如果背面导航历史记录或","The maximum size that the page view should use to arrange itself and its children.":"页面视图应使用的最大尺寸来安排自己及其子女。","The object to use to create the ":"用于创建的对象","A new text box control that is bound to the column's ":"一个绑定到列的新文本框控件","; if the provided index is out of range, an exception is thrown.":"; 如果提供的索引不超出范围，则会抛出一个例外。","The actual size that the page view used to arrange itself and its children.":"页面视图用来安排自己及其子女的实际尺寸。"," does not own its own navigation history.":"没有自己的导航历史记录。","An object that specifies the ":"指定的对象"," object that specifies how to display information in the ":"指定如何在","A new, read-only hyperlink element that is bound to the column's ":"一个绑定到列的新的，仅读取的超链接元素"," if there is at least one entry in forward navigation history; ":"如果向前导航历史记录至少有一个条目；","The index of the visual child to return.":"视觉孩子返回的索引。","A value that indicates which part of the selection adorner intersects or surrounds a specified point.":"指示选择装饰物的哪一部分相交或包围指定点的值。","Size used to arrange the control.":"用于安排控件的尺寸。","The unedited value of the cell.":"细胞的未编辑值。"," if there are no entries in forward navigation history or the ":"如果前进导航历史记录或没有条目","The visual child at the specified index.":"视觉儿童在指定的索引处。","The available size that this element can give to child elements. Infinity can be specified as a value to indicate that the element will size to whatever content is available.":"此元素可以给儿童元素提供的可用大小。 无穷大可以指定为指示该元素大小的值的值。","Size of the control.":"控件的大小。","The binding to the text of the hyperlink.":"与超链接的文本结合。"," for the content that was last navigated to, if navigated to by using a URI; otherwise, ":"对于最后导航到的内容，如果使用URI导航； 否则，","The maximum available size.":"最大可用尺寸。","The size that this element determines it needs during layout, based on its calculations of child element sizes.":"该元素在布局期间确定其所需的大小，该元素根据其对子元素大小的计算。","The upper limit the element should not exceed.":"元素不应超过的上限。","The name of the target window or frame. The registered default is ":"目标窗口或框架的名称。 注册默认值为","Not used.":"不曾用过。"," object if at least one entry has been added to forward navigation history, or ":"对象，如果至少添加了一个条目到远期导航历史记录或","The actual desired size.":"实际期望的大小。","The ratio of volume across speakers in the range between -1 and 1. The default is 0.":"1和1之间的扬声器之间的音量比。默认值为0。","The absolute pixel value (96 pixels-per-inch) to initialize the length to.":"绝对像素值（每英寸96个像素）初始化长度。","The point at which to paste the strokes.":"粘贴笔触的点。"," if there are no entries or the ":"如果没有条目或","The available size that the parent can give to the child. This is soft constraint.":"父母可以给孩子的可用大小。 这是软约束。","The percentage of buffering completed for streaming content. The value ranges from 0 to 1.":"流媒体内容完成的缓冲百分比。 值范围从0到1。"," objects to select.":"要选择的对象。","The requested size of the element.":"元素的要求大小。","The DocumentPageView's desired size.":"DocumentPageView的所需尺寸。"," value that specifies whether ":"指定是否的价值"," if the media can be paused; otherwise, ":"如果媒体可以暂停； 否则，","The document page associated with this view.":"与此视图关联的文档页面。"," manages its own journal. The default value is ":"管理自己的日记。 默认值是","The type that is used to determine how the size of the element is calculated.":"用于确定如何计算元件大小的类型。","The element on which to set the bottom property.":"设置底部属性的元素。","A clock associated with the ":"与","The paginator that retrieves content pages for this view.":"为此视图检索内容页面的Paginator。",", if one is available. Otherwise, ":"，如果有可用的话。 否则，","The bottom coordinate of ":"底部坐标","The calculated size needed for the element.":"元素所需的计算大小。"," that controls media playback. The default value is ":"控制媒体播放。 默认值是","The allocated size for the element.":"该元素的分配尺寸。"," has been called for this ":"被要求"," value that specifies when the ":"指定何时","A collection of application gestures that the ":"一系列应用程序手势","The zero-based page number of the current page displayed.  The default is 0.":"显示当前页面的基于零的页码。 默认值为0。"," with the same value or sizing mode as the current ":"具有与当前相同的值或尺寸模式"," can show its navigation UI. The default value is ":"可以显示其导航UI。 默认值是","A percentage value indicating the amount of download completed for content located on a remote server. The value ranges from 0 to 1. The default value is 0.":"一个百分比值，指示位于远程服务器上的内容完成的下载量。 值范围为0到1。默认值为0。","The element on which to set the left property.":"设置左属性的元素。"," if content is isolated within a partial trust security sandbox; otherwise, ":"如果在部分信托安全沙箱中隔离内容； 否则，"," instances have the same value or sizing mode; otherwise, ":"实例具有相同的值或大小模式； 否则，","The enumeration value that specifies how content should be stretched to fill the display page.  The default is ":"枚举值指定应如何伸展内容以填充显示页面。 默认值为"," if the media has audio; otherwise, ":"如果媒体有音频； 否则，"," that contains the URI for the current content, or the content that is currently being navigated to.":"其中包含当前内容或当前正在导航的内容的URI。","The left coordinate of ":"左坐标","The enumeration value that specifies in what scaling directions ":"指定在哪个缩放方向上指定的枚举价值","An object that represents the specified length.":"表示指定长度的对象。"," if the media has video; otherwise, ":"如果媒体有视频； 否则，","The base URI of the current context.":"当前上下文的基本URI。"," should be applied.  The default is ":"应该应用。 默认值为"," if the media is buffering; otherwise, ":"如果媒体正在缓冲； 否则，","The element on which to set the right property.":"设置正确属性的元素。"," instances do not have the same value or sizing mode; otherwise, ":"实例没有相同的值或大小模式； 否则，","The number of visual children contained in this view.":"这种观点中包含的视觉儿童数量。","The right coordinate of ":"正确的坐标","Specifies the size this ":"指定这个大小"," if audio is muted; otherwise, ":"如果音频被静音； 否则，","A Boolean value that indicates whether or the viewer is able to jump to the specified page number.":"一个布尔值，指示查看器是否可以跳到指定的页码。","A string that represent the current object.":"表示当前对象的字符串。","The element on which to set the top property.":"设置顶部属性的元素。"," that represents the arranged size of this Grid element and its children.":"这代表了该网格元素及其子女的排列规模。","A dependency object from which to retrieve the value of ":"从中检索值的依赖项对象","The load behavior ":"负载行为"," structure that represents the standard automatic sizing mode.":"代表标准自动尺寸模式的结构。","The top coordinate of ":"的顶部坐标 ","The element from which to read the property value.":"读取属性值的元素。","The number of pixels calculated for the size of the element.":"针对元素大小计算的像素数。"," attached property, read from the dependency object specified by element.":"附加属性，从元素指定的依赖项对象中读取。"," set for the media. The default value is ":"为媒体设置。 默认值是","The current editing mode of the ":"当前的编辑模式","The zero-based index position of the desired ":"所需的基于零的索引位置","The number of pixels allocated for the element.":"为元素分配的像素数。","The natural duration of the media.":"媒体的自然持续时间。","The current master ":"当前的主人"," used to fill the border area surrounding a ":"用于填充周围边界区域"," structure that represents the cell-based automatic sizing mode.":"代表基于单元格的自动尺寸模式的结构。","Indicates an upper limit size that should not be exceeded.":"表示不应超过的上限大小。","The height of the video associated with the media. Audio files will return zero.":"与媒体相关的视频高度。 音频文件将返回零。"," for this viewer, or null if no master ":"对于此观看者，如果没有主人，则无效","A collection of child elements located on the ":"位于"," that represents the required size to arrange child content.":"这代表了安排儿童内容的所需尺寸。"," structure that represents the header-based automatic sizing mode.":"代表基于标题的自动尺寸模式的结构。","The width of the video associated with the media.":"与媒体相关的视频宽度。"," on the first call to ":"在第一次打电话给","The default drawing attributes for the ":"默认图形属性","A type that represents how size is determined.":"代表大小如何确定的类型。","The amount of time since the beginning of the media. The default is 00:00:00.":"媒体开始以来的时间。 默认值为00:00:00。","Identifies the visual child that's added.":"标识添加的视觉孩子。","The stylus point description for an ":"手写笔点描述"," or if the collection has not changed since the previous ":"或如果收藏以来没有更改","Identifies the visual child that's removed.":"识别被删除的视觉孩子。"," if frames are updated while paused; otherwise, ":"如果暂停时更新帧； 否则，","The absolute value of the ":"绝对价值"," call; otherwise, ":"称呼; 否则，","The renderer that dynamically draws ink on the ":"动态绘制墨水的渲染器","The element on which to set the ":"设置的元素","The URI that specifies the source of the element. The default is ":"指定元素源的URI。 默认值为"," in pixels, or 1.0 if the ":"在像素中，或1.0","The editing mode used when a pointing device (such as a tablet pen or mouse) is active.":"当指向设备（例如平板笔或鼠标）处于活动状态时，使用的编辑模式使用。"," if the collection has changed since the last ":"如果该系列自上次发生了变化","The speed ratio of the media. The valid range is between 0 (zero) and infinity. Values less than 1 yield slower than normal playback, and values greater than 1 yield faster than normal playback. Negative values are treated as 0. The default value is 1.":"媒体的速度比。 有效范围为0（零）和无穷大。 值小于1的收益率比正常播放慢，并且值比正常播放的速度大于1的收率。 负值被视为0。默认值为1。","The property value to set.":"要设置的属性值。","An object that provides a format context.":"提供格式上下文的对象。"," objects that are associated with the current display document.":"与当前显示文档关联的对象。","The inverted editing mode of the ":"倒编辑模式","The stretch value for the rendered media. The default is ":"渲染媒体的延长价值。 默认值为","The element on which to set the attached property.":"设置附件属性的元素。","The number of the page to jump to.":"该页面的数量跳到。","The object to use as the current culture.":"用作当前文化的对象。","The eraser shape associated with the ":"与","The value that specifies the direction the element is stretched. The default is ":"指定元件拉伸方向的值。 默认值为"," associated with this instance of ":"与此实例相关联","The area that is available for the row.":"该行可用的区域。","The element from which the ":"从中","The unload behavior ":"卸载行为","The ink presenter that displays ink on the ":"墨水主持人在"," is not empty; otherwise, ":"不是空的； 否则，"," for the media.":"对于媒体。","The actual area used by the row.":"该行使用的实际区域。"," event originated.":"事件发起。"," defined on this instance of ":"在此实例上定义"," if a user can move strokes and/or elements on the ":"如果用户可以移动笔触和/或元素","The index of the row's data item, or -1 if the item was not found.":"该行数据项的索引，如果找不到该项，则为-1。","The item to display.":"要显示的项目。","A rectangular region, in the coordinate space of ":"一个矩形区域，在 "," if grid lines are visible; otherwise, ":"如果网格线可见； 否则，","A collection of enumeration values. The default is ":"枚举价值的集合。 默认值为",", which should be made visible.":"，应该可以看到。"," if the menu receives a main menu activation notification; otherwise, ":"如果菜单收到主菜单激活通知； 否则，","An element contained in a row to be found.":"要查找的行中包含的元素。"," that represents the total number of child ":"代表孩子的总数"," if a user can resize strokes and/or elements on the ":"如果用户可以调整中风和/或元素的大小","Old value of the parent of the visual, or null if the visual did not have a parent.":"如果视觉没有父母，则视觉效果的旧价值或null的旧价值。"," objects. The default value is zero.":"对象。 默认值为零。","The page number for the page that contains ":"包含的页面的页码 "," that contains the specified element.":"其中包含指定元素。"," objects contained within the ":"包含在","Container to which the style will be applied.":"将应用样式的容器。"," object for this viewer.":"此观看器的对象。","The event data from the ":"来自","Information about the change in size of the ":"有关大小变化的信息","Item to which the container belongs.":"容器所属的项目。"," is using a custom cursor; otherwise, ":"使用自定义光标； 否则，"," event of the ":"事件","A dependency object on which to set the value of ":"一个依赖关系对象，以设置该值的值","The command associated with the ":"与","A value that represents the minimum distance that a user must use the mouse to drag a ":"表示用户必须使用鼠标拖动的最小距离的值 ","The number of visual child elements for this element.":"此元素的视觉子元素数量。","A new automation peer for this row.":"该行的新自动化对等。"," if the viewer can jump to the next page; otherwise, ":"如果观众可以跳到下一页； 否则，"," to resize rows or columns. The default is 1.":"调整行或列的大小。 默认值为1。"," property of a ":" a的财产 ","The strokes that represent the possible gesture.":"代表可能的手势的笔触。","The previous value of the ":"先前的值"," if the viewer can jump to the previous page; otherwise, ":"如果观众可以跳到上一页； 否则，","The results from the gesture recognizer.":"手势识别器的结果。","The distance that the ":"的距离 ","The element on which to raise the specified command. The default is ":"引发指定命令的元素。 默认值为 ","The event data, which is empty when this method is called by the ":"事件数据，当此方法调用该方法时为空"," moves for each press of an arrow key. The default is 10.":"为箭头键的每条按压移动。 默认值为10。","A collection of possible application gestures that the ":"一系列可能的应用程序手势","The index of the row within a set of alternating rows. The registered default is 0. For information about what can influence the value, see ":"一组交替行中的行索引。 注册默认值为0。有关可能影响该值的信息，请参见","The icon that appears in a ":"出现在"," for the preview indicator that shows the potential change in ":"对于预览指标，该指标显示了潜在的变化","The template that is used to display the row details section or ":"用于显示行详细信息部分或"," might be.":" 也许是。","The text that describes the input gesture, such as Ctrl+C for the Copy command. The default is an empty string (\"\").":"描述输入手势的文本，例如复制命令的ctrl+c。 默认值是一个空字符串（“”）。","A template selector for choosing the row details template. The registered default is ":"用于选择行详细信息模板的模板选择器。 注册默认值为"," dimensions as you move the ":"当您移动时的尺寸"," if the menu item can be checked; otherwise, ":"如果可以检查菜单项； 否则，"," if the strokes are ink; ":"如果笔触是墨水；"," control. The default is the style that the current theme supplies.":"控制。 默认值是当前主题提供的样式。","A value that specifies the visibility of the row details. The registered default is ":"指定行详细信息的可见性的值。 注册默认值为"," if the strokes are a gesture.":"如果笔画是一个手势。"," is checked; otherwise, ":" 被检查；否则, ","The row header contents. The registered default is ":"行标头内容。 注册默认值为","One of the enumeration values that indicates which columns or rows are resized by this ":"枚举值之一，指示了哪个列或行的重大大小"," control. The default is ":"控制。 默认值为"," can be selected; otherwise, ":"可以选择； 否则，","The selected elements.":"选定的元素。","One of the enumeration values that specifies whether to resize rows or columns. The default is ":"指定要调整行还是列的枚举值之一。 默认值为","The selected strokes.":"选定的笔触。"," preview is displayed; otherwise, ":" 显示预览；否则, ","The column to add":"要添加的列"}