{"The prefix of the variable as it appears in the XPath expression.":"该变量的前缀出现在XPATH表达式中。"," to check white space nodes in the source document for inclusion in the output; ":"检查源文档中的白空间节点以包含在输出中；"," representing the function.":"表示功能。"," representing the variable at runtime.":"在运行时表示变量。","An array of argument types for the function being resolved. This allows you to select between methods with the same name (for example, overloaded methods).":"解决该函数的参数类型数组。 这使您可以在具有相同名称的方法之间选择（例如，超载方法）。"," to not evaluate white space nodes. The default is ":"不评估白空间节点。 默认值为"," which threw the ":"扔了","The formatted error message describing the current exception.":"描述当前异常的格式化错误消息。"," elements.  \n  \n If this is ":"元素。 \n  \n  如果是","The URL that specifies the XSLT style sheet to load.":"指定要加载的XSLT样式表的URL。"," to use to load the style sheet and any style sheet(s) referenced in ":"用于加载样式表和任何引用的样式表"," with no user credentials is used to open the style sheet. The default ":"没有用户凭据来打开样式表。 默认值"," is not used to resolve any external resources in the style sheet, so ":"不用于解决样式表中的任何外部资源，因此"," is not cached after the ":"没有缓存之后",", a default ":"，默认"," elements are not resolved.  \n  \n The ":"元素无法解决。 \n  \n  这"," method completes.":"方法完成。"," object that contains the XSLT style sheet.":"包含XSLT样式表的对象。"," containing the XSLT style sheet.":"包含XSLT样式表。",", external resources are not resolved.  \n  \n The ":"，外部资源无法解决。 \n  \n  这","The URL of the output file.":"输出文件的URL。"," used to load any style sheets referenced in ":"用于加载引用的任何样式表"," containing the namespace-qualified arguments used as input to the transformation.":"包含用作转换输入的名称空间合格参数。"," interface. In the .NET Framework, this can be either an ":"界面。 在.NET框架中，这可以是"," function is not resolved.  \n  \n The ":"功能无法解决。 \n  \n  这","The URL of the source document to be transformed.":"源文档的URL要转换。"," to use during transformation. If set to ":"在转换过程中使用。 如果设置为"," containing the results of the transformation.":"包含转换的结果。"," properties set to ":"设置为"," to enable support for the XSLT ":"为了支持XSLT",", the XSLT ":"，XSLT"," to enable support for embedded scripts blocks; otherwise, ":"为了支持嵌入式脚本块； 否则，"," function; otherwise, ":"功能; 否则，"," to support script blocks in XSLT style sheets; otherwise, ":"支持XSLT样式表中的脚本块； 否则，"," to support the XSLT ":"支持XSLT"," that contains the ancestors of every node in the source collection.":"其中包含源集合中每个节点的祖先。"," object with the ":"对象与"," that contains the ancestors of every node in the source collection. Only elements that have a matching ":"其中包含源集合中每个节点的祖先。 只有匹配的元素"," are included in the collection.":"包含在集合中。"," that contains every element in the source collection, and the ancestors of every element in the source collection. Only elements that have a matching ":"其中包含源集合中的每个元素，以及源集合中每个元素的祖先。 只有匹配的元素"," that contains the source collection.":"其中包含源集合。"," that contains a filtered collection of the attributes of every element in the source collection. Only elements that have a matching ":"其中包含源集合中每个元素的属性的过滤集合。 只有匹配的元素"," that contains every element in the source collection, and the ancestors of every element in the source collection.":"其中包含源集合中的每个元素，以及源集合中每个元素的祖先。"," that contains the attributes of every element in the source collection.":"其中包含源集合中每个元素的属性。"," that contains the descendant elements of every element and document in the source collection. Only elements that have a matching ":"其中包含源集合中每个元素和文档的后代元素。 只有匹配的元素"," of the child elements of every element and document in the source collection. Only elements that have a matching ":"源集合中每个元素和文档的子元素。 只有匹配的元素"," of the child nodes of every document and element in the source collection.":"源集合中每个文档和元素的子节点的节点。"," of the descendant nodes of every document and element in the source collection.":"源集合中每个文档和元素的后代节点。"," that contains the content of this ":"其中包含其中的内容"," that contains every element in the source collection, and the descendent elements of every element in the source collection.":"其中包含源集合中的每个元素，以及源集合中每个元素的后代元素。"," that contains all nodes in the source collection, sorted in document order.":"其中包含源集合中的所有节点，按文档顺序排序。"," object to copy from.":"对象要复制。"," to cast to a ":"铸造"," that contains every element in the source collection, and the descendant nodes of every element in the source collection.":"其中包含源集合中的每个元素，以及源集合中每个元素的后代节点。"," containing the value of the attribute.":"包含属性的值。"," that contains every element in the source collection, and the descendents of every element in the source collection. Only elements that have a matching ":"其中包含源集合中的每个元素，以及源集合中每个元素的后代。 只有匹配的元素"," that contains the descendant elements of every element and document in the source collection.":"其中包含源集合中每个元素和文档的后代元素。"," containing an empty collection.":"包含一个空的集合。","The value to assign to this attribute.":"分配给此属性的值。"," to cast to ":"铸造"," of the child elements of every element or document in the source collection.":"源集合中每个元素或文档的子元素。"," objects, this value is ":"对象，此值是"," if this attribute is a namespace declaration; otherwise ":"如果此属性是名称空间声明； 否则"," containing the XML text representation of an attribute and its value.":"包含属性及其值的XML文本表示。"," into which this method will write.":"此方法将在其中写入其中。","A string that contains the contents of the new ":"包含新内容的字符串"," containing the previous attribute of the parent element.":"包含父元素的先前属性。"," containing the name of this attribute.":"包含此属性的名称。"," that contains the string value of this comment.":"其中包含此评论的字符串值。","The writer to write this ":"作家写这个"," that is ready to have content written to it.":"准备好将内容写入其中。"," containing the descendant nodes of the ":"包含的后代节点"," containing the value of this attribute.":"包含此属性的值。"," containing the next attribute of the parent element.":"包含父元素的下一个属性。","A token that can be used to request cancellation of the asynchronous operation.":"一个可用于要求取消异步操作的令牌。","A content object containing simple content or a collection of content objects to be added.":"包含简单内容或要添加的内容对象集合的内容对象。"," node to copy from.":"节点要复制。",", in document order.":"，按照文件顺序。"," that match the specified ":"与指定的","A parameter list of content objects.":"内容对象的参数列表。","A task representing the asynchronous write operation.":"代表异步写操作的任务。"," that have a matching ":"有匹配的"," containing the descendant elements of the ":"包含的后代元素"," that matches the specified ":"与指定的"," used to initialize this ":"用于初始化这个"," containing the last child node of the ":"包含最后一个子节点"," containing the child elements of this ":"包含这个子元素"," containing the version property for this document.":"包含此文档的版本属性。"," containing the contents of this ":"包含其中的内容"," that contains the formatted XML string.":"其中包含格式的XML字符串。","The version of the XML, usually \"1.0\".":"XML的版本，通常是“ 1.0”。"," containing the children of the ":"包含儿童","A parameter list of content objects to add to this document.":"要添加到本文档的内容对象的参数列表。","A content object containing simple content or a collection of content objects that replace the children nodes.":"包含简单内容或替换儿童节点的内容对象的内容对象。"," containing the code page name for this document.":"包含此文档的代码页名。","The encoding for the XML document.":"XML文档的编码。"," object that will be copied.":"将被复制的对象。"," containing the first child node of the ":"包含第一个子节点"," containing the standalone property for this document.":"包含本文档的独立属性。"," for the document.":"对于文档。","A string containing \"yes\" or \"no\" that specifies whether the XML is standalone or requires external entities to be resolved.":"包含“是”或“否”的字符串指定XML是独立的还是需要解决的外部实体。","The stream that contains the XML data.":"包含XML数据的流。"," that specifies whether to load base URI and line information.":"这指定是否加载基础URI和行信息。"," that specifies formatting behavior.":"这指定格式行为。","The content of the document.":"文档的内容。","A stream containing the raw XML to read into the newly created ":"一个包含RAW XML的流以读取新创建的流"," object that reads the data that is contained in the stream.":"读取流中包含的数据的对象。"," that contains the content for the ":"其中包含了"," will be written to.":"将写给。","A set of load options.":"一组负载选项。","The stream containing the XML data.":"包含XML数据的流。","The writer to output the content of this ":"输出内容的作者"," that contains the contents of the specified ":"其中包含指定的内容"," that contains the internal subset for an internal DTD.":"其中包含内部DTD的内部子集。","A new XDocument containing the contents of the specified ":"一个包含指定内容的新Xdocument"," to output the XML to.":"输出XML。"," that contains the XML declaration for this document.":"其中包含此文档的XML声明。"," that contains the DTD for this document.":"其中包含此文档的DTD。"," that contains the internal subset for this Document Type Definition (DTD).":"其中包含此文档类型定义（DTD）的内部子集。"," that specifies white space behavior, and whether to load base URI and line information.":"这指定了空间行为，以及是否加载基础URI和线路信息。","A string that contains the name of the file.":"包含文件名称的字符串。","A reader that contains the raw XML to read into the newly created ":"一个包含原始XML的读者要读取新创建的读者"," that contains the name for this Document Type Definition (DTD).":"其中包含此文档类型定义（DTD）的名称。","The root ":"根"," that contains the XML that was read from the specified ":"其中包含从指定的XML","A reader containing the XML to be read into the new ":"一个包含XML的读者","The stream to write the XML to.":"将XML写入的流。"," of the XML tree.":"XML树。"," that contains the public identifier for this Document Type Definition (DTD).":"其中包含此文档类型定义（DTD）的公共标识符。","A URI string that references the file to load into a new ":"将文件加载到新的","A task representing the asynchronous save operation.":"代表异步保存操作的任务。","A string that contains XML.":"包含XML的字符串。"," that contains the contents of the specified file.":"其中包含指定文件的内容。"," that contains the qualified name of the DTD, which is the same as the qualified name of the root element of the XML document.":"其中包含DTD的合格名称，该名称与XML文档的根元素的合格名称相同。"," populated from the string that contains XML.":"从包含XML的字符串中填充。"," that contains the system identifier for this Document Type Definition (DTD).":"其中包含此文档类型定义（DTD）的系统标识符。"," that will be read for the content of the ":"将阅读有关内容的内容","The text writer to output the XML to.":"文本作者输出XML。"," that contains the public identifier of an external public DTD.":"其中包含外部公共DTD的公共标识符。"," that contains the name of the element.":"其中包含元素的名称。","The stream to output this ":"输出此的流"," that contains the system identifier of an external private DTD.":"其中包含外部私人DTD的系统标识符。","The writer to output the XML to.":"作者输出XML。","The initial content of the element.":"元素的初始内容。"," that contains the element name.":"其中包含元素名称。"," that contain this element, and all descendant nodes of this element, in document order.":"该元素包含该元素，以及该元素的所有后代节点，按文档顺序排列。"," containing the contents of the specified stream.":"包含指定流的内容。"," object that specifies whether to load base URI and line information.":"指定是否加载基础URI和行信息的对象。","The contents of the element.":"元素的内容。"," that contains unevaluated queries that will be iterated for the contents of this ":"其中包含未评估的查询，这些查询将迭代为此内容"," of elements that contain this element, and all descendant elements of this element, in document order.":"包含此元素的元素以及该元素的所有后代元素按文档顺序。"," object used to read the data that the stream contains.":"用于读取流包含的数据的对象。","A reader containing the raw XML to read.":"一个包含原始XML的读者。"," object that specifies formatting behavior.":"指定格式行为的对象。"," that will be read for the ":"这将被阅读"," of elements that contain this element, and the ancestors of this element.":"包含此元素的元素以及该元素的祖先。"," that contains the name of the file.":"其中包含文件的名称。"," that contain this element, and all descendant elements of this element, in document order. Only elements that have a matching ":"该元素包含该元素，以及该元素的所有后代元素，按文档顺序排列。 只有匹配的元素"," containing the contents of the specified reader.":"包含指定阅读器的内容。"," that contains the default namespace of this ":"其中包含此默认名称空间"," that contain this element, and the ancestors of this element. Only elements that have a matching ":"其中包含此元素，以及该元素的祖先。 只有匹配的元素"," content.":"内容。","The stream to output the XML to.":"流以输出XML到。","A reader containing the XML to be read.":"包含XML的读者。","A string that contains the namespace prefix to look up.":"一个包含要查找的名称空间前缀的字符串。"," that has the specified ":"有指定的","A URI string referencing the file to load into a new ":"引用文件以加载到新的URI字符串","A bitwise combination of the enumeration values that specify the serialization options.":"指定序列化选项的枚举值的位组合。"," to cast to an ":"铸造"," if there is no attribute with the specified name.":"如果没有指定名称的属性。"," for the namespace associated with the prefix for this ":"对于与此相关联的名称空间","A URI string referencing the file to load into an ":"引用文件以加载到一个的URI字符串"," that contains XML.":"其中包含XML。"," that contains the name of the attribute to change.":"其中包含要更改的属性的名称。"," of attributes of this element.":"该元素的属性。"," to look up.":"去查查看。","The stream containing the raw XML to read.":"包含要读取的原始XML的流。","The value to assign to the attribute. The attribute is removed if the value is ":"分配给属性的值。 如果值为","The content that will replace the child nodes and attributes of this element.":"将替代该元素的子节点和属性的内容。"," that contains the attributes of this element. Only attributes that have a matching ":"其中包含此元素的属性。 只有具有匹配的属性"," object used to read the data that is contained in the stream.":"用于读取流中包含的数据的对象。","A bitwise combination of the enumeration values that specify the load options to parse the XML.":"指定负载选项以解析XML的枚举值的位组合。","The content that will replace the attributes of this element.":"将替换此元素属性的内容。",". Otherwise, the value is converted to its string representation and assigned to the ":"。 否则，该值将转换为其字符串表示形式，并分配给"," that contains the name of the child element to change.":"其中包含要更改的子元素的名称。"," that contains the expanded XML name in the format ":"其中包含格式扩展的XML名称"," if this element has at least one attribute; otherwise ":"如果此元素至少具有一个属性； 否则"," object constructed from the expanded name.":"从扩展名称构建的对象。"," property of the attribute.":"属性的属性。","The value to assign to the child element. The child element is removed if the value is ":"分配给子元素的价值。 如果值为"," that contains the local (unqualified) part of the name.":"其中包含名称的本地（不合格）部分。"," if this element has at least one child element; otherwise ":"如果此元素至少有一个子元素； 否则"," and the specified local name.":"和指定的本地名称。","A local (unqualified) name.":"本地（不合格的）名称。"," property of the child element.":"子元素的财产。"," that contains the namespace part of the name.":"其中包含名称的名称空间部分。"," if this element contains no content; otherwise ":"如果此元素不包含内容； 否则"," that contains the namespace.":"其中包含名称空间。"," object created from the specified local name and namespace.":"从指定的本地名称和名称空间创建的对象。"," that indicates whether the specified ":"指示是否指定","The value to assign to this element. The value is converted to its string representation and assigned to the ":"分配给此元素的值。 该值转换为其字符串表示，并分配给"," that contains the last attribute of this element.":"其中包含此元素的最后属性。"," that contains the local name.":"其中包含本地名称。"," that contains the hash code for the ":"其中包含用于"," that contains a namespace URI.":"其中包含一个名称空间URI。"," from which the object is deserialized.":"从中对象被应对。"," constructed from the namespace and local name.":"由名称空间和本地名称构建。"," that contains the name of this element.":"其中包含此元素的名称。"," created from the specified URI.":"由指定的URI创建。","A string that contains an expanded XML name in the format ":"一个包含格式中扩展的XML名称的字符串"," that indicates whether ":"这表明是否"," that contains all of the text content of this element. If there are multiple text nodes, they will be concatenated.":"其中包含此元素的所有文本内容。 如果有多个文本节点，它们将被串联。"," to which this object is serialized.":"该对象序列化。"," to compare to the current ":"与电流进行比较"," that contains a local name.":"其中包含一个本地名称。"," that contains the namespace URI.":"其中包含名称空间URI。"," to compare with this ":"与此相比"," that contains an empty collection.":"其中包含一个空的集合。"," constructed from the URI string.":"由URI字符串构建。"," is equal to the specified ":"等于指定的"," that contains an expanded XML name in the format ":"其中包含格式扩展的XML名称"," created from this ":"由此创建"," that contains the first attribute of this element.":"其中包含此元素的第一个属性。",", otherwise ":"， 否则","The URI of this ":"这个的URI"," are not equal.":"不等。"," that can be used to read this node and its descendants.":"可以用来读取该节点及其后代。","The type of the annotation to retrieve.":"检索注释的类型。","The string data for this ":"此的字符串数据"," that contains the URI of the namespace.":"其中包含名称空间的URI。","An XNode that contains the nodes read from the reader.":"一个包含读者读取的节点的Xnode。"," object that specifies whether to omit duplicate namespaces.":"指定是否省略重复名称空间的对象。"," that contains the first annotation object that matches the specified type, or ":"包含与指定类型匹配的第一个注释对象，或"," that corresponds to no namespace.":"这对应于没有名称空间。","Content that replaces this node.":"替代此节点的内容。"," to write this processing instruction to.":"将此处理指令写入。"," if the nodes are equal; otherwise ":"如果节点相等； 否则"," if no annotation is of the specified type.":"如果没有指定类型的注释。"," of the sibling elements after this node, in document order.":"该节点之后的同级元素按文档顺序。"," that corresponds to the XML URI (":"对应于XML URI（","A parameter list of the new content.":"新内容的参数列表。"," that contains the string value of this processing instruction.":"其中包含此处理指令的字符串值。"," of the sibling elements after this node, in document order. Only elements that have a matching ":"该节点之后的同级元素按文档顺序。 只有匹配的元素"," containing the target application for this processing instruction.":"包含该处理指令的目标应用程序。"," containing the indented XML.":"包含缩进的XML。"," that corresponds to the xmlns URI (":"对应于XMLNS URI（","The first annotation object that matches the specified type, or ":"与指定类型匹配的第一个注释对象，或"," of the sibling elements before this node, in document order.":"该节点之前的同级元素按文档顺序。","The type of the annotations to retrieve.":"检索注释的类型。","A content object that contains simple content or a collection of content objects to be added after this node.":"该节点后要添加的内容对象或要添加的内容对象集合的内容对象。"," of the sibling elements before this node, in document order. Only elements that have a matching ":"该节点之前的同级元素按文档顺序。 只有匹配的元素"," containing the XML.":"包含XML。","Content to be added to the streaming element.":"内容要添加到流元素中。"," that contains the annotations that match the specified type for this ":"其中包含匹配指定类型的注释"," to compare for document order.":"比较文档订单。","The writer to write the current node into.":"作者将当前节点写入。"," that contains the name of this streaming element.":"其中包含此流元素的名称。","A content object that contains simple content or a collection of content objects to be added before this node.":"包含简单内容或在此节点之前要添加的内容对象集合的内容对象。"," that contains the value of this node.":"其中包含该节点的值。"," that contains the annotations for this ":"其中包含注释"," that can compare the relative position of two nodes.":"这可以比较两个节点的相对位置。"," if this node appears after the specified node; otherwise ":"如果此节点在指定的节点之后出现； 否则"," that has been previously validated.":"以前已验证。"," if this node appears before the specified node; otherwise ":"如果此节点出现在指定节点之前； 否则","The type of annotations to remove.":"删除注释的类型。"," that contains the post-schema-validation infoset for an ":"其中包含用于验证后验证的信息"," of the ancestor elements of this node.":" 该节点的祖先元素。"," has line information; otherwise, ":"有线路信息； 否则，"," of the sibling nodes after this node, in document order.":"该节点后的兄弟节点按文档顺序。"," that contains the post-schema-validation infoset (PSVI) for an ":"其中包含用于验证后验证信息（PSVI）"," that can compare two nodes for value equality.":" 这可以比较两个节点的值相等。"," of the ancestor elements of this node. Only elements that have a matching ":"该节点的祖先元素。 只有匹配的元素"," that contains the base URI for this ":"为此包含了基础URI"," that specifies the sub-tree to validate.":"这指定了要验证的子树。"," of the sibling nodes before this node, in document order.":"该节点之前的兄弟姐妹节点按文档顺序。","The node type for this ":"节点类型"," to validate against.":"验证。"," that contains the next sibling node.":" 它包含下一个同级节点。"," are included in the collection.  \n  \n The nodes in the returned collection are in reverse document order.  \n  \n This method uses deferred execution.":"包含在集合中。 \n  \n  返回集合中的节点以反向文档顺序为单位。 \n  \n  此方法使用延期执行。"," positioned at the node to read into this ":"位于节点以阅读此内容"," for an event that occurs when the reader encounters validation errors. If ":"对于读者遇到验证错误时发生的事件。 如果","First ":"第一的"," that contains the previous sibling node.":"其中包含先前的兄弟节点。"," that contains the line number reported by the ":"其中包含由","Second ":"第二",", throws an exception upon validation errors.":"，在验证错误上引发例外。"," that contains the node and its descendant nodes that were read from the reader. The runtime type of the node is determined by the node type (":"其中包含读者读取的节点及其后代节点。 节点的运行时类型由节点类型确定（"," that contains 0 if the nodes are equal; -1 if ":"如果节点相等，则包含0； -1如果"," that contains the line position reported by the ":"其中包含由"," containing 0 if the nodes are equal; -1 if ":"如果节点相等，则包含0； -1如果"," indicating if the nodes are equal.":"指示节点是否相等。"," that contains the event arguments for LINQ to XML events.":"其中包含linq到XML事件的事件参数。"," indicating whether to populate the post-schema-validation infoset (PSVI).":"指示是否填充了施加后验证信息（PSVI）。",") of the first node encountered in the reader.":"读者中遇到的第一个节点。"," is before ":"是之前"," to hash.":"哈希。","; 1 if ":"; 1如果","The name of a code entity, such as a method parameter, typically taken from an XML element or attribute name.":"代码实体的名称，例如方法参数，通常取自XML元素或属性名称。","A reader positioned at the node to read into this ":"读者位于节点上以阅读此信息"," that contains the type of change.":"其中包含更改的类型。"," that contains a value-based hash code for the node.":"该节点包含基于值的哈希代码。"," is after ":"正在追随","A camel-case version of the parameter string.":"参数字符串的骆驼盒版本。","A name that will be made available within the ":"将在"," containing the target application for this ":"包含目标应用程序"," that represents the overriding attributes.":"这代表了压倒性属性。","The node to hash.":"哈希节点。","The type of all the code entities or type mappings for the instance.":"实例的所有代码实体的类型或键入映射。"," that either overrides a ":"要么覆盖","A Pascal-case version of the parameter string.":"参数字符串的Pascal-case版本。"," of the object that is overridden.":"被覆盖的对象。","An array of the code entities or type mappings that is stored by the ":"代码实体或类型映射的数组，该映射由","An object that contains the annotation to add.":"包含要添加注释的对象。"," applied to a class declaration, or is applied to a class declaration.":"应用于类声明，或应用于类声明。","A string that can be used as a code identifier, such as the name of a method parameter.":"可以用作代码标识符的字符串，例如方法参数的名称。"," to indicate a document-style Web service binding or a SOAP header.":"指示文档风格的Web服务绑定或SOAP标头。","The base class ":"基类","One of the XML Schema data types.":"XML模式数据类型之一。"," to indicate that the instance uses camel case; ":"指示该实例使用骆驼盒；"," if identifiers are case sensitive; otherwise, ":"如果标识符对案例敏感； 否则，"," that is associated with the collection of attributes you want to retrieve.":"这与您要检索的属性集合有关。"," to indicate that a generated deserializer should check for the expected qualified name of the wrapper element; otherwise, ":"为了表明生成的求职者应检查包装元素的预期合格名称； 否则，","A name that is used to index the code entity.":"用于索引代码实体的名称。"," to indicate that the instance uses Pascal case.":"指示该实例使用Pascal情况。","The XML element name generated by the ":"由"," that represents the collection of overriding attributes.":"这代表了覆盖属性的集合。",". This parameter's value is relevant only if the ":"。 此参数的值仅在","The code entity or type mapping information.":"代码实体或类型映射信息。","The value generated in an XML document when the ":"XML文档中生成的值"," that is associated with the collection of attributes you want to override.":"这与您要覆盖的属性集合有关。"," parameter's value is ":"参数的值是","A name that will not be available within the ":"一个名称在","The code entities to which the context applies.":"上下文应用的代码实体。"," serializes the enumeration, or the value recognized when it deserializes the enumeration member.":"序列化枚举或当枚举成员应确认的价值。","The .NET type for which to generate a type mapping.":"用于生成类型映射的.NET类型。","The name of the overridden member that specifies the ":"指定的覆盖成员的名称","The type of the object to include.":"要包括的对象的类型。"," value that determines whether custom types are shared among schema.":"确定自定义类型是否在模式之间共享的值。"," instance's scope.":"实例的范围。","Internal .NET mapping of a type to an XML Schema element.":"将类型的内部.NET映射到XML模式元素。","Any object that implements the ":"任何实现的对象","A candidate name that is used to index the code entity.":"用于索引代码实体的候选名称。","The default XML namespace to use for imported type mappings.":"用于导入类型映射的默认XML名称空间。",", if custom types are shared among schema; otherwise, ":"，如果定制类型在模式之间共享； 否则，","The default XML namespace to use.":"要使用的默认XML名称空间。"," interface, such as the ":"界面，例如"," object that overrides how the ":"对象覆盖了如何"," that specifies the code entities to which the context applies.":"这指定了上下文应用的代码实体。","The identifier parameter value or a modified string if there is a name collision.":"标识符参数值或修改的字符串（如果存在名称冲突）。"," that overrides the behavior of the ":"这覆盖了行为"," class serializes mapped types using SOAP encoding.":"类使用SOAP编码序列化映射类型。","The name to check for use within the ":"要在"," that contains warnings that were generated when importing the code entity descriptions.":"其中包含导入代码实体描述时生成的警告。","The .NET type for which to save type mapping information.":"保存类型映射信息的.NET类型。"," when the member is serialized.":"当成员序列化时。"," if the name is already in use; otherwise, ":"如果名称已经在使用中； 否则，"," reflection object that contains custom attributes that are derived from the ":"反射对象包含从","An XML element name produced from the Web service method.":"从Web服务方法生成的XML元素名称。"," if white space attributes values are normalized; otherwise, ":"如果白空间属性值归一化； 否则，","An object that represents the default value of an XML element or attribute.":"表示XML元素或属性的默认值的对象。","The name to possibly modify.":"可能修改的名称。","The element name.":"元素名称。"," enumeration that describes how whites pace is handled when parsing XML.":"枚举描述了在解析XML时如何处理白人节奏的枚举。","An XML element namespace produced from the Web service method.":"由Web服务方法产生的XML元素名称空间。"," to override.":"覆盖。","The name of the XML attribute.":"XML属性的名称。","A string that is the same as the input identifier or has the first letter's case modified.":"与输入标识符相同的字符串或对第一个字母的案例进行了修改。"," that corresponds to the XML type.":"对应于XML类型。","An array of .NET code entities that belong to a Web service method.":"属于Web服务方法的.NET代码实体数组。","The name of the XML attribute. The default is the member identifier.":"XML属性的名称。 默认值是成员标识符。","The name to modify if it is not already unique.":"如果尚未唯一的话，要修改的名称。","The name of the XML type that the ":"XML类型的名称","An object that specifies how the ":"一个指定的对象","Internal .NET type mappings to the element parts of a WSDL message definition.":"内部.NET类型映射到WSDL消息定义的元素部分。"," generates when it serializes the class instance (and recognizes when it deserializes the class instance).":"当它序列化类实例时生成（并识别该类实例时）。"," of the object to override.":"覆盖的对象。","The name of the code entity or type mapping information to remove.":"代码实体的名称或键入映射信息要删除。"," serializes an enumeration member.":"序列化枚举成员。","The name of the member to override.":"成员覆盖的名称。","The XML namespace of the type.":"该类型的XML名称空间。"," to indicate that elements that correspond to WSDL message parts should be enclosed in an extra wrapper element in a SOAP message; otherwise, ":"为了指出与WSDL消息部分相对应的元素应将其包含在SOAP消息中的额外包装元素中； 否则，","The name of the XML type. The default is the class name.":"XML类型的名称。 默认值是类名称。"," to include the type in SOAP-encoded XML Schema documents; otherwise, ":"将类型包括在SOAP编码的XML模式文档中； 否则，"," to indicate an RPC-style Web service binding; ":"指示RPC风格的Web服务绑定；"," that is allowed in the array.":"在数组中允许。"," must not serialize the field or property; otherwise, ":"不得序列化字段或属性； 否则，","The unreferenced object.":"未引用的对象。","The namespace of the XML type. The default is an empty string (\"\").":"XML类型的名称空间。 默认值是一个空字符串（“”）。","The index of the added item.":"添加项目的索引。","The zero-based index of the newly added item.":"新添加的项目的基于零的索引。","A class that can provide alternative implementations of attributes that control XML serialization.":"可以提供控制XML序列化属性的替代实现的类。",", if the type maps to an XML any element or attribute; otherwise, ":"，如果类型映射到XML任何元素或属性； 否则，","A unique string used to identify the unreferenced object.":"用于识别未引用对象的唯一字符串。"," object that represents the collection of ":"代表集合的对象"," to check for.":"检查。"," to look for.":" 去寻找。",", if the accompanying field has a value specified; otherwise, ":"，如果随附的字段指定值； 否则，","The ID of the object.":"对象的ID。"," objects to copy to the collection.":"对象复制到集合。"," that specifies how the ":"这指定了如何","The unqualified name of the XML element declaration that applies to this mapping.":"适用于此映射的XML元素声明的不合格名称。","The deserialized, but unreferenced, object.":"绝对序列化但没有引用的对象。"," if the object exists in the collection; otherwise, ":"如果该物体存在于集合中； 否则，","The index at which the copied attributes begin.":"复制属性开始的索引。"," serializes a public field or read/write property that returns an array.":"序列化返回数组的公共字段或读/写属性。","The name of the Web service method member represented by this mapping.":"该映射表示的Web服务方法成员的名称。","The index of the newly added ":"新增加的索引 "," object that contains a collection of ":"包含一个集合的对象"," array to hold the copied elements.":" 数组来保存复制的元素。","The first index of the ":"第一个索引"," whose index is being retrieved.":"其索引正在检索。","The XML namespace that applies to this mapping.":"适用于此映射的XML命名空间。"," that controls the serialization of a public field or read/write property as an XML attribute.":"控制公共字段的序列化或将读/写入属性作为XML属性。"," you are interested in.":"你对。。。感兴趣。"," in the collection or -1 if the attribute is not found in the collection.":"在集合或-1中，如果在集合中找不到属性。","The zero-based index where the member is inserted.":"插入成员的基于零的索引。","The fully qualified type name of the .NET type for this mapping.":"该映射的.NET类型的完全合格的类型名称。","The index at which the attribute is inserted.":"插入属性的索引。"," exists in the collection; otherwise, ":"集合中存在； 否则，"," that can be applied to a class member that is serialized as an ":"可以应用于被序列化的类成员","The object that represents the unknown XML element.":"表示未知XML元素的对象。","The type name of the .NET type for this mapping.":"此映射的.NET类型的类型名称。","The zero-based index of the collection member to get or set.":"收集成员的基于零的索引要获得或设置。"," that represents the default value of an XML element or attribute.":"代表XML元素或属性的默认值。"," objects that is the destination of the elements copied from the collection. The array must have zero-based indexing.":"是从集合复制的元素的目的地的对象。 该数组必须具有零基索引。","The namespace of the .NET type for this mapping.":"此映射的.NET类型的名称空间。"," if the namespace declarations should be kept; otherwise, ":"如果应保留名称空间声明； 否则，"," that represents the unknown XML attribute.":"这代表未知的XML属性。","A comma-delimited list of XML element names. Each name is in the following format: ":"XML元素名称的逗号删除列表。 每个名称都采用以下格式："," whose index you want.":" 你想要谁的索引。"," that overrides a class attributed as an XML root element.":"这覆盖了归因于XML根元素的类。","The XML element name.":"XML元素名称。","The line number where the unknown element was encountered if the XML reader is an ":"如果XML读取器是一个，遇到未知元素的行号","A comma-delimited list of XML attribute names. Each name is in the following format: ":"XML属性名称的逗号限制列表。 每个名称都采用以下格式：","The XML element name of the serialized array. The default is the name of the member to which the ":"序列化数组的XML元素名称。 默认值是成员的名称"," that overrides the default serialization of a public property or field.":"这覆盖了公共财产或字段的默认序列化。","The line number of the unknown XML attribute.":"未知XML属性的行号。","The number of mappings in the collection.":"集合中的映射数量。","The number in the line where the unknown element occurs if the XML reader is an ":"如果XML读取器是一个，未知元素发生的行中的数字"," is assigned.":"被安排了。"," that overrides an ":"覆盖了一个","The index of the mapping to return.":"映射的索引要返回。","The position number of the unknown XML attribute.":"未知XML属性的位置编号。","The object that is being deserialized by the ":"由","An XML schema definition (XSD) data type.":"XML模式定义（XSD）数据类型。","The name of the .NET type.":".NET类型的名称。"," applied to a class declaration.":"适用于班级声明。"," of the object to include.":"包含的对象。","The object being deserialized.":"该对象被逐渐化。","The lookup key.":"查找键。"," object that represents the overriding attributes.":"代表覆盖属性的对象。","The member name that returns the enumeration used to detect a choice.":"返回用于检测选择的枚举的成员名称。","The .NET namespace of the mapping.":"映射的.NET命名空间。",", and no instance is generated. The default is ":"，并且不生成实例。 默认值为 ","The name of the mapped element.":"映射元素的名称。","The line number of the unknown XML node.":"未知XML节点的行号。","The name of a field that returns an enumeration.":"返回枚举的字段的名称。"," that is associated with the collection of attributes you want.":"这与您想要的属性集合有关。","The namespace of the generated XML element.":"生成的XML元素的命名空间。","The namespace of the mapped element.":"映射元素的命名空间。","The position number of the unknown XML node.":"未知XML节点的位置编号。"," that points to the event handler.":"这指向事件处理程序。","The name of the node being deserialized.":"节点的名称被序列化。","The zero-based index of a set of indexes in an array of arrays.":"一组数组中的一组索引的基于零的索引。","The XML local name of the node being deserialized.":"该节点的XML局部名称被序列化。"," that contains mappings to export.":"其中包含要出口的映射。","The XSD element name.":"XSD元素名称。","The namespace URI that is associated with the XML node being deserialized.":"与XML节点相关的命名空间URI。"," object to be added to the collection of objects.":"对象要添加到对象集合中。","The string \"any\" with an appended integer.":"带有附加整数的字符串“任何”。","The namespace of the .NET Framework type that is being deserialized.":"正在反序列化的.NET Framework类型的命名空间。"," that represents the XML node being deserialized.":"这代表XML节点被序列化。","The namespace that the array should have.":"数组应该具有的名称空间。"," is added.":"被添加。","The internal .NET Framework type mappings for the element parts of a Web Services Description Language (WSDL) message definition.":"内部.NET框架键入Web服务元素零件说明语言（WSDL）消息定义的映射。"," to be deserialized.":"被判决。"," being deserialized.":"被挑选。","The length of the SOAP array.":"肥皂阵列的长度。"," of the schema object.":"模式对象。","The internal mapping between a .NET Framework type and an XML schema element.":".NET框架类型和XML模式元素之间的内部映射。","The text of the XML node being deserialized.":"XML节点的文本被启用。"," attribute of a ":"a的属性"," is currently positioned over a null attribute with the value ":"当前位于带有值的空属性上"," if the schema elements that enclose the schema are to be included; otherwise, ":"如果要包含包含模式的模式元素； 否则，","An object that overrides how the ":"一个覆盖方式的对象"," object to be added to the end of the collection.":"对象要添加到集合的末尾。"," element that identifies the element.":"标识元素的元素。","Internal .NET Framework type mappings for the element parts of a Web Services Description Language (WSDL) message definition.":"Web服务描述语言(WSDL)消息定义的元素部分的内部.NET Framework类型映射。"," class serializes mapped types.":"类序列化映射类型。","An object to be deserialized from a SOAP-encoded ":"从SOAP编码的物体中进行估算的对象","The object that is deserialized from the XML element.":"从XML元素进行应序列化的对象。"," that specifies the callback method that handles errors and warnings during XML Schema validation, if the strict parameter is set to ":"如果将严格的参数设置为"," that represents the qualified XML name of the exported element declaration.":"这代表了导出元素声明的合格XML名称。"," objects that contain .NET Framework code entities that belong to a Web service method.":"包含属于Web服务方法的.NET框架代码实体的对象。"," in a while loop.":"在一段时间内循环。"," to validate the XML schemas in the collection using the ":"使用该集合中验证XML模式","An XML qualified name that indicates the data type of an XML element.":"表示XML元素的数据类型的XML限定名称。","The internal mapping between a .NET type and an XML schema element.":".NET类型和XML模式元素之间的内部映射。","The namespace of the item to check for.":"要检查的项目的名称空间。","The string that will have its white space trimmed.":"将修剪其空白的字符串。"," if elements that correspond to Web Services Description Language (WSDL) message parts should be enclosed in an extra wrapper element in a SOAP message; otherwise, ":"如果与Web Services描述语言（WSDL）消息零件相对应的元素应将其包含在SOAP消息中的额外包装元素中； 否则，","The name of an XML attribute.":"XML属性的名称。"," object that specifies a collection of classes being generated for bindings defined in a WSDL document.":" 指定为WSDL文档中定义的绑定生成的类的集合的对象。","The trimmed string.":"修剪的字符串。"," if the XML attribute name indicates an XML namespace; otherwise, ":"如果XML属性名称指示XML名称空间； 否则，"," if the item is found; otherwise, ":"如果找到该物品； 否则，"," with mappings to the element parts of a WSDL message definition.":"映射到WSDL消息定义的元素部分。"," object to locate.":"要定位的对象。"," that specifies the name of an element's type for which a .NET Framework type is generated.":"这指定了生成.NET框架类型的元素类型的名称。","The name of the abstract type.":"抽象类型的名称。"," that may have the type ":"可能有类型"," if the method is a remote procedure call; otherwise, ":"如果该方法是远程过程调用； 否则，",", if the collection contains the specified item; otherwise, ":"，如果该集合包含指定的项目； 否则，","The .NET Framework namespace of the abstract type.":"抽象类型的.NET框架名称空间。","The name of the part element in the WSDL document.":"WSDL文档中零件元素的名称。","The fully qualified name of the current XML element.":"当前XML元素的完全合格名称。"," that contains the mappings.":"其中包含映射。"," that is the destination of the schemas copied from ":"那是复制的架构的目的地"," representing the .NET Framework type mapping for a single element part of a WSDL message definition.":"代表WSDL消息定义的单个元素部分的.NET框架类型映射。","The local name of the derived XML Schema data type.":"派生的XML模式数据类型的本地名称。"," if the element has a ":"如果元素有一个","A 32-bit integer that represents the index in the array where copying begins.":"一个32位整数，代表复制开始的数组中的索引。"," to specify that the generated schema type will be marked with the ":"指定生成的模式类型将用","The namespace of the derived XML Schema data type.":"派生的XML模式数据类型的名称空间。"," that specifies the name of an element defined in an XML schema document.":"这指定了XML模式文档中定义的元素的名称。"," attribute value and has been read; otherwise, ":"属性值并已读取； 否则，"," that specifies a fully qualified name with a namespace used to locate an ":" 它指定一个具有命名空间的完全限定名称，用于定位 ","A base type for the .NET Framework type that is generated to correspond to an XSD element's type.":".NET框架类型的基本类型，该类型与XSD元素类型相对应。"," attribute that is applied to the type.":"应用于类型的属性。","The local name of the base XML Schema data type.":"基本XML模式数据类型的本地名称。"," that represents the fully qualified name of the current XML element; otherwise, ":"代表当前XML元素的完全合格名称； 否则，"," of the object to find. Possible types include: ":"要查找的对象。 可能的类型包括："," that represents a mapping of a .NET type to an XML Schema element.":"这代表了.NET类型对XML模式元素的映射。"," representing the.NET Framework type mapping information for an XML schema element.":"代表XML模式元素的.NET框架类型映射信息。","The namespace of the base XML Schema data type.":"基本XML模式数据类型的名称空间。"," attribute value is present.":"存在属性值。"," to indicate that the type corresponding to an XSD element can indirectly inherit from the base type; otherwise, ":"指出对应于XSD元素的类型可以间接从基本类型继承； 否则，"," instance, such as an ":"实例，例如"," that contains the internal .NET mapping of a type to an XML Schema element.":"其中包含将类型的内部.NET映射到XML模式元素。","The string value; otherwise, ":"字符串值; 否则，","The namespace of the derived .NET Framework type.":"派生的.NET框架类型的名称空间。","The .NET Framework type for which to save type mapping information.":"用于保存类型映射信息的.NET框架类型。","The .NET Framework type mapping information for an XML schema element.":".NET框架键入XML模式元素的映射信息。","The namespace of the schemas to retrieve.":"架构的名称空间要检索。","The name of the base .NET Framework type.":"基本.NET框架类型的名称。"," class that contains custom attributes derived from the ":"包含从","An output string into which the ":"输出字符串"," implementation that contains the schemas.":"包含模式的实施。","The name of the element for which to generate a mapping.":"要为其生成映射的元素的名称。",", if the member represents a Web service return value; otherwise, ":"，如果成员表示Web服务返回值； 否则，"," that an object cannot be cast to. This type is incorporated into the exception message.":"该对象不能被施放。 这种类型已包含在异常消息中。","The zero-based index of the first occurrence of the value within the entire ":"在整个值中的第一次出现的基于零的索引"," attribute value is read.":"属性值已读取。","The namespace of the element for which to generate a mapping.":"生成映射的元素的名称空间。","The name of the Web service method.":"Web服务方法的名称。"," of the Web service method member code entity that is represented by this mapping.":"此映射表示的 Web 服务方法成员代码实体的名称。","The object that cannot be cast. This object is incorporated into the exception message.":"不能施放的对象。 此对象已纳入异常消息。"," object to be inserted.":"要插入的对象。"," to override the ":"覆盖"," if the value was read; otherwise, ":"如果读取值； 否则，"," instances that specifies the members of the element for which to generate a mapping.":"指定生成映射的元素成员的实例。","The XML schema to check for an ":"XML模式检查","A string identifier.":"字符串标识符。"," property; otherwise, ":"财产; 否则，"," that contains type mapping information.":"其中包含类型映射信息。","The value of the referenced element in the document.":"文档中引用元素的值。"," attribute with a ":"属性"," that specifies the name of the message part.":"这指定了消息部分的名称。"," that contains the objects that represent SOAP attributes applied to the member.":"其中包含代表应用于成员的肥皂属性的对象。","The local name of the XML Schema data type that is mapped to the unavailable derived type.":"映射到不可用派生类型的XML架构数据类型的本地名称。","The local name of the element's XML Schema data type.":"该元素的XML模式数据类型的本地名称。","The .NET Framework type mapping for a WSDL message definition containing a single element part.":"WSDL消息定义包含单个元素部分的.NET框架类型映射。","The namespace of the XML Schema data type that is mapped to the unavailable derived type.":"映射到不可用的派生类型的XML模式数据类型的名称空间。","The namespace of the element's XML Schema data type.":"元素XML模式数据类型的名称空间。"," that represents XML attributes that have been applied to the member code.":"这代表已应用于成员代码的XML属性。"," if the specified schema exists; otherwise, ":" 如果指定的模式存在；否则, "," object you want to iterate over.":"您想迭代的对象。"," if the element name is also the XML Schema data type name; otherwise, ":"如果元素名称也是XML模式数据类型名称； 否则，","The full name of the .NET Framework base type for which a derived type cannot be located.":"无法找到派生类型的.NET框架基本类型的全名。"," that specifies the names of the message parts.":" 指定消息部分的名称。","The value of the element to remove at ":"要删除的元素的值 "," if the move is successful; otherwise, ":"如果举动成功； 否则，","The fully qualified name of the .NET Framework type for which there is a mapping.":"具有映射的.NET框架类型的完全合格名称。","An output string into which the value of the ":"输出字符串，其中的值"," that represents the .NET Framework type mappings for the element parts of a WSDL message definition.":"这代表了WSDL消息定义的元素部分的.NET框架类型映射。","The current element in the collection of ":"集合中的当前元素",", if the schemas have been compiled; otherwise, ":"，如果汇编了模式； 否则，"," attribute is read.":"属性已读取。","The enumeration value that is not valid.":"无效的枚举值。","A base type for all .NET Framework types that are generated to correspond to message parts.":"生成与消息零件相对应的所有.NET框架类型的基本类型。"," objects to which element declarations obtained from type mappings are added.":"添加从类型映射获得的元素声明的对象。"," that corresponds to the current position of the ":"对应于当前位置","The index of the item to retrieve.":"要检索的项目索引。"," that represents the name of the unknown type.":"这代表未知类型的名称。"," to indicate that the types corresponding to message parts can indirectly inherit from the base type; otherwise, ":"指出与消息零件相对应的类型可以间接从基本类型继承； 否则，","The namespace of the XML schema document to which to add an ":"XML架构文档的名称空间要添加一个"," interface with its members populated from the location of the ":"与其成员的接口从填充的位置","The namespace of the specified object.":"指定对象的名称空间。","An arbitrary name assigned to the ":"分配给的任意名称"," that is being checked.":"正在检查。","An IXmlSerializable object that corresponds to the current position of the XMLReader.":"与XMLReader的当前位置相对应的IXMLSerializable对象。","The .NET Framework type mappings for the element parts of a WSDL message definition.":".NET框架键入WSDL消息定义的元素部分的映射。"," element declaration.":"元素声明。","Specifies whether the serializable object is wrapped.":"指定是否包装了可序列化对象。"," that specifies an XML element.":"该指定XML元素。","The collection into which the collection items array is copied.":"收集项目阵列复制的集合。","The required index.":"所需的索引。"," object that describes a type mapping.":"描述类型映射的对象。"," if the result of the read operation should be trimmed; otherwise, ":"如果应修剪读取操作的结果； 否则，","An object that implements the IXmlSerializable interface with its members populated from the location of the XmlReader.":"一个实现IXMLSerializable接口的对象，其成员从XMLReader的位置填充。","An array of items to be copied into the ":"要复制到 "," of the array's elements.":"阵列的元素。"," object that specifies a base type.":"指定基本类型的对象。","A string to prefix to the result of a call to the ":"一个字符串，前缀是调用呼叫的结果","The result of the read operation appended to the input value.":"读取操作的结果附加到输入值。","The result of call to the ":"致电的结果","The existing ":"现有"," class that contains the object to be fixed and the array of string identifiers for the items to fill in.":" 包含要固定的对象和要填写的项的字符串标识符数组的类。"," that represents the simple data type for the current location of the ":"代表了当前位置的简单数据类型"," value that specifies whether the generated type can indirectly inherit the ":"指定生成类型是否可以间接继承的值",", if it is already large enough; otherwise, a new, larger array that contains the original array's elements.":"，如果已经足够大； 否则，一个包含原始数组元素的新较大数组。"," method appended to the input value.":"方法附加到输入值。","The object returned by the callback.":"回调返回的对象。","An XML name to be decoded.":"要解码的XML名称。","A generic ":"通用","An object that contains the array whose values are filled in.":"一个包含填充值的数组的对象。","A string that will be appended to.":"将附加到的字符串。","A name that may contain a prefix.":"可能包含前缀的名称。"," delegate and the callback method's input data.":"委托和回调方法的输入数据。","The local name that the array should have.":"数组应该具有的本地名称。"," that represents a null XML value.":"这代表一个null XML值。","The name that is not valid.":"无效的名称。","The name of the .NET Framework type that is being deserialized.":".NET框架类型的名称被序列化。"," that represents a namespace-qualified XML name.":"这代表了名称空间合格的XML名称。"," object that shows the time but no date.":"显示时间但没有日期的对象。","The value of the node as a .NET Framework value type, if the value is a simple XML Schema data type.":"如果值是简单的XML模式数据类型，则节点作为.NET框架值类型的值。"," element declaration that the name belongs to.":"该名称属于的元素声明。","The byte array to write in the body of the XML element.":"字节阵列在XML元素的主体中写入。","An object that the ":"一个对象"," if the method should read content only after reading the element's start element; otherwise, ":"如果该方法仅在阅读元素的开始元素后才读取内容； 否则，","A string to be used as an XML name.":"用作XML名称的字符串。","The expected local name of an element.":"元素的预期本地名称。"," is attempting to deserialize, subsequently accessible through the ":"正在尝试进行挑选，随后可以通过"," that contains the root element that has been read.":"其中包含已读取的根元素。","The object being serialized either in the current XML element or a ":"在当前XML元素或A中序列化的对象","A string to be used as a local (unqualified) XML name.":"用作本地（未合格的）XML名称的字符串。"," to read content only after reading the element's start element; otherwise, ":"仅在阅读元素的开始元素后才阅读内容； 否则，","The expected namespace of an element.":"元素的预期命名空间。"," that represents the attribute in question.":"这代表了所讨论的属性。","An XML name to be encoded.":"要编码的XML名称。"," element that is referenced by the current element.":"当前元素引用的元素。","The newly created exception.":"新创建的异常。"," that represents the XML node that has been read.":"这代表已读取的XML节点。","A comma-delimited list of XML qualified names.":"XML合格名称的逗号限制列表。"," element that referenced by the current element.":"当前元素引用的元素。","A space-delimited sequence of XML names to be encoded.":"要编码的XML名称的空格序列。","The object that represents the invalid member.":"代表无效成员的对象。"," that is being deserialized.":"那是必不可少的。","The type stored in the object's type mapping (as opposed to the object's type found directly through the ":"存储在对象类型映射中的类型（与直接通过的对象类型相反","The object to be deserialized.":"值得注意的对象。"," that is invalid.":"那是无效的。"," that represents the XML to be written.":"这代表要编写的XML。","The full name of the assembly.":"大会的全名。"," for which an event is raised.":"为此举办活动。","An XML qualified name, with invalid characters replaced by escape sequences.":"XML合格的名称，无效字符被逃生序列取代。","A name for the ":"一个名字"," operation).":"手术）。","The object that is being deserialized.":"被挑选的对象。"," to ignore empty spaces in the string; otherwise, ":"忽略字符串中的空空间； 否则，","A dynamically generated ":"动态生成","An object that represents the invalid enumeration.":"代表无效枚举的对象。"," to serialize the object directly into the XML element rather than make the element reference another element that contains the data; otherwise, ":"将对象直接序列化到XML元素中，而不是使元素引用另一个包含数据的元素； 否则，","A dynamically generated assembly.":"动态生成的组件。","A unique string that is used to identify the unreferenced object, subsequently accessible through the ":"用于识别未引用对象的唯一字符串，随后可通过","The array that is being checked.":"正在检查的阵列。","The local name of the referencing element being written.":"正在写入的引用元素的本地名称。","The XML type name.":"XML类型名称。","The maximum length of the array.":"阵列的最大长度。","The local name of the XML attribute.":"XML属性的本地名称。","The value that is not valid.":"无效的值。"," if XML strings are decoded into valid .NET type names; otherwise, ":" 如果XML字符串被解码为有效的.NET类型名称；否则, ","The value of the XML attribute as a byte array.":"XML属性作为字节数组的值。"," for the array, if present for the input array, can be returned; otherwise, a new, smaller array.":"对于数组，如果存在输入数组，则可以返回； 否则，一个新的，较小的数组。","The namespace of the referencing element being written.":"正在写入的引用元素的命名空间。","The name of the XML element with an invalid value.":"具有无效值的XML元素的名称。"," that represents the deserialized ":"代表避难所",", if it is already small enough; otherwise, a new, smaller array that contains the original array's elements up to the size of ":"，如果已经足够小； 否则，一个新的，较小的阵列包含原始数组的元素，直至","The value of the XML attribute as a string.":"XML属性作为字符串的值。","The local name of the result body.":"结果主体的本地名称。","The valid value.":"有效值。","The namespace of the XML attribute.":"XML属性的名称空间。",", if the value is a return value.":"，如果值是返回值。"," to return a base-64 byte array.":" 返回一个base-64字节数组。","The XML element that cannot be processed.":"无法处理的XML元素。","The namespace of the result body.":"结果体的命名空间。"," that is being used by the ":"这是由","The namespace prefix to write.":"命名空间前缀要编写。","The object whose type cannot be serialized.":"类型不能序列化的对象。","A base-64 byte array; otherwise, ":"基本64字节阵列； 否则，"," interface that uses custom XML formatting.":"使用自定义XML格式的接口。","The namespace represented by the prefix.":"前缀表示的名称空间。","The current count of an ":"当前的计数"," attribute if the ":"属性如果是","The type that cannot be serialized.":"无法序列化的类型。","A string to translate into a base-64 byte array.":"要转换为base-64字节数组的字符串。","The XML node to write, possibly a child XML element.":"XML节点编写，可能是儿童XML元素。"," class object is ":"类对象是","A collection into which the callback method copies the collection items array.":"回调方法复制收集项目数组的集合。","A base-64 byte array.":"基本64字节阵列。","A base-64 ":"A基地-64 ","The local name of the parent XML element to write.":"要写的父XML元素的本地名称。"," to return a hexadecimal byte array.":"返回十六进制字节阵列。","A method that instantiates the ":"一种实例化的方法"," to ignore writing the opening element tag; otherwise, ":"忽略编写开头元素标签； 否则，","The same byte array that was passed in as an argument.":"相同的字节阵列被传递给了一个论点。"," to write the opening element tag.":"写开口元素标签。","An array into which the callback method copies a collection.":"回调方法复制集合的数组。","The namespace of the parent XML element to write.":"父XML元素要编写的名称空间。","A hexadecimal byte array; otherwise, ":"十六进制字节阵列； 否则，"," delegate that points to the callback method.":"将该指向回调方法委派。"," to write the element name with a prefix if none is available for the specified namespace; otherwise, ":"如果指定名称空间不可用，则用前缀编写元素名称； 否则，","A hexadecimal byte array to translate to a string.":"一个十六进制字节阵列，用于翻译为字符串。"," to write an ":"写一个","The byte array value converted to a string.":"字节数组值转换为字符串。","The collection that is used for the fixup.":"用于修复的集合。","A string to translate into a hexadecimal byte array.":"一根琴弦转换为十六进制字节阵列。"," attribute if the object to serialize is ":"属性如果序列化的对象为","The array into which the callback method copies a collection.":"回调方法复制集合的数组。","A hexadecimal byte array.":"十六进制字节阵列。","The object being serialized as an XML element.":"被序列化为XML元素的对象。"," to translate to a string.":"转换为字符串。","The object that contains other objects whose values get filled in by the callback implementation.":"包含其他对象的对象，其值通过回调实现填充。"," to indicate that the node, if an XML element, adheres to an XML Schema ":"为了指示节点（如果XML元素）粘附在XML架构上","A string to translate into a ":"要翻译成一个字符串 "," class that contains prefix and namespace pairs to be used in the generated XML.":" 包含要在生成的XML中使用的前缀和命名空间对的类。"," value converted to a string.":"值转换为字符串。","The size of the string array obtained through the ":"通过"," element declaration; otherwise, ":"元素声明； 否则，"," class object.":"类对象。"," that shows the date but no time.":"这显示了日期，但没有时间。","The local name of the element to write.":"要写的元素的本地名称。","The string array obtained through the ":"通过","A string that consists of delimited identifiers where each identifier represents a constant from the set enumerator list.":"一个由划界标识符组成的字符串，每个标识符代表从集合枚举列表中的常数。","The local name of the XML element.":"XML元素的本地名称。","The callback method that creates an instance of the ":"创建一个实例的回调方法","The namespace of the element to write.":"要编写的元素的名称空间。"," that shows the date and time.":"这显示了日期和时间。"," that consists of the identifiers as keys and the constants as integral numbers.":"该标识符是键，而常数为积分数字。","The name to write, using its prefix if namespace-qualified, in the element text.":"元素文本中使用其前缀（如果命名空间符号）来编写的名称。","The enumeration value as a series of bitwise ":"枚举价值作为一系列位","The object to be serialized in the element body.":"要在元素主体中序列化的对象。","The array of keys.":"钥匙阵列。","The name of the XML Schema data type to be written to the ":"XML模式数据类型的名称要写入","The name of the enumeration type.":"枚举类型的名称。","The source containing objects with values to fill.":"源包含具有要填充的值的对象。","The enumeration's name values.":"枚举的名称值。"," if the XML element explicitly specifies the text value's type using the ":"如果XML元素明确指定了文本值的类型","A long value that consists of the enumeration value as a series of bitwise ":"由枚举价值作为一系列位的长度值","The local name of the XML element to be written without namespace qualification.":"XML元素的本地名称将在没有名称空间资格的情况下编写。","The object being serialized.":"对象被序列化。","The enumeration's constant values.":"枚举的恒定值。","The value of the string to write.":"字符串的值编写的值。"," operations.":"操作。","The text value of the XML element.":"XML元素的文本值。","A string that consists of delimited identifiers, where each represents a member from the set enumerator list.":"由划界标识符组成的字符串，每个标识符都代表来自集合枚举列表的成员。"," of objects that are serialized.":"序列化的对象。","The XML node to write.":"XML节点要编写。"," used by the class instance.":"由类实例使用。","The local name of the XML element to write.":"XML元素要写的本地名称。","The name of the type of objects that are serialized.":"序列化对象类型的名称。"," object (or ":"对象（或","The values of the enumeration.":"枚举的价值。","The type of the object that this ":"对象的类型","The namespace of the type of objects that are serialized.":"序列化对象类型的名称空间。","The constants of the enumeration.":"枚举的常数。",") used to generate a qualified name value for an ":"）用于生成一个合格的名称价值","The namespace of the XML element to write.":"要写入的XML元素的命名空间。","For SOAP encoded messages, the base used to generate id attributes.":"对于SOAP编码的消息，用于生成ID属性的基础。"," attribute from the Web Services Description Language (WSDL) namespace (\"http://schemas.xmlsoap.org/wsdl/\").":"来自Web服务描述语言（WSDL）名称空间的属性（“ http://schemas.xmlsoap.org/wsdl/”）。","A string that consists of delimited identifiers, where each item is one of the values set by the bitwise operation.":"由划界标识符组成的字符串，其中每个项目都是由位操作设置的值之一。"," can serialize.":" 能序列化。","The XML namespaces to declare.":"XML名称空间要声明。","The simple, unencrypted name of the assembly.":"简单，未加密的组装名称。","The XML qualified name to write in the body of the XML element.":"XML合格的名称要在XML元素的正文中写入。","The default namespace to use for all the XML elements.":"用于所有XML元素的默认名称空间。","The local name of an XML Schema data type.":"XML模式数据类型的本地名称。"," that is translated to a string.":"这被翻译成一个字符串。","A location, such as a path or URI, that points to the assembly.":"指向组件的位置，例如路径或URI。"," array of additional object types to serialize.":"其他对象类型的数组要序列化。","The string to write in the body of the XML element.":"在XML元素的主体中写入的字符串。"," on which to evaluate the XPath expression.":"在其上可以评估XPATH表达式。","The namespace of an XML Schema data type.":"XML模式数据类型的名称空间。","A derivation of the ":"派生","The type of the object to serialize.":"序列化对象的类型。"," method returns an encoded name; otherwise, ":"方法返回编码名称； 否则，"," that contains an XPath expression.":"其中包含XPATH表达式。"," class that is specifically created to serialize the specified type.":" 专门为序列化指定类型而创建的类。"," that extends or overrides the behavior of the class specified in the ":"扩展或覆盖了在"," that contains the namespaces and prefix pairs.":"其中包含名称空间和前缀对。","An object that can contain a ":"一个可以包含一个的对象"," that defines the XML root element properties.":"定义XML根元素属性。"," that contains fields that override the default serialization behavior.":"其中包含覆盖默认序列化行为的字段。"," of the object that this ":"这个对象",", or an ":"，或一个 ","The default namespace of all XML elements in the XML document.":"XML文档中所有XML元素的默认名称空间。"," for the namespace prefixes in the XPath expression.":"对于XPath表达式中的名称空间前缀。"," that extends or overrides the behavior of the class specified in the type parameter.":"扩展或覆盖类型参数中指定的类的行为。","The location of the types.":"类型的位置。","An object that contains the result of evaluating the expression. The object can be a ":"包含评估表达式结果的对象。 该对象可以是","The path that specifies the location of the types.":"指定类型位置的路径。"," that represents the XML root element.":"代表XML根元素。",", or null.":"，或无效。"," class that is specifically created to serialize the mapped type.":"专门为序列化映射类型而创建的类。"," that maps one type to another.":"那将一种类型映射到另一种类型。"," that contains the selected elements.":"其中包含所选元素。","The type to be serialized.":"要序列化的类型。"," that points to the document to deserialize.":"这指出了该文档的应有化。","The XML node to navigate.":"导航的XML节点。"," can deserialize the object that the ":"可以使对象的必要性","An interface that provides an accessor to the ":"一个为登录器提供的插头"," if the type can be serialized; otherwise, ":" 如果类型可以序列化；否则, "," points to; otherwise, ":"指着; 否则，"," object that contains the XML data.":"包含XML数据的对象。","An instance of a type derived from the ":"从该类型派生的实例","An instance that implements the ":"实施实现的实例","The path of the file that contains the XML data.":"包含XML数据的文件的路径。"," that is used to read an XML document or data stream.":"用于读取XML文档或数据流。"," that contains the XML document to deserialize.":"其中包含XML文档进行挑选。"," object that contains all the properties of an ":"包含所有属性的对象","The encoding style of the serialized XML.":"序列化XML的编码样式。"," that contains the methods.":"其中包含方法。"," description of the error condition for this exception.":"此例外的错误条件的描述。"," class used to read the document.":"用于阅读文档的课程。"," that contains the typed serializers.":"其中包含打字的串行序列。","The encoding used.":"使用的编码。"," that is used to write to an XML data stream or document.":"用于写入XML数据流或文档。","The type that is being serialized.":"正在序列化的类型。"," that contains the document to deserialize.":"其中包含要进行序列化的文档。"," containing the common language runtime (CLR) namespace of the assembly.":"包含汇编的通用语言运行时（CLR）名称空间。"," of the deserialized object.":"避免的对象。","The version of the parent assembly.":"父件的版本。"," you are deserializing.":"你是必不可少的。"," to be serialized.":"被序列化。","The version of the assembly.":"组件的版本。","The name of the assembly that contains an ":"包含一个装配的名称",", if the resulting schema type is an XSD anonymous type; otherwise, ":"，如果结果模式类型是XSD匿名类型； 否则，"," for the type.":"对于类型。","The namespace of the type.":"该类型的名称空间。"," to include the type in XML schema documents; otherwise, ":"包括XML模式文档中的类型； 否则，","The namespace of the XML type.":"XML类型的名称空间。","The name of the assembly that contains specially built serializers.":"包含专门构建序列化的组件的名称。","The name of the XML type.":"XML类型的名称。"," to serialize.":"序列化。","The type name of the mapped object.":"映射对象的类型名称。"," referenced by the object.":"对象引用。","The XML element name of the mapped object. The default is the class name of the object.":"映射对象的XML元素名称。 默认值是对象的类名。"," that contains namespaces for the generated XML document.":"其中包含生成的XML文档的名称空间。","The XML namespace of the mapped object. The default is an empty string (\"\").":"映射对象的XML名称空间。 默认值是一个空字符串（“”）。"," that contains namespaces and prefixes to use.":"其中包含要使用的名称空间和前缀。","The encoding used in the document.":"文档中使用的编码。"," that can process XPath queries.":"那可以处理XPath查询。"," that can process an XPath query.":"可以处理XPATH查询。"," to be used by ":"要使用"}