{" if the node is being removed.  \n  \n ":"如果节点被删除。"," parts that have been signed with the signature.":"已签名的零件。","The ability to delete a store.":"删除商店的能力。","A new, identical copy of the current ":"电流的新副本","true if the loop ran to completion; otherwise false;":"如果循环完成完成，则为真实； 否则错误；"," if the node did not have a parent.  \n  \n ":"如果节点没有父母。","A list for all of the values currently stored by all of the threads that have accessed this instance.":"当前存储的所有值的列表，该值已访问了本实例的所有线程。","The ability to enumerate the certificates in a store.":"商店中枚举证书的能力。"," from which to construct the ":"从哪个构建","The digital certificate of the signer, or ":"签名人的数字证书，或"," of the attribute":"属性","The ability to enumerate the stores on a computer.":"计算机上列举商店的能力。","The value that was read. This value is the latest written by any processor in the computer, regardless of the number of processors or the state of processor cache.":"读取的价值。 该值是计算机上任何处理器编写的最新值，无论处理器的数量或处理器缓存状态如何。","The character to use for indenting. The default is space.  \n  \n ":"用于缩进的角色。 默认值是空间。"," if the certificate is not stored in the ":"如果证书未存储在","The strong name to compare against the current strong name.":"与当前强名称相比的强名。","  \n  \n When ":"什么时候","The value to write. The value is written immediately so that it is visible to all processors in the computer.":"要写的价值。 该值立即编写，以便计算机中的所有处理器可见。","The ability to open a store.":"开设商店的能力。","The date and time that the signature was created.":"创建签名的日期和时间。",", each attribute is pre-pended with a new line and one extra level of indentation.":"，每个属性都有新的线路和一个额外的凹痕预付。"," if the specified strong name is equal to the current strong name; otherwise, ":"如果指定的强名等于当前的强名称； 否则，","The ability to remove a certificate from a store.":"从商店中删除证书的能力。","The object reference to write. The reference is written immediately so that it is visible to all processors in the computer.":"对象引用写。 该引用立即编写，以便计算机中的所有处理器可见。","The format of the date and time returned by the ":"由","The current node as a boxed object of the most appropriate .NET Framework type.":"当前节点是最合适的.NET框架类型的盒装对象。","The simple name part of the ":"简单名称的一部分","The public key defining the strong name identity namespace.":"定义强名称名称空间的公共密钥。","The .NET Framework ":".NET框架","The value of the tuple's fourth component":"元组的第四个分量的值","The package associated with this signature manager.":"与此签名管理器关联的包。","The strong name public key blob of the software publisher.":"软件出版商的强名称公钥斑点。","The simple name part of the strong name identity. This corresponds to the name of the assembly.":"强名称身份的简单名称部分。 这对应于大会的名称。","The signature that was added as a countersign; or ":"添加为反词的签名； 或者"," representing the XPath type returned by the function":"表示函数返回的XPATH类型",">When this method returns, this instance's value formatted as a span of characters.":">当此方法返回时，此实例的值格式为一个字符的跨度。","The version number of the identity.":"身份的版本编号。"," if no certificate could be located or the user canceled the certificate selection dialog.":"如果无法找到证书或用户取消证书选择对话框。","An array of .NET Framework code entities that belong to a Web service method.":"属于Web服务方法的.NET框架代码实体的数组。","A signed integer that indicates the relative values of the two objects, as shown in the following table.  \n  \n ":"一个指示两个对象的相对值的签名整数，如下表所示。","The version number of the strong name.":"强名称的版本号。","The X.509 certificate to add as a countersign signature.":"X.509证书将添加为柜台签名。","Internal .NET Framework type mappings to the element parts of a WSDL message definition.":"内部.NET框架键入WSDL消息定义的元素部分。"," object, as depicted in the following format. Each component is separated by a period character ('.'). Square brackets ('[' and ']') indicate a component that will not appear in the return value if the component is not defined:  \n  \n major.minor[.build[.revision]]  \n  \n For example, if you create a ":"对象，如以下格式所示。 每个组件都由周期字符（'。'）隔开。 Square Brackets（'['and']）表示一个组件，如果未定义组件，则不会在返回值中出现： \n  \n  major.minor [.build [.revision]] \n  \n  例如，如果您创建一个","A new permission that represents the intersection of the current permission and the specified permission, or ":"表示当前权限与指定权限的交集的新权限，或者 ","The simple name of the ":"简单的名称","The .NET Framework type for which to generate a type mapping.":"用于生成类型映射的.NET框架类型。","The signature that was added as a countersign.":"添加为反词的签名。"," parameter determines how many components are returned.  \n  \n ":"参数确定返回多少个组件。","The simple name of the identity.":"身份的简单名称。"," values that specifies the type of trust manager user interface to use.":"指定要使用的信任管理器用户界面的类型的值。","  \n\n For example, if you create ":"例如，如果您创建","The X.509 certificate to countersign each of the specified ":"X.509证书，以对抗指定的每个证书","Internal .NET Framework mapping of a type to an XML Schema element.":"内部.NET框架映射到XML模式元素。"," that contains the public key of the identity, or ":"其中包含身份的公钥，或"," to call the trust manager; otherwise, ":"致电信托经理； 否则，","The item removed from the collection.":"从集合中删除的项目。","The fully qualified type name of the .NET Framework type for this mapping.":"此映射的.NET框架类型的完全合格的类型名称。"," if there is no key.":"如果没有钥匙。","The list of signatures to countersign.":"要反签名的签名列表。"," to cache state data; otherwise, ":" 以缓存状态数据；否则, ","Object that can be used to cancel the take operation.":"可用于取消操作的对象。","The digital signature used to countersign each of the ":"用于对抗每个的数字签名","The type name of the .NET Framework type for this mapping.":"此映射的.NET框架类型的类型名称。","The version of the identity.":"身份的版本。"," to not prompt the user; ":"不提示用户；","The URI of the digital signature to return.":"数字签名的URI返回。","The namespace of the .NET Framework type for this mapping.":"此映射的.NET框架类型的名称空间。","The item removed from one of the collections.":"该项目从其中一个收藏中删除。","A name to compare against the name specified by the security provider.":"与安全提供商指定的名称进行比较的名称。"," to prompt the user. The default is ":"提示用户。 默认值为","The public key value of the strong name identity expressed as a hexadecimal string.":"强名称的公共密钥价值表示为十六进制字符串。","The digital signature for the specified ":"指定的数字签名","The name of the .NET Framework type.":".NET框架类型的名称。","An object that represents the number of milliseconds to wait, or an object that represents -1 milliseconds to wait indefinitely.":"表示等待毫秒数的对象，或者表示无限期等待-1毫秒的对象。"," object representing the previous ":"代表以前的对象","The .NET Framework namespace of the mapping.":"映射的.NET框架名称空间。"," if a signature for the given ":"如果给定的签名","Always returns true":"总是返回真实","The version number of the strong name identity.":"强名称身份的版本编号。"," cannot be found.":"找不到。","Always the string \"Union\".":"总是字符串“联合”。"," with":"和"," that represents a mapping of a .NET Framework type to an XML Schema element.":" 表示.NET Framework类型到XML架构元素的映射。","The URL of origin for the associated code assembly.":"相关代码组件的原点URL。","The list of uniform resource identifiers (URIs) for the ":"统一资源标识符（Uri）的列表 ","An object containing a public key blob.":"包含公钥blob的对象。"," to use the default comparer":"使用默认比较"," elements to sign.":"要签名的元素。"," that contains the internal .NET Framework mapping of a type to an XML Schema element.":"其中包含将类型的内部.NET框架映射到XML模式元素。"," if the public key blob of the current object is equal to the public key blob of the ":"如果当前对象的公共密钥斑点等于公共密钥斑点","A new, identical copy of the evidence object.":"证据对象的新副本。","The number of elements in the array":"数组中的元素数量","The hash code based on the public key.":"基于公共密钥的哈希代码。","The digital signature used to sign the list of ":"用于签署列表的数字签名"," if XML strings are decoded into valid .NET Framework type names; otherwise, ":"如果将XML字符串解码为有效的.NET框架类型名称； 否则，","The evidence set from which to construct the identity permission.":"构建身份许可的证据。","The equality comparer to use in the search":"搜索中使用的平等比较","The name of the type":"类型的名称"," evidence object to test for equivalence with the current object.":"证据对象测试与当前对象的等效性。","A hexadecimal version of the public key blob.":"公共密钥斑点的十六进制版。","The X.509 certificate to use to digitally sign each of the specified ":"用于数字签名的X.509证书","The comparer implementation to use to compare values for equality and sorting.":"用于比较值的比较实现。","The digital signature used to sign the given list of ":"用于签署给定列表的数字签名","The hash code of the current URL.":"当前URL的哈希代码。","The source object that the raises the ":"提出的源对象"," to request. Only ":"请求。 仅有的"," if no certificate could be found or the user clicked \"Cancel\" in the certificate selection dialog box.":"如果找不到证书或在“证书选择”对话框中单击“取消”的用户。"," if the element is already in the set":"如果元素已经在集合中","The URL from which the code assembly originates.":"代码组件的URL。"," are valid.":"有效。","The delegate that handles the ":"处理的代表","The URL for which to test.":"测试的URL。"," objects to sign.":"对象要签名。","The index of the of the new item to be added":"要添加的新项目的索引","The permission flags to request.":"许可标志要请求。","The object with the event.":"事件的对象。"," should not be called to find the properties of this object. This method never returns ":"不应被调用以找到此对象的属性。 此方法永远不会返回"," if the URL from the specified object is equivalent to the URL contained in the current ":"如果来自指定对象的URL等于当前包含的URL","The X.509 certificate to use to digitally sign each of the specified parts and relationships.":"用于数字签署每个指定零件和关系的X.509证书。"," instance":"实例"," for the type descriptor.":"对于类型的描述符。","The object to add as a listener.":"要添加为侦听器的对象。","The URL for which the membership condition tests.":"成员条件测试的URL。"," if the type descriptor can be accessed from partial trust; otherwise, ":"如果可以从部分信托访问类型的描述符； 否则，","The digital signature used to sign the elements specified in the ":"用于签名的数字签名"," is bound":"是绑定的","A new object to contain listeners to the ":"一个新的对象，可以包含侦听器"," lists.":"列表。","The page to which the option is bound":"该选项绑定的页面","A URL or wildcard expression.":"URL或通配符表达。","The zone of origin for the associated code assembly.":"关联代码程序集的源区域。","The listener to remove.":"听众删除。","An identification string to associate with the signature.":"标识字符串与签名相关联。"," to locate in the collection":"在集合中找到","A URL representing the identity of Internet code.":"代表Internet代码身份的URL。","The URL from which to create the zone.":"创建区域的URL。","A value that indicates whether the event is cancelable.":"指示事件是否可以取消的值。","A new zone with the specified URL.":"带有指定URL的新区域。","The URL to match with the URL specified by the host.":"与主机指定的URL匹配的URL。","A list of custom data objects to sign.":"签名的自定义数据对象列表。","The index at which to insert an item.":"插入项目的索引。"," if the event is to be canceled; otherwise, ":"如果要取消活动； 否则，","The current value of the Web browser permission level.":"Web浏览器权限级别的当前值。","The hash code of the current zone.":"当前区域的哈希码。","A list of references to custom objects to sign.":"签名自定义对象的引用列表。","The index at which to remove the item.":"删除项目的索引。","The zone from which the code assembly originates.":"代码组件起源的区域。"," if the event is cancelable, otherwise, ":"如果事件可取消，则否则，","The state of the current Web browser permission level.":"当前Web浏览器权限级别的状态。","The index at which to set the item.":"设置项目的索引。","The X.509 certificate to verify.":"X.509证书要验证。"," for which to test.":"要测试。","The zone identifier.":"区域标识符。","The registered name of a dependency property or an attached property.":"依赖属性或附件属性的注册名称。"," (value 0) if the certificate verified successfully; otherwise, a bitwise enumeration of error flags.":"（值0）如果证书成功验证； 否则，错误标志的位枚举。","The old object.":"旧对象。"," of the object that owns the property definition.":"拥有属性定义的对象。"," if the zone from the specified object is equivalent to the zone contained in the current ":"如果指定对象的区域等于当前包含的区域","The evidence set against which to make the test.":"进行测试的证据。"," to exit on first failure; otherwise, ":"首次失败退出； 否则，","The new object.":"新对象。"," of the object you want to set the property for.":"您要设置属性的对象。","The zone for which the membership condition tests.":"成员条件测试的区域。","A new, identical copy of the current membership condition.":"当前会员条件的新副本。","Specifies to ignore the property type.":"指定忽略属性类型。"," to get or set in the collection":"获取或设置在集合中","The security context for the current thread.":"当前线程的安全上下文。"," to continue and check all signatures.":"继续并检查所有签名。","The object to compare to ":"比较的对象","If the property described by ":"如果由"," if the specified membership condition is an ":"如果指定的会员条件是"," if the flow has been suppressed; otherwise, ":"如果流动被抑制； 否则，"," (value 0) if all signatures are verified successfully; otherwise, an enumeration that identifies the error.":"（值0）如果成功验证了所有签名； 否则，可以识别错误的枚举。"," to remove from the collection":"从集合中删除"," is a dependency property, returns a valid ":"是依赖性属性，返回有效","The policy level context used to resolve named permission set references.":"用于解决命名权限集引用的策略级别上下文。","The security context to set.":"要设置的安全上下文。"," to get in the collection":"进入收藏","A URI string that identifies the default hash algorithm used to create and verify signatures.":"标识用于创建和验证签名的默认哈希算法的URI字符串。",". Otherwise, returns a ":"。 否则，返回","The hash code for the current membership condition.":"当前会员条件的哈希代码。"," URI identifier for the ":"URI标识符","The delegate that represents the method to run in the specified security context.":"代表在指定的安全上下文中运行的方法的委托。","The identifier for a dependency property.":"依赖属性的标识符。","The internal stream buffer size.":"内部流缓冲区大小。","A representation of the membership condition.":"会员条件的代表。","A structure for restoring the flow.":"恢复流量的结构。"," instance used to create and verify signatures.":"实例用于创建和验证签名。","The type of the object where the property is set.":"设置属性的对象的类型。","The maximum number of records to retrieve.":"要检索的最大记录数。","The policy level context for resolving named permission set references.":"解决命名权限集引用的策略级别上下文。"," for the provided dependency property.":"对于提供的依赖属性。",". This value does not include rows affected by statements that do not return rows.":"。 此值不包括受不返回行的语句影响的行。"," if the package contains signatures; otherwise, ":"如果包装包含签名； 否则，"," if the stack contains no partially trusted application domains, no partially trusted assemblies, and no currently active ":"如果堆栈不包含部分信任的应用程序域，没有部分信任的程序集，并且当前没有活动","The path of the application directory.":"应用程序目录的路径。"," modifiers; ":"修饰符；","The errors generated by the .NET Framework data provider when the ":".NET框架数据提供商生成的错误","The requested value.":"请求的值。","A new, identical copy of the ":"一个新的，相同的副本","The handle of the parent window to use to display the certificate selection dialog box.":"用于显示“证书选择”对话框的父窗口的句柄。","builder":"建筑商"," if the common language runtime cannot guarantee that the stack contains none of these.":"如果通用语言运行时无法保证堆栈不包含这些内容。"," collection of attributes.":"属性的收集。","The URI of the signature origin part.":"签名起源部分的URI。","An object of same type as the current evidence object.":"与当前证据对象相同类型的对象。","None.":"没有任何。","The host evidence to match to a permission set.":"主机证据与权限集匹配。"," that represents the type of component this property is bound to. When ":"这表示该属性与之绑定的组件类型。 什么时候"," if the two instances are equivalent; otherwise, ":"如果两个实例是等效的； 否则，","The type of default signature origin relationship.":"默认签名来源关系的类型。"," are invoked, the object specified might be an instance of this type.":"被调用，指定的对象可能是此类型的实例。","The attributes":"属性","A permission set that can be used as a grant set for the application that has the provided evidence.":"可以用作具有提供证据的应用程序的赠款集。","The date/time format used to create a signature ":"用于创建签名的日期/时间格式"," objects; otherwise a null value if no ":"对象； 否则，如果没有，则无效","The hash code of the current application directory.":"当前应用程序目录的哈希代码。","The dependency property identifier.":"依赖关系属性标识符。","A dictionary that contains each defined ":"一个包含每个定义的词典","An output parameter that contains an ":"包含一个输出参数"," with the specified name, or -1 if the table does not exist in the collection.  \n  \n ":"使用指定的名称，或-1，如果表格中不存在表。","A representation of the state of the ":"表示状态的代表","A callback that designers use to modify the effective value of a dependency property before the dependency property value is stored in the dependency property engine.":"设计人员使用的回调在依赖属性属性引擎中存储之前，它用于修改依赖关系属性的有效值。"," and its associated XML ":"及其相关的XML"," of granted ":"理所当然","The zero-based column ordinal":"基于零的列序"," identifier.":"标识符。"," evidence object.":"证据对象。"," if the member can be set during run time. If there is no ":"如果可以在运行时间设置成员。 如果没有","An XmlWriter":"XMLWriter","The permission to test against the grant of the caller.":"允许对呼叫者的授予进行测试。"," if the specified evidence satisfies the membership condition; otherwise, ":"如果规定的证据满足会员条件； 否则，","The user of the ":"用户",", the return value is the default, which is ":"，返回值是默认值，","The policy level context, used to resolve named permission set references.":"策略级别上下文，用于解决命名的权限集引用。","An enumeration of string-string key-value pairs.":"字符串键值对的枚举。"," if the permissions granted to the caller include the permission ":"如果授予呼叫者的许可包括许可"," to be deleted.":"被删除。","The name to display for the property.":"属性显示的名称。","The physical file path to a file containing the security policy information.":"包含安全策略信息的文件的物理文件路径。","A string representation of the state of the membership condition.":"成员资格条件状态的字符串表示形式。","An enumeration of string-string key-value-pairs.":"字符串键 - 值对的枚举。","A collection of user and ":"用户的集合"," if the property is an attached property; otherwise, ":"如果财产是附属财产； 否则，","One of the enumeration values that specifies the type of the policy level to be loaded.":"指定要加载策略级别的类型的枚举值之一。","The amount of time, in milliseconds, to wait for the associated process to exit. The maximum is the largest possible value of a 32-bit integer, which represents infinity to the operating system.":"等待相关过程退出的时间，以毫秒为单位。 最大值是32位整数的最大值，它代表了操作系统的无穷大。"," that uniquely identifies an application.":"这独特地标识了一个应用程序。"," was specified on the property; otherwise, ":"在该物业上指定； 否则，"," key/value pairs that are contained in the rights managed protected package.":"权利托管保护包中包含的键/价值对。"," that indexes the modules in the collection":"索引集合中的模块","A default permission set that is granted to all assemblies that do not have specific grants.":"授予所有没有特定赠款的所有组件的默认权限集。","The embedded ":"嵌入式"," constructor of the value true; otherwise, ":"值真实的构造函数； 否则，","The loaded policy level.":"加载的策略级别。","Gets or sets the rate at which this metric should be displayed":"获取或设置此衡量指标的显示速率",", if the package does not contain a ":"，如果包装不包含","An array of strong names that represent assemblies that should be considered fully trusted in an application domain.":"代表组件的一系列强名称，应被视为在应用程序域中完全信任的组件。","The dependency property metadata.":"依赖性属性元数据。"," to add":"添加","The XML representation of a security policy level in the same form in which it appears in a configuration file.":"安全策略级别的XML表示形式以相同的形式出现在配置文件中。","The user or user group to return the ":"用户或用户组返回"," for the application trust object.":"对于应用程序信任对象。"," structure ¾ for example, {X=20, Y=20, Width=100, Height=50}":"结构¾，例如{x = 20，y = 20，宽度= 100，高度= 50}"," of the dependency property.":"依赖属性。"," objects that compose the security policy hierarchy.":"组成安全策略层次结构的对象。"," for the specified user; or ":"对于指定的用户； 或者"," structure to be converted":"结构要转换"," describing the default grants.":" 描述默认授予。"," if notifications for this property may originate from outside the property descriptor, such as from the component itself. ":"如果此属性的通知可能起源于属性描述符外部，例如组件本身。","The set of permissions that can be granted by the security system.":"安全系统可以授予的一系列权限。"," that matches the given ":"与给定的","Object to test for value equality":"对象测试价值平等的对象","An object containing additional security information about the application.":"包含有关应用程序的其他安全信息的对象。"," if notifications will only originate from direct calls made to ":"如果通知只能源于直接呼叫","The publish license to store and embed in the package.":"发布许可证以存储并嵌入包装。","The required permissions the code needs to run.":"代码需要运行所需的权限。","The bits to write":"写的碎片","A list of full-trust assemblies.":"全值组件的列表。","The source object that raises the ":"引发的源对象 ","The use license to store and embed in the package.":"存储和嵌入包装的使用许可证。","The optional permissions that will be used if granted, but aren't required for the code to run.":"如果授予，则将使用的可选权限，但不需要该代码运行。"," if the application is trusted to run; otherwise, ":"如果该应用程序被信任运行； 否则，","The boxed enumeration value to write":"要写入的盒装枚举值","The denied permissions that must never be granted to the code even if policy otherwise permits it.":"即使政策否则允许，拒绝的权限也绝对不得不授予代码。"," for accessing the rights management information.":"用于访问权利管理信息。","The item to return group names for.":"返回组名称的项目。"," if application trust information is persisted; otherwise, ":"如果持续存在应用程序信任信息； 否则，"," that is the destination of the elements copied from the current collection.":"那是从当前集合复制的元素的目的地。","The enumeration value to write":"写作的枚举价值","The digital signature being verified.":"数字签名正在验证。","The level of grouping.":"分组的水平。","An output parameter that contains the set of permissions not granted.":"包含未授予的权限集的输出参数。"," to supply to the converter.":"向转换器提供。","The set of permissions that would be granted by the security system.":"安全系统将授予的一系列权限。","The signature verification error.":"签名验证错误。"," object describing the application to find.":"描述要查找的应用程序的对象。","The array to store decompressed bytes.":"存储解压缩字节的阵列。","The group name(s) for the given item.":"给定项目的组名称。","The path to the destination directory on the file system. The directory specified must not exist, but the directory that it is contained in must exist.":"文件系统上的目标目录的路径。 指定的目录一定不存在，而是必须存在的目录。","The name for the new stream.":"新流的名称。","An array of evidence objects used to evaluate policy.":"用于评估政策的一系列证据对象。"," containing all matching ":"包含所有匹配","The name of the group to check.":"要检查的组名称。"," to indicate that existing files are to be overwritten; ":"指出现有文件应被覆盖；","The new stream with the specified ":"带有指定的新流"," that can be used to iterate over the collection.":"可以用来迭代集合。","The set of permissions that is appropriate for all of the provided evidence.":"适合所有提供的证据的许可集。","The name of the item to check.":"要检查的项目名称。","The compression option for the data stream.":"数据流的压缩选项。","One of the enumeration values that specifies whether the file will be opened with read, write, or read/write access":"指定是否将使用读，写或读/写访问打开文件的枚举值之一","The evidence set against which the policy is evaluated.":"评估政策的证据。"," object to be removed.":" 要移除的对象。"," if the names match and the item belongs to the group; otherwise, ":"如果名称匹配并且该项目属于该组； 否则，"," values":"值","The encryption option for the data stream.":"数据流的加密选项。"," property value should be serialized; otherwise, ":"财产价值应序列化； 否则，"," that contains items to be removed from the current collection.":"其中包含要从当前集合中删除的项目。"," to release only unmanaged resources":"仅发布非管理资源","An enumeration of the set of code groups matching the evidence.":"一组与证据相匹配的代码组的列举。","The name for the new child data store.":"新儿童数据存储的名称。","The number of items contained in the collection.":"集合中包含的项目数。","A custom comparer that sorts groups using an object that implements ":"使用实施对象对组进行分类的自定义比较","The policy level object to be saved.":"保存的策略级别对象。",". This can be null for static members.":"。 对于静态成员来说，这可能是无效的。","The new child data store.":"新的儿童数据存储。","The collection of names that are used to initialize a group with a set of subgroups with the given names.":"用于初始化一组带有给定名称的子组的组的名称的集合。"," if code must have ":"如果代码必须具有","The zero-based index of the object within the collection.":"集合内对象的从零开始的索引。"," node with the specified name and type":"带有指定名称和类型的节点"," name of the stream to delete.":"删除流的名称。","The collection of sort criteria in which to sort the groups.":"排序组的排序标准的集合。"," object for the specified application, or ":"指定应用程序的对象，或"," in order to execute; otherwise, ":"为了执行； 否则，"," property of the result":"结果的属性","The name of the sub-store to delete.":"删除子商店的名称。"," if the item belongs to this collection view; otherwise, ":"如果该项目属于此集合视图； 否则，"," if security is enabled; otherwise, ":"如果启用了安全性； 否则，"," if the object cannot be found.":"如果找不到对象。"," if no value should be passed":"如果不应该通过的价值"," instance to return.":"实例要返回。"," if the state is available; otherwise, ":"如果国家可用； 否则，"," object that you can use to dispose of the calling object.":"您可以用来处置调用对象的对象。","The object to use to synchronize access to the collection.":"用于同步访问集合的对象。","The language's unique identifier":"该语言的唯一标识符","The item to set as the ":"要设置为","The line number of the XML stream where the XML syntax error was detected.":"检测到XML语法误差的XML流的线号。","The stream with the specified ":"带有指定的流"," selected from the input sequence":"从输入序列中选择","The URI scheme represented by the current instance.":"当前实例表示的URI方案。"," if the resulting ":"如果结果","The name of the computer on which the service resides.":"服务所在的计算机名称。"," that contains values of type TSource selected from the input sequence.":"其中包含从输入序列中选择的类型tsource的值。"," objects, each pointing to an I/O steam defined within this store.":"对象，每个指向该商店中定义的I/O蒸汽。","The short name that identifies the service to the system.":"标识系统服务的简短名称。"," is within the view; otherwise, ":"在视野内； 否则，","The port represented by the current instance.":"当前实例表示的端口。","The name of the sub-store to return.":"返回子店的名称。","The name of the computer that is running the service associated with the ":"正在运行与之关联的服务的计算机名称","Options to control the behavior during deserialization, the default options are ":"控制次要化期间行为的选项，默认选项是"," is an item within the view; otherwise, ":"是视图中的项目； 否则，","The port represented by the returned instance.":"由返回实例表示的端口。","The child sub-store with the specified ":"带有指定的儿童子店","The name of the service.":"服务的名称。"," is the specified header exists in the collection; otherwise ":"集合中的指定标头是否存在； 否则","The index to set the ":"设置的索引"," instance for the specified port.":"指定端口的实例。"," objects, each pointing to a sub-store defined within this store.":"对象，每个指向该商店中定义的子店。"," is the specified header ":"是指定的标题"," if this view support filtering; otherwise, ":"如果此视图支持过滤； 否则，"," that receives the copied permission entries.":" 即接收复制的权限条目。"," name to check for.":"要检查的名称。"," if the two objects represent the same scheme and port; otherwise, ":"如果两个对象表示相同的方案和端口； 否则，","The number of headers in a collection":"集合中的标题数"," if this view supports grouping; otherwise, ":"如果此视图支持分组； 否则，"," is a subset of the specified ":"是指定的子集"," if a stream with the specified ":"如果指定的流"," value that identifies a computer port used in conjunction with the ":"标识与该计算机端口一起使用的值"," if this view supports sorting; otherwise, ":"如果此视图支持排序； 否则，","The content of a message":"消息的内容"," exists; otherwise, ":"存在； 否则，"," that represents the union of the current permission and the specified permission.":"这代表了当前许可和指定许可的联合。"," that identifies a URI scheme, converted to lowercase.":"这标识了URI方案，转换为小写。","The culture to use during sorting.":"分类期间使用的文化。"," value that specifies the total number of packets in the output queue.":"指定输出队列中数据包总数的值。"," if a child sub-store with the specified ":"如果指定的儿童子店"," enumeration value.":"枚举价值。","A membership condition that tests evidence to determine whether this code group applies policy.":"测试证据以确定该代码组是否应用策略的会员条件。","The current item of the view or ":"视图的当前项目或","The name of this store.":"这家商店的名称。"," containing the XML encoding to use to reconstruct the permission object.":"包含用于重建权限对象的XML编码。"," that initiated the authentication challenge.":"这引发了身份验证挑战。","The policy statement for the code group in the form of a permission set and attributes to grant code that matches the membership condition.":"代码组的策略声明以权限集的形式和属性授予与成员资格条件相匹配的代码。"," if there is no current item.":"如果没有当前项目。","The I/O stream opened in a default ":"I/O流以默认为打开"," associated with this request.":"与此请求相关联。"," that represents the intersection of the current permission and the specified permission; otherwise, ":"代表当前许可和指定许可的交集； 否则，"," root ":"根","The code group to be added as a child. This new child code group is added to the end of the list.":"小时候要添加的代码组。 这个新的子代码组添加到列表的末尾。","The ordinal position of the ":"序序位置","The file mode in which to open the stream.":"打开流的文件模式。"," to combine with the current permission. It must be of the same type as the current ":"与当前许可结合使用。 它必须与当前类型相同"," to an Internet resource.":"进入互联网资源。","An equivalent copy of the current code group, including its membership conditions and child code groups.":"当前代码组的等效副本，包括其成员资格条件和子代码组。"," within the view.":"在视图中。","The stream opened in the specified file ":"在指定文件中打开的流"," delegate":"代表"," containing the XML encoding of the permission object, including any state information.":"包含权限对象的XML编码，包括任何状态信息。","The XML encoding to which to add the serialization.":"XML编码要添加序列化的编码。","A method used to determine if an item is suitable for inclusion in the view.":"一种用于确定项目是否适合包含在视图中的方法。","The policy level within which the code group exists.":"代码组存在的策略级别。","The file access mode in which to read or write to the stream.":"可以在其中读取或写入流的文件访问模式。"," representing the resource associated with the request":"代表与请求关联的资源"," that is the new ":"那是新的"," objects that describe how the items in the collection are grouped in the view.":"描述集合中的项目在视图中分组的对象。","The I/O stream opened in the specified ":"指定的I/O流打开"," parameter will be raised upon completion of the operation.  \n  \n ":"操作完成后将提出参数。","An enumerable set of specific ":"一组特定的","The code group to compare with the current code group.":"与当前代码组进行比较的代码组。","A read-only collection of the top-level groups or ":"顶级组的仅阅读集或"," and with a given ":"并给定","The defining ":"定义"," is a  dual-mode socket; otherwise, ":"是双模式插座； 否则，"," if the specified code group is equivalent to the current code group; otherwise, ":"如果指定的代码组等于当前代码组； 否则，"," if there are no groups.":"如果没有组。","The compression option setting for the package stream.":"软件包流的压缩选项设置。"," to compare child code groups, as well; otherwise, ":"也比较儿童代码组； 否则，","The specific ":"具体"," of the view is beyond the end of the collection; otherwise, ":"视图超出了收藏的尽头； 否则，","The encryption option setting for the package stream.":"软件包流的加密选项设置。","A user-defined object that is passed to the method invoked when the asynchronous operation completes":"异步操作完成时传递给所调用方法的用户定义对象","The hash code of the current code group.":"当前代码组的哈希代码。"," exists as an item in the ":"作为项目存在于"," of the view is beyond the beginning of the collection; otherwise, ":"视图超出了收藏的开始； 否则，","Does the Framework test the response or the request?":"框架是否测试响应或请求？","The name of this stream.":"此流的名称。","The code group to be removed as a child.":"小时候要删除的代码组。","The second matrix to care":"第二个护理矩阵"," list of the current ":"列表"," if the resulting view is empty; otherwise, ":"如果结果视图为空； 否则，","The evidence for the assembly.":"大会的证据。","The user the access right is granted to.":"用户授予访问权限。","The resulting integral vector":"由此产生的积分向量","The access right that is granted.":"授予的访问权。"," to intersect with the current ":"与电流相交","A policy statement that consists of the permissions granted by the code group with optional attributes, or ":"由具有可选属性的代码组授予的权限或"," objects that describe how the items in the collection are sorted in the view.":"描述集合中的项目在视图中如何排序的对象。","The namespace to be used in evaluating locals and watches for the current active lexical scope":"用于评估当前活动词汇范围的当地人和手表的名称空间",". This new permission is ":"。 这个新的许可是"," if the code group does not apply (the membership condition does not match the specified evidence).":"如果代码组不应用（成员条件不符合指定的证据）。"," object that is the underlying collection.":"对象是基础集合。","A string representing the common language runtime version.":"表示通用语言运行时版本的字符串。","The starting date and time that the right begins.":"右开始的开始日期和时间。","A permission that is to be tested for the subset relationship. Can be ":"要测试子集关系的许可。 可","The ending date and time that the right expires.":"正确的结束日期和时间到期。",", walks up this property's inheritance chain to find the custom attributes":"，走上该属性的继承链以查找自定义属性","The newly created view.":"新创建的视图。"," that is the root of the tree of matching code groups.":"那是匹配代码组的树的根。"," denotes unrestricted permissions. ":"表示无限制的许可。"," if the collection view supports turning live filtering on or off; otherwise, ":"如果收集视图支持打开或关闭实时过滤； 否则，","The type of the field":"字段的类型","A string representation of the attributes of the policy statement for the code group.":"代码组的策略语句属性的字符串表示。"," has specific access level restrictions in ":"具有特定的访问级限制","The access right that is granted to the ":"授予的访问权限 "," if the collection view supports turning live grouping on or off; otherwise, ":"如果收集视图支持打开或关闭现场分组； 否则，","A list of child code groups.":"子代码组列表。","Read-only. Retrieves the GUID of this type":"只读。 检索这种类型的指导",", or has no permissions.":"，或没有权限。"," if the collection view supports turning live sorting on or off; otherwise, ":"如果收集视图支持打开或关闭现场分类； 否则，",", as specified to the ":"，指定","An XML encoding of this ":"XML编码","The description of the code group.":"代码组的描述。"," if the type is nested or defined in a root namespace,":"如果类型是在根名称空间中嵌套或定义的，则"," if filtering data in real time is enabled; ":"如果启用实时过滤数据；","The membership condition that determines to which evidence the code group is applicable.":"确定代码组适用的证据的成员条件。","The user that the access ":"用户访问","A memory block that starats at ":"一个开始的内存块",", including any state information.":"，包括任何状态信息。"," if live filtering is not enabled; ":"如果未启用实时过滤；"," is granted to, as specified to the ":"被授予","A description of the merge logic for the code group.":"代码组合并逻辑的描述。"," to be used to read the Portable PDB,.":" 以用于读取便携式PDB，。"," that represents the union of the current ":"代表当前的结合"," if it cannot be determined whether the collection view implements live filtering.":"如果无法确定收集视图是否实时过滤。","A read-only list of ":"仅阅读列表","The start date and time that the granted ":"授予的开始日期和时间"," if grouping data in real time is enable; ":"如果实时对数据进行分组；","The generated COM interface that can be passed outside the .NET runtime.":"可以在.NET运行时传递的生成的COM接口。","The name of the code group.":"代码组的名称。"," values, or ":"值，或"," if live grouping is not enabled; ":"如果未启用实时分组；","The index position of an existing character in this secure string":"此安全字符串中现有字符的索引位置","The name of a named permission set of the policy level.":"策略级别的命名权限集的名称。"," begins, or ":" 开始，或 "," if it cannot be determined whether the collection view implements live grouping.":"如果无法确定收集视图是否实时分组。"," to a .wav file.":"到.wav文件。","The loaded assembly, or ":"加载的组件，或"," if sorting data in real time is enable; ":"如果实时分类数据是启用的；","The policy statement for the code group.":"代码组的策略语句。"," if there is there is no starting limitation.":"如果没有起始限制。","The location of a .wav file to load.":"加载.WAV文件的位置。","The maximum nested node depth. The default is 32;":"最大嵌套节点深度。 默认值为32;","The end date and time that the granted ":"授予的结束日期和时间"," values. This value is used to construct the ":"值。 此值用于构造"," if a .wav file is loaded; ":"如果加载了.wav文件；"," if live sorting is not enabled; ":"如果未启用实时排序；","The pathname of the base directory that the assembly resolver uses to probe for assemblies.":"组装固化器用来探测组件的基本目录的路径名。"," expires, or ":"到期，或"," if it cannot be determined whether the collection view implements live sorting.":"如果无法确定收集视图是否实时排序。"," if a .wav file has not yet been loaded.":"如果尚未加载.WAV文件。"," that is granted.":"被授予。","A Boolean value.":"布尔值。"," if there is no ending limitation.":"如果没有结局限制。","The number of milliseconds to wait. The default is 10000 (10 seconds).":"等待的毫秒数。 默认值为10000（10秒）。","A policy statement consisting of the permissions granted by the code group with optional attributes, or ":"一个由具有可选属性的代码组授予的权限组成的政策声明，或","A collection of strings that specify the properties that participate in filtering data in real time.":"一系列字符串，这些字符串指定实时过滤数据的属性。","A character to convert.":"一个要转换的角色。","The user or group name.":"用户或组名称。","The file path or URL from which to load a .wav file, or ":"文件路径或从中加载.wav文件的URL或","The string \"Union\".":"字符串“联合”。","A collection of strings that specify the properties that participate in grouping data in real time.":"一系列字符串，指定实时参与数据分组的属性。","A character formed by two bytes beginning at ":"从两个字节形成的字符","The method for authentication.":"身份验证的方法。","The concatenation of the string \"Same directory FileIO - \" and the access type.":"字符串“相同目录fileio-”和访问类型的串联。"," if no file path is present. The default is ":"如果没有文件路径。 默认值为","A collection of strings that specify the properties that participate in sorting data in real time.":"一系列字符串，指定实时参与数据的属性。","A double precision floating point number formed by eight bytes beginning at ":"从八个字节形成的双精度浮点数","An equivalent copy of the code group, including its membership conditions and child code groups.":"代码组的等效副本，包括其成员条件和子代码组。"," from which to load the .wav file, or ":"从哪个加载.wav文件或","The new item that is added to the collection.":"添加到集合中的新项目。","A double-precision floating-point value representing the converted bytes.":"代表转换字节的双精度浮点值。"," if no stream is available. The default is ":"如果没有流。 默认值为","The string \"First Match\".":"字符串“第一匹配”。","The user instance to compare for equality.":"要比较相等性的用户实例。","The item to edit.":"要编辑的项目。","The array of bytes.":"字节的数组。","An equivalent copy of ":"等效副本的"," are the same for both this user and the given user; otherwise, ":"该用户和给定的用户都是相同的； 否则，"," that contains data about the ":"其中包含有关","The position of the item to remove.":"要移除的物品的位置。","The collection to compare to the current set":"与当前集合进行比较的集合"," program event in the current Windows sound scheme.":"当前Windows声音方案中的程序事件。","A hash code computed from the user ":"从用户计算的哈希代码"," from which to construct the identity permission.":" 从中构造身份许可。"," if a new item can be added to the collection; otherwise, ":"如果可以将新项目添加到集合中； 否则，"," are equal.  \n  \n -or-  \n  \n A null reference (":"相等。 \n  \n  -或者- \n  \n  null引用（","The X.509 certificate to display.":"显示的X.509证书。"," if the user is currently authenticated; otherwise, ":"如果当前对用户进行身份验证； 否则，","A new identity permission that corresponds to the current object.":"与当前对象相对应的新身份权限。"," if the collection view can discard pending changes and restore the original values of an edited object; otherwise, ":"如果收集视图可以丢弃待处理并恢复编辑对象的原始值； 否则，",".  The default is ":"。 默认值为","A handle to the parent window to use for the display dialog.":"用于显示对话框的父窗口的句柄。","The identifier of the static analysis tool rule to be suppressed.":"要抑制的静态分析工具规则的标识符。"," if an item can be removed from the collection; otherwise, ":"如果可以从集合中删除一个项目； 否则，"," against which to make the test.":"对此进行测试。"," until authenticated.":"直到经过身份验证。","A fully qualified path that represents the target of the attribute.":"代表属性目标的完全合格的路径。","A collection of X.509 certificates to select from.":"X.509证书的集合。"," that contains the XML encoding to use to reconstruct the security object.":"其中包含用于重建安全对象的XML编码。","The item that is being added if ":"如果要添加的项目","An instance of the \"Anyone\" ":"“任何人”的实例","An array of string where each element contains a command-line argument. The first element is the executable file name, and the following zero or more elements contain the remaining command-line arguments.":"每个元素包含命令行参数的字符串数组。 第一个元素是可执行文件名称，以下零或更多元素包含剩余的命令行参数。"," context for resolving ":"解决的上下文","The item in the collection that is being edited if ":"集合中的项目正在编辑，如果","0 (zero).":"0（零）。"," persona.":"角色。","The path to the specified system special folder, if that folder physically exists on your computer; otherwise, an empty string (\"\").  \n  \n A folder will not physically exist if the operating system did not create it, the existing folder was deleted, or the folder is a virtual directory, such as My Computer, which does not correspond to a physical path.":"如果该文件夹在您的计算机上存在物理存在，则指定系统特殊文件夹的路径； 否则，一个空字符串（“”）。 \n  \n  如果操作系统未创建它，将现有文件夹删除，或者该文件夹是虚拟目录，例如我的计算机，则该文件夹将不存在，例如我的计算机，它与物理路径不符。","The title of the dialog box.":"对话框的标题。"," if an add transaction is in progress; otherwise, ":"如果正在进行添加交易； 否则，","A string representation of the membership condition.":"会员条件的字符串表示。"," specified to the ":"指定为","The 32-bit signed integer that specifies the number of processors on the current machine. There is no default. If the current machine contains multiple processor groups, this property returns the number of logical processors that are available for use by the common language runtime (CLR).":"32位签名的整数指定当前计算机上的处理器数量。 没有默认值。 如果当前的计算机包含多个处理器组，则此属性将返回通用语言运行时（CLR）可用的逻辑处理器的数量。"," that contains the XML encoding of the security object, including any state information.":"其中包含安全对象的XML编码，包括任何状态信息。"," if an edit transaction is in progress; otherwise, ":"如果正在进行编辑交易； 否则，","A descriptive message to guide the user.  The message is displayed in the dialog box.":"描述性消息来指导用户。 该消息显示在对话框中。","The user or group name specified to the ":"用户或组名称指定为"," if this is a concurrent GC (BGC); ":"如果这是并发GC（BGC）；","One of the enumeration values that specifies the position of the new item placeholder in the collection view.":"指定新项目占位符在收集视图中的位置的枚举值之一。"," values that specifies whether single or multiple selections are allowed.":"指定单一选择还是多个选择的值。","The assembly for which to compute the hash value.":"计算哈希值的组件。","An instance of the \"Owner\" ":"“所有者”的实例","A number representing the total objects observed by this GC that are ready for finalization.":"代表该GC观察到的总体对象的数字已准备好完成。"," object that contains the selected certificate or certificates.":"包含所选证书或证书的对象。","A byte array that contains an ":"包含一个字节数组","The cipher text to decrypt.":"密码文本解密。","The object that is added to the collection.":"添加到集合中的对象。","A handle to the parent window to use for the display dialog box.":"“父窗口”的句柄用于显示对话框。","An integer representing the total fragmentation when the last garbage collection occurred.":"当发生最后垃圾收集时，代表总碎片的整数。","The decrypted clear text of ":"解密的清晰文本"," hash value.":"哈希值。"," if a specified object can be added to the collection; otherwise, ":"如果可以将指定的对象添加到集合中； 否则，","The assembly for the request.":"请求的组件。","A number representing the generation this GC collected.":"代表该GC收集的一代的数字。","The clear text content to encrypt.":"清晰的文本内容要加密。","An object that contains the hash value provided by the ":"包含由","A collection that contains information about the properties that are available on the items in a collection.":"包含有关集合中项目可用属性的信息的集合。","Encrypted cipher text of the given ":"给定的加密密码文本","A byte array that contains a ":"包含一个字节数组"," instance, with the ":"实例，与","A read-only span containing the generation information for all generations.":"仅读取的跨度，其中包含所有世代的生成信息。","An object that contains additional information about the property.":"包含有关该属性的其他信息的对象。"," value used as source information for ":"用作源信息的价值","A hash object that contains the hash value provided by the ":"一个包含由hash值提供的哈希对象","A number representing the index of this GC.":"代表此GC索引的数字。","The cipher block size, in bytes.  The default block size for Advanced Encryption Standard (AES) is 8.":"密码块大小，字节。 高级加密标准（AE）的默认块大小为8。","The hash algorithm to use to compute the hash value for the assembly.":"用于计算组件的哈希值的哈希算法。","The name of the property that exists on ":"存在的财产名称","The assembly name for the request.":"请求的汇编名称。","A collection enumerating the rights that passed verification and that are granted to the user.":"列举通过验证并授予用户的权利的集合。","A byte array that represents the hash value for the assembly.":"代表组件的哈希值的字节数组。"," upon which to listen for changes. Set to ":"聆听变化。 调成","A string that is parsed as an assembly-qualified type name.":"作为组装合格类型名称解析的字符串。","The memory load when the last garbage collection occurred.":"上次垃圾回收时的内存负载。"," grants the user rights to decrypt; otherwise, ":"授予解密的用户权利； 否则，","A representation of the current ":"电流的表示"," to indicate \"any property\".":"指示“任何财产”。"," grants the user rights to encrypt; otherwise, ":"授予用户加密的权利； 否则，"," determined by reflection on the type.":" 型上的反射而确定。","A number representing the pause time percentage.":"一个代表暂停时间百分比的数字。","Source object to remove all listeners from.":"源对象以删除所有侦听器。"," hash value for the assembly.":" 程序集的哈希值。"," if the buffer passed to ":"如果缓冲区传递到","A number representing the total pinned objects observed by this GC.":"代表该GC观察到的总固定对象的数字。","The data to purge. This is expected to be a ":"清除数据。 预计这将是一个"," to request access for.":"请求访问。","The hash value for which to test.":"测试的哈希值。"," can be a different length from the buffer passed to ":"可以与传递给缓冲区的长度不同"," of the assembly for which this ":"在其中的集会","A number representing the number of promoted bytes for this GC.":"代表此GC的促进字节数的数字。"," to stop listening and to completely remove all data.":"停止聆听并完全删除所有数据。"," from the specified object is equivalent to the ":"从指定的对象等同于"," if the buffers passed to ":"如果缓冲区传递给"," determines permissions.":"确定权限。","A number representing the total commited bytes of the managed heap.":"代表托管堆的总字节的数字。"," contained in the current ":"电流中包含"," must be the exact same length.  For AES the default is ":"必须是完全相同的长度。 对于AES默认为"," if some entries were removed; otherwise, ":"如果删除了一些条目； 否则，"," object that represents:  \n  \n The invariant culture, if ":"代表的对象： \n  \n  不变的文化，即"," for this serialization.":"对于这个序列化。","The unqualified string name of the type for which this ":"此类型的不合格的字符串名称"," upon which to stop listening for changes. Set to ":"停止聆听更改。 调成","\n            Number of chars requested beyond current position.\n            ":"要求超出当前位置的字符数量。"," is an empty string (\"\").  \n  \n -or-  \n  \n The specific culture associated with ":"是一个空字符串（“”）。 \n  \n  -或者- \n  \n  与","The hash algorithm to use for the membership condition.":"用于会员条件的哈希算法。","The value for the locale ":"区域设置的值 ","Whether the box should be checked.":"是否应该检查盒子。"," is a neutral culture.  \n  \n -or-  \n  \n The culture specified by ":"是一种中立的文化。 \n  \n  -或者- \n  \n  由","The object to remove the listener from.":"要从中删除侦听器的对象。","The hash value for which the membership condition tests.":"成员条件测试的哈希值。","The object to compare the ":"比较的对象"," class.  \n  \n -or-  \n  \n The value of the ":"班级。 \n  \n  -或者- \n  \n  价值","The evidence from which to create the new identity permission.":"创建新身份许可的证据。","The object on which to start listening for ":"开始聆听的对象"," is 0 through 99, it is interpreted as being between 1930 and 2029, as explained in the \"Remarks\" section below. If ":"是0到99，它被解释为在1930年至2029年之间，如下“备注”部分所述。 如果"," properties of.":"属性。","The new identity permission.":"新的身份许可。"," class.  \n  \n -or-  \n  \n null, if ":"班级。 \n  \n  -或者- \n  \n  null，如果","The source object on which to stop listening for ":"源对象停止聆听"," value representing a specified year, month, and day, with the time information set to midnight (00:00:00).":"代表指定年，月和日的值，将时间信息设置为午夜（00:00:00）。"," properties of the given object match those of this instance; otherwise, ":"给定对象的属性匹配此实例的属性； 否则，","The options that describe this property filter.":"描述此属性过滤器的选项。","A string representation of the state of the current membership condition.":"当前成员条件状态的字符串表示。"," object for the specified file":"指定文件的对象","An object that represents the culture used by the current thread.":"表示当前线程使用的区域性的对象。","A computed hash code based on the ":"基于计算的哈希代码","A signed 32-bit integer value.":"签名的32位整数值。","A membership condition that tests evidence to determine whether this code group applies code access security policy.":"测试证据以确定该代码组是否应用代码访问安全策略的成员条件。","The full name of the country/region in the language of the localized version of .NET Framework.":"以.NET框架本地化版本的语言，国家/地区的全名。"," object to read from the file":"从文件中读取的对象","The locale description.":"地方描述。","NaN":"进入","The object to compare. This object is expected to be a ":"比较的对象。 预计这个对象将是一个","Optional. Number of the only record or byte to lock or unlock":"可选的。 锁定或解锁的唯一记录或字节"," containing the scheme to match against the code's scheme.":"包含与代码方案匹配的计划。"," if a match exists; otherwise, ":"如果存在比赛； 否则，","The locale name.":"语言环境名称。","-Infinity":"-无穷","Infinity":"无穷","The property filter options.":"属性过滤器选项。"," that contains the value of the parameter that caused the current ":" 它包含导致当前的参数的值 "," that specifies the scheme and port code can use to connect back to its origin server.":"这指定了方案和端口代码可以用来连接回其原始服务器。","A signed and serialized publish license.":"签名和序列化发布许可证。","The buffer to which bytes are to be copied.":"要复制字节的缓冲区。","The text message for this exception. The value of this property takes one of two forms, as follows.  \n  \n ":"此例外的短信。 该属性的价值采用两种形式之一，如下所示。","The name of the property to sort the list by.":"属性的名称按列表进行排序。"," object to compare with the current code group.":"对象与当前代码组进行比较。","The secure environment for license activation and binding.":"许可激活和绑定的安全环境。","The byte array from which to copy ":"字节阵列要复制","The sort order.":"排序顺序。","The implementation to use when comparing elements.  \n  \n -or-  \n  \n ":"比较元素时要使用的实现。 \n  \n  -或者-"," array containing connection access information.":"包含连接访问信息的数组。"," for a user or user group in the specified ":"对于指定的用户或用户组"," bytes to the current buffered stream.":"字节到当前缓冲流。"," instance to compare.":"实例要比较。"," to sort":"排序","The rights management service to use for decrypting the license.":"权利管理服务用于解密许可证。"," for the assembly.":"对于集会。"," - 1":"-1"," and this instance of ":"和这个实例","A decrypted, unsigned version of this license.":"该许可证的解密，未签名的版本。","An integer that indicates the relationship of the current collection object to other, as shown in the following table.  \n  \n ":"一个整数，指示当前集合对象与其他对象的关系，如下表所示。"," that consists of the permissions granted by the code group with optional attributes, or ":"由具有可选属性的代码组授予的权限组成，或"," replaced by the bytes read from the current source.":"由从当前源读取的字节替换。","The key to be added or whose value should be updated":"要添加的钥匙或应更新其价值"," have the same values.":"具有相同的值。","The serialized Extensible Rights Markup Language (XrML) string that was used to create this license.":"用于创建此许可证的序列化的可扩展权利标记语言（XRML）字符串。","The complete set of code groups that were matched by the evidence.":"由证据匹配的完整代码组集。","The buffer containing data to write to the stream.":"包含数据写入流的缓冲区。","The value to be added for an absent key":"缺少钥匙要添加的值","The hash code for this instance of ":"此实例的哈希代码","Always the string \"Same site Web.\"":"总是字符串“同一站点网”。","The publisher-created content identifier.":"发布者创建的内容标识符。","The function used to generate a new value for an existing key based on the key's existing value":"该功能用于根据密钥的现有值生成现有密钥的新值","A region of memory. When this method returns, the contents of this span are replaced by the bytes read from the current memory stream source.":"记忆区域。 当此方法返回时，此跨度的内容被当前内存流源读取的字节替换。"," if the values are not equal; otherwise, ":"如果值不相等； 否则，","The contact name for the author or publisher of the content.":"内容的联系人名称或内容的发布者。","The minimum permissions the code requires to run.":"代码需要运行的最小权限。","The function used to generate a value for an absent key":"用于生成缺失键值的函数"," value to indicate whether to sort in ascending or descending order.":"值表示是按上升或降序排序的价值。","A region of memory. This method copies the contents of this region to the current memory stream.":"记忆区域。 此方法将该区域的内容复制到当前内存流。","The contact uniform resource identifier (URI) for the author or publisher of the content.":"与内容的作者或发布者的联系统一资源标识符（URI）。",":   - If less than 0, ":"： - 如果少于0，","The permissions the code can use if they are granted, but that are not required.":"代码授予的权限可以使用，但不需要。","The URI to use for acquiring a ":"用于获取A的URI"," if this object is in use; otherwise, ":"如果使用此对象； 否则，","The path information to modify. The path cannot contain any of the characters defined in ":"要修改的路径信息。 该路径不能包含在",".   - If 0, ":"。  - 如果0，","The permissions the code explicitly asks not to be granted.":"代码明确要求不授予的权限。","An equivalent copy of the current ":"当前的等效副本","The failure code for the error.":"错误代码。","The default value is null.":"默认值为null。",", an empty span, or a root (such as \\, C:, or \\server\\share).":"，一个空跨度或根（例如\\，c：，c：,, \\ server \\ share）。",".   - If greater than 0, ":"。  - 如果大于0","The permissions the code can use if they are granted, but are not required.":"代码被授予的权限可以使用，但不需要。","The exception instance that caused the error.":"引起错误的异常实例。"," in the sort order: - If less than 0, the current instance precedes ":"按顺序： - 如果少于0，则当前实例先于","The zero-based index where the ":"从零开始的指数，其中 ","The path to the temporary folder, ending with a backslash.":"临时文件夹的路径，以反斜杠结尾。",". - If 0, the current instance and ":"。  - 如果0，当前实例和","The exception instance that caused this exception.":"引起此异常的异常实例。","The element from which the property value is read.":"读取属性值的元素。"," used to create the ":"用于创建"," if the characters that follow the last directory separator (\\\\ or /) or volume separator (:) in the path include a period (.) followed by one or more characters; otherwise, ":"如果遵循最后一个目录分隔符（\\\\或 /）或音量分隔符（:)在路径中的字符包括一个（。），然后是一个或多个字符； 否则，","The application rights manifest.":"应用程序权利。"," property value for the element.":"元素的属性值。"," to add to the list of ":"添加到列表中"," are equal. - If greater than 0, the current instance follows ":"相等。  - 如果大于0，则当前实例如下","The method of authentication.":"身份验证的方法。","When this method returns, this span contains all the bytes from the unmanaged memory stream.":"当此方法返回时，此跨度包含来自不受管理的内存流中的所有字节。"," number of decimal places.":"小数点数量。","The element to which the attached property is written.":"所附属性的元素是编写的。"," objects used to determine whether an assembly is a member of the group of assemblies that should not be evaluated.":"用于确定组件是否是不应评估的组件组成员的对象。","The span of bytes from which to copy bytes to the current unmanaged memory stream.":"将字节复制到当前不受管理的内存流的字节跨度。","The type of the user rights account certificate.":"用户权限帐户证书的类型。","A value that specifies how to round ":"一个指定如何回合的值"," to add to the current policy level.":"添加到当前的策略级别。","The needed ":"需要的","A function that returns the referenced object":"返回引用对象的函数","A secure client session for activation, license binding, and other rights management operations.":"一个安全的客户会话，用于激活，许可绑定和其他权利管理操作。"," if it is midway between two other numbers.":"如果是其他两个数字之间的中间。","An animation trace source.":"动画跟踪源。","The user or user-group for granting access to rights managed content.":"用户或用户组授予访问权限托管内容的访问。"," that replaces the ":"替换","The thread synchronization mode":"线程同步模式","The number that is nearest to the ":"最接近 ","A list of the currently activated users.":"当前激活的用户列表。","A data-binding trace source.":"数据结合轨迹源。"," that was replaced.":"它被替换了。","An angle, θ, measured in radians, such that -∞ < θ ≤ -1, or 1 ≤ θ < ∞. \n  \n -or-  \n  \n ":"在弧度中测量的角度，θ，以至于-∞<θ≤ -1或1≤θ<∞。 \n  \n  -或者-"," parameter with a precision equal to the ":"精度等于"," has been activated for accessing rights managed content; otherwise, ":"已被激活以访问权利托管内容； 否则，","A dependency property trace source.":"依赖关系属性跟踪源。"," in the current policy level with the specified name, if found; otherwise, ":"在当前的策略级别中，指定名称（如果找到）； 否则，","Specification for how to round ":"如何回合的规格","The user to remove the license activation for.":"用户删除了激活许可证。","A document trace source.":"文档跟踪源。"," of the assembly to remove from the list of assemblies used to evaluate policy.":"大会的删除用于评估策略的组件列表。"," is halfway between two numbers, one of which is even and the other odd, the ":"位于两个数字之间，其中一个是偶数，另一个是奇怪的，"," is halfway between two numbers, one of which is even and the other odd, then ":"是两个数字之间的一半，其中一个是偶数，另一个是奇怪的，然后","The application manifest specified to the ":"该应用程序已指定为","A Freezable trace source.":"可冷冻的痕量源。"," parameter determines which of the two numbers is returned. If the precision of ":"参数确定返回两个数字中的哪个。 如果精度"," to remove from the current policy level.":"从当前策略级别中删除。"," parameter determines which of the two numbers is returned.":"参数确定返回两个数字中的哪个。"," method when the ":"方法时"," determines which of the two is returned. Note that this method returns a ":"确定返回两者中的哪一个。 请注意，此方法返回"," that was removed.":"那被删除了。","An hwnd host trace source.":"HWND主机跟踪源。","A string that contains a GUID in one of the following formats (\"d\" represents a hexadecimal digit whose case is ignored):  \n  \n 32 contiguous digits:  \n  \n dddddddddddddddddddddddddddddddd  \n  \n -or-  \n  \n Groups of 8, 4, 4, 4, and 12 digits with hyphens between the groups. The entire GUID can optionally be enclosed in matching braces or parentheses:  \n  \n dddddddd-dddd-dddd-dddd-dddddddddddd  \n  \n -or-  \n  \n {dddddddd-dddd-dddd-dddd-dddddddddddd}  \n  \n -or-  \n  \n (dddddddd-dddd-dddd-dddd-dddddddddddd)  \n  \n -or-  \n  \n Groups of 8, 4, and 4 digits, and a subset of eight groups of 2 digits, with each group prefixed by \"0x\" or \"0X\", and separated by commas. The entire GUID, as well as the subset, is enclosed in matching braces:  \n  \n {0xdddddddd, 0xdddd, 0xdddd,{0xdd,0xdd,0xdd,0xdd,0xdd,0xdd,0xdd,0xdd}}  \n  \n All braces, commas, and \"0x\" prefixes are required. All embedded spaces are ignored. All leading zeros in a group are ignored.  \n  \n The digits shown in a group are the maximum number of meaningful digits that can appear in that group. You can specify from 1 to the number of digits shown for a group. The specified digits are assumed to be the low-order digits of the group.":"以下格式之一中包含GUID的字符串（“ D”代表忽略案例的十六进制数字）：\n  \n 32个连续数字：\n  \n DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\n  \n -或者-\n  \n 两组之间有连字符的8、4、4、4和12位数字。可以选择将整个GUID包含在匹配的括号或括号中：\n  \n DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\n  \n -或者-\n  \n {DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD}\n  \n -或者-\n  \n （DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD）\n  \n -或者-\n  \n 8、4和4位数字的组和八组的2个数字的子集，每组由“ 0x”或“ 0x”前缀，并由逗号分隔。整个GUID以及子集都包含在匹配的括号中：\n  \n {0xddddddd，0xddd，0xddd，{0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd，0xdd}}}}}\n  \n 需要所有括号，逗号和“ 0x”前缀。所有嵌入式空间都被忽略。一组中的所有领先零都被忽略。\n  \n 组中显示的数字是该组中可能出现的有意义数字的最大数量。您可以从1到组显示的数字数量指定。假定指定的数字是组的低阶数字。","A markup trace source.":"标记跟踪源。","The user or user-group specified to the ":"指定到的用户或用户组"," that has a number of fractional digits equal to ":"该分数等于"," used to resolve the ":" 用于解决 "," or Empty, is not of the correct format, or represents a number less than ":"或空的，不是正确的格式，或代表小于","A name scope trace source.":"名称范围跟踪源。"," is halfway between two integers, one of which is even and the other odd, then ":"是两个整数之间的一半，一个是偶数，另一个是奇怪的，然后","The resulting ":"所结果的","Index of the type description whose documentation is to be returned.":"将返回文档的类型说明的索引。","A resource dictionary trace source.":"资源词典跟踪源。"," was created.":" 是被创造出来的。","The location of the loaded file that contains the manifest. If the loaded file was shadow-copied, the location is that of the file after being shadow-copied. If the assembly is loaded from a byte array, such as when using the ":"包含清单的加载文件的位置。 如果已加载的文件被贴上阴影，则该位置是被阴影贴上阴影后的文件的位置。 如果将组件从字节数组加载，例如使用"," used to resolve policy.":"用于解决政策。","Returns a string that contains the name of the specified item.":"返回包含指定项目名称的字符串。","A routed event trace source.":"路由事件跟踪源。"," method overload, the value returned is an empty string (\"\").":"方法过载，返回的值是一个空字符串（“”）。"," representing the root of a tree of code groups matching the specified evidence.":"代表与指定证据相匹配的代码组树的根。","Returns a string that contains the documentation string for the specified item.":"返回一个包含指定项目的文档字符串的字符串。","The Extensible Rights Markup Language (XrML) publish-license template to use to create this license.":"可扩展的权利标记语言（XRML）发布用于创建此许可证的许可模板。","The name of the targeted parameter of the CallerArgumentExpression":"CallerArgumentExpression的目标参数的名称","A returned ":"返回"," objects used to determine whether an assembly is a member of the group of assemblies used to evaluate security policy. These assemblies are granted full trust during security policy evaluation of assemblies not in the list.":"用于确定程序集的对象是否是用于评估安全策略的组件组的成员。 在安全政策评估列表中，这些组件在安全策略评估期间被授予完全信任。","Returns the Help context identifier associated with the specified item.":"返回与指定项目关联的帮助上下文标识符。","A shell trace source.":"一个shell跟踪源。"," parameters represent different .NET Framework versions; otherwise, ":"参数代表不同的.NET框架版本； 否则，"," for the document author.":"对于文档作者。","Returns a string that contains the fully qualified name of the Help file.":"返回一个包含帮助文件的完全合格名称的字符串。","The label associated with the policy level.":"与策略级别关联的标签。","The signed ":"签名","The stream on which to create the file.":"创建文件的流。","A reference to the element of the ":"提及该元素的","On successful return, a structure that contains the library's attributes.":"成功返回时，包含库属性的结构。"," that is created by signing this ":"这是通过签名而创建的","The publish license that is embedded in the compound file.":"嵌入在复合文件中的发布许可证。"," at index zero, or ":"在索引零，或","A list of named permission sets defined for the policy level.":"为策略级别定义的命名权限集的列表。"," is  ":"是","The index of the type description within the type library":"类型库中类型说明的索引","An object that determines what operations the current user is allowed to perform on the encrypted content.":"确定允许当前用户在加密内容上执行的操作的对象。","A serialized template created from the XrML of the ":"由XRML创建的序列化模板"," that is the root of the tree of policy level code groups.":"那是策略级代码组的根源。",": - Less than zero: This instance precedes ":"： - 小于零：此实例先于","The publisher-created rights-managed content identifier.":"由出版商创建的权利管理的内容标识符。","The path where the policy file is stored, or ":"存储策略文件的路径，或","The name of the OLE compound file.":"Ole复合文件的名称。"," enumeration for the type description.":"类型说明的枚举。","A collection of the assigned user rights that are provided in this license.":"本许可中提供的分配用户权利的集合。"," does not have a storage location.":"没有存储位置。",". \n- Zero: The instance has the same position in the sort order as ":"。 \n  - 零：实例在排序顺序中具有相同的位置"," was found in the type library; otherwise ":"在类型库中发现； 否则","The stream representing the existing unencrypted package.":"表示现有未加密包的流。",".\n- Greater than zero: This instance follows ":"。 \n  - 大于零：此实例遵循","A collection of name and description pairs.":"名称和描述对的集合。"," with which to initialize the new instance.":" 用其初始化新实例。","The version of the .NET Framework against which the assembly was built.":"构建组件的.NET框架的版本。","The user who owns the published content.":"拥有已发布内容的用户。","The work to execute asynchronously":"异步执行的工作"," identical to those of the current ":"与当前的相同"," in the envelope.":"在信封中。","A use license in serialized Extensible Rights Markup Language (XrML) form.":"序列化的可扩展权利标记语言（XRML）表单中的使用许可证。","The display name of the .NET Framework version.":".NET框架版本的显示名称。","One of the enumeration values that controls the behavior of the created task>":"控制创建任务的行为>的枚举价值之一>"," context for lookup of ":"查找的上下文","The stream that is tested.":"测试的流。","The environment to bind the license to.":"将许可证绑定到的环境。","The tuple object to convert to a value tuple":"元组对象转换为值元组","The name of the .NET Framework version with which the assembly was compiled.":"编译组件的.NET框架版本的名称。","The attributes of the policy statement.":"政策声明的属性。"," if the specified stream is an OLE compound file with an encrypted package stream; otherwise, ":" 如果指定的流是具有加密包流的OLE复合文件；否则, ",">When this method returns, contains the single-precision floating-point number equivalent of the ":">当此方法返回时，包含单位浮点数等效的单位浮点数"," instance if the license binding succeeded; otherwise, ":"实例，如果许可绑定成功； 否则，","The fragment portion of the URI. The fragment identifier (\"#\") is added to the beginning of the fragment.":"URI的碎片部分。 片段标识符（“＃”）被添加到片段的开头。","A text string representing the attributes of the policy statement.":"代表策略语句属性的文本字符串。","An object that supplies culture-specific comparison information.":"提供特定文化比较信息的对象。"," that contains the URI constructed by the ":"其中包含由","The file that is tested.":"已测试的文件。","The license to compare.":"比较许可。"," of the policy statement.":"政策声明。","The culture that supplies culture-specific comparison information.":"提供特定文化比较信息的文化。"," if the specified file is an OLE compound file with an encrypted package stream; otherwise, ":"如果指定的文件是带有加密软件包流的OLE复合文件； 否则，","The user name of the user that accesses the URI.":"访问URI的用户的用户名。"," that contains the software publisher's public key.":"其中包含软件发布者的公钥。"," if both licenses are the equivalent; otherwise, ":"如果两个许可证都是同等的； 否则，","A character representing the reference to the element of the string at index zero.":"代表索引零元素元素的引用的字符。","The stream containing the encrypted package.":"包含加密软件包的流。","The object to compare with the current instance":"与当前实例进行比较的对象"," to test for equivalence with the current object.":"测试与当前对象的等效性。"," has zero elements or all the elements of ":"具有零元素或所有元素","A hash code for this license.":"此许可证的哈希代码。"," that is opened.":"那是打开的。","The initialization vector to use for the symmetric algorithm":"用于对称算法的初始化矢量"," if the two instances of the ":"如果两个实例","The serialized Extensible Rights Markup Language (XrML) string originally passed to the ":"序列化的可扩展权利标记语言（XRML）字符串最初传递给"," is zero, ":"为零，","The file containing the encrypted package.":"包含加密软件包的文件。"," class are equal; otherwise, ":"班级相等； 否则，","The pseudorandom key that is at least as long as the output byte array of the specified hash algorithm (usually the output from Expand step).":"伪随机密钥，至少与指定哈希算法的输出字节数组（通常是展开步骤的输出）一样长。"," has no elements, or all the elements of ":"没有元素，或所有元素","The application data dictionary that contains key/value pairs passed from the publishing application to the consuming application.":"应用程序数据字典包含从发布应用程序传递到消费应用程序的密钥/值对。","The type of access.":"访问类型。","The hash code of the current ":"当前的哈希码","The content identifier created by the publisher.":"发布者创建的内容标识符。","The pseudorandom key that is at least as long as as the output byte array of the specified hash algorithm (usually the output from Expand step).":"伪随机密钥至少高于指定的哈希算法的输出字节数组（通常是从展开步骤输出）。"," string. If ":"细绳。 如果","The publisher's ":"出版商的","The type of sharing.":"共享类型。","The owner of the license.":"许可证的所有者。"," parameter and the algorithms they map to.  \n  \n ":"参数及其映射到的算法。"," if the publisher certificate from the specified object is equivalent to the publisher certificate contained in the current ":"如果来自指定对象的发布者证书等于当前中包含的发布者证书"," value that was used to open the file.":"用于打开文件的值。"," is an empty array, the method returns ":" 是一个空数组，该方法返回 "," for the package.":"对于包装。","The intended type that scopes the use of the attached property where this .NET Framework attribute applies.":"在适用此.NET框架属性的附件属性中使用的预期类型。","When this method returns, contains the 32-biut integer value equivalent to the current JSON number.":"当此方法返回时，包含32位整数值等效于当前JSON号。"," context, used to resolve ":"上下文，用于解决","A string that consists of the strings in ":"一个由字符串组成的字符串"," string.\n\n -or-\n\n ":"细绳。 \n\n  -或者-"," representing streams in the OLE compound file that are outside the encrypted package.":"代表位于加密软件包外部的OLE复合文件中的流。","An object that is a unique identifier for the ":"是一个唯一标识符的对象"," context, which is used to resolve ":"上下文，用于解决"," to ignore null values during serialization and deserialization; otherwise, see langword=\"false\" />.":"在序列化和避免时忽略零值； 否则，请参见langword =“ false” />。"," has no elements, or ":"没有元素，或"," constructor":"构造函数","The invalid ":"无效"," of the  .NET Framework attribute that must also be applied on a class in order for the attached property to be browsable on the class where ":"为了使所附属性在类上浏览的.NET框架属性，该属性也必须应用于类"," for which the membership condition tests.":"为此，会员条件测试。"," source of the event.":"事件的来源。","The cancellation token to use to cancel the enumeration.":"取消令牌用于取消枚举。"," and all the elements of ":" 和所有的元素 ","The  .NET Framework attribute type.":".NET框架属性类型。","The website of origin for the associated code assembly.":"关联代码程序集的源网站。","The latest value written to the field by any processor.":"任何处理器写在现场上的最新值。"," character. If ":"特点。 如果"," to return the transform list for.":"返回转换列表。"," if information about the ":"如果有关","A new object that is identical to the current ":"与当前相同的新对象","An ordered list of URI strings, such as ":"一个有序的URI字符串列表，例如"," is saved to the ":"保存到"," has no members, the method returns ":"没有成员，方法返回","if all participants reached the barrier within the specified time; otherwise false":"如果所有参与者在指定的时间内都达到了障碍； 否则错误",", that represents the canonical XML transformations applied to the part with the given ":"，这代表具有给定的零件应用的规范XML转换","A value that defines how the dispatcher reacts to failures.":"定义调度员对失败的反应的值。","The URL from which to create the new ":"创建新的URL"," URI.":"Uri。",", the return value is the last index position in this instance.":"，返回值是在这种情况下的最后一个索引位置。","The name of the semaphore. If it is ":"信号量的名称。 如果是"," method puts the delegates on the dispatcher queue or if the delegate is directly invoked; otherwise, ":"方法将代表放在调度员队列或直接调用代表时； 否则，","A new site object.":"一个新的站点对象。","true if a single ":"如果是一个"," if the verification succeeded; otherwise, one of the ":"如果验证成功； 否则，之一",", the return value is the smaller of ":"，返回值是较小的"," or empty, a process-local semaphore is created. If the name is prefixed by \"Global\", a machine-wide semaphore is created (or the existing one returned). If it is prefixed by \"Local\", a session-wide semaphore is created (or the existing one returned). If the name is not prefixed at all, a session-wide semaphore is created (same as prefix \"Local\"). Both prefix and name are case-sensitive.":"或空，创建了过程 - 本地信号量。 如果该名称由“全局”前缀，则创建一个机器范围的信号量（或现有的信号量）。 如果将其前缀为“本地”，则创建一个会话范围的信号量（或现有的信号量）。 如果根本没有前缀，则创建一个会话范围的信号量（与前缀“ local”相同）。 前缀和名称都对大小写。","The evidence from which to construct the identity permission.":"构建身份许可的证据。"," and the last index position in this instance.":"以及在这种情况下的最后一个索引位置。"," is used for multiple dispatcher operations; otherwise, ":" 用于多个调度器操作；否则, ","A site identity permission for the current ":"当前的站点身份许可"," values that identifies a problem.":"确定问题的值。","The name of the semaphore. If it's prefixed by \"Global\", it refers to a machine-wide semaphore. If it's prefixed by \"Local\" or doesn't have a prefix, it refers to a session-wide semaphore. Both prefix and name are case-sensitive.":"信号量的名称。 如果它是“全局”的前缀，则指的是机器范围的信号量。 如果它的前缀为“本地”或没有前缀，则是指范围内的信号量。 前缀和名称都对大小写。","The object to test for equivalence with the current object.":"测试与当前对象的对象。","The signer's X.509 certificate to verify the digital signature against.":"签名者的X.509证书以验证数字签名。","The object that the property exists on. When the callback is invoked, the property system will pass this value.":"属性存在的对象。 调用回调后，属性系统将传递此值。","The isolation level of the transaction":"交易的隔离水平","The culture to use when comparing.":"比较时要使用的文化。","The new value of the property, prior to any coercion attempt.":"在任何强制尝试之前，该物业的新价值。","One of the enumeration values that determines whether the split operation should omit empty substrings from the return value.":"枚举值之一决定是否应从返回值中省略拆分操作。","The string to encode":"用于编码的字符串"," values that specifies the option for the digital signature.":"指定数字签名选项的值。","The hash code of the current website name.":"当前网站名称的哈希码。","The coerced value (with appropriate type).":"强制值（具有适当类型）。","An array whose elements contain at most ":"一个数组，其元素最多包含","The XML digital signature.":"XML数字签名。","The current validated XML element or attribute as a boxed object of the most appropriate .NET Framework type.":"当前验证的XML元素或属性是最合适的.NET框架类型的盒装对象。","A representation of the current site.":"当前站点的表示。","String to evaluate for conversion.":"弦乐以评估转换。","A character array that delimits the substrings in this string, an empty array that contains no delimiters, or ":"一个字符串的字符数组，该字符串中的子字符串，一个不包含定界数的空数组或","The package part that contains the signature.":"包含签名的包部分。","The .NET Framework type of the validated XML element or attribute. The default value is ":"已验证的XML元素或属性的.NET框架类型。 默认值是","The name of the website from which the code assembly originates.":"代码组件的网站名称。","Context information that is used for conversion.":"用于转换的上下文信息。"," to omit empty array elements from the array returned; or ":"省略返回的数组中的空数组元素； 或者","A URI string that identifies the signature type. The default is ":"标识签名类型的URI字符串。 默认值为"," to clone only the node itself":"仅克隆节点本身"," if the site from the specified ":"如果指定的网站","The object to evaluate for conversion.":"评估转换的对象。","A byte array that contains the encrypted hash value of the ":"一个字节数组，包含包含加密的哈希值","The string to convert.  \n  \n Note The string must conform to a subset of the W3C Recommendation for the XML dateTime type. For more information, see the dateTime section of the XML Schema specification..":"要转换的字符串。 \n  \n  注意字符串必须符合XML DateTime类型的W3C建议的子集。 有关更多信息，请参见XML模式规范的DateTime部分。"," to include empty array elements in the array returned.":" 在返回的数组中包含空数组元素。"," object is equivalent to the site contained in the current ":"对象等效于当前包含的站点","A collection that contains all the package parts signed with the signature.":"包含所有带有签名的包装部分的集合。"," can be converted into a ":"可以转换为","The site for which the membership condition tests.":"会员条件测试的网站。","The string must contain only the following characters &#20; &#10; &#13; and &#9;":"字符串必须仅包含以下字符＆＃20; ＆＃10; ＆＃13; 和＆＃9;","A string array that delimits the substrings in this string, an empty array that contains no delimiters, or ":"一个字符串数组，该数组划定了此字符串中的子字符串，一个不包含定界数的空数组，或","The XML source":"XML源","The list of the ":"列表"," based on the supplied ":"根据所提供的"," of the software publisher.":"软件出版商的内容。","The name of a system-wide synchronization event.":"全系统同步事件的名称。","The object to convert into a string.":"转换为字符串的对象。","The simple name section of the strong name.":"强名称的简单名称部分。","The prefix to associate with the namespace being added. Use String.Empty to add a default namespace.  \n  \n NoteIf the ":"与要添加的命名空间相关联的前缀。 使用字符串。空以添加默认命名空间。  \n  \n 注： ","A string representation of the specified ":"指定的字符串表示","The name of the system synchronization event to open.":"系统同步事件的名称要打开。"," of the strong name.":"强的名字。","The prefix for the namespace":"名称空间的前缀","The new value stored at ":"存储在","The markup of the child nodes of this node.  \n  \n ":"该节点的子节点的标记。",". If the value is ":"。 如果值为","The markup containing this node and all its child nodes.  \n  \n ":"包含此节点及其所有子节点的标记。","The name of the system mutex to open.":"系统静音的名称要打开。"," if the condition is satisfied within the timeout; otherwise, false":"如果在超时内满足条件； 否则，错误"}