{"Gets the type name of the .NET type for this mapping.":"获取此映射的.NET类型的类型名称。\r\n","Returns the size, in bytes, of a file opened by using the ":"通过使用该文件打开的文件的大小，字节为字节\r\n","Encodes a space-delimited sequence of XML names into a single XML name.":"将XML名称的空格序列编码为单个XML名称。\r\n","Encodes the specified binary bytes as binhex and writes out the resulting text.":"用BINHEX编码指定的二进制字节，并写出结果文本。\r\n","Writes out a <![CDATA[...]]> block containing the specified text.":"写出一个<！[cdata [...]]>包含指定文本的块。\r\n","Rolls back (aborts) the transaction.":"回滚（中止）交易。\r\n","Gets a value that indicates whether the accompanying field in the .NET type has a value specified.":"获取一个值，该值指示.NET类型中的附带字段是否具有指定值。\r\n","The SMTP service is ready.":"SMTP服务已准备就绪。\r\n"," attribute for an XML element that is being serialized into a document.":" XML元素的属性正在序列化为文档。\r\n","Represents an XML declaration.":"代表XML声明。\r\n","Specifies the XSLT features to support during execution of the XSLT style sheet.":"指定在执行XSLT样式表格期间支持的XSLT功能。\r\n","Occurs when the state of the connection changes.":"当连接状态发生变化时，就会发生。\r\n",", or derived from ":"，或源自\r\n"," payloads through the ":" 有效载荷通过\r\n","When overridden in a derived class, writes out the attribute with the specified local name and value.":"当在派生类中覆盖时，用指定的本地名称和值写出属性。\r\n","The name of the class that contains the compiled style sheet.  \r\n  \r\n This is usually the name of the style sheet. Unless otherwise specified, the xsltc.exe tool uses the name of the style sheet for the class and assembly names.":"包含编译样式表的类的名称。\r\n  \r\n 这通常是样式表的名称。除非另有说明，否则XSLTC.EXE工具使用类和汇编名称的样式表的名称。\r\n"," instance is equal to the specified ":" 实例等于指定的\r\n","Gets or sets the GUID of the object type that can inherit the Access Control Entry (ACE) that this ":"获取或设置可以继承访问控制条目（ACE）的对象类型的GUID\r\n"," parameter is not a valid algorithm name.  \r\n  \r\n -or-  \r\n  \r\n The ":" 参数不是有效的算法名称。\r\n  \r\n -或者-\r\n  \r\n 这\r\n","Creates and returns an identical copy of the current application identity.":"创建并返回当前应用程序身份的相同副本。\r\n","When overridden in a derived class, writes raw markup manually from a character buffer.":"当在派生的班级中覆盖时，用角色缓冲区手动写下原始标记。\r\n","The loaded resource is not a valid style sheet.":"加载资源不是有效的样式表。\r\n","Provides the base interface for creating ":"提供用于创建的基本接口\r\n","Gets the line number of the unknown XML node.":"获取未知XML节点的行号。\r\n","Specifies the sort order for uppercase and lowercase letters.":"指定大写和小写字母的排序顺序。\r\n","Replaces the format items in a string with the string representation of three specified objects. An parameter supplies culture-specific formatting information.":"用三个指定对象的字符串表示替换字符串中的格式项目。参数提供特定于文化的格式信息。\r\n","NMTOKENS type.":"NMTOKENS类型。\r\n"," object that belongs to the specified namespace.":" 属于指定名称空间的对象。\r\n","Gets or sets a value that determines whether the resulting schema type is an XSD anonymous type.":"获取或设置一个确定结果模式类型是XSD匿名类型的值。\r\n"," or http://www.w3.org/1999/XSL/Transform.  \r\n  \r\n The ":" 或http://www.w3.org/1999/xsl/transform。\r\n  \r\n 这\r\n","Closes any open elements or attributes and puts the writer back in the Start state.":"关闭任何开放元素或属性，并将作者放回起点状态。\r\n","Serialize this streaming element to a file.":"将此流元素序列化为文件。\r\n","Indicates that the common language runtime checks the name encoding.":"表示通用语言运行时检查名称编码。\r\n","Writes the start of an attribute.":"写一个属性的开始。\r\n","Defines the reader, writer, and methods for pre-generated, typed serializers.":"定义读者，作者和预先生成的键入序列化的方法。\r\n"," value includes a filename or directory that cannot be found.":" 值包括找不到的文件名或目录。\r\n","An invalid value was specified.":"指定了无效的值。\r\n"," class, specifying overrides for XML serialization.":" 类，指定XML序列化的替代。\r\n","Contains a variable number of arguments which are either XSLT parameters or extension objects.":"包含可变数量的参数，这些参数是XSLT参数或扩展对象。\r\n"," to the namespace node with the specified namespace prefix.":" 使用指定名称空间前缀的名称空间节点。\r\n","Executes the transform by using the input document that is specified by the ":"通过使用由该转换执行转换\r\n"," method was called with an ":" 方法是用一个\r\n"," parameter's lower bound.":" 参数的下限。\r\n","PE image not available.":"PE图像不可用。\r\n","Represents the options that can be set for an ":"表示可以设置的选项\r\n"," class that can serialize objects of the specified type into XML document instances, and vice versa. Each object to be serialized can itself contain instances of classes, which this overload can override with other classes. This overload also specifies the default namespace for all the XML elements, and the class to use as the XML root element.":"可以将指定类型的对象序列化为XML文档实例的类，反之亦然。每个要序列化的对象本身都包含类的实例，该过载可以与其他类覆盖。此过载还指定了所有XML元素的默认名称空间，以及将类用作XML root元素的类。\r\n","Writes the XML declaration if the writer is positioned at the start of an XML document.":"如果作者位于XML文档的开头，则写XML声明。\r\n"," method to put the ":" 放置\r\n"," or an empty string.  \r\n  \r\n -or-  \r\n  \r\n The parameter values are not valid.":" 或一个空字符串。\r\n  \r\n -或者-\r\n  \r\n 参数值无效。\r\n","Gets the last child node of this node.":"获取此节点的最后一个子节点。\r\n","Determines whether the XML element where the ":"确定XML元素是否在哪里\r\n","Gets or sets a mechanism to create an instance of the class or struct using a parameterless constructor during deserialization.":"获取或设置一种机制，以在避难化期间使用无参数构造函数创建类或结构的实例。\r\n"," object is a proper subset of the specified collection.":" 对象是指定集合的​​正确子集。\r\n","Returns the month in the specified date.":"在指定日期返回月份。\r\n"," parameter value is not valid.":" 参数值无效。\r\n","Gets or sets a value that should be ":"获取或设置一个应该是的值\r\n","Indicates the default option settings for string comparisons.":"指示字符串比较的默认选项设置。\r\n"," to the next attribute.":" 到下一个属性。\r\n","Gets the XML element name as it appears in the service description document.":"在服务描述文档中显示出XML元素名称。\r\n","Verifies that the XML data in the ":"验证XML数据中的数据\r\n","Returns a filtered collection of attributes of this element. Only attributes that have a matching ":"返回该元素的属性的过滤集合。只有具有匹配的属性\r\n","Returns the property value of a specified object.":"返回指定对象的属性值。\r\n","Returns a serializer for the specified type.":"返回指定类型的序列化器。\r\n","The writer is closed.\r\n\r\n-or-\r\n\r\nAn ":"作家关闭。\r\n\r\n-或者-\r\n\r\n一个\r\n","Computes the hash value of the specified stream using the specified hash algorithm and padding mode, and signs the resulting hash value.":"使用指定的哈希算法和填充模式计算指定流的哈希值，并符合所得的哈希值。\r\n","Gets the value indicating if the string comparison should ignore the case of the member name.":"获取值表示字符串比较是否应忽略成员名称的情况。\r\n"," class that is used to serialize the specified type and namespace.":" 用于序列化指定类型和名称空间的类。\r\n","Writes out the given white space.":"写出给定的空白。\r\n"," structure that has a ":" 结构\r\n","The current node's string value cannot be converted to a ":"当前节点的字符串值不能转换为\r\n"," type flag, which expands the type flags without growing the ":" 类型标志，扩展类型标志而不生长\r\n"," class with the specified assembly name.":" 带有指定的汇编名称的课程。\r\n","A processing instruction, such as ":"处理指令，例如\r\n",".  \r\n  \r\n The default is ":"。\r\n  \r\n 默认值为\r\n","Evaluates an XPath expression.":"评估XPATH表达式。\r\n","Gets a value indicating whether this element has at least one child element.":"获得一个值，指示此元素是否至少具有一个子元素。\r\n"," object and outputs the results to an ":" 对象并将结果输出到\r\n","An element, such as ":"一个元素，例如\r\n","Writes an XML element with a specified qualified name in its body.":"写一个XML元素，其体内有指定的合格名称。\r\n"," completes. The continuation executes based on a set of specified conditions.":" 完成。延续基于一组指定条件执行。\r\n","The style sheet contains embedded scripts, and the caller does not have ":"样式表包含嵌入式脚本，呼叫者没有\r\n","Gets the next sibling node of this node.":"获取此节点的下一个兄弟姐妹节点。\r\n","Returns a collection of the descendant elements for this document or element, in document order.":"根据文档顺序返回本文档或元素的后代元素的集合。\r\n","User-defined type. Each member of the structure has a range determined by its data type and independent of the ranges of the other members. This member is equivalent to the Visual Basic constant ":"用户定义的类型。该结构的每个成员都有一个由其数据类型决定的范围，并且独立于其他成员的范围。该成员等同于视觉基本常数\r\n","Selects a collection of elements using an XPath expression.":"使用XPath表达式选择元素集合。\r\n"," value is specified.":" 指定值。\r\n","Returns the in-scope namespaces of the current node.":"返回当前节点的范围内命名空间。\r\n","Represents a node or an attribute in an XML tree.":"代表XML树中的节点或属性。\r\n","Removes this attribute from its parent element.":"从其父元素中删除此属性。\r\n"," instance was allocated by calling the ":" 实例是通过调用\r\n","Writes a specified string value.":"写一个指定的字符串值。\r\n","Converts the string representation of a number in a specified style and culture-specific format to its unsigned native integer equivalent. A return value indicates whether the conversion succeeded.":"将指定样式和特定于文化格式的数字的字符串表示形式转换为其无符号的本机整数当量。返回值表示转换是否成功。\r\n","Exports an ":"出口\r\n","Returns all namespaces defined in the scope of the current node. This includes the ":"返回当前节点范围中定义的所有名称空间。这包括\r\n","Gets the post-schema-validation infoset (PSVI) of a validated element.":"获取经过验证的元素的验证后验证信息（PSVI）。\r\n"," object is overridden.":" 对象被覆盖。\r\n","Gets the state of the writer.":"获得作家的状态。\r\n","A64: UQSHRN Vd.4H, Vn.4S, #n":"A64：UQSHRN VD.4H，VN.4S，#N\r\n","Gets the callback method that instantiates the ":"获取实例化的回调方法\r\n","Retrieves a double-precision floating-point value from the ":"从\r\n","Returns a filtered collection of elements that contains every element in the source collection, and the ancestors of every element in the source collection. Only elements that have a matching ":"返回包含源集合中每个元素的元素的过滤集合，以及源集合中每个元素的祖先。只有匹配的元素\r\n","Serialize this streaming element to a file, optionally disabling formatting.":"将此流元素序列化为文件，可选地禁用格式。\r\n","Returns the cosine of the specified complex number.":"返回指定的复合号的余弦。\r\n"," is used at execution time to get the return value of the function.":" 在执行时间使用以获取函数的返回值。\r\n","Gets the collection of typed serializers that is found in the assembly.":"获取在组件中发现的打字串行序列的集合。\r\n","Gets the current element in the collection of ":"在集合中获取当前元素\r\n"," element for a given object.":" 给定对象的元素。\r\n","Transforms XML data using an Extensible Stylesheet Language for Transformations (XSLT) style sheet.":"使用用于转换（XSLT）样式表的扩展样式语言转换XML数据。\r\n","Converts the value of the specified Unicode character to the equivalent 8-bit signed integer.":"将指定的Unicode字符的值转换为等效的8位签名整数。\r\n"," or sort key includes a prefix and either an ":" 或排序密钥包括前缀，要么\r\n","Writes an opening element tag, including any attributes.":"写一个开头元素标签，包括任何属性。\r\n","Searches for the specified schema and returns the zero-based index of the first occurrence within the entire ":"搜索指定的模式，并返回整个中首次出现的基于零的索引\r\n","Generates a mapping to an XML Schema element for a specified .NET type.":"为指定的.NET类型生成映射到XML架构元素。\r\n"," of the specified name and type.":" 指定的名称和类型。\r\n","Adds a new method to the type, with the specified name and method attributes.":"将新方法添加到该类型，并带有指定的名称和方法属性。\r\n","Writes out a processing instruction with a space between the name and text as follows: <?name text?>.":"写下一个处理指令，具有以下名称和文本之间的空间：<？name text？>。\r\n","Returns a user-readable string that describes the local variable.":"返回描述本地变量的用户可读字符串。\r\n","Provides options that control the behavior of bounded ":"提供控制有限行为的选项\r\n","When overridden in a derived class, creates a new ":"当在派生的班级中覆盖时，会创建一个新的\r\n"," from a file, optionally preserving white space, setting the base URI, and retaining line information.":" 从文件中，可选地保留空白，设置基本URI并保留线路信息。\r\n","When overridden in a derived class, closes one element and pops the corresponding namespace scope.":"当在派生类中覆盖时，关闭一个元素并弹出相应的名称空间范围。\r\n","Represents text as a sequence of UTF-16 code units.":"将文本表示为UTF-16代码单元的序列。\r\n","Sorts the elements of a sequence in descending order by using a specified comparer.":"通过使用指定的比较以降序顺序分类序列的元素。\r\n"," object that corresponds to the XML URI (":" 对应于XML URI的对象（\r\n","Describes the context in which a set of schema is bound to .NET code entities.":"描述一组架构与.NET代码实体绑定的上下文。\r\n","A64: SABDL2 Vd.4S, Vn.8H, Vm.8H":"A64：SABDL2 VD.4S，VN.8H，VM.8H\r\n"," objects, starting at the specified index of the target array.":" 对象，从目标数组的指定索引开始。\r\n","Gets the name of the XSD element of the mapping.":"获取映射的XSD元素的名称。\r\n","Encodes the specified character span into the specified byte span.":"将指定的字符跨度编码到指定的字节跨度。\r\n","Returns a collection of the sibling nodes after this node, in document order.":"按照文档顺序返回此节点后的兄弟节点的集合。\r\n","Uses the information in the ":"在\r\n"," must serialize a member as an empty XML tag with the ":" 必须将成员序列化为一个空的XML标签\r\n"," does not support the type of the object specified.":" 不支持指定的对象的类型。\r\n","The element type of the span.":"跨度的元素类型。\r\n","Gets the text of the XML node being deserialized.":"获取XML节点的文本被序列化。\r\n","Gets or sets the markup representing the child nodes of the current node.":"获取或设置代表当前节点的子节点的标记。\r\n"," is less than 0 or greater than 59.":" 小于0或大于59。\r\n","Contains functionality to compare nodes for their document order. This class cannot be inherited.":"包含可以比较节点的文档顺序的功能。这个类不能被继承。\r\n","Obtains machine-scoped isolated storage corresponding to the calling code's assembly identity.":"获取与调用代码的汇编身份相对应的机器分割的隔离存储。\r\n","Removes nodes and attributes from this ":"从此删除节点和属性\r\n"," parameter contains an XPath expression that is not valid.":" 参数包含无效的XPath表达式。\r\n","When overridden in a derived class, creates a symmetric encryptor object with the specified ":"当在派生的类中覆盖时，将使用指定的对象创建对称的加密对象\r\n"," parameter specifies an object to be overridden. The ":" 参数指定要覆盖的对象。这\r\n","Gets the Document Type Definition (DTD) for this document.":"获取本文档的文档类型定义（DTD）。\r\n","Converts the current value to a 32-bit signed integer based on the underlying type.":"根据基础类型将当前值转换为32位签名的整数。\r\n"," used to construct this ":" 用于构造这个\r\n"," parameter specifies an object to be overridden by the ":" 参数指定要覆盖的对象\r\n"," enables more efficient XPath expression processing.":" 启用更有效的XPath表达处理。\r\n","Gets the number of elements contained in ":"获取包含的元素数量\r\n"," object that specifies the Elliptic Curve Diffie-Hellman (ECDH) family of algorithms.":" 指定算法的椭圆形曲线差异 - 赫尔曼（ECDH）家族的对象。\r\n"," is thrown with the message \"An asynchronous operation is already in progress.\"\r\n\r\n-or-\r\n    \r\nAn ":" 传递消息“已经进行了异步操作”。\r\n\r\n-或者-\r\n    \r\n一个\r\n"," attribute for the XML element at the current location of the ":" XML元素的属性在当前位置\r\n","Displays a date using the long-date format specified in your computer's regional settings. This member is equivalent to the Visual Basic constant ":"使用计算机区域设置中指定的长期格式显示日期。该成员等同于视觉基本常数\r\n","Uses the supplied context to evaluate the ":"使用所提供的上下文评估\r\n","Gets or sets a value indicating whether the ":"获取或设置一个值，指示是否\r\n","Gets or sets how many IndentChars to write for each level in the hierarchy when ":"获取或设置在层次结构中为每个级别编写多少个indentchars\r\n","Reads a forward-only stream of rows from a data source.":"读取来自数据源的远前行流。\r\n","Gets the Uniform Resource Identifier (URI) of this namespace.":"获取此名称空间的统一资源标识符（URI）。\r\n"," class that can serialize objects of the specified type into XML documents, and vice versa. Specifies the object that represents the XML root element.":" 可以将指定类型的对象序列化为XML文档的类，反之亦然。指定表示XML根元素的对象。\r\n","Specifies whether relevant ":"指定是否相关\r\n","Represents an XML Schema Definition Language (XSD) Schema validation engine. The ":"代表XML模式定义语言（XSD）架构验证引擎。这\r\n"," provides additional runtime arguments.":" 提供其他运行时参数。\r\n"," would result in invalid XML.":" 将导致无效的XML。\r\n","Gets the default event for the specified component.":"获取指定组件的默认事件。\r\n","A64: SQNEG Sd, Sn":"A64：SQNEG SD，SN\r\n","Represents an object that waits for the completion of an asynchronous task and provides a parameter for the result.":"代表一个对象，该对象等待完成异步任务并为结果提供参数。\r\n","The alignment (in bytes) of sections when they are loaded into memory.":"将截面的对齐（以字节）加载到内存中时。\r\n","Gets or sets the namespace of the generated XML element.":"获取或设置生成的XML元素的名称空间。\r\n","Asynchronously writes the XML declaration with the version \"1.0\".":"异步用版本“ 1.0”编写XML声明。\r\n","Gets or sets the name of the assembly that contains serializers for a specific set of types.":"获取或设置包含一组特定类型的串行化的组件的名称。\r\n","Returns a collection of the child elements of this element or document, in document order.":"根据文档顺序返回此元素或文档的子元素的集合。\r\n"," with the position of the ":" 与\r\n","Converts the value of the specified 32-bit signed integer to an equivalent double-precision floating-point number.":"将指定的32位签名整数的值转换为等效的双精度浮点数。\r\n","Gets or sets a value that specifies how white space is handled.":"获取或设置一个指定如何处理空白的值。\r\n"," that indicates that an enumeration value is not valid.":" 这表明枚举值无效。\r\n","The character is in the surrogate pair character range, ":"角色在替代对范围内，\r\n","The last node to replace specified is not a valid sibling node of the current node.":"替换指定的最后一个节点不是当前节点的有效兄弟姐妹节点。\r\n","Gets the common language runtime type for the specified XML Schema definition language (XSD) type.":"获取指定XML模式定义语言（XSD）类型的通用语言运行时类型。\r\n","Gets the base URI for this ":"为此获取基本URI\r\n"," is not positioned on an element node or the root node.":" 不在元素节点或根节点上。\r\n","#x20":"＃x20\r\n"," using a XPath expression.":" 使用XPATH表达式。\r\n","Gets a schema type object.":"获取模式类型对象。\r\n","The value specified cannot be ":"指定的值不能是\r\n","int32x4_t vqdmlal_lane_s16 (int32x4_t a, int16x4_t b, int16x4_t v, const int lane) A32: VQDMLAL.S16 Qd, Dn, Dm[lane] A64: SQDMLAL Vd.4S, Vn.4H, Vm.H[lane]":"int32x4_t vqdmlal_lane_s16（int32x4_t a，int16x4_t b，int16x4_t v，const int lane）a32：vqdmlal.s16 qd，dn，dn，dm [lane] a64 a64：sqdmlal vd.4s，vn.4s，vn.4 lane v.hh4 lane，\r\n","Values are sorted numerically.":"值以数值为单位分类。\r\n","Returns a collection of nodes that contains every element in the source collection, and the descendant nodes of every element in the source collection.":"返回一个节点集合，其中包含源集合中的每个元素，以及源集合中每个元素的后代节点。\r\n","When overridden in a derived class, encodes the specified binary bytes as Base64 and writes out the resulting text.":"当在派生类中覆盖时，将指定的二进制字节编码为base64并写出结果文本。\r\n"," attribute value is invalid.":" 属性值无效。\r\n","The two nodes do not share a common ancestor.":"这两个节点没有共同的祖先。\r\n","Gets or sets the maximum number of redirects that the handler follows.":"获取或设置处理程序遵循的最大重定向数量。\r\n","Represents white space in element content.":"代表元素内容中的空白。\r\n","A32: VMOVN.I32 Dd, Qm":"A32：vmovn.i32 DD，QM\r\n","Processes the element and attribute names in the XML schemas and, optionally, validates the XML schemas.":"处理XML模式中的元素和属性名称，并选择验证XML模式。\r\n","Gets or sets the name of the field that returns the enumeration to use when detecting types.":"获取或设置在检测类型时返回枚举的字段名称。\r\n","NCName type.":"NCNAME类型。\r\n"," other than String.Empty.":" 除了string.empty。\r\n"," to the first attribute of the current node.":" 到当前节点的第一个属性。\r\n","Tries to convert the span representation of a number to its 32-bit unsigned integer equivalent. A return value indicates whether the conversion succeeded or failed.":"试图将数字的跨度表示为其32位无符号整数等效。返回值表示转换是成功还是失败。\r\n","Initializes object references only while serializing a SOAP-encoded SOAP message.":"仅在序列化SOAP编码的SOAP消息时初始化对象引用。\r\n",", and returns the typed result.":"，并返回键入结果。\r\n"," and defines which well-known DTDs that the ":" 并定义了哪些众所周知的DTD\r\n"," object for navigating through nodes in this ":" 在此中导航节点的对象\r\n","Gets the formatted error message describing the current exception.":"获取描述当前异常的格式化错误消息。\r\n","Returns the closest prefix defined in the current namespace scope for the namespace URI.":"返回名称空间URI当前名称空间范围中定义的最接近的前缀。\r\n","When overridden in a derived class, forces the generation of a character entity for the specified Unicode character value.":"当在派生类中覆盖时，会迫使指定的Unicode字符值的字符实体生成。\r\n","new SampleType[]{a, b, c}":"新的采样型[] {a，b，c}\r\n","Returns a string created by joining a number of substrings contained in an array.":"返回通过连接数组中包含的许多子字符串创建的字符串。\r\n","The current node does not conform to a valid style sheet.":"当前节点不符合有效的样式表。\r\n","Writes a SOAP message XML element that can contain a reference to a ":"写下肥皂消息XML元素，该元素可以包含对\r\n","Locates in one of the XML schemas an ":"位于XML模式之一中\r\n","ID":"ID\r\n","Write methods are generated.":"写入方法是生成的。\r\n"," that indicates that a type being serialized is not being used in a valid manner or is unexpectedly encountered.":" 这表明一种被序列化的类型没有以有效的方式使用或意外遇到。\r\n","Writes the namespace declaration attributes.":"写名称空间声明属性。\r\n","Returns a collection of elements that contains every element in the source collection, and the descendent elements of every element in the source collection.":"返回包含源集合中每个元素的元素集合，以及源集合中每个元素的后代元素。\r\n"," object specified for namespace resolution, and returns an ":" 为命名空间分辨率指定的对象，并返回\r\n"," objects with XML schema element declarations that are found in type mapping objects.":" 具有XML模式元素声明的对象，这些声明在类型映射对象中找到。\r\n","Deserializes an object from a SOAP-encoded ":"从SOAP编码的对象进行测试\r\n"," segment.":" 部分。\r\n","Adds the period of time indicated by the supplied ":"添加所提供的时间段\r\n","Gets the array into which the callback method copies a collection.":"获取回调方法复制集合的数组。\r\n"," class, taking a collection of ":" 上课，收集\r\n","Returns a collection of the sibling elements after this node, in document order.":"按照文档顺序返回此节点之后的兄弟姐妹元素的集合。\r\n","Gets the high memory load threshold when the last garbage collection occurred.":"最后一次垃圾收集时，获取高内存负载阈值。\r\n"," is an open generic type (that is, the ":" 是一种开放的通用类型（即\r\n","Sorts the elements in the entire ":"分类整个元素\r\n","Specifies that the search will be from right to left instead of from left to right. For more information, see the \"Right-to-Left Mode\" section in the Regular Expression Options article.":"指定搜索将是从右到左而不是从左到右。有关更多信息，请参见《正则表达式选项》文章中的“左至左模式”部分。\r\n","Format (indent) the XML while serializing.":"序列化时格式（缩进）XML。\r\n","Creates a new enumerator that contains the same enumeration state as the current one.":"创建一个与当前枚举状态相同的枚举状态的新枚举者。\r\n","Gets the module in the current ":"获取当前的模块\r\n","Creates a cancelable continuation that executes asynchronously when the target ":"创建一个可取消的延续，当目标时执行异步\r\n"," class from the XML data in the file specified with the white space handling specified.":" 从指定的白空间处理指定的文件中的XML数据中的类。\r\n","Represents a writer that provides a fast, non-cached, forward-only way of generating streams or files containing XML data that conforms to the W3C Extensible Markup Language (XML) 1.0 and the Namespaces in XML recommendations.  \r\n  \r\n Starting with the .NET Framework 2.0, we recommend that you use the ":"代表一个作者，该作者提供了一种快速，非空缺，仅向前的方式，用于生成符合W3C可扩展标记语言（XML）1.0和XML建议中的命名空间的XML数据的流或文件。\r\n  \r\n 从.NET Framework 2.0开始，我们建议您使用\r\n","Writes an XML element whose body is empty.":"写一个XML元素，其身体是空的。\r\n","A64: AESMC V>.16B, Vn.16B":"A64：AESMC v> .16b，vn.16b\r\n","Gets the callback method that creates an instance of the ":"获取可创建一个实例的回调方法\r\n","Returns a value indicating whether two instances of ":"返回一个值，指示是否有两个实例\r\n"," that indicates that an XML element that should adhere to the XML Schema ":" 这表明应遵守XML模式的XML元素\r\n"," XML element for a given object.":" 给定对象的XML元素。\r\n","Gets the object associated with the specified (base class) type.":"获取与指定（基类）类型关联的对象。\r\n","Returns an enumerator that iterates through the collection of XML schemas.":"返回通过XML模式的集合来迭代的枚举者。\r\n","The item's value is not in the correct format for the target type.":"项目的值不适合目标类型的正确格式。\r\n","Performs in parallel a subsequent ordering of the elements in a sequence in ascending order by using a specified comparer.":"通过使用指定的比较并以序列顺序以序列顺序对元素进行并行执行。\r\n","Writes an object that uses custom XML formatting as an XML element.":"将使用自定义XML格式作为XML元素的对象写入。\r\n"," indicating whether this column is hidden, or ":" 指示该列是隐藏的，还是\r\n","A call is made to write more output after ":"打电话以写出更多输出之后\r\n","A64: FMINNM Dd, Dn, Dm":"A64：FMINNM DD，DN，DM\r\n"," for the specified Uniform Resource Identifier (URI).":" 对于指定的统一资源标识符（URI）。\r\n"," to the following element of the ":"到以下元素\r\n","Deserializes an XML document contained by the specified ":"应对指定的XML文档进行验证\r\n"," includes the final bit in the ":" 包括最后一部分\r\n"," serializes a public field or public read/write property as an XML attribute.":" 将公共字段或公共读/写入属性序列化为XML属性。\r\n"," element of the style sheet.":" 样式表的元素。\r\n"," objects representing the XML schemas used by SOAP literal messages defined in a WSDL document.":" 代表WSDL文档中定义的SOAP文字消息使用的XML模式的对象。\r\n","Gets or sets a value which indicates whether the source column is nullable. This allows ":"获取或设置一个指示“源列”是否可随机列的值。这允许\r\n","Gets the XML reader object that is used by the serializer.":"获取序列化器使用的XML读取器对象。\r\n","Provides the base class for a generic read-only collection.":"提供仅通用阅读集合的基类。\r\n"," method has been called previously for this task.":" 此任务之前已调用方法。\r\n","Called by clients to authenticate the server and optionally the client in a client-server connection as an asynchronous operation. The authentication process uses information specified in the ":"客户呼叫客户验证服务器，并在客户端服务器连接中所选的客户端作为异步操作。身份验证过程使用在\r\n","When overridden in a derived class, writes the XML declaration with the version \"1.0\".":"当在派生类中覆盖时，用版本“ 1.0”编写XML声明。\r\n","Returns an enumerator that iterates through the string dictionary.":"返回通过字符串词典进行迭代的枚举器。\r\n","Gets the parent of the current node.":"获取当前节点的父。\r\n","The property is being set to an invalid value.":"该属性被设置为无效的值。\r\n"," has been called or the result of this call is an invalid XML document.\r\n\r\n-or-\r\n\r\nAn ":" 已被调用或此调用的结果是无效的XML文档。\r\n\r\n-或者-\r\n\r\n一个\r\n"," object that is being used by ":" 正在使用的对象\r\n","Returns the name of the assembly that contains one or more versions of the ":"返回包含一个或多个版本的组件名称\r\n","Gets the number of elements in the immutable sorted set.":"获取不变的排序集中的元素数量。\r\n","When overridden in a derived class, sets the value of the component to a different value.":"当在派生类中覆盖时，将组件的值设置为另一个值。\r\n","The current size of the isolated store is undefined.":"隔离商店的当前尺寸不确定。\r\n","When overridden in a derived class, writes out the attribute with the specified prefix, local name, namespace URI, and value.":"当在派生类中覆盖时，用指定的前缀，本地名称，名称空间URI和值写出属性。\r\n","Gets or sets the type of text encoding to use.":"获取或设置要使用的文本编码类型。\r\n"," from a string that represents the time.":" 来自代表时间的字符串。\r\n"," class, specifying the initial number of entries and the maximum number of concurrent entries.":" 类，指定初始条目数量和并发条目的最大数量。\r\n","Gets a comma-delimited list of XML element names expected to be in an XML document instance.":"获取预期在XML文档实例中预期的XML元素名称的逗号删除列表。\r\n"," contains a null value (":" 包含一个null值（\r\n","Opens the specified named synchronization event, if it already exists.":"如果已经存在，则打开指定的同步事件。\r\n","Decodes an XML name.":"解码XML名称。\r\n",", outputs two specified messages and displays a message box that shows the call stack.":"，输出两个指定的消息，并显示一个显示呼叫堆栈的消息框。\r\n","Applied to a Web service client proxy, enables you to specify an assembly that contains custom-made serializers.":"应用于Web服务客户端代理，使您可以指定包含自定义串行器的程序集。\r\n","Gets or sets the XML Schema definition language (XSD) data type of the generated XML element.":"获取或设置生成的XML元素的XML模式定义语言（XSD）数据类型。\r\n","Time data based on a 24-hour clock. Time value range is 00:00:00 through 23:59:59.9999999 with an accuracy of 100 nanoseconds. Corresponds to a SQL Server ":"时间数据基于24小时时钟。时间值范围是00:00:00至23：59：59.999999，精度为100纳秒。对应于SQL Server\r\n","ENUMERATION type.":"枚举类型。\r\n","A64: USUBL2 Vd.2D, Vn.4S, Vm.4S":"A64：USUBL2 VD.2d，VN.4S，VM.4S\r\n","Removes the specified access rule from the Discretionary Access Control List (DACL) that is associated with the current ":"从与当前关联的酌处访问控制列表（DACL）中删除指定的访问规则\r\n",", or a portion of it to a one-dimensional array.":"，或其中一部分到一维数组。\r\n","Removes from the ":"从\r\n","This method was called outside the prolog (after the root element).":"该方法被称为序言之外（在根元素之后）。\r\n","Gets the number of work items that have been processed so far.":"获取到目前为止处理的工作项目数量。\r\n"," is greater than zero and is greater than or equal to the length of ":" 大于零，大于或等于\r\n","Gets the method used to serialize the ":"获取用于序列化的方法\r\n","Initializes a read-only ":"初始化一个只读\r\n","Gets the current node's value as an ":"获取当前节点的值作为\r\n"," The qualified name of the element.":" 元素的合格名称。\r\n"," class from the XML data in the specified file.":" 从指定文件中的XML数据类。\r\n","Gets the line number where the unknown element was encountered if the XML reader is an ":"如果XML读取器是一个，获取遇到未知元素的行号\r\n","= 'preserve' scope.":"='保存范围。\r\n","Returns a collection of the sibling nodes before this node, in document order.":"按照文档顺序，在此节点之前返回兄弟节点的集合。\r\n"," is also used to handle any import or include elements found in XML Schema definition language (XSD) schemas.":" 还用于处理任何导入或包含XML模式定义语言（XSD）架构中的元素。\r\n"," for the callback method.":" 对于回调方法。\r\n","A64: SCVTF Dd, Dn":"A64：SCVTF DD，DN\r\n","Prevents a specified name from being used within the ":"防止指定名称在\r\n",", optionally setting the base URI, and retaining line information.":"，可选地设置基本URI并保留线路信息。\r\n","Gets a collection of objects that specify how the ":"获取一个对象集合，以指定\r\n","Produces a string from a ":"从一个\r\n","Gets the contents of the ":"获取内容\r\n","Generates internal type mapping information for an element defined in an XML schema document.":"为XML模式文档中定义的元素生成内部类型映射信息。\r\n","The request for the minimum permissions required for code to run. This action can only be used within the scope of the assembly.":"代码运行所需的最小权限请求。此操作只能在组件范围内使用。\r\n","A32: SHA256H2.32 Qd, Qn, Qm":"A32：SHA256H2.32 QD，QN，QM\r\n","Tries to format the value of the current 8-bit signed integer instance into the provided span of characters.":"试图将当前8位签名的整数实例的值格式化为提供的字符跨度。\r\n","Loads a method from a style sheet compiled using the ":"使用使用该样式表的样式表加载方法\r\n","There was an error executing the XSLT transform.":"执行XSLT变换存在错误。\r\n","Returns the tangent of the specified complex number.":"返回指定的复数号码的切线。\r\n","Closes the previous ":"关闭上一个\r\n","NOTATION type.":"符号类型。\r\n"," that represents the asynchronous operation of a ":"这代表了A的异步操作\r\n"," especially created to serialize or deserialize the specified type.":" 特别是为了序列化或估算指定类型而创建的。\r\n","Returns a value that indicates whether two planes are not equal.":"返回一个指示两个平面是否不相等的值。\r\n","Creates a new child node at the beginning of the list of child nodes of the current node using the nodes in the ":"在当前节点的子节点列表的开头创建一个新的子节点\r\n","Removes the specified object from the collection.":"从集合中删除指定的对象。\r\n","Compares the values of two nodes, including the values of all descendant nodes.":"比较两个节点的值，包括所有后代节点的值。\r\n","Generates internal type mapping information for an element defined in an XML schema document or as a part in a WSDL document.":"为XML模式文档中定义的元素或WSDL文档中定义的元素生成内部类型映射信息。\r\n","Compares the values of two nodes.":"比较两个节点的值。\r\n"," object parameter is not well-formed.":" 对象参数不正确。\r\n","Gets or sets the reading mode for a ":"获取或设置阅读模式\r\n","Writes a byte array as the body of an XML element. ":"将字节阵列写为XML元素的主体。\r\n","The text would result in a non-well formed XML document or ":"该文本将导致非电网形成的XML文档或\r\n"," from a string that contains XML.":" 来自包含XML的字符串。\r\n","Describes a schema importer.":"描述了模式进口商。\r\n","Returns a filtered collection of elements that contain this element, and the ancestors of this element. Only elements that have a matching ":"返回包含此元素的元素的过滤集合以及该元素的祖先。只有匹配的元素\r\n","Executes the transform using the input document specified by the URI and outputs the results to an ":"使用URI指定的输入文档执行转换，并将结果输出到一个\r\n"," class using the specified value as the name of the XML attribute.":" 使用指定值作为XML属性的名称。\r\n","Gets or sets a value that indicates whether the XML element name generated by the ":"获取或设置一个指示是否由XM​​L元素名称生成的值\r\n"," which has been invalidly applied to a member; only members that are of type ":" 已无效地应用于会员；只有类型的成员\r\n","A signed number that indicates the relative values of the instance and value.  \r\n  \r\n ":"指示实例和值相对值的签名数字。\r\n  \r\n \r\n","Write this document to an ":"将此文档写给\r\n"," class and specifies the name and XML namespace of the type.":" 类并指定该类型的名称和XML名称空间。\r\n",", external resources are not resolved.  \r\n  \r\n In version 1.1 of the .NET Framework, the caller must be fully trusted in order to specify an ":"，外部资源无法解决。\r\n  \r\n 在.NET框架的版本1.1中，必须完全信任呼叫者以指定一个\r\n","Loads and compiles the XSLT style sheet specified by the URI. The ":"加载并编译由URI指定的XSLT样式表。这\r\n","Event argument for a ":"事件参数\r\n","No route to the remote host exists.":"没有通往远程主机的路线。\r\n","Returns an object that represents the specified method declared by the current type.":"返回表示当前类型声明的指定方法的对象。\r\n","Adds the specified content immediately after this node.":"在此节点之后立即添加指定的内容。\r\n","Returns the value of the namespace node corresponding to the specified local name.":"返回与指定本地名称相对应的名称空间节点的值。\r\n","Validates that an ":"验证该\r\n","Preserve all insignificant white space while serializing.":"在序列化的同时保留所有微不足道的空白空间。\r\n","The offset is greater than 14 hours or less than -14 hours.  \r\n  \r\n -or-  \r\n  \r\n The ":"偏移大于14小时或小于-14小时。\r\n  \r\n -或者-\r\n  \r\n 这\r\n","Controls the schema generated by the ":"控制由\r\n","Removes all leading whitespace characters from a memory region.":"从内存区域删除所有领先的空格字符。\r\n","Gets the previous attribute of the parent element.":"获取父元素的先前属性。\r\n","Encodes an XML name.":"编码XML名称。\r\n"," class using the specified XML serialization overrides and default XML namespace.":" 使用指定的XML序列化覆盖和默认XML名称空间的类。\r\n","Gets or sets which character to use for indenting when ":"获取或设置哪个字符用于缩进\r\n"," containing the contents of the specified ":" 包含指定的内容\r\n","Indicates which buttons to display when calling the ":"指示打电话时显示哪些按钮\r\n","Represents a text node.":"代表文本节点。\r\n"," class to the end of the collection.":" 班级到收藏的结尾。\r\n","Adds an object to the end of the collection.":"在集合的末端添加一个对象。\r\n","Asynchronously reads a sequence of bytes from the current Deflate stream, writes them to a byte array, advances the position within the Deflate stream by the number of bytes read, and monitors cancellation requests.":"异步读取当前气流流中的一个字节序列，将它们写入字节数组，通过读取字节数的数量来推进Deflate流中的位置，并监控取消请求。\r\n","Selects an ":"选择一个\r\n","When overridden in a derived class, gets the base URI for the current node.":"当在派生类中覆盖时，获取当前节点的基本URI。\r\n"," that can be inserted into the generated XML document.":" 可以将其插入生成的XML文档中。\r\n","Releases all resources used by this enumerator instance.":"释放此枚举器实例所使用的所有资源。\r\n","Asynchronously copies everything from the ":"异步复制所有内容\r\n","Writes raw markup manually from a character buffer.":"从角色缓冲区手动写下原始标记。\r\n","A node collection.":"节点集合。\r\n"," resolves any XSLT ":" 解决任何XSLT\r\n","When overridden in a derived class, gets a value indicating whether the item represents an XPath node or an atomic value.":"当在派生类中覆盖时，获取一个值，指示该项目表示XPath节点还是原子值。\r\n"," is currently positioned has a null attribute set to the value ":" 当前位置是否具有一个空属性设置为值\r\n"," representing the function. The ":" 表示功能。这\r\n"," has been or will be changed. In addition, a change in the serialization of an empty element (either from an empty tag to start/end tag pair or vice versa) raises this event.":" 已经或将要更改。此外，更改空元素的序列化（从空标签到启动/结束标签对，反之亦然）提出了此事件。\r\n","Retrieves a collection of custom attributes that are applied to a specified assembly.":"检索应用于指定程序集的自定义属性的集合。\r\n","A64: SMINP Vd.8H, Vn.8H, Vm.8H":"A64：sminp vd.8h，vn.8h，vm.8h\r\n","Provides an internal interface for accessing the arguments of DynamicExpression tree nodes as well as CallSite and Rewriting functionality.  You should not use this API.  It is only public due to DLL refactoring and exists only for internal performance optimizations.":"提供了一个内部接口，用于访问DynamiceCpression树节点的参数以及呼叫和重写功能。您不应该使用此API。它仅由于DLL重构而公开，并且仅用于内部性能优化。\r\n","Loads the compiled style sheet that was created using the XSLT Compiler (xsltc.exe).":"加载使用XSLT编译器（XSLTC.EXE）创建的编译样式表。\r\n","The password character specified when setting this property is the same as the current prompt character, ":"设置此属性时指定的密码字符与当前提示字符相同，\r\n","Gets the origin information of the packet that was received as a result of calling the ":"获取由于致电而收到的数据包的来源信息\r\n","Serialize this element to an ":"序列化此元素\r\n","Writes raw markup manually from a string.":"从字符串手动写下原始标记。\r\n","There was a parsing error loading the input document.":"加载输入文档有一个解析错误。\r\n","Converts the specified string representation of a time interval to its ":"将时间间隔的指定字符串表示为其\r\n","Represents a name of an XML element or attribute.":"表示XML元素或属性的名称。\r\n","Gets or sets the size, in bytes, of the data block used in the send operation.":"获取或设置发送操作中使用的数据块的大小，字节。\r\n","Gets or sets the standalone property for this document.":"获取或设置本文档的独立属性。\r\n","Provides information about the .NET runtime installation.":"提供有关.NET运行时安装的信息。\r\n","Lowercase letters are sorted before uppercase letters.":"小写字母在大写字母之前进行排序。\r\n"," value includes a filename or directory cannot be found.":" 值包括一个文件名或目录。\r\n","Sets the enumerator to its initial position, which is before the first element in the collection of ":"将枚举者设置为其初始位置，这是在集合中的第一个元素之前\r\n"," class for the specified type.":" 指定类型的类。\r\n"," to read the fully qualified name of the element where it is currently positioned.":" 读取当前位置的元素的完全合格名称。\r\n","Gets the current node's value as the ":"获取当前节点的值作为\r\n","Compares two nodes to determine their relative document order.":"比较两个节点以确定其相对文档顺序。\r\n"," and associates it with the namespace qualified name.":" 并将其与名称空间合格的名称相关联。\r\n"," attribute if the string's value is ":" 属性如果字符串的值为\r\n","Gets or sets a collection of objects that specify how the ":"获取或设置一个对象集合，以指定\r\n",", external resources are not resolved.  \r\n  \r\n In version 1.1 of the .NET Framework, the caller must be fully trusted to specify an ":"，外部资源无法解决。\r\n  \r\n 在.NET框架的1.1版中，必须完全信任呼叫者以指定\r\n"," + 1 - ":" + 1-\r\n"," has not advanced.":" 没有进步。\r\n","Requests the base URI information from the ":"从\r\n","Load an ":"加载an\r\n","The type of the elements of the items span.":"项目元素的类型跨度。\r\n"," to read a simple, text-only XML element that could be ":" 读一个简单的仅文本XML元素\r\n"," is readable.":" 是可读的。\r\n","Gets the public key of the assembly.":"获取集会的公钥。\r\n","Any of the ":"任何\r\n","Processes a base-64 byte array.":"处理基本64字节阵列。\r\n"," has been applied.":" 已应用。\r\n","  \r\n  \r\n -or-  \r\n  \r\n the value for ":"  \r\n  \r\n -或者-\r\n  \r\n 值\r\n","Gets or sets a value that indicates that the value of the corresponding XML element definition's ":"获取或设置一个指示相应XML元素定义的值的值\r\n","The current object size is undefined.":"当前对象大小不确定。\r\n","Gets or sets a value that specifies whether or not the ":"获取或设置一个指定的值\r\n","Inserts a schema into the ":"将模式插入\r\n","The function that best represents the object. Only one function in a type can have this attribute.":"最能代表对象的功能。类型中只有一个功能可以具有此属性。\r\n","Provides an iterator over a selected set of nodes.":"在选定的一组节点上提供迭代器。\r\n","When overridden in a derived class, specifies the ":"在派生类中覆盖时，指定\r\n","Removes the element with the specified key, if the key exists.":"如果键存在，则使用指定键删除元素。\r\n"," for each of the element parts of a literal SOAP message definition.":" 对于文字肥皂消息定义的每个元素部分。\r\n","The XPath expression contains an error or its return type is not a node set.":"XPath表达式包含错误或其返回类型不是节点集。\r\n"," property for use by the .NET infrastructure.":" .NET基础架构使用的属性。\r\n","Copies everything from the ":"复制所有内容\r\n","The item's value is not in the correct format for the ":"该项目的值不适用于正确的格式\r\n","Creates a new instance of the specified implementation of the Elliptic Curve Digital Signature Algorithm (ECDSA).":"创建椭圆曲线数字签名算法（ECDSA）的指定实现的新实例。\r\n","Removes all occurrences of white space characters from the beginning and end of the specified string.":"从指定字符串的开头和结尾删除白空间字符的所有出现。\r\n","Adds a parameter to the ":"将参数添加到\r\n","Determines whether the collection contains the specified object.":"确定该集合是否包含指定的对象。\r\n","Gets a value that indicates if the current node represents an XPath node.":"获取一个值，该值表示当前节点是否表示XPath节点。\r\n","Gets the prefix declared for the specified namespace URI.":"获取指定名称空间URI的前缀。\r\n","Selects a node set, using the specified XPath expression.":"使用指定的XPATH表达式选择节点集。\r\n","Generates internal type mappings for information that is gathered from a Web service method.":"生成内部类型映射以获取从Web服务方法收集的信息。\r\n"," property to the next node in the selected node set.":" 属性到所选节点集中的下一个节点。\r\n","IEnumerable<IGrouping<TKey, TSource>>":"ienumerable <igrouping <tkey，tsource >>\r\n","Gets or sets a value indicating whether the component is enabled.":"获取或设置一个指示该组件是否已启用的值。\r\n","There was a parsing error loading the style sheet.":"加载样式表有一个解析错误。\r\n","Generates a mapping to an XML Schema element for a .NET type.":"为.NET类型生成映射到XML模式元素。\r\n",", for all groups in the schema, which holds the post-compilation value of the ":"，对于架构中的所有组，都具有\r\n","Selects a collection of elements using an XPath expression, resolving namespace prefixes using the specified ":"使用XPath表达式选择元素集合，使用指定的命名空间前缀解决名称空间前缀\r\n","Converts the value of the specified 16-bit signed integer to an equivalent Boolean value.":"将指定的16位签名整数的值转换为等效的布尔值。\r\n","Transforms the XML data in the input file and outputs the result to an output file.":"将输入文件中的XML数据转换为输出文件中的XML数据。\r\n","import":"进口\r\n"," object from a local name and a namespace.":" 来自本地名称和名称空间的对象。\r\n","Creates Begin and End methods for the asynchronous invocation of Web methods.":"为Web方法的异步调用创建开始和结束方法。\r\n"," that indicates that an explicit reference conversion failed.":" 这表明明确的参考转换失败。\r\n","Sets the value of the current node.":"设置当前节点的值。\r\n"," that contains the specified value has been marked for deletion.":" 其中包含指定值已标记为删除。\r\n"," is not a member of ":" 不是\r\n"," is currently positioned.":" 目前已定位。\r\n","An error occurred during serialization. The original exception is available using the ":"在序列化过程中发生了错误。原始例外可用于使用\r\n","Gets the value of the attribute with the specified local name and namespace Uniform Resource Identifier (URI).":"使用指定的本地名称和名称空间统一资源标识符（URI）获取属性的值。\r\n","Asynchronously writes the given text content.":"异步写入给定的文本内容。\r\n","Gets or sets the version property for this document.":"获取或设置此文档的版本属性。\r\n","Replaces the children nodes of this document or element with the specified content.":"用指定的内容替换本文档或元素的子节点。\r\n"," or http://www.w3.org/1999/XSL/Transform  \r\n  \r\n The ":" 或http://www.w3.org/1999/xsl/transform\r\n  \r\n 这\r\n","Returns a filtered collection of the sibling elements before this node, in document order. Only elements that have a matching ":"按照文档顺序，在此节点之前返回兄弟姐妹元素的过滤集合。只有匹配的元素\r\n","Asynchronously writes out the specified name, ensuring it is a valid name according to the W3C XML 1.0 recommendation (https://www.w3.org/TR/1998/REC-xml-19980210#NT-Name).":"异步写出指定的名称，确保根据W3C XML 1.0推荐是有效的名称（https://www.w3.org/tr/1998/rec-xml-19980210#nt-name）。\r\n","Raises an ":"提高一个\r\n","Invalid value was specified.":"指定了无效的值。\r\n","Asynchronously writes this ":"异步写这本书\r\n","When overridden in a derived class, writes the DOCTYPE declaration with the specified name and optional attributes.":"当在派生类中覆盖时，用指定的名称和可选属性编写Doctype声明。\r\n","There is a character in the buffer that is a valid XML character but is not valid for the output encoding. For example, if the output encoding is ASCII, you should only use characters from the range of 0 to 127 for element and attribute names. The invalid character might be in the argument of this method or in an argument of previous methods that were writing to the buffer. Such characters are escaped by character entity references when possible (for example, in text nodes or attribute values). However, the character entity reference is not allowed in element and attribute names, comments, processing instructions, or CDATA sections.":"缓冲区中有一个有效的XML字符，但对于输出编码无效。例如，如果输出编码为ASCII，则仅应将元素和属性名称的0到127范围的字符使用。无效的字符可能是在此方法的参数中，也可能是在写入缓冲区的先前方法的参数中。此类字符在可能的情况下被字符实体引用逃脱（例如，在文本节点或属性值中）。但是，字符实体参考在元素和属性名称，评论，处理说明或CDATA部分中不允许参考。\r\n","The reader specified is not an ":"指定的读者不是\r\n","This operation is not supported on the current platform.  \r\n  \r\n -or-  \r\n  \r\n ":"当前平台不支持此操作。\r\n  \r\n -或者-\r\n  \r\n \r\n","Combines an ":"结合一个\r\n","Replaces the child nodes and the attributes of this element with the specified content.":"用指定的内容替换子节点和该元素的属性。\r\n","Gets the line position indicating where the error occurred in the style sheet.":"获取行位置，指示误差在样式表中发生的位置。\r\n","The type of the reference.":"参考的类型。\r\n"," with the specified property name.":" 带有指定的属性名称。\r\n"," to the next sibling node with the local name and namespace URI specified.":" 到下一个带有本地名称和名称空间URI的兄弟姐妹节点。\r\n","Represents an attribute that specifies the derived types that the ":"表示指定派生类型的属性\r\n","Gets the activity kind which the activity will be created with.":"获取活动将创建的活动类型。\r\n"," class with parameters for a callback method.":" 带有参数的类回调方法。\r\n","Setting this property to a negative value.":"将此属性设置为负值。\r\n"," class from the specified mappings.":" 从指定的映射中的类。\r\n"," property is assigned the text contained in the line.":" 分配了该行中包含的文本。\r\n"," parameter specifies objects that can be inserted into the array.":" 参数指定可以插入数组的对象。\r\n","Gets or sets which character to use to quote attribute values.":"获取或设置用于引用属性值的字符。\r\n","The distinguished name uses the new line character.":"杰出的名称使用新的行字符。\r\n"," class with the specified assembly name and location of the assembly.":" 具有指定的汇编名称和组件位置的课程。\r\n"," class and specifies the XML element name generated in the XML document instance.":" 类并指定XML文档实例中生成的XML元素名称。\r\n","Gets the container for the component.":"获取组件的容器。\r\n","Gets the first annotation object of the specified type from this ":"从此获取指定类型的第一个注释对象\r\n","Removes every node in the source collection from its parent node.":"从其父节点中删除源集合中的每个节点。\r\n"," has been or will be renamed.":" 已被重命名。\r\n"," class that can serialize objects of the specified type into XML documents, and deserialize XML documents into objects of the specified type. Specifies the default namespace for all the XML elements.":" 可以将指定类型的对象序列化为XML文档的类，并将XML文档置于指定类型的对象中。为所有XML元素指定默认名称空间。\r\n"," or writer is closed.\r\n\r\n-or-\r\n        \r\nAn ":" 或作家关闭。\r\n\r\n-或者-\r\n        \r\n一个\r\n"," object returned by the ":" 对象由\r\n","Sets the value of a child element, adds a child element, or removes a child element.":"设置子元素的值，添加子元素或删除子元素。\r\n"," inserts a ":" 插入a\r\n","Represents the TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256 cipher suite.":"代表tls_ecdhe_ecdsa_with_chacha20_poly1305_sha256密码套件。\r\n","Compiles the XPath expression specified and returns an ":"编译指定的XPath表达式并返回\r\n","The two nodes are not derived from ":"这两个节点不是从中得出的\r\n","Adds the specified content as the first children of this document or element.":"将指定的内容添加为本文档或元素的第一个孩子。\r\n"," conforms to an XSD in an ":" 符合XSD\r\n"," has line information.":" 有线路信息。\r\n","Gets or sets a value that indicates whether the name of the generated XML element is qualified.":"获取或设置一个指示生成的XML元素的名称是否合格的值。\r\n","A namespace, such as ":"名称空间，例如\r\n"," class with the specified content.":" 与指定内容的课程。\r\n"," value is less than or equal to a 64-bit unsigned integer.":" 值小于或等于64位未签名的整数。\r\n"," class that contains serialized data.":" 包含串行数据的类。\r\n","Specifies all public constructors.":"指定所有公共构造师。\r\n","Gets a stream used to write the input of the application.":"获取用于编写应用程序输入的流。\r\n"," to the next sibling node of the current node that matches the ":" 到匹配当前节点的下一个兄弟姐妹节点\r\n","Gets the object associated with the specified, base-class, type.":"获取与指定的基础类型类型关联的对象。\r\n","Asynchronously writes out a <![CDATA[...]]> block containing the specified text.":"异步写出a <！[cdata [...]]>包含指定文本的块。\r\n","Asynchronously closes any open elements or attributes and puts the writer back in the Start state.":"异步关闭任何开放元素或属性，并将作者放回开始状态。\r\n"," from a name that may contain a prefix.":" 来自可能包含前缀的名称。\r\n","Represents the access control and audit security for a directory. This class cannot be inherited.":"代表目录的访问控制和审核安全性。这个类不能被继承。\r\n","Serializes and deserializes objects into and from XML documents. The ":"序列化并从XML文档中序列化对象。这\r\n","The path to the folder is created if it does not already exist.":"如果尚不存在，则创建通往文件夹的路径。\r\n"," class that is used to serialize the specified type.":" 用于序列化指定类型的类。\r\n","Gets the .NET ":"获取.net\r\n","] enum specified by ":"]枚举\r\n","Transforms XML data using an XSLT style sheet.":"使用XSLT样式表转换XML数据。\r\n","Gets a range that consists of the entire Basic Multilingual Plane (BMP), from U+0000 to U+FFFF).":"获取一个由整个基本多语言平面（BMP）组成的范围，从U+0000到U+FFFF）。\r\n","Indicates whether a replacement string can be used when an input surrogate pair cannot be encoded, or whether the surrogate pair can be ignored. Parameters specify the surrogate pair and the index position of the pair in the input.":"指示当无法编码输入替代对时，是否可以使用替换字符串，或者是否可以忽略替代对。参数指定替代对和输入中对的索引位置。\r\n","This class contains the LINQ to XML extension methods for XSD validation.":"此类包含用于XSD验证的LINQ到XML扩展方法。\r\n","Gets an object that represents the unknown XML attribute.":"获取代表未知XML属性的对象。\r\n","This member supports .NET infrastructure and is not intended to be used directly from your code.":"该成员支持.NET基础架构，并且不打算直接从您的代码中使用。\r\n","Returns all namespaces defined in the scope of the current node, excluding the ":"返回当前节点范围中定义的所有名称空间，不包括\r\n","Gets the name of the parameter.":"获取参数的名称。\r\n"," property for this ":" 为此的属性\r\n",") and returns a generic ":"）并返回通用\r\n","VPCMPGTW ymm, ymm, ymm/m256":"VPCMPGTW YMM，YMM，YMM/M256\r\n","Inserts an item to the list at the specified index.":"将项目插入指定索引中的列表。\r\n","Setting this property to something other than either a single or double quote.":"将此属性设置为单个或双引号以外的事物。\r\n","The type of items in the immutable hash set.":"不变的哈希集中的项目类型。\r\n"," array contains a transparent proxy for a ":" 数组包含一个透明的代理\r\n","Controls deserialization by the ":"通过\r\n","Provides the exception thrown when an error occurs while processing an XPath expression.":"当处理XPath表达式时发生错误时，提供了异常。\r\n"," of the current node.":" 当前节点。\r\n","This method was called outside the prolog (after the root element).\r\n\r\n-or-\r\n\r\nAn ":"该方法被称为序言之外（在根元素之后）。\r\n\r\n-或者-\r\n\r\n一个\r\n","Occurs when a message is specified in the style sheet by the ":"当在样式表中指定消息时发生\r\n","Gets the GUID for the Properties window. This field is read-only.":"获取属性窗口的GUID。该字段仅阅读。\r\n","Asynchronously closes the previous ":"异步关闭以前\r\n","Provides the declaration as a formatted string.":"将声明作为格式字符串提供。\r\n"," class that can serialize objects of the specified type into XML documents, and deserialize XML documents into objects of the specified type.":" 可以将指定类型的对象序列化为XML文档的类，并将XML文档置于指定类型的对象中。\r\n","The type is predefined. The client application should automatically create a single instance of the object that has this attribute. The name of the variable that points to the object is the same as the class name of the object.":"类型是预定义的。客户端应用程序应自动创建具有此属性的对象的单个实例。指向对象的变量的名称与对象的类名相同。\r\n"," to read the current XML element if the element has a null attribute with the value true.":" 读取当前XML元素，如果该元素具有带有true值的null属性。\r\n"," / 3).":" / 3）。\r\n"," objects are unequal.":" 物体不平等。\r\n","Saves the XML document to the specified file. If the specified file exists, this method overwrites it.":"将XML文档保存到指定的文件中。如果指定的文件存在，则此方法覆盖它。\r\n","Writes the DOCTYPE declaration with the specified name and optional attributes.":"用指定的名称和可选属性写下Doctype声明。\r\n","Exports the current key in the PKCS#8 EncryptedPrivateKeyInfo format with a char-based password.":"用基于字符的密码在PKCS＃8 EncryptedPrivateKeyInfo格式中导出当前密钥。\r\n","Returns a collection of elements that contain this element, and the ancestors of this element.":"返回包含此元素的元素的集合以及该元素的祖先。\r\n","Gets or sets a value indicating whether to omit an XML declaration.":"获取或设置一个指示是否省略XML声明的值。\r\n","Returns the formatted (indented) XML for this streaming element.":"返回此流元素的格式（缩进）XML。\r\n","Specifies that the member can be further detected by using an enumeration.":"指定可以使用枚举进一步检测该成员。\r\n","Copies the contents of a managed ":"复制托管的内容\r\n","A64: UMULL2 Vd.4S, Vn.8H, Vm.H[lane]":"A64：Umull2 VD.4S，VN.8H，VM.H [Lane]\r\n","When overridden in a derived class, gets the current item as a boxed object of the most appropriate .NET Framework 2.0 type according to its schema type.":"当在派生类中覆盖时，将当前项目作为最合适的.NET Framework 2.0类型的盒装对象。\r\n"," is invalid.\r\n\r\n -or-\r\n\r\n The index of a format item is less than 0 (zero), or greater than or equal to 1.":" 是无效的。\r\n\r\n -或者-\r\n\r\n 格式项目的索引小于0（零）或大于或等于1。\r\n","object collection":"对象收集\r\n","preserve":"保存\r\n"," using the specified XPath query.":" 使用指定的XPATH查询。\r\n","The array is larger than 2 gigabytes (GB).":"阵列大于2 GB（GB）。\r\n","When overridden in a derived class, gets the index of the current position in the selected set of nodes.":"当在派生类中覆盖时，获取所选节点集中当前位置的索引。\r\n","Documents in a single stream do not share the same encoding.":"单流中的文档不共享相同的编码。\r\n","Specifies that Thursday should be used as the first day of the week when date-related functions are called.":"指定星期四应用作一周中的第一天，即调用与日期相关的功能。\r\n"," and does not contain a valid ":" 并且不包含有效的\r\n","An invalid surrogate character pair was passed.":"通过了无效的替代角色对。\r\n","Returns a filtered collection of the sibling elements after this node, in document order. Only elements that have a matching ":"根据文档顺序，该节点后返回兄弟姐妹元素的过滤集合。只有匹配的元素\r\n",", nor of a type such as ":"，也不是这样的类型\r\n","Tries to convert the span representation of a number to its ":"试图将一个数字的跨度表示为其\r\n"," is less than zero.  \r\n  \r\n -or-  \r\n  \r\n The buffer length minus ":" 小于零。\r\n  \r\n -或者-\r\n  \r\n 缓冲长度负\r\n"," The value of this instance is equal to the value of ":" 此实例的值等于\r\n","Gets any exception that was thrown during the construction of the event source.":"在活动源构建过程中获取任何例外。\r\n","Returns a filtered collection of the attributes of every element in the source collection. Only elements that have a matching ":"返回源集合中每个元素的属性的过滤集合。只有匹配的元素\r\n"," is deserializing.":" 是必不可少的。\r\n","Gets the current count of the ":"获取当前的计数\r\n","Marks a program element as read-only.":"将程序元素标记为只读。\r\n","Returns a string representation of the ":"返回一个字符串表示\r\n","Gets a value that indicates whether this object represents a failed operation.":"获取一个指示此对象是否表示失败操作的值。\r\n","The property is set to a culture name that cannot be used to locate a resource file. Resource filenames can include only letters, numbers, hyphens, or underscores.":"该属性设置为无法用于定位资源文件的文化名称。资源文件名只能包括字母，数字，连字符或下划线。\r\n","The type of field to read. This must be a reference type, not a value type.":"要阅读的字段类型。这必须是参考类型，而不是值类型。\r\n","Returns a filtered collection of the child elements of every element and document in the source collection. Only elements that have a matching ":"返回源集合中每个元素和文档的子元素的过滤集合。只有匹配的元素\r\n"," contains an unsupported flag; or ":" 包含一个不受支持的标志；或者\r\n","> element in a WSDL document for generating classes from the document.":"> WSDL文档中用于从文档生成类的元素。\r\n"," instance by using the specified URI and settings.":" 实例使用指定的URI和设置。\r\n"," parameter is an empty string (\"\") or does not exist.":" 参数是一个空字符串（“”）或不存在。\r\n"," object to write an ":" 对象写一个\r\n","When overridden in a derived class, writes the start of an attribute with the specified prefix, local name, and namespace URI.":"当在派生类中覆盖时，用指定的前缀，本地名称和名称空间URI写下属性的开始。\r\n"," object that enables support for the XSLT ":" 可以支持XSLT的对象\r\n","Writes out the specified name, ensuring it is a valid ":"写出指定的名称，确保它是有效的\r\n"," class for serialization of types from SOAP-encoded, non-root XML data.":" 从SOAP编码的非Root XML数据中序列化类型的类。\r\n","Gets the object the ":"获取对象\r\n"," class using the specified text writer and tab string.":" 使用指定的文本作者和选项卡字符串类。\r\n",", and stores the endpoint.":"并存储端点。\r\n"," and associates it with the namespace URI.":" 并将其与命名空间URI相关联。\r\n","A tag could not be decoded at the reader's current position.":"标签无法在读者的当前位置上解码。\r\n","Gets a collection of command-line arguments to use when starting the application. Strings added to the list don't need to be previously escaped.":"启动应用程序时获取要使用的命令行参数的集合。添加到列表中的字符串以前不需要被逃脱。\r\n"," to recognize a type when it serializes or deserializes an object.":" 识别类型序列化或应对对象的序列化时。\r\n","Gets the type of the XML node being deserialized.":"获取被序列化的XML节点的类型。\r\n","The current node's value is not in the correct format for the target type.":"当前节点的值不适合目标类型的正确格式。\r\n","Produces the result of a call to the ":"产生呼叫的结果\r\n"," value cannot be resolved.  \r\n  \r\n -or-  \r\n  \r\n An error occurred while processing the request.":" 价值无法解决。\r\n  \r\n -或者-\r\n  \r\n 处理请求时发生错误。\r\n","Gets a value indicating whether the visibility of this method or constructor is described by ":"获得一个值，指示该方法或构造函数的可见性是由\r\n"," class from the XML data in the specified ":" 从指定的XML数据中的类\r\n","Asynchronously generates and writes the surrogate character entity for the surrogate character pair.":"异步生成并写入替代角色对的替代角色实体。\r\n","Nodes are sorted in descending order. For example, if the numbers 1,2,3, and 4 are sorted in descending order, they appear as, 4,3,2,1.":"节点按降序排序。例如，如果数字1,2,3和4按降序排序，则它们的出现为4,3,2,1。\r\n","http://schemas.microsoft.com/ws/2008/06/identity/claims/ispersistent":"http://schemas.microsoft.com/ws/2008/06/istentity/claims/ispersistent\r\n","Encodes a valid XML local name by replacing characters that are not valid with escape sequences.":"通过替换无效的逃生序列的字符来编码有效的XML本地名称。\r\n","Write this comment to an ":"将此评论写给\r\n","Gets or sets a value that indicates whether asynchronous ":"获取或设置一个指示是否异步的值\r\n","Returns the preferred resource writer class for this kind of ":"返回此类首选资源作家类\r\n","Gets the parameter associated with the namespace qualified name.":"获取与名称空间合格名称关联的参数。\r\n"," value by zero.":" 值零。\r\n"," whose value matches the specified ":" 其价值与指定的\r\n","Writes an XML element whose text body is a value of a simple XML Schema data type.":"写一个XML元素，其文本主体是简单XML模式数据类型的值。\r\n","Gets information about the annual transition from standard time to daylight saving time.":"获取有关从标准时间到日光节省时间的年度过渡的信息。\r\n","Returns a hash code for the given object, using a hashing algorithm that ignores the case of strings.":"使用忽略字符串情况的哈希算法返回给定对象的哈希代码。\r\n","When overridden in a derived class, writes out the specified name, ensuring it is a valid NmToken according to the W3C XML 1.0 recommendation (https://www.w3.org/TR/1998/REC-xml-19980210#NT-Name).":"当在派生的班级中覆盖时，写出指定的名称，确保根据W3C XML 1.0推荐是有效的NMToken（https://www.w.org/tr/1998/rec-xml-19980210#nt-name ）。\r\n","Accepts a pending connection request as a cancellable asynchronous operation.":"接受待处理的连接请求作为可取消的异步操作。\r\n"," objects used by the ":" 对象\r\n","Requests the line information from the ":"从\r\n","Tries to enter the lock in upgradeable mode.":"尝试以可升级模式进入锁。\r\n"," must serialize a member that has the ":" 必须序列化具有\r\n","Advances the enumerator to the next item in the collection.":"将枚举者推进到集合中的下一个项目。\r\n","The state of writer is not ":"作者的状态不是\r\n"," can be examined reliably to determine whether the lock was acquired.":" 可以可靠地检查以确定是否获得锁。\r\n","Notifies a transaction participant that enlistment has completed successfully.":"通知交易参与者入伍已成功完成。\r\n","Represents primitive types by fields and primitive types by ":"通过字段和原始类型代表原始类型\r\n","Encrypt and sign data to help ensure the confidentiality and integrity of transmitted data.":"加密和签名数据，以帮助确保传输数据的机密性和完整性。\r\n","The exception that is thrown when an unrecognized HRESULT is returned from a COM method call.":"从com方法调用返回未认识的hresult时，抛出的例外。\r\n","Compares two 32-bit signed integers for equality and, if they are equal, replaces the first value.":"比较两个32位签名的整数的平等，如果它们相等，则取代了第一个值。\r\n","A node with only white space characters and no significant white space. White space characters are ":"一个只有白色空间字符的节点，没有明显的空白。白空间字符是\r\n"," or any of its descendants have changed.":" 或其任何后代都改变了。\r\n"," object within the body of a named XML element.":" 对象在命名XML元素的主体内。\r\n","Inserts an object in the immutable list at the specified index.":"将对象插入指定索引的不变列表中。\r\n","The Content-Range header, which specifies where in the full body the accompanying partial body data should be applied.":"内容范围的标头指定在整体中，应应用伴随的部分身体数据。\r\n","uint8x16_t vrev32q_u8 (uint8x16_t vec) A32: VREV32.8 Qd, Qm A64: REV32 Vd.16B, Vn.16B":"uint8x16_t vrev32q_u8（uint8x16_t vec）\r\n","The text would result in a non-well formed XML document.":"该文本将导致非井形形成的XML文档。\r\n","Streams the current node and its child nodes to the ":"将当前节点及其子节点流到\r\n"," does not contain root directory information.\r\n\r\n -or-\r\n \r\n":" 不包含根目录信息。\r\n\r\n -或者-\r\n \r\n\r\n"," object to handle remote host communication. This method returns a buffer that contains the initial data transferred.":" 对象处理远程主机通信。此方法返回一个包含传输初始数据的缓冲区。\r\n","Gets or sets an object that specifies how the ":"获取或设置一个指定的对象\r\n","This class provides access to Intel PCLMULQDQ hardware instructions via intrinsics.":"该课程通过内在提供了对Intel PCLMULQDQ硬件说明的访问权限。\r\n","Gets the quotation mark character used to enclose the value of an attribute node.":"获取用来封闭属性节点值的引号。\r\n","Supports mappings between .NET types and XML Schema data types.":"支持.NET类型和XML模式数据类型之间的映射。\r\n","The XML string parameter is not well-formed.":"XML字符串参数不正确。\r\n","When overridden in a derived class, determines whether the current ":"当在派生类中覆盖时，确定当前是否\r\n","Generates mappings to XML schema element declarations, including literal XML Schema Definition (XSD) message parts in a Web Services Description Language (WSDL) document, for .NET types or Web service method information.":"为.NET类型或Web Service方法信息，在Web服务说明语言（WSDL）文档中生成映射到XML模式元素声明，包括字面XML架构定义（XSD）消息零件。\r\n"," for the last day of last year with the results of a ":" 在去年的最后一天，结果\r\n","Evaluates the specified XPath expression and returns the typed result, using the ":"评估指定的Xpath表达式并使用\r\n","ebTypes":"ebtypes\r\n","http://www.w3.org/XML/1998/namespace":"http://www.w3.org/xml/1998/namespace\r\n","Allocates a ":"分配a\r\n","Gets a value that determines whether custom types are shared.":"获取一个确定自定义类型是否共享的值。\r\n","Satisfies a request for a resource from the cache, if the resource is available; otherwise, sends a request for a resource to the server. If the requested item is available in any cache between the client and the server, the request might be satisfied by the intermediate cache.":"如果资源可用，则满足从高速缓存的资源请求；否则，将资源请求发送到服务器。如果请求的项目可在客户端和服务器之间的任何缓存中可用，则中间缓存可能会满足请求。\r\n","Represents an XML Document Type Definition (DTD).":"表示XML文档类型定义（DTD）。\r\n"," namespace types.":" 名称空间类型。\r\n","Ignore the case.":"忽略案件。\r\n","Delegate that is used by the ":"由\r\n"," object to write an XML attribute.":" 对象编写XML属性。\r\n","Gets the fixed-position numeric value of the specified field.":"获取指定字段的固定位置数值。\r\n","The exception that is thrown to contain an exception thrown from one of the specified delegates.":"抛出的例外包含从指定的代表之一抛出的例外。\r\n"," does not match the length of ":" 与长度不符\r\n","Encodes the specified binary bytes as base64 and writes out the resulting text.":"将指定的二进制字节编码为base64，并写出结果文本。\r\n","Gets a comma-delimited list of XML attribute names expected to be in an XML document instance.":"获取预期在XML文档实例中预期的XML属性名称的逗号列表。\r\n","Returns the URI of this ":"返回其中的URI\r\n","Omit duplicate namespaces when loading the ":"加载时省略重复的名称空间\r\n"," object using the specified XPath query with the ":" 使用指定的XPath查询的对象\r\n","Always thrown when this method is called.":"当调用此方法时，请始终抛弃。\r\n","The writer is closed or in error state.\r\n-or-\r\n\r\nAn ":"作者已关闭或处于错误状态。\r\n-或者-\r\n\r\n一个\r\n","Adds a named code entity or type mapping to the ":"将命名的代码实体或类型映射添加到\r\n","Returns a collection of elements that contains the ancestors of every node in the source collection.":"返回包含源集合中每个节点的祖先的元素集合。\r\n"," remains empty.":" 保持空。\r\n"," representation for ":" 表示\r\n",". The runtime type of the node is determined by the ":"。节点的运行时类型由\r\n","Writes an XML element with a specified value in its body.":"写一个具有指定值的XML元素。\r\n","Writes an XML attribute.":"写一个XML属性。\r\n","Gets a collection of warnings that are generated when importing the code entity descriptions.":"获取导入代码实体说明时生成的警告集合。\r\n"," instance using the specified stream.":" 实例使用指定的流。\r\n"," object as an XML attribute.":" 对象作为XML属性。\r\n",". Otherwise, the version downgrades to HTTP/1.1. This option does not allow use of a prenegotiated clear text connection, for example, H2C.":"。否则，版本将降级为HTTP/1.1。此选项不允许使用预订的清晰文本连接，例如H2C。\r\n","Gets or sets the hash algorithm to use when signing and verifying data.":"签名和验证数据时获取或设置要使用的哈希算法。\r\n"," object that corresponds to the xmlns URI (":" 对应于XMLNS URI的对象（\r\n"," to the element with the local name and namespace URI specified, to the boundary specified, in document order.":" 到具有指定的本地名称和名称空间URI的元素，按文档顺序指定的边界。\r\n","Performs application-defined tasks associated with freeing, releasing, or resetting managed resources asynchronously.":"执行与释放，释放或重置托管资源相关的应用程序定义的任务。\r\n","It isn't known in the current context if the type reference or definition is a class or value type.":"如果类型参考或定义是类或值类型，则在当前上下文中尚不清楚。\r\n","Returns an accessor that allows you to navigate and edit the specified ":"返回登录器，该登录器允许您导航和编辑指定的\r\n","Asynchronously copies everything from the reader to the writer and moves the reader to the start of the next sibling.":"异步将从读者到作家的所有内容都复制，并将读者移至下一个兄弟姐妹的开始。\r\n"," has been or will be removed from an ":" 已经或将从\r\n","When overridden in a derived class, flushes whatever is in the buffer to the underlying streams and also flushes the underlying stream.":"当在派生的类中覆盖时，将缓冲区中的任何东西冲向下面的流，并冲洗下面的流。\r\n","Gets or sets the random number generator algorithm to use in the creation of the key exchange.":"获取或设置用于创建密钥交换的随机数生成器算法。\r\n"," provides additional run-time arguments and the ":" 提供额外的运行时间参数和\r\n","Indicates a SID for a batch process. This SID is added to the process of a token when it logs on as a batch job.":"指示批处理过程的SID。当该SID作为批处理作业登录时，将其添加到令牌的过程中。\r\n","Returns a string representation of the value of this ":"返回该值的字符串表示\r\n","QName type.":"QNAME类型。\r\n"," attribute for SOAP 1.2) that is used to refer to an XML element in SOAP encoding.":" SOAP 1.2）的属性，用于参考SOAP编码中的XML元素。\r\n","Copies the entire collection to a compatible one-dimensional array of ":"将整个系列复制到兼容的一维数组\r\n","When overridden in a derived class, sorts the nodes selected by the XPath expression according to the supplied parameters.":"当在派生类中覆盖时，根据所提供的参数对XPath表达式选择的节点进行分类。\r\n"," to write an object that uses custom XML formatting as an XML element.":" 编写一个使用自定义XML格式作为XML元素的对象。\r\n"," uses the specified ":" 使用指定的\r\n","Returns the specified nested type that is declared by this type.":"返回此类型声明的指定嵌套类型。\r\n"," class to specify loader optimizations for an executable.":" 类以指定可执行文件的加载程序优化。\r\n","Returns a collection of elements that contain this element, and all descendant elements of this element, in document order.":"返回包含此元素的元素集合，以及该元素的所有后代元素，按文档顺序排列。\r\n","The class cannot be exported as a structure or the field is nonpublic. Beginning with the .NET Framework version 2.0, the field may be private.":"该类不能以结构的形式导出，或者该字段是非公共的。从.NET Framework 2.0版本开始，该字段可能是私有的。\r\n"," parameter is negative, and is not equal to ":" 参数为负，不等于\r\n","VPSHUFHW ymm, ymm/m256, imm8":"vpshufhw ymm，ymm/m256，imm8\r\n","Returns the passed-in string if all the characters and surrogate pair characters in the string argument are valid XML characters, otherwise an ":"如果字符串参数中的所有字符和替代对字符是有效的XML字符，则返回传递的字符串，否则\r\n","Returns whether the collection contains the given ":"返回该集合是否包含给定的\r\n"," is set to a string that contains \"100-continue\" as a substring.":" 设置为包含“ 100-Continue”作为子字符串的字符串。\r\n"," attribute that appears in a SOAP-encoded ":" 在肥皂编码中出现的属性\r\n","ID type.":"ID类型。\r\n",".  \r\n  \r\n This method is being used to create an XML declaration after ":"。\r\n  \r\n 此方法用于创建XML声明之后\r\n"," can place in a serialized array.":" 可以放在串行阵列中。\r\n"," object for a single element part of a literal SOAP message definition.":" 字面肥皂消息定义的单个元素部分的对象。\r\n","The style sheet contains an error.":"样式表包含错误。\r\n",") is pushed onto the evaluation stack.":"）将其推入评估堆栈。\r\n"," field. Each member must use the ":" 场地。每个成员必须使用\r\n","Gets or sets the encoding for this document.":"获取或设置此文档的编码。\r\n"," is less than 0 or greater than 3.":" 小于0或大于3。\r\n","Represents the collection of XML schemas.":"代表XML模式的集合。\r\n","Creates a new sibling element after the current node using the namespace prefix, local name and namespace URI specified, with the value specified.":"使用指定的值指定的命名空间前缀，本地名称和名称空间URI，在当前节点之后创建一个新的同级元素。\r\n","When overridden in a derived class, copies everything from the reader to the writer and moves the reader to the start of the next sibling.":"当在派生的班级中覆盖时，将所有内容从读者到作家复制，并将读者移至下一个兄弟姐妹的开始。\r\n"," representing the version information associated with the specified file.":" 表示与指定文件关联的版本信息。\r\n",", but derived classes that have the concept of arrays might return ":"，但是具有数组概念的派生类可能会返回\r\n"," that indicates that an object being deserialized should be abstract.":" 这表明被估算化的对象应该是抽象的。\r\n","Specifies that a continuation will be a long-running, course-grained operation. It provides a hint to the ":"指定延续将是一个长期运行的课程元素操作。它提供了一个暗示\r\n","When overridden in a derived class, writes the specified start tag and associates it with the given namespace and prefix.":"当在派生类中覆盖时，写入指定的启动标签，并将其与给定的名称空间和前缀相关联。\r\n","You can only change this property when in the ":"您只能在\r\n","Specifies that the event is special in a way described by the name.":"指定事件以名称描述的方式是特殊的。\r\n","Gets the name of the XML node being deserialized.":"获取XML节点的名称，被序列化。\r\n","A32: VNEG.F64 Dd, Dm":"A32：VNEG.F64 DD，DM\r\n","Invalid value specified.":"指定的值无效。\r\n","Writes a single-precision floating-point number.":"写一个单精度的浮点数。\r\n","Gets the expanded name of this attribute.":"获取此属性的扩展名称。\r\n","Creates a new memory region over the portion of the target array beginning at a specified position and including a specified number of elements.":"从指定位置开始，包括指定数量的元素，在目标数组的部分上创建一个新的内存区域。\r\n"," that indicates a failure while writing an array where an XML Schema ":" 这表明在编写XML模式的数组时发生故障\r\n"," object that represents an assembly reference to the collection.":" 代表汇编引用该集合的对象。\r\n"," equivalent using the specified format, culture-specific format information, and style.\r\n            The format of the string representation must match the specified format exactly or an exception is thrown.":" 使用指定格式，特定于文化的格式信息和样式等效。\r\n            字符串表示的格式必须与指定格式匹配，或者抛出异常。\r\n","Closes one element and pops the corresponding namespace scope.":"关闭一个元素并弹出相应的名称空间范围。\r\n","xsl:import":"XSL：导入\r\n"," already has a parameter associated with it.":" 已经有一个与之关联的参数。\r\n"," object that represents the XPath expression.":" 代表XPath表达式的对象。\r\n"," that indicates that a type is unknown.":" 这表明类型未知。\r\n"," event of type ":" 类型的事件\r\n"," into the collection.":" 进入集合。\r\n"," serializes a SOAP enumeration.":" 序列化肥皂枚举。\r\n","Gets a comparer that can compare two nodes for value equality.":"获取一个可以比较两个节点的值的比较。\r\n","Sets the value of this attribute.":"设置此属性的值。\r\n"," should also close the underlying stream or ":" 还应该关闭基础流或\r\n","Gets or sets the amount of time in milliseconds to execute a single matching operation before the operation times out.":"获取或设置毫秒毫秒的时间以在操作时间之前执行单个匹配操作。\r\n","Setting the property after a Read has been called.":"调用读取后设置属性。\r\n","The value of an ":"一个价值\r\n"," objects and to register ":" 对象并注册\r\n","Hitachi SH3 DSP.":"日立SH3 DSP。\r\n","Creates typed versions of the ":"创建类型版本的版本\r\n","Defines claim value types according to the type URIs defined by W3C and OASIS. This class cannot be inherited.":"根据W3C和OASIS定义的URI类型定义索赔价值类型。这个类不能被继承。\r\n"," class with the specified claim type, value, value type, issuer,  and original issuer.":" 具有指定的索赔类型，价值，价值类型，发行人和原始发行人的类。\r\n","Gets the name of the component before the rename event.":"在重命名事件之前获取组件的名称。\r\n","A comment token includes white space.":"评论令牌包括空白。\r\n"," object is in an error state or closed.":" 对象处于错误状态或封闭状态。\r\n","A32: VSUB.F32 Qd, Qn, Qm":"A32：VSUB.F32 QD，QN，QM\r\n","The value parameter is ":"值参数为\r\n","A64: BIC Vd.8B, Vn.8B, Vm.8B The above native signature does not exist. We provide this additional overload for consistency with the other scalar APIs.":"A64：BIC VD.8B，vn.8b，vm.8b上述本地签名不存在。我们提供此额外的过载，以使其与其他标量API保持一致。\r\n","A64: CLZ Vd.4S, Vn.4S":"A64：CLZ VD.4S，VN.4S\r\n"," class using the specified XML serialization overrides.":" 使用指定XML序列化的类覆盖。\r\n","Forces the generation of a character entity for the specified Unicode character value.":"强迫指定Unicode字符值的字符实体的生成。\r\n"," is not valid.  \r\n  \r\n -or-  \r\n  \r\n The host name specified in ":" 无效。\r\n  \r\n -或者-\r\n  \r\n 指定的主机名\r\n"," from the collection, if it is present.":" 从集合中，如果存在。\r\n","Returns a hash code based on an ":"基于一个\r\n","When overridden in a derived class, gets a value indicating whether to include white space nodes in the output.":"当在派生类中覆盖时，获取一个值，指示是否在输出中包括白空间节点。\r\n","When overridden in a derived class, routes data written to the object into the HMAC algorithm for computing the HMAC value.":"当在派生类中覆盖时，将数据写入对象中的数据将数据路由到HMAC算法中以计算HMAC值。\r\n"," is not a valid bitwise combination of ":" 不是有效的位组合\r\n","The transmission control buffer (TCB) for the TCP connection is being deleted.":"TCP连接的传输控制缓冲区（TCB）正在删除。\r\n"," class and specifies the name of the XML element generated in the XML document and the ":" 类并指定XML文档中生成的XML元素的名称和\r\n","Searches an entire one-dimensional sorted array for a value using the specified ":"使用指定的\r\n"," code follow each other without an intervening event that has a ":" 代码互相关注，而无需中间事件\r\n","Indicates that the type of a variant object is an array. Returned by the ":"表示变体对象的类型是数组。由\r\n","Gets or sets the name of this element.":"获取或设置此元素的名称。\r\n","Computes the HMAC of data using the MD5 algorithm.":"使用MD5算法计算数据的HMAC。\r\n","Deserializes the object using the data contained by the specified ":"使用指定的数据进行对象的验证\r\n",", including all ":"，包括全部\r\n","Moves to the attribute with the specified local name and namespace Uniform Resource Identifier (URI).":"使用指定的本地名称和名称空间统一资源标识符（URI）移动到属性。\r\n","Creates a new sibling node after the currently selected node using the XML string specified.":"使用指定的XML字符串在当前选择的节点之后创建一个新的兄弟节点。\r\n","Gets a value indicating whether or not this ":"获得一个值，指示是否\r\n"," object that is identified by the specified namespace.":" 指定名称空间标识的对象。\r\n"," class for the specified file name, with the specified byte order mark detection option.":" 指定文件名的类，带有指定的字节订单标记检测选项。\r\n"," instance's scope the code entity or type mapping identified by the input name.":" 实例的范围代码实体或输入名称标识的类型映射。\r\n","Decodes the span of UTF-8 encoded text in base 64 (in-place) into binary data. The decoded binary output is smaller than the text data contained in the input (the operation deflates the data). If the input is not a multiple of 4, the method will not decode any data.":"将基本64（就地）中UTF-8编码文本的跨度解码为二进制数据。解码的二进制输出小于输入中包含的文本数据（操作使数据放气）。如果输入不是4的倍数，则该方法不会解码任何数据。\r\n","When overridden in a derived class, gets a value that indicates whether the current node is an empty element without an end element tag.":"当在派生类中覆盖时，获取一个值，该值指示当前节点是否是一个没有端元素标签的空元素。\r\n"," and outputs the result to an ":" 并将结果输出到\r\n"," indicates that the requested information has been moved to the URI specified in the Location header. The default action when this status is received is to follow the Location header associated with the response. When the original request method was POST, the redirected request will use the GET method. ":" 表示所请求的信息已移至位置标题中指定的URI。收到此状态时的默认操作是遵循与响应关联的位置标头。发布原始请求方法时，重定向请求将使用GET方法。\r\n"," class and determines whether code identifiers are case sensitive.":" 类并确定代码标识符是否对案例敏感。\r\n"," is not a valid HTML color name.":" 不是有效的HTML颜色名称。\r\n","Removes a single matching allow or deny access control list (ACL) permission from the current file or directory.":"从当前文件或目录中删除单个匹配允许或拒绝访问控制列表（ACL）许可。\r\n","Gets a value indicating whether the variable is local.":"获取一个指示该变量是否本地化的值。\r\n","Stores an object that contains a callback method that will be called, as necessary, to fill in .NET collections or enumerations that map to SOAP-encoded arrays or SOAP-encoded, multi-referenced elements.":"存储一个包含回调方法的对象，该对象将在必要时被调用，以填充.NET集合或枚举，以将映射到SOAP编码的数组或SOAP编码的，多参考的元素。\r\n"," scope for the current node.":" 当前节点的范围。\r\n","Asynchronously writes the specified start tag and associates it with the given namespace and prefix.":"异步写入指定的启动标签，并将其与给定的名称空间和前缀关联。\r\n",") mode handles any length of plain text and produces cipher text whose length matches the plain text length. This mode behaves like the ":"）模式处理任何长度的纯文本，并产生与纯文本长度相匹配的密码文本。这种模式的行为就像\r\n"," and that contains methods common to both of these types.":" 这包含这两种类型的共有方法。\r\n","Gets the object associated with the specified (base-class) type. The member parameter specifies the base-class member that is overridden.":"获取与指定（基类）类型关联的对象。成员参数指定被覆盖的基类成员。\r\n"," do not contain a PEM-encoded private key, or it is malformed.\r\n\r\n-or-\r\n\r\nThe contents of the file path in ":" 请勿包含PEM编码的私钥，否则将其畸形。\r\n\r\n-或者-\r\n\r\n文件路径的内容\r\n"," specified, to the boundary specified, in document order.":" 根据文件顺序指定指定的边界。\r\n"," property cannot be set.":" 无法设置属性。\r\n","Raised when this ":"当这个时抬起\r\n","Returns a filtered collection of elements that contains every element in the source collection, and the descendents of every element in the source collection. Only elements that have a matching ":"返回包含源集合中每个元素的元素的过滤集合，以及源集合中每个元素的后代。只有匹配的元素\r\n","Gets the fully qualified type name of the .NET type for this mapping.":"获取此映射的.NET类型的完全合格的类型名称。\r\n","Static method that determines whether the specified XML schema contains a custom ":"确定指定XML模式是否包含自定义的静态方法\r\n","The universal class tag value for Boolean.":"布尔值的通用类标签值。\r\n"," conforms to a specified ":" 符合指定的\r\n","The exception that is thrown when an error occurs while processing an XSLT transformation.":"处理XSLT转换时发生错误时抛出的异常。\r\n","Initializes an anonymously hosted dynamic method, specifying the method name, return type, and parameter types.":"初始化匿名托管的动态方法，指定方法名称，返回类型和参数类型。\r\n","Reinitializes the binary reader using the given input buffer.":"使用给定的输入缓冲区重新开始二进制读取器。\r\n"," to write the output to and customization options.":" 将输出写入和自定义选项。\r\n"," argument is a null value.":" 参数是一个无效的值。\r\n","Establishes a ":"建立\r\n","Retrieves a collection containing a set of standard values for the data type for which this validator is designed. This will return ":"检索包含设计验证器的数据类型的一组标准值的集合。这将返回\r\n","Includes mappings for derived types for later use when import methods are invoked.":"包括用于调用导入方法时的派生类型的映射。\r\n","Writes this node to an ":"将此节点写入\r\n"," class that is empty, has the specified initial capacity, and uses the default equality comparer for the key type.":" 为空的类，具有指定的初始容量，并使用密钥类型的默认平等比较。\r\n","The current node the ":"当前节点\r\n","Specifies an empty collection that you can use, rather than creating a new one. This field is read-only.":"指定您可以使用的空集，而不是创建一个新的集合。该字段仅阅读。\r\n","Adds custom debug information.":"添加自定义调试信息。\r\n"," delegate and the type it applies to, for a later invocation.":" 委托及其适用的类型，用于以后的调用。\r\n","Gets the XML writer object for the serializer.":"获取序列化器的XML作者对象。\r\n","Specifies the event type when an event is raised for an ":"指定事件类型时筹集事件时\r\n","Gets or sets the name of the attribute group.":"获取或设置属性组的名称。\r\n","Replaces the current node with the content of the string specified.":"用指定的字符串内容代替当前节点。\r\n"," elements and the XSLT settings determine the permissions for the style sheet.":" 元素和XSLT设置确定样式表的权限。\r\n","The current dynamic type has not been created by calling the ":"当前的动态类型尚未通过调用\r\n","Deletes the current node and its child nodes.":"删除当前节点及其子节点。\r\n"," serializes a public field or public read/write property.":" 序列化公共字段或公共读/写属性。\r\n","Determines whether a specified name is already being used within the ":"确定是否已经在\r\n"," namespace which is always declared implicitly. The order of the namespaces returned is not defined.":" 名称空间总是被隐式声明。未定义返回的名称空间的顺序。\r\n","Represents primitive types by properties.":"代表属性的原始类型。\r\n","Creates a new copy of the ":"创建一个新的副本\r\n"," fields, optionally followed by the unmanaged type of the elements within the array when it is necessary to differentiate among string types.":" 当必要区分字符串类型时，字段，随后是数组中不托管的元素类型。\r\n","When overridden in a derived class, writes out a comment <!--...--> containing the specified text.":"当在派生的类中覆盖时，请写下评论<！--..-->包含指定的文本。\r\n"," element declaration is applied.":" 应用元素声明。\r\n","Gets the filter string for the toolbox item.":"获取工具箱项目的过滤字符串。\r\n"," parameter specifies the object to be overridden by the ":" 参数指定要覆盖的对象\r\n","Gets a value that indicates whether the current field is transparent at the current trust level.":"获取一个指示当前字段在当前信托级别上是否透明的值。\r\n"," can edit the underlying XML data.":" 可以编辑基础XML数据。\r\n","Gets or sets the value generated in an XML document when the ":"获取或设置XML文档中生成的值\r\n","Specifies serialization options.":"指定序列化选项。\r\n"," method to create a validating XML reader.":" 创建验证XML读取器的方法。\r\n","Gets or sets the cache policy for the underlying ":"获取或设置基础的缓存策略\r\n","Returns the XML for this node, optionally disabling formatting.":"返回此节点的XML，可选地禁用格式。\r\n"," has been or will be added to an ":" 已经或将添加到\r\n","Returns a value indicating whether the specified string occurs within this ":"返回一个值，指示指定字符串是否发生在此内\r\n","Represents the TLS_PSK_WITH_AES_128_CCM_8 cipher suite.":"表示TLS_PSK_WITH_AES_128_CCM_8密码套件。\r\n"," cannot be passed as a parameter.":" 不能作为参数传递。\r\n","Represents a form feed character for print functions (":"代表打印功能的表单供稿字符（\r\n","The thread is waiting for a local procedure call to arrive.":"该线程正在等待本地程序呼叫到达。\r\n"," is at the same position as the specified ":" 与指定的位置相同\r\n","The maximum stack size, in bytes, to be used by the thread, or 0 to use the default maximum stack size specified in the header for the executable.  \r\n  \r\n Important   For partially trusted code, ":"线程中要使用的最大堆栈大小，或者0用于使用可执行文件中指定的默认最大堆栈大小。\r\n  \r\n 对于部分信任的代码很重要，\r\n","The data source supports right outer joins.":"数据源支持正确的外部连接。\r\n","The type of the accumulated value.":"累积值的类型。\r\n","Gets or sets the value of this node.":"获取或设置该节点的值。\r\n","Gets or sets a value indicating whether to write attributes on a new line.":"获取或设置一个指示是否在新行上写属性的值。\r\n","When overridden in a derived class, writes out an entity reference as ":"当在派生的班级中覆盖时，将实体参考写为\r\n","Gets the namespace of the .NET type being mapped to the data type of an XML Schema element that represents a SOAP message.":"获取.NET类型的名称空间被映射到表示SOAP消息的XML模式元素的数据类型。\r\n","Creates a new file, writes the specified string array to the file by using the specified encoding, and then closes the file.":"创建一个新文件，通过使用指定的编码将指定的字符串数组写入文件，然后关闭文件。\r\n","Gets a value indicating whether a stream supports seeking.":"获得一个指示流是否支持寻求的值。\r\n","Writes out an entity reference as ":"将实体参考写为\r\n","Indicates whether the specified character has a surrogate code unit.":"指示指定的字符是否具有替代代码单元。\r\n"," must serialize the class member as an encoded SOAP attribute.":" 必须将类成员序列化为编码的肥皂属性。\r\n","Gets the namespace of the mapped element.":"获取映射元素的名称空间。\r\n"," class with the specified settings.":" 带有指定设置的课程。\r\n"," instance using the specified ":" 实例使用指定的\r\n","When overridden in a derived class, writes out the given white space.":"当在派生的班级中覆盖时，写出给定的空白。\r\n","Transforms the XML data in the ":"转换XML数据\r\n","The value in a set operation is less than 100 or greater than 9378.":"设定操作中的值小于100或大于9378。\r\n","Returns a copy of all stack frames in the current stack trace.":"返回当前堆栈跟踪中所有堆栈帧的副本。\r\n","The zip archive that this entry belongs to has been disposed.":"该条目属于的拉链档案已被处置。\r\n"," after waiting the specified time to allow data to be sent.":" 等待指定的时间允许发送数据。\r\n"," class from an existing comment node.":" 现有评论节点的类。\r\n"," to the element with the local name and namespace URI specified in document order.":" 到具有文档顺序指定的本地名称和名称空间URI的元素。\r\n","Asynchronously reads data from this stream and stores it in the specified range of a byte array.":"异步读取来自该流的数据，并将其存储在字节数组的指定范围内。\r\n","Adds an object to the annotation list of this ":"在此的注释列表中添加对象\r\n","Attempts to encrypt data into the specified buffer, using ECB mode with the specified padding mode.":"尝试使用指定的填充模式将数据加密到指定的缓冲区。\r\n","No type.":"没有类型。\r\n","Gets the maximum number of arguments for the function. This enables the user to differentiate between overloaded functions.":"获取该功能的最大参数数量。这使用户可以区分超载功能。\r\n",", which starts at the specified index of the target array.":"，从目标阵列的指定索引开始。\r\n"," class from an ":" 从an\r\n"," instruction onto the Microsoft intermediate language (MSIL) stream to call a ":" 在Microsoft中间语言（MSIL）流上进行指示以调用\r\n","Gets the text string showing the class name, the member name, and the signature of the missing member.":"获取显示类名称，成员名称和缺失成员的签名的文本字符串。\r\n","Gets the encoding of the document.":"获取文档的编码。\r\n","Gets a set of code entities to which the context applies.":"获取上下文应用的一组代码实体。\r\n","When overridden in a derived class, gets the .NET Framework 2.0 type of the item.":"当在派生类中覆盖时，获取.NET Framework 2.0项目类型。\r\n","Writes the start of an attribute with the specified local name.":"用指定的本地名称写入属性的开始。\r\n","Removes the attributes of this ":"删除此属性\r\n"," object parameter is ":" 对象参数为\r\n","Adds an element declaration for an object or type to a SOAP message or to an ":"将对象或键入的元素声明添加到肥皂消息或\r\n","Gets a collection of annotations of the specified type for this ":"为此获取指定类型的注释的集合\r\n"," instance using the stream and ":" 实例使用流和\r\n","Thrown if ":"如果被扔\r\n","Generates and writes the surrogate character entity for the surrogate character pair.":"生成并写入替代角色对的替代角色实体。\r\n","Returns an object used to read the XML document to be serialized.":"返回用于读取XML文档的对象。\r\n","Represents the TLS_ECDH_anon_WITH_AES_128_CBC_SHA cipher suite.":"代表TLS_ECDH_ANON_WITH_AES_128_CBC_SHA CIPHER SUITE。\r\n"," class and adds an ":" 上课并添加\r\n","Creates a new immutable sorted set that contains the specified item.":"创建一个包含指定项目的新的不变排序集。\r\n"," inserts an ":" 插入\r\n","Returns an array of the code entities or type mappings within the ":"返回代码实体的数组或键入映射\r\n"," using the specified args and outputs the result to an ":" 使用指定的args并将结果输出到\r\n","The available stack space is insufficient to execute the average .NET function.":"可用的堆栈空间不足以执行平均.NET函数。\r\n","The attribute argument is \"boxed\" (passed to a parameter, field, or property of type object) and carries type information in the attribute blob.":"属性参数为“盒装”（传递到类型对象的参数，字段或属性），并在属性blob中带有类型信息。\r\n"," to the next namespace node.":" 到下一个名称空间节点。\r\n","Encodes a valid XML name by replacing characters that are not valid with escape sequences.":"通过更换逃脱序列无效的字符来编码有效的XML名称。\r\n"," is not supported by the platform.":" 平台不支持。\r\n","Never satisfies a request by using resources from the cache and does not cache resources. If the resource is present in the local cache, it is removed. This policy level indicates to intermediate caches that they should remove the resource. In the HTTP caching protocol, this is achieved using the no-cache cache control directive.":"永远不要通过使用缓存中的资源来满足请求，并且不会缓存资源。如果资源存在于本地缓存中，则将其删除。此策略级别表明中间缓存应该删除资源。在HTTP缓存协议中，这是使用无缓存缓存控制指令实现的。\r\n"," object, the outer object doesn't do any additional conformance checking. Conformance checking is left up to the underlying object.  \r\n  \r\n See the ":" 对象，外对象不进行任何其他符合性检查。一致性检查留在基础对象上。\r\n  \r\n 看到\r\n","Gets a value that indicates whether the entity has validation errors.":"获取一个指示实体是否具有验证错误的值。\r\n","Provides an interface to a given variable that is defined in the style sheet during runtime execution.":"在运行时执行期间，在样式表中定义的给定变量提供了一个接口。\r\n","Produces a string that consists of delimited identifiers that represent the enumeration members that have been set.":"产生一个由代表已设置的枚举成员的定界标识符组成的字符串。\r\n","Gets or sets the string value of this comment.":"获取或设置此注释的字符串值。\r\n"," class with default settings.":" 具有默认设置的类。\r\n","The root node of the XML document or node tree.":"XML文档或节点树的根节点。\r\n","No isolated storage usage.":"没有孤立的存储使用情况。\r\n"," instance. This is referred to as Publication in the field names. That value is returned to any other threads that were simultaneously running the initialization method, unless the initialization method throws exceptions on those threads. Any instances of ":" 实例。这被称为字段名称中的出版物。除非初始化方法在这些线程上引发异常，否则该值将返回到同时运行初始化方法的任何其他线程。任何实例\r\n","No row corresponds to that index value.":"没有行对应于该索引值。\r\n","Gets or sets the common language runtime (CLR) namespace of the assembly.":"获取或设置汇编的通用语言运行时（CLR）名称空间。\r\n","Gets or sets the character string to use for line breaks.":"获取或设置字符串以用于线路断路。\r\n","Returns the raw data for the entire X.509v3 certificate as a hexadecimal string.":"将整个X.509V3证书的原始数据作为十六进制字符串返回。\r\n","Writes a base-64 byte array.":"写一个基本64字节阵列。\r\n"," from a file.":" 从文件。\r\n","Retrieves an empty dictionary that has the same ordering and key-value comparison rules as this dictionary instance.":"检索一个空词典，该字典具有与该字典实例相同的订单和键值比较规则。\r\n","-related attributes that have been applied to the member code entity.":" - 已应用于成员代码实体的相关属性。\r\n","Gets the length of the SOAP-encoded array where the ":"获取肥皂编码阵列的长度\r\n","Writes out a formatted string and a new line to the text stream, using the same semantics as ":"使用与\r\n","Specifies the length of the data transferred. Reserved for operating system use.":"指定传输数据的长度。保留用于操作系统使用。\r\n","Adds the specified content as children of this ":"将指定的内容添加为儿童\r\n","Gets the position in the line of the unknown XML attribute.":"获取未知XML属性线的位置。\r\n","Determines if the current node appears before a specified node in terms of document order.":"根据文档顺序确定当前节点是否出现在指定节点之前。\r\n","Sets the key used to look up the mapping.":"设置用于查找映射的密钥。\r\n","Gets the name of the data type this property can extend.":"获取该属性可以扩展的数据类型的名称。\r\n"," to the root node that the current node belongs to.":" 当前节点属于的根节点。\r\n","Gets or sets the network proxy for the underlying ":"获取或设置基础网络代理\r\n","Gets the number of Internet Control Message Protocol version 6 (ICMPv6) messages sent.":"获取发送的Internet控制消息协议版本6（ICMPV6）消息的数量。\r\n"," with an ":" 带着\r\n","Determines whether the specified object instances are considered equal.":"确定指定的对象实例是否被视为平等。\r\n"," into the collection at the specified index.":" 在指定索引中进入集合。\r\n","Describes a Microsoft intermediate language (MSIL) instruction that applies to objects.":"描述适用于对象的Microsoft中间语言（MSIL）指令。\r\n","int32x4_t vsliq_n_s32(int32x4_t a, int32x4_t b, __builtin_constant_p(n)) A32: VSLI.32 Qd, Qm, #n A64: SLI Vd.4S, Vn.4S, #n":"int32x4_t vsliq_n_s32（int32x4_t a，int32x4_t b，__builtin_constant_p（n））a32：vsli.32 qd，qm，qm，＃n a64：\r\n","Adds the specific key/value pairs to the immutable sorted dictionary.":"将特定的键/值对添加到不可变的排序字典中。\r\n","This method supports the .NET Framework infrastructure and is not intended to be used directly from your code.":"此方法支持.NET框架基础架构，并且不打算直接从您的代码中使用。\r\n","When overridden in a derived class, closes any open elements or attributes and puts the writer back in the Start state.":"当在派生类中覆盖时，关闭任何开放元素或属性，并将作者放回起点状态。\r\n","Gets a value indicating whether the variable is an Extensible Stylesheet Language Transformations (XSLT) parameter. This can be a parameter to a style sheet or a template.":"获取一个值，指示该变量是否是可扩展的样式表语言转换（XSLT）参数。这可以是样式表或模板的参数。\r\n","Signals that a participant has reached the barrier and waits for all other participants to reach the barrier as well, using a 32-bit signed integer to measure the timeout, while observing a cancellation token.":"信号表明，参与者已经到达障碍物，并等待所有其他参与者也使用32位签名的整数来测量超时，同时观察取消令牌。\r\n","Deletes a range of sibling nodes from the current node to the node specified.":"从当前节点到指定的节点删除一系列兄弟节点。\r\n"," that indicates an unexpected name for an element that adheres to an XML Schema ":" 这表明粘附于XML模式的元素的意外名称\r\n"," enables you to control how objects are encoded into XML.":" 使您可以控制对象如何编码为XML。\r\n","Asynchronously writes text one buffer at a time.":"异步地每次写下一个缓冲区。\r\n","Specifies the return type of the XPath expression.":"指定XPath表达式的返回类型。\r\n","Selects all the descendant nodes of the current node with the local name and namespace URI specified.":"使用指定的本地名称和名称空间URI选择当前节点的所有后代节点。\r\n"," is not valid entity tag header value information.":" 不是有效的实体标签标题值信息。\r\n","Builder of a Metadata Root to be embedded in a Portable Executable image.":"元数据根的构建器将嵌入到便携式可执行图像中。\r\n","Gets or sets the markup representing the opening and closing tags of the current node and its child nodes.":"获取或设置代表当前节点及其子节点的开口和关闭标签的标记。\r\n","Gets or sets the name of this streaming element.":"获取或设置此流元素的名称。\r\n"," object with default settings. Support for the XSLT ":" 具有默认设置的对象。支持XSLT\r\n"," property whose values get filled in by the callback implementation.":" 其值被回调实现所填写的属性。\r\n","Gets the number of Internet Control Message Protocol version 4 (ICMPv4) Echo Reply messages that were received.":"获取接收到的Internet控制消息协议版本4（ICMPV4）回声消息的数量。\r\n"," is equal to or greater than the ":" 等于或大于\r\n"," instance supports database savepoints.\r\n            If ":" 实例支持数据库保存点。\r\n            如果\r\n","Gets the object that represents the unknown XML element.":"获取表示未知XML元素的对象。\r\n",". This does not include XML declarations, which are not visible to the ":"。这不包括XML声明，这些声明对\r\n","Gets an empty collection of attributes.":"获得空的属性集合。\r\n"," specifies a file that is read-only.  \r\n  \r\n -or-  \r\n  \r\n This operation is not supported on the current platform.  \r\n  \r\n -or-  \r\n  \r\n ":" 指定只读的文件。\r\n  \r\n -或者-\r\n  \r\n 当前平台不支持此操作。\r\n  \r\n -或者-\r\n  \r\n \r\n"," view over the data in a list.\r\n Items should not be added or removed from the ":" 查看列表中的数据。\r\n 不应添加或从\r\n"," from a string that contains XML, optionally preserving white space and retaining line information.":" 从包含XML的字符串中，可选地保留空白并保留线路信息。\r\n"," to read the string value at its current position and return it as a base-64 byte array.":" 要在其当前位置读取字符串值并将其返回为基本64字节数组。\r\n"," from a string.":" 从字符串。\r\n","Gets or sets the error message resource name to use in order to look up the ":"获取或设置错误消息资源名称，以查找\r\n"," serializes a public field or read/write property as an XML element.":"将公共字段序列化或读/写属性作为XML元素。\r\n"," value and buffer size.":" 值和缓冲区大小。\r\n"," is less than or equal to zero, or greater than or equal to 0x003f0000.":" 小于或等于零，或大于或等于或等于0x003f0000。\r\n"," from the URI specified as an asynchronous operation using a task object.":" 从使用任务对象指定为异步操作的URI。\r\n","The XPath expression parameter is not a valid XPath expression.":"XPath表达参数不是有效的XPATH表达式。\r\n","Produces a string that can be written as an XML qualified name, with invalid characters replaced by escape sequences.":"产生一个可以写成XML合格名称的字符串，而无效的字符被逃生序列取代。\r\n","Determines whether the collection contains the specified ":"确定该集合是否包含指定的\r\n","When overridden in a derived class, generates and writes the surrogate character entity for the surrogate character pair.":"当在派生类中覆盖时，生成并写入替代角色对的替代角色实体。\r\n","An error was encountered in the XPath query or the return type of the XPath expression is not a node.":"在XPATH查询中遇到错误，或者XPath表达式的返回类型不是节点。\r\n","When overridden in a derived class, calculates the number of characters produced by decoding the sequence of bytes in the span. A parameter indicates whether to clear the internal state of the decoder after the calculation.":"当在派生类中覆盖时，计算通过在跨度中解码字节序列产生的字符数。一个参数指示计算后是否清除解码器的内部状态。\r\n","The type of the objects in ":"对象的类型\r\n"," parameter was marked with a ":" 参数用\r\n","Fills in the values of a SOAP-encoded array whose data type maps to a .NET reference type.":"填写肥皂编码数组的值，该数组的数据类型映射到.NET参考类型。\r\n","Size is negative or extends past the end of the stream.":"大小为负或延伸超过流的末端。\r\n"," to the collection of ":" 收集\r\n","Creates a new sibling node before the currently selected node using the XML string specified.":"使用指定的XML字符串在当前选择的节点之前创建一个新的兄弟节点。\r\n"," objects that represents the XML schemas used by SOAP literal messages, plus classes being generated for bindings defined in a Web Services Description Language (WSDL) document.":" 代表SOAP文字消息使用的XML模式的对象，以及用于Web服务描述语言（WSDL）文档中定义的绑定的类。\r\n",", starting at the beginning of the target array.":"，从目标阵列的开头开始。\r\n","Gets the line number of the unknown XML attribute.":"获取未知XML属性的行号。\r\n","When overridden in a derived class, writes out a processing instruction with a space between the name and text as follows: <?name text?>.":"当在派生类中覆盖时，写出一个处理指令，在名称和文本之间的空间如下：<？name text？>。\r\n","Stores an object that contains a callback method instance that will be called, as necessary, to fill in the objects in a SOAP-encoded array.":"存储一个包含回调方法实例的对象，该实例将在必要时调用，以填充肥皂编码的数组中的对象。\r\n","Indicates that a field of a serializable class should not be serialized. This class cannot be inherited.":"表示不应序列化一个可序列化类的字段。这个类不能被继承。\r\n","=\"default\".":"=“默认”。\r\n","Returns a collection of attributes of this element.":"返回此元素的属性集合。\r\n"," class from the specified name and value.":" 从指定名称和值的类。\r\n"," instance using the filename and ":" 实例使用文件名和\r\n","Signs a byte array from the specified start point to the specified end point.":"符号从指定的起点到指定端点的字节数组。\r\n","An error occurred in the hashing or signing operation.":"哈希或签名操作中发生了错误。\r\n","Creates a new child node at the end of the list of child nodes of the current node using the XML contents of the ":"使用XML内容的XML内容在当前节点的子节点的列表的末尾创建一个新的子节点\r\n","Defines identifiers that indicate information about the context in which a request for Help information originated.":"定义标识符，以指示有关启动帮助信息请求的上下文信息的信息。\r\n"," utility.":" 效用。\r\n"," and a new table cannot be created.":" 并且无法创建一个新表。\r\n","Returns a collection of the descendant nodes for this document or element, in document order.":"根据文档顺序返回本文档或元素的后代节点的集合。\r\n"," as an XML attribute.":" 作为XML属性。\r\n","Determines if the current node appears after a specified node in terms of document order.":"根据文档顺序确定当前节点是否在指定节点之后出现。\r\n","Represents the base class from which all asymmetric key exchange formatters derive.":"代表所有不对称键交换格式化器得出的基类。\r\n","Gets the namespace Uniform Resource Identifier (URI) (as defined in the World Wide Web Consortium (W3C) Namespace specification) of the node on which the reader is positioned.":"获取名称空间统一资源标识符（URI）（如读者所在的节点的世界宽Web联盟（W3C）名称空间规范所定义）。\r\n","Sets the value of the XML attribute if it is of type ":"设置XML属性的值（如果是类型）\r\n","The type of the key produced by ":"由\r\n","When overridden in a derived class, writes out the specified name, ensuring it is a valid name according to the W3C XML 1.0 recommendation (https://www.w3.org/TR/1998/REC-xml-19980210#NT-Name).":"当在派生的班级中覆盖时，写出指定的名称，确保根据W3C XML 1.0推荐是有效的名称（https://www.w.org/tr/1998/rec-xml-19980210#nt-name ）。\r\n"," implements.  \r\n  \r\n-   ":" 工具。\r\n  \r\n - \r\n","Gets the underlying stream object.":"获取基础流对象。\r\n","The filename includes an incorrect or invalid syntax for file name, directory name, or volume label syntax.":"该文件名包括文件名，目录名称或卷标签语法的错误或无效语法。\r\n","Represents a single vector of a specified numeric type that is suitable for low-level optimization of parallel algorithms.":"代表适用于平行算法低水平优化的指定数字类型的单个向量。\r\n","Generates mappings to SOAP-encoded messages from .NET types or Web service method information.":"从.NET类型或Web服务方法信息中生成映射到肥皂编码的消息。\r\n"," class from the XML data that is contained in the specified ":" 来自指定的XML数据的类\r\n",", optionally disabling formatting.":"，可选地禁用格式。\r\n","Gets the collection of methods that is used to read a data stream.":"获取用于读取数据流的方法的集合。\r\n","Asynchronously connects to a waiting server with an infinite timeout period.":"异步连接到具有无限超时期的等待服务器。\r\n","Gets the first attribute of this element.":"获取此元素的第一个属性。\r\n","Compiles the specified XPath expression, with the ":"编译指定的XPath表达式\r\n","Compares the position of the current ":"比较电流的位置\r\n","The XML string parameter is ":"XML字符串参数为\r\n","Gets the public key associated with the private key with which signatures are being generated.":"获取与签名生成的私钥关联的公共密钥。\r\n","Describes the node types for the nodes of an expression tree.":"描述表达树节点的节点类型。\r\n","Indicates a SID for documents library capability for app containers.":"指示用于应用程序容器的文档库功能的SID。\r\n"," parameter when returning from a method.":" 从方法返回时参数。\r\n","Asynchronously closes one element and pops the corresponding namespace scope.":"异步关闭一个元素并弹出相应的名称空间范围。\r\n","Ensures that a given array, or a copy, is no larger than a specified length.":"确保给定的数组或副本不超过指定的长度。\r\n","Converts the string representation of a number to its signed native integer equivalent.":"将数字的字符串表示形式转换为其签名的本机整数等效。\r\n"," with the collection of ":" 收集\r\n","Specifies load options when parsing XML.":"解析XML时指定加载选项。\r\n","Adds an instance of the ":"添加了一个实例\r\n","The element is not ":"元素不是\r\n","Gets or sets a list of XML qualified name objects that contain the namespaces and prefixes used to produce qualified names in XML documents.":"获取或设置XML合格名称对象的列表，该对象包含用于在XML文档中生成合格名称的名称空间和前缀。\r\n"," to recognize a type when it serializes or deserializes an object as encoded SOAP XML.":" 识别当该类型序列化或对象为编码的soap XML序列化。\r\n"," should remove duplicate namespace declarations when writing XML content. The default behavior is for the writer to output all namespace declarations that are present in the writer's namespace resolver.":" 编写XML内容时，应删除重复的名称空间声明。默认行为是为了使作者输出作者名称空间解析器中存在的所有命名空间声明。\r\n","When overridden in a derived class, returns a clone of this ":"当在派生的班级中覆盖时，返回一个克隆\r\n","Creates a delegate of the specified type that represents the specified instance method to invoke on the specified class instance with the specified case-sensitivity.":"创建指定类型的委托，该类型表示指定的实例方法，以使用指定的情况敏感性调用指定的类实例。\r\n","The zip archive does not support writing.":"拉链档案不支持写作。\r\n","Formats a validation error message.":"格式化验证错误消息。\r\n"," that references the specified namespaces.":" 引用指定的名称空间。\r\n"," node types.":" 节点类型。\r\n","Represents the TLS_RSA_WITH_CAMELLIA_256_CBC_SHA cipher suite.":"代表TLS_RSA_WITH_CAMELLIA_256_CBC_SHA CIPHER SUITE。\r\n","Removes the assigned characters between the specified positions from the formatted string, and then outputs the removal position and descriptive information.":"从格式化的字符串中删除指定位置之间的分配字符，然后输出删除位置和描述性信息。\r\n","Provides a cursor model for navigating and editing XML data.":"提供用于导航和编辑XML数据的光标模型。\r\n","Gets a value that indicates whether this object represents a constructed generic type. You can create instances of a constructed generic type.":"获取一个指示此对象是否表示构造的通用类型的值。您可以创建构造的通用类型的实例。\r\n"," to serialize a public field or public read/write property as XML text.":" 序列化公共字段或公共读/写属性为XML文本。\r\n"," instance's scope and, if it does, generates a modified string.":" 实例的范围，如果确实如此，则会生成一个修改的字符串。\r\n"," will delay closing a socket in an attempt to send all pending data.":" 将延迟关闭插座以发送所有待处理数据。\r\n","Gets the addresses of Windows Internet Name Service (WINS) servers.":"获取Windows Internet名称服务（WINS）服务器的地址。\r\n","The text would result in a non-well-formed XML document.":"该文本将导致非井形XML文档。\r\n"," of the first node encountered in the reader.":" 读者中遇到的第一个节点。\r\n","The parent element is ":"父元素是\r\n","xmlns=\"namespace\"":"XMLNS =“名称空间”\r\n","Returns a filtered collection of elements that contains the ancestors of every node in the source collection. Only elements that have a matching ":"返回元素的过滤集合，其中包含源集合中每个节点的祖先。只有匹配的元素\r\n","Generates internal type mapping information for a single element part of a literal-use SOAP message defined in a WSDL document.":"为WSDL文档中定义的文字使用SOAP消息的单个元素部分生成内部类型映射信息。\r\n"," implementations which provide a \"virtualized\" XML view over a store, to provide access to underlying objects.":" 在商店上提供“虚拟化” XML视图的实现，以提供对基础对象的访问。\r\n","Selects all the ancestor nodes of the current node that have the specified local name and namespace URI.":"选择具有指定的本地名称和名称空间URI的当前节点的所有祖先节点。\r\n","Gets or sets the namespace of the XML element.":"获取或设置XML元素的名称空间。\r\n"," specified is ":" 指定是\r\n","Ensures that a given array, or a copy, is large enough to contain a specified index.":"确保给定的数组或副本足够大，可以包含指定的索引。\r\n","A numeric value.":"数字值。\r\n"," read an XML end tag.":" 读取XML结束标签。\r\n","Contains fields that can be used to pass event delegates to a thread-safe ":"包含可用于将事件代表传递给线程安全的字段\r\n","xmlns:xml":"XMLNS：XML\r\n","Asynchronously forces the generation of a character entity for the specified Unicode character value.":"异步迫使指定的Unicode字符值的字符实体生成。\r\n"," object with a local name to create an ":" 具有本地名称的对象以创建一个\r\n","Returns a vector whose elements are the minimum of each of the pairs of elements in two specified vectors.":"返回一个向量，其元素是两个指定向量中每对元素的最小值。\r\n","Implements a new instance of the ":"实现了\r\n","Provides data for the known, but unreferenced, object found in an encoded SOAP XML stream during deserialization.":"在避难化过程中，提供了在编码的SOAP XML流中发现的已知但未引用的对象的数据。\r\n","The directory to write to is not found.":"找不到写的目录。\r\n","Returns an enumerable collection of file information that matches a search pattern.":"返回与搜索模式匹配的枚举的文件信息集合。\r\n","Gets or sets a value indicating whether to do namespace support.":"获取或设置一个指示是否执行名称空间支持的值。\r\n","Ensures that the input is of the correct case by modifying the name according to the value of the ":"确保输入是正确的情况，通过根据该名称的值修改名称\r\n"," event with the provided arguments.":" 带有提供的论点的事件。\r\n"," class, trimmed of white space if needed, and appended to the input value.":" 班级，如果需要，则修剪为白空间，并将其附加到输入值。\r\n","When overridden in a derived class, writes out a start tag with the specified local name.":"当在派生的类中覆盖时，用指定的本地名称写出开始标签。\r\n"," class specified error message and a reference to the inner exception that is the cause of this exception.":" 类指定的错误消息和对此异常原因的内部异常的引用。\r\n"," with the options specified by the ":" 使用选项由\r\n"," represents an unknown XML node.":" 表示未知的XML节点。\r\n","CDATA type.":"CDATA类型。\r\n","Gets or sets the system identifier for this Document Type Definition (DTD).":"获取或设置此文档类型定义（DTD）的系统标识符。\r\n","The file path parameter or ":"文件路径参数或\r\n","The file system directory that acts as a staging area for files waiting to be written to a CD.":"文件系统目录充当了等待写入CD的文件的登台区域。\r\n","Adds an element declaration for a .NET type to the applicable ":"将.NET类型的元素声明添加到适用\r\n","Creates a new child node at the end of the list of child nodes of the current node using the XML data string specified.":"使用指定的XML数据字符串在当前节点的子节点列表的末尾创建一个新的子节点。\r\n","A64: RADDHN Vd.4H, Vn.4S, Vm.4S":"A64：Raddhn VD.4H，VN.4S，VM.4S\r\n","Converts a short value from host byte order to network byte order.":"从主机字节订单转换为网络字节订单。\r\n"," namespace. The ":" 名称空间。这\r\n"," does not specify a valid registry key, and ":" 未指定有效的注册表密钥，并且\r\n","When overridden in a derived class, compares the base Uniform Resource Identifiers (URIs) of two documents based upon the order the documents were loaded by the XSLT processor (that is, the ":"当在派生类中覆盖时，根据XSLT处理器加载了两个文档的两个文档的基本统一资源标识符（URI）（即，即，\r\n","Gets the line number that the underlying ":"获取基础的线号\r\n","When overridden in a derived class, resolves a variable reference and returns an ":"当在派生类中覆盖时，请解决变量参考并返回\r\n"," change event.":" 更改事件。\r\n","The resulting PEM-encoded text is larger than ":"由此产生的PEM编码的文本大于\r\n","Creates a new child element node at the end of the list of child nodes of the current node using the namespace prefix, local name and namespace URI specified with the value specified.":"使用名称空间前缀，本地名称和指定值指定的值的名称空间URI在当前节点的子节点的列表的末尾创建一个新的子元素节点。\r\n","The encoding is not supported; the filename is empty, contains only white space, or contains one or more invalid characters.":"不支持编码；文件名是空的，仅包含空白，或包含一个或多个无效的字符。\r\n","Gets the current node as a boxed object of the most appropriate .NET type.":"将当前节点作为最合适的.NET类型的盒装对象。\r\n"," function and embedded script blocks.":" 功能和嵌入式脚本块。\r\n","Provides the method to invoke the function with the given arguments in the given context.":"提供了在给定上下文中使用给定参数调用函数的方法。\r\n"," is a directory.  \r\n  \r\n -or-  \r\n  \r\n ":" 是目录。\r\n  \r\n -或者-\r\n  \r\n \r\n","Returns internal type mappings using information from a Web service method, and allows you to specify an XML element name, XML namespace, and other options.":"使用Web服务方法的信息返回内部类型映射，并允许您指定XML元素名称，XML名称空间和其他选项。\r\n","The vector whose elements are the smallest integral values that are greater than or equal to the given vector's elements.\r\n            If a value is equal to ":"元素是最小的积分值的向量，该值大于或等于给定向量的元素。\r\n            如果值等于\r\n","Extracts the baggage key-value pair list from an incoming request represented by the carrier. For example, from the headers of an HTTP request.":"从承运人代表的传入请求中提取行李键值对列表。例如，来自HTTP请求的标题。\r\n","<element>":"<元素>\r\n"," class by providing a method for navigating and editing an XML node.":" 通过提供导航和编辑XML节点的方法。\r\n"," is thrown if you are using Microsoft .NET Framework version 1.1 or earlier.":" 如果您使用的是Microsoft .NET Framework 1.1或更早的版本，则会抛弃。\r\n","Adds the specified content immediately before this node.":"在此节点之前立即添加指定的内容。\r\n"," to the first sibling node of the current node.":" 到当前节点的第一个兄弟姐妹节点。\r\n","Returns an array of the public and non-public ":"返回一系列公众和非公共\r\n"," encounters an XML node of unknown type during deserialization.":" 遇到避难化过程中未知类型的XML节点。\r\n","Gets a value indicating whether this element has at least one attribute.":"获取一个值，指示此元素至少具有一个属性。\r\n","The XPath expression cannot be evaluated.":"无法评估XPATH表达式。\r\n","Creates events for the asynchronous invocation of Web methods.":"为Web方法的异步调用创建事件。\r\n","IDREF type.":"IDREF类型。\r\n"," to the first namespace node that matches the ":" 到匹配的第一个名称空间节点\r\n","Takes a numeric enumeration value and the names and constants from the enumerator list for the enumeration and returns a string that consists of delimited identifiers that represent the enumeration members that have been set.":"从枚举列表中获取数字枚举值以及枚举列表中的名称和常数，并返回由代表已设置的枚举成员的界定标识符组成的字符串。\r\n","Compiles the XSLT style sheet contained in the ":"编译包含在\r\n","Gets an object that is being deserialized from a SOAP-encoded ":"从肥皂编码\r\n"," when a class instance is serialized as SOAP encoded XML.":" 当类实例序列化为SOAP编码的XML时。\r\n"," object, see XDocument Class Overview.":" 对象，请参阅Xdocument类概述。\r\n"," defined at the ":" 定义在\r\n","Replaces this node with the specified content.":"用指定的内容替换该节点。\r\n","Specifies the GUID of the Microsoft language vendor.":"指定Microsoft语言供应商的GUID。\r\n","Controls the XML schema that is generated when the attribute target is serialized by the ":"控制属性目标序列化时生成的XML模式\r\n","isNullable":"可以否认\r\n","Gets a value indicating whether this element contains no content.":"获取一个指示此元素是否包含内容的值。\r\n"," that can be used to add nodes to the ":" 可以用来将节点添加到\r\n"," class with a specified value for the number of ":" 具有指定值的类\r\n"," class, specifying a default XML namespace for imported type mappings.":" 类，指定导入类型映射的默认XML名称空间。\r\n","Writes an element with the specified prefix, local name, namespace URI, and value.":"用指定的前缀，本地名称，名称空间URI和值写一个元素。\r\n","Maintains a group of names for related code entities or type mappings that are generated by .NET's XML serialization infrastructure.":"维护相关代码实体的一组名称或由.NET XML序列化基础结构生成的类型映射。\r\n","The file path parameter is ":"文件路径参数为\r\n"," class for deserialization of SOAP-encoded XML data.":" 用于肥皂编码的XML数据的绝对序列化类。\r\n",", optionally preserving white space and retaining line information.":"，可选地保留空白并保留线路信息。\r\n","Uppercase letters are sorted before lowercase letters.":"大写字母在小写字母之前进行排序。\r\n","Any of the XPath node types.":"任何XPath节点类型。\r\n"," elements are not resolved.  \r\n  \r\n The ":" 元素无法解决。\r\n  \r\n 这\r\n"," element for later access through the ":" 元素以后通过\r\n","The string contains non-white space characters.":"该字符串包含非白色空间字符。\r\n"," instance using the specified filename.":" 实例使用指定的文件名。\r\n","; or the text would result in a non-well formed XML document.":";否则文本将导致非井片形成的XML文档。\r\n","The object value to write.  \r\n  \r\n Note With the release of the .NET Framework 3.5, this method accepts ":"要编写的对象值。\r\n  \r\n 注意，随着.NET Framework 3.5的发布，此方法接受\r\n","Both read and write methods are generated.":"两种读写方法都是生成的。\r\n","A64: USHLL Vd.2D, Vn.2S, #n":"A64：USHLL vd.2d，VN.2S，#N\r\n","Gets the output size of this hash or HMAC algorithm, in bytes.":"在字节中获取此哈希或HMAC算法的输出大小。\r\n"," class with the specified pipe name, pipe direction, maximum number of server instances, transmission mode, pipe options, recommended in and out buffer sizes, pipe security, inheritability mode, and pipe access rights.":" 与指定的管道名称，管道方向，服务器实例的最大数量，传输模式，管道选项，推荐进出缓冲尺寸，管道安全性，可继承模式和管道访问权限的类。\r\n","Holds an ":"持有\r\n","Calculates a MemberForwarded coded index for the specified handle.":"为指定的手柄计算成员Forwarded编码索引。\r\n","Stores an object to be deserialized from a SOAP-encoded ":"存储一个可以从肥皂编码的物体\r\n"," for this node.":" 对于此节点。\r\n","Provides a safe handle that represents a key (NCRYPT_KEY_HANDLE).":"提供一个表示密钥（ncrypt_key_handle）的安全手柄。\r\n"," with the specified target from this method.":" 使用此方法的指定目标。\r\n","The XML document is invalid.":"XML文档无效。\r\n"," class that can serialize objects of type ":" 可以序列化类型对象的类\r\n","Asynchronously writes an element with the specified prefix, local name, namespace URI, and value.":"异步写一个带有指定的前缀，本地名称，名称空间URI和值的元素。\r\n",", or its equivalent.":"，或它的等效。\r\n","Returns the URI of the ":"返回URI\r\n",". The following target types are valid:  \r\n  \r\n - ":"。以下目标类型有效：\r\n  \r\n  - \r\n","Produces a camel-case string from an input string.":"从输入字符串中产生骆驼盒字符串。\r\n","Writes the current node to an ":"将当前节点写入\r\n"," class with the specified name and content.":" 具有指定名称和内容的课程。\r\n","Gets or sets an object that instructs the ":"获取或设置一个指示的对象\r\n"," class to serialize or deserialize an object of the specified type.":" 类以序列化或应对指定类型的对象进行序列化。\r\n","The caller does not have sufficient permissions to call this method.":"呼叫者没有足够的权限来调用此方法。\r\n","Occurs during deserialization of a SOAP-encoded XML stream, when the ":"发生在肥皂编码的XML流的避难化期间，当\r\n","Gets or sets the namespace of the XML type.":"获取或设置XML类型的名称空间。\r\n"," to the child node of the ":" 到子节点\r\n"," is positioned on a node that is not an element, attribute, or the root node or there is not type information to perform validation.":" 位于不是元素，属性或根节点的节点上，或者没有类型的信息要执行验证。\r\n"," that indicates that an object being deserialized cannot be instantiated because there is no constructor available.":" 这表明无法实例化，因为没有可用的构造函数，因此无法实例化。\r\n","Gets or sets the Service Provider Name (SPN) to use for authentication when using extended protection.":"使用扩展保护时获取或设置服务提供商名称（SPN）用于身份验证。\r\n","Event argument for an ":"事件论点\r\n"," that indicates that the current position of ":" 这表明当前位置\r\n"," used for resolving external document type definition (DTD) and schema location references. The ":" 用于解决外部文档类型定义（DTD）和架构位置参考。这\r\n","The week specified in your system settings as the first week of the year. This member is equivalent to the Visual Basic constant ":"在您的系统设置中指定的一周是一年中的第一周。该成员等同于视觉基本常数\r\n","Returns a derivation of the ":"返回派生\r\n","Gets the root element of the XML Tree for this document.":"获取此文档的XML树的根元素。\r\n","Gets the line number indicating where the error occurred in the style sheet.":"获取行号，指示误差在样式表中发生的位置。\r\n"," instance's scope, ensuring that the name is unique within the scope.":" 实例的范围，确保名称在范围内是唯一的。\r\n"," objects that match the filter in the order of the sort that match the specified state.":" 按照指定状态匹配的排序顺序匹配过滤器的对象。\r\n",", external resources are not resolved.  \r\n  \r\n The ":"，外部资源无法解决。\r\n  \r\n 这\r\n"," method on the same ":" 相同的方法\r\n","Gets the namespace associated with a particular prefix for this ":"获取与此的特定前缀关联的名称空间\r\n"," method and returns a completed task, blocking the calling thread. The default implementation will return a cancelled task if passed an already cancelled cancellation token. Exceptions thrown by ExecuteScalar will be communicated via the returned Task Exception property.  \r\n  \r\n Do not invoke other methods and properties of the ":" 方法并返回完成的任务，阻止调用线程。如果已通过已取消的取消令牌，则默认实现将返回已取消的任务。 ExecuteScalar抛出的异常将通过返回的任务异常属性传达。\r\n  \r\n 请勿调用其他方法和属性\r\n"," element tag.":" 元素标签。\r\n","Sets the specified access control for the specified ":"设置指定的指定访问控件\r\n","Sets the data in the specified slot on the currently running thread, for that thread's current domain. For better performance, use fields marked with the ":"为该线程的当前域上的当前运行线程上的指定插槽中设置数据。为了更好地性能，请使用标记的字段\r\n"," reported for this ":" 为此报道了\r\n","The value assigned to the ":"分配给的值\r\n","Called by clients to authenticate the client, and optionally the server, in a client-server connection as an asynchronous operation. The authentication process uses the specified client credential and the channel binding.":"客户端打电话给客户服务器连接中的客户端和服务器的身份验证，作为异步操作。身份验证过程使用指定的客户端凭据和通道绑定。\r\n"," read the fully qualified name of the element where it is currently positioned.":" 阅读当前位置的元素的完全合格名称。\r\n"," class that can serialize objects of the specified type into XML documents, and deserialize XML documents into objects of the specified type. Each object to be serialized can itself contain instances of classes, which this overload can override with other classes.":" 可以将指定类型的对象序列化为XML文档的类，并将XML文档置于指定类型的对象中。每个要序列化的对象本身都包含类的实例，该过载可以与其他类覆盖。\r\n"," with the collection of SOAP-related attributes that have been applied to the member code entity.":" 随着已应用于成员代码实体的肥皂相关属性的收集。\r\n","Reads an XML element that allows null values (":"读取一个允许null值的XML元素（\r\n","Gets whether elements in an earlier partition always come before elements in a later partition.":"获取早期分区中的元素是否总是在以后分区中的元素之前出现。\r\n","When overridden in a derived class, moves to the node that has an attribute of type ":"当在派生类中覆盖时，移至具有类型属性的节点\r\n"," class and specifies the name of the XML type.":" 类并指定XML类型的名称。\r\n","Evaluates an XPath expression, resolving namespace prefixes using the specified ":"评估XPath表达式，使用指定的命名空间前缀解决\r\n"," object that specifies a public key BLOB for an elliptic curve cryptography (ECC) key.":" 为椭圆曲线密码（ECC）密钥指定公共密钥斑点的对象。\r\n"," to decode response header values.":" 解码响应标头值。\r\n","Produces a string from an input hexadecimal byte array.":"从输入十六进制字节阵列中产生一个字符串。\r\n"," structure from a 32-bit ARGB value.":" 从32位ARGB值中的结构。\r\n","; the call results in surrogate pair characters being split or an invalid surrogate pair being written.":";呼叫导致替代对角色被拆分或编写无效的替代对。\r\n"," encounters an XML attribute of unknown type during deserialization.":" 遇到避难化期间未知类型的XML属性。\r\n","Sorts the elements in an entire ":"分类整个元素\r\n","Gets a value indicating whether the current node is an attribute that was generated from the default value defined in the DTD or schema.":"获取一个值，指示当前节点是从DTD或架构中定义的默认值生成的属性。\r\n"," to the same position as the specified ":" 与指定的位置相同\r\n"," objects to override.":" 对象覆盖。\r\n","Executes the transform using the input document specified by the URI and outputs the results to a file.":"使用URI指定的输入文档执行转换，并将结果输出到文件。\r\n"," class with the type and the base type.":" 类型和基本类型的类。\r\n","Gets or sets values indicating the level of authentication and impersonation used for this request.":"获取或设置值表示该请求的身份验证和模拟级别的值。\r\n"," to a file, optionally disabling formatting.":" 到文件，可选地禁用格式。\r\n","During serialization, deserialization, and schema import and export, returns a data contract type that substitutes the specified type.":"在序列化，避难所和架构导入和导出过程中，返回替换指定类型的数据合同类型。\r\n","Gets or sets the translation component of this matrix.":"获取或设置此矩阵的翻译组件。\r\n","Returns the zero-based index of the first occurrence of the specified ":"返回指定的首次出现的基于零的索引\r\n","Provides a type converter to convert 64-bit signed integer objects to and from various other representations.":"提供类型转换器，以将64位签名的整数对象转换为其他各种表示形式。\r\n"," synchronously on the ":" 同步\r\n","Reinitializes a JavaScript Object Notation (JSON) enabled reader to a specified buffer that contains JSON-encoded data.":"重新初步将JavaScript对象符号（JSON）启用读取器到包含JSON编码数据的指定缓冲区。\r\n","Gets the component that contains the specified component.":"获取包含指定组件的组件。\r\n","Serializes the specified ":"序列化指定的\r\n","Selects a node set using the specified ":"使用指定的节点集选择一个节点集\r\n"," according to the W3C XML 1.0 recommendation.":" 根据W3C XML 1.0建议。\r\n","Writes a byte to the current position in the buffered stream.":"将一个字节写入缓冲流中的当前位置。\r\n","Adds the specified audit rule to the System Access Control List (SACL) associated with this ObjectSecurity`1 object.":"将指定的审核规则添加到与此ObjectSecurity`1对象关联的系统访问控制列表（SACL）中。\r\n","Returns the type of an array whose element type is the generic type parameter, with the specified number of dimensions.":"返回其元素类型为通用类型参数的数组的类型，其中指定的尺寸数。\r\n"," has been disposed or the ":" 已被处置或\r\n"," parameter when the ":" 参数时\r\n","\\r\\n":"\\ r \\ n\r\n"," parameter, optionally preserving white space.":" 参数，可选地保存空白。\r\n","[Supported in the .NET Framework 4.5.1 and later versions]  \r\n  \r\n Initializes a new instance of the ":"[在.NET Framework 4.5.1及以后的版本中支持]\r\n  \r\n 初始化一个新实例\r\n","Gets or sets the type of the object to include.":"获取或设置要包含的对象的类型。\r\n","Gets or sets the value of this attribute.":"获取或设置此属性的值。\r\n","Compiles a string representing an XPath expression and returns an ":"编译代表XPath表达式并返回的字符串\r\n","Setting this property after a read operation has occurred (":"发生读取操作后，设置此属性（\r\n","Gets or sets an object that represents the method that handles the ":"获取或设置一个代表处理方法的对象\r\n","Writes a verbatim message without any additional context information followed by the current line terminator to the file or stream.":"写下逐字消息，而没有任何其他上下文信息，然后是当前的线路终结者到文件或流。\r\n"," that applies a delegate or lambda expression to a list of argument expressions.":" 这将代表或lambda表达式应用于参数表达式列表。\r\n","Gets the local name of the current node.":"获取当前节点的本地名称。\r\n","Gets a dynamically generated assembly by name.":"按名称获取动态生成的组件。\r\n"," class using the specified stream and encoding.":" 使用指定的流和编码的类。\r\n"," is not positioned on an element or attribute node.":" 不在元素或属性节点上。\r\n"," function is not resolved.  \r\n  \r\n The ":" 功能无法解决。\r\n  \r\n 这\r\n"," object specified to resolve namespace prefixes in the XPath expression.":" 对象在XPATH表达式中指定的命名空间前缀。\r\n","The multiplication operator is not defined for ":"乘法运算符未定义\r\n","The server process can impersonate the client's security context on its local system. The server cannot impersonate the client on remote systems.":"服务器流程可以在其本地系统上冒充客户端的安全上下文。服务器无法在远程系统上模仿客户端。\r\n","The parent is ":"父母是\r\n","Gets or sets a value indicating whether to enable support for the XSLT ":"获取或设置一个值，指示是否启用XSLT支持\r\n","INSERTPS xmm, xmm/m32, imm8":"插入XMM，XMM/M32，IMM8\r\n"," object from an input string.":" 来自输入字符串的对象。\r\n","If the next content node is not a start tag; if the element ":"如果下一个内容节点不是开始标签；如果是元素\r\n","Gets the position in the line of the unknown XML node.":"在未知XML节点的线路中获取位置。\r\n","Selects all the descendant nodes of the current node that have a matching ":"选择具有匹配的当前节点的所有后代节点\r\n","Provides mappings between .NET Web service methods and Web Services Description Language (WSDL) messages that are defined for SOAP Web services.":"提供.NET Web服务方法和Web服务描述语言（WSDL）消息之间的映射，该消息定义为SOAP Web服务。\r\n","Compares an existing ":"比较现有\r\n"," from the Web Services Description Language (WSDL) namespace.":" 来自Web服务描述语言（WSDL）名称空间。\r\n","Loads the XSLT style sheet contained in the ":"加载XSLT样式表中包含的XSLT样式表\r\n","Returns the result of a call to the ":"返回呼叫的结果\r\n","Indicates that the transfer encoding is unknown.":"表明传输编码未知。\r\n","Gets the collection of methods that is used to write to a data stream.":"获取用于写入数据流的方法的集合。\r\n","Return the Quality of Service (QOS) attributes for the socket group. This value is reserved for future use, and is equal to the Winsock 2 SIO_GET_GROUP_QOS constant.":"返回插座组的服务质量（QOS）属性。此值保留供将来使用，并且等于winsock 2 sio_get_group_qos常数。\r\n","Writes this streaming element to an ":"将此流元素写入\r\n","Gets or sets an array of keys for the objects that belong to the ":"获取或设置属于属于对象的键\r\n"," attribute (":" 属性 （\r\n","Writes an element with the specified local name and value.":"写一个带有指定的本地名称和值的元素。\r\n","The type of elements in the queue.":"队列中的元素类型。\r\n","Returns the fully qualified name of the current exception, and possibly the error message, the name of the inner exception, and the stack trace.":"返回当前异常的完全合格名称，可能是错误消息，内部异常的名称以及堆栈跟踪。\r\n"," to the attribute with the matching local name and namespace URI.":" 具有匹配的本地名称和名称空间URI的属性。\r\n","At least one component in ":"至少一个组成\r\n",", XML namespaces, and encoding.":"，XML名称空间和编码。\r\n","Gets a value that indicates whether the current dynamic method is security-safe-critical at the current trust level; that is, whether it can perform critical operations and can be accessed by transparent code.":"获取一个值，该值指示当前的动态方法在当前信托级别上是否是安全安全至关重要的；也就是说，它是否可以执行关键操作，并且可以通过透明代码访问。\r\n","Generates internal mappings to .NET types for XML schema element declarations, including literal XSD message parts in a WSDL document.":"为XML模式元素声明生成内部映射到.NET类型，包括WSDL文档中的字面XSD消息部分。\r\n","Specifies client requirements for authentication and impersonation when using the ":"指定客户在使用身份验证和模仿的要求\r\n"," and initializes its underlying XML tree using the specified stream, optionally preserving white space.":" 并使用指定的流来初始化其基础XML树，可选地保留空白。\r\n","Preserves insignificant white space while parsing.":"解析时可以保留微不足道的空白空间。\r\n","When overridden in a derived class, moves the ":"当在派生的班级中覆盖时，移动\r\n","Outputs this ":"输出此\r\n","Represents a dataflow block that supports receiving messages without linking.":"表示一个数据流块，该块支持接收消息而无需链接。\r\n","Checks whether the deserializer has advanced.":"检查求职者是否已进步。\r\n","Gets or sets the name of the XML attribute generated by the ":"获取或设置由XML属性的名称\r\n","Represents an abstract class used for controlling serialization by the ":"代表用于控制序列化的抽象类\r\n"," serializes a public field or property as encoded SOAP XML.":" 将公共字段或属性序列化为编码的SOAP XML。\r\n","Equivalent to HTTP status 202. ":"等效于HTTP状态202。\r\n"," class and specifies the name of the XML element generated in the XML document.":" 类并指定XML文档中生成的XML元素的名称。\r\n","&num;":"＆num;\r\n","Used to retrieve string information for native interoperability.":"用于检索本机互操作性的字符串信息。\r\n"," delegate instance, plus the method's inputs; also supplies the method's parameters.":" 委托实例，加上方法的输入；还提供方法的参数。\r\n","Gets or sets the concatenated text contents of this element.":"获取或设置此元素的串联文本内容。\r\n","Gets or sets the name of the XML type.":"获取或设置XML类型的名称。\r\n","Indicates the default attribute state, that the property should not notify the parent property of changes to its value. This field is read-only.":"指示默认属性状态，即该属性不应将其值更改的父属性通知父属性。该字段仅阅读。\r\n"," objects in each substring.":" 每个基因中的对象。\r\n","Divides two unsigned values and pushes the remainder onto the evaluation stack.":"将两个未签名的值分开，并将其余部分推到评估堆栈上。\r\n"," class with the specified string content.":" 与指定的字符串内容类。\r\n","Ignore that the certificate has an invalid name when determining certificate verification.":"忽略证书在确定证书验证时具有无效的名称。\r\n"," class and specifies the ":" 班级并指定\r\n","Serialize this element to a ":"序列化此元素\r\n","Moves the ":"移动\r\n"," if that object does not exist.":" 如果该对象不存在。\r\n","Specifies the sort order.":"指定排序顺序。\r\n","A schema validation error occurred, and no ":"架构验证错误发生，否\r\n","When overridden in a derived class, gets the state of the writer.":"当在派生的班级中覆盖时，会得到作者的状态。\r\n"," encounters a recognized type that is not used or is unreferenced.":" 遇到未使用或未参考的公认类型。\r\n","Initializes an instances of the ":"初始化一个实例\r\n","Serialize this streaming element to a ":"序列化此流元素\r\n","Enables iteration over a collection of ":"在集合中启用迭代\r\n","{namespace}localname":"{名称空间} localname\r\n","Gets or sets the type allowed in an array.":"获取或设置数组中允许的类型。\r\n","Gets or sets a value indicating whether to allow DTD processing. This property is obsolete. Use ":"获取或设置一个指示是否允许DTD处理的值。该属性已过时。利用\r\n","Specifies how to write XML data and a relational schema from a ":"指定如何编写XML数据和来自\r\n","Writes a UTF-16 text value (as a JSON string) as an element of a JSON array.":"将UTF-16文本值（作为JSON字符串）写为JSON数组的元素。\r\n","Serialize and write all name/value tuples provided in the constructor to an HTTP content stream as an asynchronous operation.":"序列化并将构造函数中提供的所有名称/值元组作为异步操作作为HTTP内容流。\r\n","Returns a filtered collection of the descendant elements for this document or element, in document order. Only elements that have a matching ":"根据文档顺序返回本文档或元素的后代元素的过滤集合。只有匹配的元素\r\n"," to the given ":" 给定\r\n","Gets or sets a value indicating whether to normalize line breaks in the output.":"获取或设置一个值，以指示输出中的线路断路是否标准化。\r\n","Maps a code entity in a .NET Web service method to an element in a Web Services Description Language (WSDL) message.":"将.NET Web服务方法中的代码实体映射到Web服务描述语言（WSDL）消息中的元素。\r\n","Gets the namespace of the .NET type for this mapping.":"获取此映射的.NET类型的名称空间。\r\n","Selects all the child nodes of the current node that have the matching ":"选择具有匹配的当前节点的所有子节点\r\n","When overridden in a derived class, gets the item's value as an ":"当在派生类中覆盖时，将项目的值作为一个\r\n","Returns an enumerable collection of file names and directory names that match a search pattern and enumeration options in a specified path.":"返回指定路径中匹配搜索模式和枚举选项的文件名和目录名称的枚举集合。\r\n"," class and customizes how the ":" 班级并自定义如何\r\n"," into XML document instances, and deserialize XML document instances into objects of type ":" 进入XML文档实例，并将XML文档实例列为类型的对象\r\n"," to start returning ":" 开始返回\r\n","Gets the current item.":"获取当前项目。\r\n"," that indicates that a derived type that is mapped to an XML Schema data type cannot be located.":" 这表明无法找到映射到XML模式数据类型的派生类型。\r\n","Gets the first child node of this node.":"获取此节点的第一个子节点。\r\n","Gets the object associated with the specified (base class) type. The ":"获取与指定（基类）类型关联的对象。这\r\n","Sets the value of this element.":"设置此元素的值。\r\n","Reads an XML Schema  from the supplied stream.":"从提供的流中读取XML模式。\r\n","Writes the XML declaration with the version \"1.0\" and the standalone attribute.":"用版本“ 1.0”和独立属性编写XML声明。\r\n"," object with the specified white space handling.":" 具有指定的白空间处理的对象。\r\n","When overridden in a derived class, writes out the namespace-qualified name. This method looks up the prefix that is in scope for the given namespace.":"当在派生的班级中覆盖时，写下了名称空间合格的名称。此方法查找给定名称空间范围的前缀。\r\n"," representing the variable.":" 表示变量。\r\n","Gets or sets the location of the assembly that contains the serializers.":"获取或设置包含序列化器的组件的位置。\r\n","The XPath expression is not valid.":"XPATH表达式无效。\r\n","Compares the specified UTF-8 encoded text to the name of this property.":"将指定的UTF-8编码文本与此属性的名称进行比较。\r\n","Converts the value of the specified 16-bit signed integer to the equivalent 64-bit unsigned integer.":"将指定的16位签名整数的值转换为等效的64位未签名整数。\r\n","Gets a value that determines whether a type can be serialized.":"获取一个确定类型是否可以序列化的值。\r\n",", and makes it available via the ":"，并通过\r\n","Gets the date component of this instance.":"获取此实例的日期组件。\r\n","Gets the next attribute of the parent element.":"获取父元素的下一个属性。\r\n"," sub-tree conforms to a specified ":" 子树符合指定的\r\n","Finds the greatest common divisor of two ":"找到两个最大的共同除数\r\n","MASKMOVDQU xmm, xmm":"maskMovdQu XMM，XMM\r\n","Gets or sets the string value of this processing instruction.":"获取或设置此处理指令的字符串值。\r\n"," that indicates the ":" 这表明\r\n","Gets or sets the name of the Web service method member for this mapping.":"获取或设置此映射的Web服务方法成员的名称。\r\n","Gets or sets whether white space and attribute values are normalized.":"获取或设置是否标准化了空白和属性值。\r\n","Removes all parameters and extension objects from the ":"从\r\n","Converts a memory span that contains string representation of a date and time to its ":"将包含日期和时间的字符串表示的内存跨度转换为其\r\n"," object to the collection of ":" 目的是集合\r\n","A node with white space characters and ":"带有白空间字符的节点，\r\n","Returns a filtered collection of elements that contain this element, and all descendant elements of this element, in document order. Only elements that have a matching ":"返回包含此元素的元素的过滤集合，以及该元素的所有后代元素，按文档顺序排列。只有匹配的元素\r\n","Produces a numeric enumeration value from a string that consists of delimited identifiers that represent constants from the enumerator list.":"从字符串中产生一个数字枚举值，该字符串由代表枚举列表的常数的分隔标识符组成。\r\n","Gets or sets the type that the serializer operates on.":"获取或设置串行器运行的类型。\r\n"," is positioned on does not allow a new child node to be prepended.":" 定位在不允许新的孩子节点上进行预先准备。\r\n","Attempts to retrieve a read-only sequence segment from the specified read-only sequence.":"尝试从指定的仅读取序列检索仅读取序列段。\r\n","Write this ":"写这个\r\n","Writes a SOAP message XML element that contains a reference to a ":"写下肥皂消息XML元素，其中包含对\r\n","Defines the XPath node types that can be returned from the ":"定义可以从\r\n","Represents the TLS_DHE_DSS_WITH_CAMELLIA_128_CBC_SHA256 cipher suite.":"代表TLS_DHE_DSS_WITH_CAMELLIA_128_CBC_SHA256密码套件。\r\n"," serializes and deserializes an object.":" 序列化并应对一个对象。\r\n"," does not allow a new sibling node to be inserted after the current node.":" 在当前节点之后不允许插入新的兄弟节点。\r\n"," is qualified or unqualified.":" 是合格或不合格的。\r\n"," specified in document order.":" 用文档顺序指定。\r\n","Asynchronously reads a sequence of bytes from the current file stream and writes them to a byte array beginning at a specified offset, advances the position within the file stream by the number of bytes read, and monitors cancellation requests.":"异步读取当前文件流中的一个字节序列，并将它们写入指定偏移段开始的字节数组，通过读取字节数的数量，并监视取消请求。\r\n"," is not a valid name according to the W3C Namespaces spec.":" 根据W3C名称空间规格不是有效名称。\r\n","Gets a value that indicates whether this entry is a directory.":"获取一个指示此条目是否为目录的值。\r\n","Gets the first (in document order) child element with the specified ":"用指定的\r\n","Specifies the data type used to determine sort order.":"指定用于确定排序顺序的数据类型。\r\n","xsl:output":"XSL：输出\r\n","Gets the XML element name of the mapped object.":"获取映射对象的XML元素名称。\r\n","Represents a missing value in the ":"表示在\r\n"," scope.  \r\n  \r\n ":" 范围。\r\n  \r\n \r\n","Gets the description that visual designers can display when referencing an event, extender, or property.":"获取视觉设计师在引用事件，扩展器或属性时可以显示的描述。\r\n","There was an error processing the XSLT transformation.  \r\n  \r\n Note: This is a change in behavior from earlier versions. An ":"处理XSLT转换存在错误。\r\n  \r\n 注意：这是早期版本的行为变化。一个\r\n","Specifies whether a mapping is read, write, or both.":"指定映射是读取，编写还是两者兼而有之。\r\n"," elements.  \r\n  \r\n If this is ":" 元素。\r\n  \r\n 如果是\r\n","Sets the typed value of the current node.":"设置当前节点的键入值。\r\n","Gets the last attribute of this element.":"获取此元素的最后属性。\r\n","Gets or sets how white space is handled when parsing XML.":"解析XML时获取或设置如何处理空白。\r\n"," and initializes its underlying XML tree using the specified XML reader, optionally preserving white space.":" 并使用指定的XML读取器来初始化其基础XML树，并选择保留白色空间。\r\n"," instance by using the specified stream, optionally preserving white space, setting the base URI, and retaining line information.":" 实例通过使用指定的流，可选地保留空白，设置基本URI并保留线路信息。\r\n","Gets an XML schema definition that describes the XML representation of this object.":"获取XML模式定义，描述该对象的XML表示。\r\n"," element and that was stored earlier by ":" 元素，这是先前存储的\r\n"," object created from this ":" 由此创建的对象\r\n","When overridden in a derived class, encodes the specified binary bytes as ":"当在派生类中覆盖时，将指定的二进制字节编码为\r\n","Gets or sets a value that corresponds to the name attribute of the WSDL part element.":"获取或设置与WSDL部分元素的名称属性相对应的值。\r\n"," class with the specified debug setting.":" 具有指定调试设置的类。\r\n"," structure to float.":" 浮动的结构。\r\n","Removes the input name from the ":"从\r\n","Sets the value of an attribute, adds an attribute, or removes an attribute.":"设置属性的值，添加属性或删除属性。\r\n","Removes all code entities or type mappings, including their names, from the ":"从\r\n","Gets the name of the mapped element.":"获取映射元素的名称。\r\n","Represents a text node that contains CDATA.":"表示包含CDATA的文本节点。\r\n","Instructs ":"指示\r\n"," instance's reserved names.":" 实例的保留名称。\r\n","Creates a new child element at the beginning of the list of child nodes of the current node using the namespace prefix, local name, and namespace URI specified with the value specified.":"在当前节点的子节点列表的开头中创建一个新的子元素，并使用指定值指定的值指定的名称空间前缀，本地名称和名称空间URI。\r\n","Gets the unqualified name of the XML element declaration that applies to this mapping.":"获取适用于此映射的XML元素声明的不合格名称。\r\n","The element does not contain a valid ":"该元素不包含有效的\r\n"," property is applied to the field value when the data field is in edit mode.":" 当数据字段处于编辑模式时，将属性应用于字段值。\r\n"," does not allow a new sibling node to be inserted before the current node.":" 在当前节点之前不允许插入新的兄弟节点。\r\n"," class with the specified version, encoding, and standalone status.":" 与指定版本，编码和独立状态的类。\r\n"," is not a valid NmToken; or ":" 不是有效的nmtoken；或者\r\n","Specifies whether to omit duplicate namespaces when loading an ":"指定加载时是否省略重复的名称空间\r\n","Gets the XML namespace that applies to this mapping.":"获取适用于此映射的XML名称空间。\r\n","2 * ReceiveBufferSize + SendBufferSize + 256 + 20 (16 on 32-bit)":"2 *接收缓冲 + sendbuffersize + 256 + 20（32位16）\r\n","Writes the specified ":"写出指定的\r\n","Removes the object with the namespace URI from the ":"用名称空间URI从\r\n","Gets or sets a value that indicates whether the XML writer should check to ensure that all characters in the document conform to the \"2.2 Characters\" section of the W3C XML 1.0 Recommendation.":"获取或设置一个值，该值指示XML Writer是否应检查以确保文档中的所有字符符合W3C XML 1.0建议的“ 2.2个字符”部分。\r\n"," to read the XML node at its current position.":" 读取当前位置的XML节点。\r\n","ENTITIES type.":"实体类型。\r\n","Executes the transform using the input document specified by the ":"使用该输入文档执行转换\r\n"," and encoding style.":" 和编码样式。\r\n","Starts just-in-time (JIT) compilation of the methods that were previously recorded in the specified profile file, on a background thread. Starts the process of recording current method use, which later overwrites the specified profile file.":"启动时间（JIT）的汇编（JIT）汇编的以前在背景线程上指定的配置文件文件中记录的方法。启动记录当前方法使用的过程，后来覆盖指定的配置文件文件。\r\n",".  \r\n  \r\n -or-  \r\n  \r\n The return type of the method represented by ":"。\r\n  \r\n -或者-\r\n  \r\n 该方法的返回类型由\r\n","Allows you to override attributes applied to properties, fields, and classes when you use an ":"当您使用时，允许您覆盖应用于属性，字段和类的属性\r\n","Copies items into an array. Only for Web Forms Interfaces.":"将项目复制到阵列中。仅适用于Web表单界面。\r\n","Represents elements in an XML tree that supports deferred streaming output.":"表示支持延期流输出的XML树中的元素。\r\n","Gets a value indicating whether the member is browsable, as specified in the ":"获得一个值，指示成员是否可浏览，如在\r\n","This is not the first write method called after the constructor.\r\n\r\n-or-\r\n\r\nAn ":"这不是构造函数之后的第一个写入方法。\r\n\r\n-或者-\r\n\r\n一个\r\n","Defines the valid calling conventions for a method.":"定义方法的有效通话约定。\r\n","The R key.":"R键。\r\n","Writes an element with the specified local name, namespace URI, and value.":"用指定的本地名称，名称空间URI和值写一个元素。\r\n","Gets the namespace part of the fully qualified name.":"获取完全合格名称的名称空间。\r\n"," that can be inserted into the serialized array.":" 可以将其插入序列化阵列中。\r\n","Gets the description of the error condition for this exception.":"获取此异常的错误条件的描述。\r\n","Gets or sets a value that corresponds to the type attribute of the WSDL part element.":"获取或设置与WSDL部分元素的类型属性相对应的值。\r\n","xsl:message":"XSL：消息\r\n","Provides static methods to convert input text into names for code entities.":"提供静态方法将输入文本转换为代码实体的名称。\r\n","Retrieves an array of the custom attributes applied to a method parameter. Parameters specify the method parameter, the type of the custom attribute to search for, and whether to search ancestors of the method parameter.":"检索应用于方法参数的自定义属性的数组。参数指定方法参数，要搜索的自定义属性的类型以及是否搜索方法参数的祖先。\r\n"," class, specifying XML serialization overrides and a default XML namespace.":" 类，指定XML序列化替代和默认的XML名称空间。\r\n","A32: VRHADD.U16 Qd, Qn, Qm":"A32：VRHADD.U16 QD，QN，QM\r\n","Gets the local (unqualified) part of the name.":"获取名称的本地（不合格）部分。\r\n"," object to the writer. The position of the ":" 反对作者。位置\r\n","Writes a four-byte signed integer to the current stream and advances the stream position by four bytes.":"将四字节签名的整数写入当前流，并以四个字节为单位。\r\n",", optionally populating the XML tree with the post-schema-validation infoset (PSVI).":"，可选地使用后室内验证信息（PSVI）填充XML树。\r\n","Signals a breakpoint to an attached debugger.":"标志着附带的调试器的断点。\r\n","A service of type ":"类型的服务\r\n"," objects contained by the ":" 包含的对象\r\n"," remains unchanged.":" 保持不变。\r\n","The type of the intermediate elements collected by the function represented by ":"由函数收集的中间元素的类型\r\n","Gets a value that indicates whether the current node has any attributes.":"获取一个指示当前节点是否具有任何属性的值。\r\n","Gets the XML namespace of the mapped object.":"获取映射对象的XML名称空间。\r\n"," parameter will be raised upon completion of the operation.\r\n\r\n ":" 操作完成后将提出参数。\r\n\r\n \r\n"," parameter specifies the name of a member that is overridden.":" 参数指定被覆盖的成员的名称。\r\n","Gets the object being deserialized.":"使对象被弥补。\r\n",", positioned on the current context node.":"，位于当前上下文节点上。\r\n","Gets an object from a collection.":"从集合中获取对象。\r\n"," are not valid.":" 无效。\r\n"," are included in the collection.  \r\n  \r\n The nodes in the returned collection are in reverse document order.  \r\n  \r\n This method uses deferred execution.":" 包含在集合中。\r\n  \r\n 返回集合中的节点以反向文档顺序为单位。\r\n  \r\n 此方法使用延期执行。\r\n","Gets a specified ":"指定一个\r\n","Returns the culture-specific abbreviated name of the specified month based on the culture associated with the current ":"根据与当前相关的文化，返回特定文化的缩写名称\r\n","An object that defines a set of properties and enables binding, which can involve selection of an overloaded member, coercion of argument types, and invocation of a member through reflection.  \r\n  \r\n -or-  \r\n  \r\n A null reference (":"定义一组属性并启用绑定的对象，该对象可以涉及选择超载成员，强制参数类型以及通过反射调用成员的对象。\r\n  \r\n -或者-\r\n  \r\n null引用（\r\n"," to write an XML attribute that has no namespace specified for its name.":" 编写一个没有指定名称的名称空间的XML属性。\r\n",", starting at the specified array index.":"，从指定的数组索引开始。\r\n","Provides a way for clients to access the actual object, rather than the adapter object handed out by a custom marshaler.":"为客户提供了一种访问实际对象的方法，而不是由自定义元帅分发的适配器对象。\r\n"," and writes the XML document to a file using the specified ":" 并使用指定的\r\n","The XML contents of the ":"XML内容\r\n","Nodes are sorted in ascending order. For example, if the numbers 1,2,3, and 4 are sorted in ascending order, they appear as 1,2,3,4.":"节点按升序排序。例如，如果数字1,2,3和4按升序排序，则它们的出现为1,2,3,4。\r\n","Writes text one buffer at a time.":"一次写文字一个缓冲区。\r\n","This class contains the LINQ to XML extension methods that enable you to evaluate XPath expressions.":"此类包含LINQ到XML扩展方法，使您能够评估XPath表达式。\r\n","Specifies that the public member value be serialized by the ":"指定公共成员价值由\r\n","Determines whether the current node matches the specified ":"确定当前节点是否匹配指定的\r\n"," has already been called.":" 已经被称为。\r\n","Gets or sets the level of conformance that the XML writer checks the XML output for.":"获取或设置XML Writer检查XML输出的一致性级别。\r\n"," is not of type ":" 不是类型\r\n","When overridden in a derived class, closes this stream and the underlying stream.":"当在派生的类中覆盖时，关闭该流和基础流。\r\n","Asynchronously outputs this ":"异步输出此\r\n","Adds an element declaration to the applicable ":"将元素声明添加到适用的\r\n"," that appends text to the file represented by this instance of the ":" 这将文本附加到由此实例表示的文件\r\n"," elements in a SOAP message.":" 肥皂消息中的元素。\r\n"," object from an expanded name.":" 来自扩展名称的对象。\r\n","Determines if this attribute is a namespace declaration.":"确定此属性是否是名称空间声明。\r\n"," header is not ":" 标题不是\r\n","Generates internal type mapping information for the element parts of a literal-use SOAP message defined in a WSDL document.":"为WSDL文档中定义的文字使用SOAP消息的元素部分生成内部类型映射信息。\r\n","The Visual Basic compiler uses this class for object flow control; it is not meant to be called directly from your code.":"Visual Basic编译器将此类用于对象流控制；它并不是要直接从您的代码中调用。\r\n"," or any of its descendants are about to change.":" 或其任何后代都将要改变。\r\n","Returns a collection of nodes that contain this element, and all descendant nodes of this element, in document order.":"根据文档顺序返回包含此元素的节点的集合以及该元素的所有后代节点。\r\n","Selects all the ancestor nodes of the current node that have a matching ":"选择具有匹配的当前节点的所有祖先节点\r\n","When overridden in a derived class, writes an attribute with the specified local name, namespace URI, and value.":"当在派生类中覆盖时，写入指定的本地名称，名称空间URI和值的属性。\r\n","Provides a typed class that represents a compiled XPath expression.":"提供代表编译XPath表达式的类型类。\r\n","The type of the elements in the ":"元素的类型\r\n"," methods of the integral and floating-point numeric types.":" 积分和浮点数数字类型的方法。\r\n"," with the specified configuration.":" 带有指定的配置。\r\n"," that contains the given expressions and has no variables.":" 其中包含给定的表达式，没有变量。\r\n","When overridden in a derived class, writes out a <![CDATA[...]]> block containing the specified text.":"在派生类中覆盖时，写出包含指定文本的a <！[cdata [...]]>块。\r\n"," representing the XML Path Language (XPath) type of the variable.":" 代表变量的XML路径语言（XPATH）类型。\r\n","This results in an invalid XML document.\r\n\r\n-or-\r\n\r\nAn ":"这导致无效的XML文档。\r\n\r\n-或者-\r\n\r\n一个\r\n","Gets the module that contains the manifest for the current assembly.":"获取包含当前组件清单的模块。\r\n","Returns the expanded XML name in the format ":"返回格式扩展的XML名称\r\n","Defines the lock that implements single-writer/multiple-reader semantics. This is a value type.":"定义实现单作者/多阅读器语义的锁。这是一个值类型。\r\n","Represents a node that can contain other nodes.":"表示可以包含其他节点的节点。\r\n"," and initializes its underlying XML tree using the specified ":" 并使用指定的\r\n","Represents a collection of attribute objects that control how the ":"表示控制如何控制的属性对象的集合\r\n","Values are sorted alphabetically.":"值按字母顺序排序。\r\n","Serialize this ":"序列化\r\n","Gets the supplied XML Path Language (XPath) types for the function's argument list. This information can be used to discover the signature of the function which allows you to differentiate between overloaded functions.":"获取函数参数列表的提供的XML路径语言（XPATH）类型。该信息可用于发现该功能的签名，该函数使您可以区分过载功能。\r\n","When overridden in a derived class, closes the previous ":"在派生的班级中覆盖时，关闭了先前\r\n","An error was encountered in the XML data. The ":"XML数据中遇到了错误。这\r\n","An abstract class that is the base class for ":"一个抽象课，是\r\n"," is Closed.":" 已经关了。\r\n"," and the thread is now dead, but its state has not yet changed to ":" 线程现在已经死了，但其状态尚未更改为\r\n","The exception that is thrown by the Load method when an error is found in the XSLT style sheet.":"当在XSLT样式表中发现错误时，通过加载方法抛出的异常。\r\n"," was not positioned on the root node of the XML data.":" 未放置在XML数据的根节点上。\r\n","Represents the HTTP CONNECT protocol method that is used with a proxy that can dynamically switch to tunneling, as in the case of SSL tunneling.":"代表与代理可以动态切换到隧道的http Connect协议方法，如SSL隧穿。\r\n","Returns an editor with the specified base type for the specified type.":"返回具有指定类型的指定基本类型的编辑器。\r\n"," is not in a format recognized by ":" 不是以\r\n","Gets the location path of the style sheet.":"获取样式表的位置路径。\r\n","Provides an implementation of a ":"提供了\r\n"," to serialize or deserialize an object.":" 序列化或应对对象。\r\n"," to a collection of ":" 收集\r\n","Ends a pending asynchronous operation started with ":"结束待处理的异步操作始于\r\n"," serializes a class to which the ":" 序列化的班级\r\n"," does not support editing.":" 不支持编辑。\r\n","include":"包括\r\n","Gets the index of a column specified by name.":"获取按名称指定的列的索引。\r\n","When overridden in a derived class, gets the namespace URI of the current node.":"当在派生类中覆盖时，获取当前节点的名称空间URI。\r\n","Produces a valid code entity name from an input string.":"从输入字符串中生成有效的代码实体名称。\r\n","Return a new array containing the encoded value.":"返回包含编码值的新数组。\r\n"," instance's context for later use when import methods are invoked.":" 实例的上下文供以后使用时使用导入方法。\r\n","Asynchronously writes the XML declaration with the version \"1.0\" and the standalone attribute.":"异步用版本“ 1.0”和独立属性编写XML声明。\r\n"," must serialize a particular class member as an array of XML elements.":" 必须将特定类成员序列化为XML元素的数组。\r\n"," event for the current position of the ":" 当前位置的事件\r\n"," is less than 0 or greater than 6.":" 小于0或大于6。\r\n","The update delegate. Called when the dynamic site experiences cache miss.":"更新委托。当动态站点经历缓存失误时打电话。\r\n"," element as a list of values of a specified data type.":" 元素作为指定数据类型的值列表。\r\n","execute":"执行\r\n"," class that validates the content returned from the given ":" 验证从给定的内容验证内容的课程\r\n","Represents an XML document. For the components and usage of an ":"代表XML文档。用于组件和使用\r\n","Creates a new ephemeral DSA key with the specified DSA key parameters.":"使用指定的DSA密钥参数创建一个新的短暂DSA密钥。\r\n"," with a common object file format (COFF) based image containing an emitted ":" 具有共同对象文件格式（COFF）的图像，包含发射的图像\r\n"," delegate to serialize SOAP-encoded XML data.":" 委派以序列化SOAP编码的XML数据。\r\n","Creates a new sibling node before the currently selected node using the nodes in the ":"在当前选择的节点使用节点之前，请在\r\n","Represents an XML comment.":"代表XML评论。\r\n","Produces a string from an input ":"从输入中产生一个字符串\r\n","Gets the name of the .NET type being mapped to the data type of an XML Schema element that represents a SOAP message.":"获取.NET类型的名称被映射到表示SOAP消息的XML模式元素的数据类型。\r\n","Gets the Halfwidth and Fullwidth Forms Unicode block (U+FF00-U+FFEE).":"获取半宽度和全宽度的Unicode块（U+FF00-U+FFEE）。\r\n"," array is greater than 14 hours or less than -14 hours.":" 阵列大于14小时或小于-14小时。\r\n"," resolves the XSLT ":" 解决XSLT\r\n","Symbol character that is not a mathematical symbol, a currency symbol or a modifier symbol. Signified by the Unicode designation \"So\" (symbol, other). The value is 28.":"不是数学符号，货币符号或修饰符符号的符号字符。由Unicode名称“ so”表示（符号，其他）。值为28。\r\n","Removes the child nodes from this document or element.":"从此文档或元素中删除子节点。\r\n","Groups the elements of a sequence according to a specified key selector function.":"根据指定的键选择器函数将序列的元素分组。\r\n","Writes a category name and a message to the listener you create when you implement the ":"将类别名称和消息写给您创建的侦听器时\r\n","Generates a mapping to an XML Schema element for a .NET type, using the specified type and attribute.":"使用指定的类型和属性生成.NET类型的XML模式元素的映射。\r\n","Gets the result of the ":"得到的结果\r\n","Wraps the UTF-8 encoded text into an ":"将UTF-8编码文本包装到一个\r\n","A32: VTST.8 Dd, Dn, Dm":"A32：VTST.8 DD，DN，DM\r\n","Reads a number of decompressed bytes into the specified byte span.":"在指定的字节跨度中读取许多解压缩字节。\r\n","Represents initializing members of a member of a newly created object.":"代表新创建对象的成员的初始化成员。\r\n","Gets an empty collection of elements.":"获得空的元素集合。\r\n"," is used in the instance document.":" 在实例文档中使用。\r\n","Gets or sets the identity of the parent assembly.":"获取或设置父件的身份。\r\n","Writes the start of an attribute with the specified local name and namespace URI.":"用指定的本地名称和名称空间URI写下属性的开始。\r\n","Creates a Digital Signature Algorithm (":"创建数字签名算法（\r\n","Creates an attribute node on the current element node using the namespace prefix, local name and namespace URI specified with the value specified.":"使用指定的值指定的命名空间前缀，本地名称和名称空间URI在当前元素节点上创建一个属性节点。\r\n"," and initializes its underlying XML tree from the specified stream, optionally preserving white space.":" 并从指定的流来初始化其基础XML树，可选地保留空白。\r\n","Gets the number of .NET code entities that belong to a Web service method to which a SOAP message is being mapped.":"获取属于Web服务方法的.NET代码实体的数量。\r\n","ObservableCounter{T}.Observe()":"observableCounter {t} .observe（）\r\n","Populates an object from its XML representation at the current location of the ":"从其XML表示的对象填充在当前位置\r\n"," to read an XML document root element at its current position.":" 要在其当前位置读取XML文档根元素。\r\n"," to the next sibling node of the current node.":" 到当前节点的下一个兄弟姐妹节点。\r\n","Allows subsequent opening of the file for writing. If this flag is not specified, any request to open the file for writing (by this process or another process) will fail until the file is closed. However, even if this flag is specified, additional permissions might still be needed to access the file.":"允许随后打开文件供书写。如果未指定此标志，则任何打开文件的请求（通过此过程或其他过程）将失败，直到关闭文件为止。但是，即使指定了此标志，访问文件仍然可能需要附加权限。\r\n"," element declaration cannot be processed.":" 元素声明无法处理。\r\n","Returns a collection of the descendant nodes of every document and element in the source collection.":"返回源集合中每个文档和元素的后代节点的集合。\r\n","Provides Transmission Control Protocol/Internet Protocol version 6 (TCP/IPv6) statistical data for the local computer.":"提供传输控制协议/Internet协议版本6（TCP/IPv6）本地计算机的统计数据。\r\n","Loads and compiles the style sheet located at the specified URI.":"加载并编译位于指定URI的样式表。\r\n","Indicates whether this secure string is marked read-only.":"指示此安全字符串是否标记为仅读取。\r\n"," attribute set to \"1\".":" 属性设置为“ 1”。\r\n","Produces the full product of two unsigned 64-bit numbers.":"产生两个未签名的64位数字的完整产品。\r\n"," object used to resolve ":" 用于解决的对象\r\n"," object parameter is not derived from ":" 对象参数不是从\r\n"," to read the string value at its current position and return it as a hexadecimal byte array.":" 要在其当前位置读取字符串值并将其返回为十六进制字节数组。\r\n"," must serialize a member that is set to ":" 必须序列化设置为\r\n"," already exists. See the Note in the Remarks section.\r\n  \r\n -or-  \r\n  \r\n The ":" 已经存在。请参阅“注释”部分中的注释。\r\n  \r\n -或者-\r\n  \r\n 这\r\n"," for the custom modifier.  \r\n  \r\n -or-  \r\n  \r\n The size of ":" 对于自定义修饰符。\r\n  \r\n -或者-\r\n  \r\n 的大小\r\n","Cast the value of this ":"抛弃它的价值\r\n"," does not use it as a default except under special circumstances.":" 除特殊情况外，不要将其用作默认值。\r\n","Gets the type of the delegate used by the ":"获取由\r\n"," using a XPath expression, resolving namespace prefixes using the specified ":" 使用XPATH表达式，使用指定的命名空间前缀解决\r\n","Gets the reason that the thread is waiting.":"得到线程正在等待的原因。\r\n","Produces a hexadecimal byte array from an input string.":"从输入字符串产生十六进制字节数组。\r\n","Gets or sets the public identifier for this Document Type Definition (DTD).":"获取或设置此文档类型定义（DTD）的公共标识符。\r\n","Does not preserve insignificant white space or load base URI and line information.":"不保留微不足道的空白或负载基础URI和线路信息。\r\n","Gets or sets a value indicating whether to indent elements.":"获取或设置一个指示是否缩进元素的值。\r\n"," is less than the resulting number of bytes.":" 小于由此产生的字节数。\r\n","Returns a filtered collection of elements that contains the descendant elements of every element and document in the source collection. Only elements that have a matching ":"返回元素的过滤集合，其中包含源集合中每个元素和文档的后代元素。只有匹配的元素\r\n","When overridden in a derived class, writes the XML declaration with the version \"1.0\" and the standalone attribute.":"当在派生类中覆盖时，用版本“ 1.0”和独立属性编写XML声明。\r\n"," it does not support.":" 它不支持。\r\n","Gets an item that contains internal type mapping information for a .NET code entity that belongs to a Web service method being mapped to a SOAP message.":"获取一个包含一个内部类型映射信息的.NET代码实体的内部类型映射信息，该信息属于映射到SOAP消息的Web服务方法。\r\n",") to an ":"）\r\n"," interface, with ":" 接口，带\r\n","Deserializes the XML document contained by the specified ":"应对指定的XML文档进行验证\r\n","Represents the abstract concept of a node (element, comment, document type, processing instruction, or text node) in the XML tree.":"表示XML树中节点（元素，注释，文档类型，处理指令或文本节点）的抽象概念。\r\n"," class using the specified default XML namespace.":" 使用指定的默认XML名称空间的类。\r\n"," class and indicates whether the field is the primary key for the data row, whether it is a database identity field, and whether it can be null and sets the length of the field.":" 类并指示该字段是否是数据行的主要键，它是否是数据库身份字段以及是否可以为null并设置字段的长度。\r\n","Returns a collection of elements that contains every element in the source collection, and the ancestors of every element in the source collection.":"返回包含源集合中每个元素的元素集合，以及源集合中每个元素的祖先。\r\n","Returns the indented XML for this node.":"返回此节点的缩进XML。\r\n","Writes a byte to the current stream at the current position.":"将一个字节写入当前位置的当前流。\r\n","No reader options specified.":"没有指定的读者选项。\r\n","Provides a fast, read-only, in-memory representation of an XML document by using the XPath data model.":"通过使用XPATH数据模型，提供XML文档的快速，仅阅读，内存表示。\r\n","Gets the post-schema-validation infoset (PSVI) of a validated attribute.":"获取经过验证的属性的Schema后验证信息（PSVI）。\r\n"," / 4.":" / 4。\r\n","Returns a filtered collection of the child elements of this element or document, in document order. Only elements that have a matching ":"根据文档顺序返回该元素或文档的子元素的过滤集合。只有匹配的元素\r\n","Suppresses reporting of a specific rule violation, allowing multiple suppressions on a single code artifact.":"抑制报告特定规则违规的报告，允许对单个代码工件进行多次抑制。\r\n","When overridden in a derived class, returns the closest prefix defined in the current namespace scope for the namespace URI.":"当在派生类中覆盖时，将返回名称空间URI当前名称空间范围中定义的最接近的前缀。\r\n"," class that can serialize objects of the specified type into XML documents, and vice versa. Each object to be serialized can itself contain instances of classes, which this overload can override with other classes.":" 可以将指定类型的对象序列化为XML文档的类，反之亦然。每个要序列化的对象本身都包含类的实例，该过载可以与其他类覆盖。\r\n","int64x2_t vqdmlsl_high_n_s32 (int64x2_t a, int32x4_t b, int32_t c) A32: VQDMLSL.S32 Qd, Dn+1, Dm[0] A64: SQDMLSL2 Vd.2D, Vn.4S, Vm.S[0]":"int64x2_t vqdmlsl_high_n_s32（int64x2_t a，int32x4_t b，int32_t c）a32：vqdmlsl.s32 qd，dn+1，dn+1，dm [0] a64：sqdmlsl2\r\n"," does not escape URI attributes.":" 不会逃脱URI属性。\r\n"," is not a valid XML name; or ":" 不是有效的XML名称；或者\r\n","Moves to the attribute with the specified name.":"用指定名称移至属性。\r\n"," from a string, optionally preserving white space, setting the base URI, and retaining line information.":" 从字符串中，可选地保留空白，设置基本URI并保留线路信息。\r\n","Gets the type name of the mapped object.":"获取映射对象的类型名称。\r\n","Gets or sets the name for this Document Type Definition (DTD).":"获取或设置此文档类型定义（DTD）的名称。\r\n","Gets or sets a value that indicates whether to include the type in XML schema documents.":"获取或设置一个指示是否包含XML模式文档中的类型的值。\r\n","Gets or sets the type of the object to use when serializing or deserializing an object.":"获取或设置序列化或应对对象的对象的类型。\r\n","Flushes whatever is in the buffer to the underlying streams and also flushes the underlying stream.":"冲洗到基础流的缓冲区中的任何东西，还冲洗下面的流。\r\n","Produces a Pascal-case string from an input string.":"从输入字符串中产生一个pascal-case字符串。\r\n","#x9":"＃x9\r\n","Creates a new value tuple with 3 components (a triple).":"创建一个具有3个组件（三重）的新值元组。\r\n"," used to resolve external resources when the ":" 用于解决外部资源时用于解决外部资源时\r\n","Asynchronously writes the DOCTYPE declaration with the specified name and optional attributes.":"异步地用指定的名称和可选属性写下Doctype声明。\r\n","Gets or sets a string containing the target application for this processing instruction.":"获取或设置包含此处理指令的目标应用程序的字符串。\r\n"," namespace is always declared implicitly. The order of the namespaces returned is not defined.":" 命名空间总是被隐式声明。未定义返回的名称空间的顺序。\r\n","When overridden in a derived class, writes the specified start tag and associates it with the given namespace.":"当在派生类中覆盖时，写入指定的启动标签，并将其与给定的名称空间相关联。\r\n","Reads a line of characters from the current string and returns the data as a string.":"从当前字符串中读取字符线，并将数据返回为字符串。\r\n","Creates a new sibling node after the currently selected node using the nodes in the ":"使用当前选择的节点使用节点在\r\n",", and receives a corresponding ICMP echo reply message from that computer as an asynchronous operation. This overload allows you to specify a time-out value for the operation and a buffer to use for send and receive.":"，并从该计算机接收到相应的ICMP回声消息作为异步操作。此过载使您可以指定操作的超时值，并用于发送和接收的缓冲区。\r\n","Gets the namespace URI that is associated with the XML node being deserialized.":"获取与XML节点应进行的命名空间URI。\r\n","Gets the node type for this ":"获取此节点类型\r\n","Converts the string representation of a number to its 32-bit signed integer equivalent.":"将数字的字符串表示形式转换为其32位签名的整数等效。\r\n","Creates a new sibling node after the currently selected node using the XML contents of the ":"使用当前选择的节点使用XML内容，创建一个新的兄弟节点\r\n","Defines a generalized method that a value type or class implements to create a type-specific method for determining equality of instances.":"定义一种广义方法，该方法值类型或类实现以创建用于确定实例平等的类型的方法。\r\n"," rights.":" 权利。\r\n","Identifies types or members as security-critical and safely accessible by transparent code.":"将类型或成员标识为关键安全性，并可以通过透明代码安全访问。\r\n","The network interface uses a Very High Data Rate Digital Subscriber Line (VDSL).":"网络接口使用非常高的数据速率数字订户线（VDSL）。\r\n"," object used to create one or more new child nodes at the end of the list of child nodes of the current node.":" 对象用于在当前节点的子节点列表的末尾创建一个或多个新的子节点。\r\n","Returns a value that indicates whether the collection contains an ":"返回一个值，该值指示该集合是否包含\r\n","The XML data string parameter is not well-formed.":"XML数据字符串参数不正确。\r\n","Selects a node set using the specified XPath expression with the ":"使用指定的XPath表达式选择一个节点集\r\n","Deserializes objects from the SOAP-encoded ":"从SOAP编码的对象进行验证\r\n"," object and outputs the results to a stream. The ":" 对象并将结果输出到流。这\r\n","When overridden in a derived class, evaluates whether to preserve white space nodes or strip them for the given context.":"当在派生的类中覆盖时，会评估是保留白空间节点还是在给定的上下文中剥离它们。\r\n","Gets the concatenated string representation of the platform identifier, version, and service pack that are currently installed on the operating system.":"获取当前在操作系统上安装的平台标识符，版本和服务包的串联字符串表示。\r\n","Returns the item's value as the specified type.":"将项目的值作为指定类型返回。\r\n","Creates a mutable array that can be converted to an ":"创建一个可变的阵列，可以转换为\r\n","Writes this CDATA object to an ":"将此CDATA对象写成\r\n"," and will not move its position.  \r\n  \r\n If ":" 并且不会移动其位置。\r\n  \r\n 如果\r\n"," objects created by using this constructor must then be added to the collection via ":" 然后必须通过使用此构造函数创建的对象，然后通过\r\n","The Content-Location header, which specifies a URI from which the accompanying body can be obtained.":"内容安置标头指定可以从中获得伴随的身体的URI。\r\n","Determines whether the current node matches the specified XPath expression.":"确定当前节点是否匹配指定的XPATH表达式。\r\n","Writes an XML element that contains a string as the body. ":"写一个XML元素，其中包含一个字符串作为身体。\r\n","An error occurred when opening the associated file.  \r\n\r\n-or-\r\n\r\nThe file specified in the ":"打开关联文件时发生错误。\r\n\r\n-或者-\r\n\r\n在\r\n","Compares nodes to determine whether they are equal. This class cannot be inherited.":"比较节点以确定它们是否相等。这个类不能被继承。\r\n","Removes the parameter from the ":"从\r\n","Returns a collection of the attributes of every element in the source collection.":"返回源集合中每个元素的属性集合。\r\n","Gets the line position that the underlying ":"获得基础的线位置\r\n","Represents certain attributes of a XSD <":"表示XSD <的某些属性\r\n","The timeout manager to use for an ":"用于使用的超时管理器\r\n"," element from XML Schema as specified by the World Wide Web Consortium (W3C). This class can be used to specify a restriction on the maximum length of the data value of a ":" XML模式的元素，由万维网联盟（W3C）指定。该类可用于指定对数据值的最大长度的限制\r\n"," class using the specified element name.":" 使用指定元素名称的类。\r\n"," Node type":" 节点类型\r\n","Gets an object of the specified type that provides a number formatting service.":"获取提供数字格式服务的指定类型的对象。\r\n","Specifies the right to create a folder This right requires the ":"指定创建文件夹的权利此权利需要\r\n"," This instance is less than object.":" 此实例小于对象。\r\n","Gets the minimum number of arguments for the function. This enables the user to differentiate between overloaded functions.":"获取该功能的最少参数数量。这使用户可以区分超载功能。\r\n"," to first namespace node of the current node.":" 到当前节点的第一个名称空间节点。\r\n"," object parameter or ":" 对象参数或\r\n","Inserts the string representation of a specified 16-bit signed integer into this instance at the specified character position.":"将指定的16位签名整数的字符串表示形式插入指定的字符位置。\r\n","Returns the name of the assembly that contains the serializer for the specified type in the specified namespace.":"返回包含指定名称空间中指定类型的序列化程序的汇编名称。\r\n"," or writer is closed.\r\n\r\n-or-\r\n\r\nAn ":" 或作家关闭。\r\n\r\n-或者-\r\n\r\n一个\r\n","Gets or sets a value that indicates whether the instance uses camel case.":"获取或设置一个指示该实例是否使用骆驼盒的值。\r\n","Refreshes the state of the object.":"刷新对象的状态。\r\n","When overridden in a derived class, sorts the nodes selected by the XPath expression according to the specified ":"当在派生类中覆盖时，根据指定的XPath表达式选择的节点\r\n"," is always stored in Local. If ":" 总是存储在本地。如果\r\n","Gets the prefix associated with a namespace for this ":"获取与此名称空间相关联的前缀\r\n","Closes this stream and the underlying stream.":"关闭此流和基础流。\r\n"," is a generic interface, and ":" 是一个通用接口，\r\n"," class that can serialize objects of the specified type into XML documents, and deserialize an XML document into object of the specified type. It also specifies the class to use as the XML root element.":" 可以将指定类型的对象序列化为XML文档的类，并将XML文档列为指定类型的对象。它还指定类用作XML根元素。\r\n"," provides additional run-time arguments.":" 提供额外的运行时间参数。\r\n"," (allow or deny) as the specified rule, and then adds the specified rule.":" （允许或拒绝）作为指定规则，然后添加指定的规则。\r\n","Appends the string representation of a specified ":"附加指定的字符串表示\r\n"," object parameter is not derived from the ":" 对象参数不是从\r\n","When overridden in a derived class, resolves a function reference and returns an ":"当在派生类中覆盖时，请解决函数参考并返回\r\n",".  \r\n  \r\n -or-  \r\n  \r\n The field described by an element of ":"。\r\n  \r\n -或者-\r\n  \r\n 由一个元素描述的字段\r\n","Serializes the specified object and writes the XML document to a file using the specified ":"序列化指定的对象，并使用指定的对象将XML文档写入文件\r\n"," with default settings is used.  \r\n  \r\n If the ":" 使用默认设置。\r\n  \r\n 如果是\r\n","Gets the name of the Web service method member that is represented by this mapping.":"获取该映射表示的Web服务方法成员的名称。\r\n","Remove the duplicate namespace declarations while serializing.":"序列化时删除重复的名称空间声明。\r\n","When overridden in a derived class, returns a writer used to serialize the object.":"当在派生类中覆盖时，返回用来序列化对象的作者。\r\n","Gets the amount of data received from the network that is available to read.":"获取从网络接收到的数据量，可以阅读。\r\n","Obtains an ":"获得\r\n","Calculates the month in which a specified date occurs.":"计算指定日期的月份。\r\n","The encoding is not supported or the stream cannot be written to.":"不支持编码或无法写入流。\r\n","An attribute, such as ":"一个属性，例如\r\n","Returns a collection of elements that contains the descendant elements of every element and document in the source collection.":"返回包含源集合中每个元素和文档的后代元素的元素集合。\r\n","staticData":"staticdata\r\n","Writes out a comment <!--...--> containing the specified text.":"写一个评论<！--...-->包含指定的文本。\r\n","Attempts to send an Internet Control Message Protocol (ICMP) echo message with the specified data buffer to the computer that has the specified ":"尝试将带有指定数据缓冲区的Internet控制消息协议（ICMP）回声消息发送到已指定的计算机\r\n"," is positioned on is not the root node or an element node.":" 位于IS不是根节点或元素节点上。\r\n","Use keep-alives.":"使用饲养物。\r\n","When overridden in a derived class, gets the result type of the XPath expression.":"当在派生类中覆盖时，获取XPath表达式的结果类型。\r\n","Replaces the current node with the contents of the ":"用内容的内容代替当前节点\r\n","xsl:include":"XSL：包括\r\n","Gets or sets the level in a hierarchy of XML elements that the ":"在XML元素的层次结构中获取或设置级别\r\n","ENTITY type.":"实体类型。\r\n","Sets an event handler for receiving information about document type definition (DTD), XML-Data Reduced (XDR) schema, and XML Schema definition language (XSD) schema validation errors.":"设置一个事件处理程序，用于接收有关文档类型定义（DTD），XML-DATA减少（XDR）架构和XML模式定义语言（XSD）模式验证错误的信息。\r\n","Represents an XML element.  See XElement Class Overview and the Remarks section on this page for usage information and examples.":"代表XML元素。有关使用信息和示例，请参见Xlement类概述和此页面上的注释部分。\r\n","Pushes a 64-bit floating point number onto the stack.":"将64位浮点数推到堆栈上。\r\n","The style sheet cannot be found.":"找不到样式表。\r\n","IDREFS type.":"IDREFS类型。\r\n","Represents the XML type for the string. This allows the string to be read as a particular XML type, for example a CDATA section type.":"表示字符串的XML类型。这允许将字符串读取为特定的XML类型，例如CDATA部分类型。\r\n"," to Closed.":" 关闭。\r\n","A32: VMLS.I8 Dd, Dn, Dm":"A32：VMLS.I8 DD，DN，DM\r\n","The writer is closed or in error state.\r\n\r\n-or-\r\n\r\nAn ":"作者已关闭或处于错误状态。\r\n\r\n-或者-\r\n\r\n一个\r\n","Compares two nodes to determine their relative XML document order.":"比较两个节点以确定其相对XML文档顺序。\r\n","Gets the collection of header name/value pairs sent in the request.":"获取在请求中发送的标题名称/值对的集合。\r\n","The style sheet contains embedded script, and the caller does not have ":"样式表包含嵌入式脚本，呼叫者没有\r\n","Writes the object value.":"写对象值。\r\n"," class that is used to serialize the specified type. If a property or field returns an array, the ":" 用于序列化指定类型的类。如果属性或字段返回数组，则\r\n"," and initializes its underlying XML tree using the specified text reader, optionally preserving white space.":" 并使用指定的文本读取器来初始化其基础XML树，并选择保留空白。\r\n","Gets or sets the string that separates the components of time, that is, the hour, minutes, and seconds.":"获取或设置将时间组件分开的字符串，即小时，分钟和秒。\r\n","Specifies that the field is accessible only by the parent type.":"指定该字段仅通过父类型访问。\r\n","Stores an implementation of the ":"存储实施\r\n","Returns the name of the specified column.":"返回指定列的名称。\r\n",".  \r\n  \r\n -or-  \r\n  \r\n The property that ":"。\r\n  \r\n -或者-\r\n  \r\n 属性\r\n",". This ensures that incoming records that match existing records are updated instead of appended. When using ":"。这样可以确保更新现有记录的传入记录而不是附加记录。使用时\r\n"," class based on the specified byte array with the ":" 基于指定字节数组的类\r\n","Gets or sets a value that specifies whether to keep all namespace declarations when an object containing a member that returns an ":"获取或设置一个值指定是否保留所有名称空间声明的值\r\n","Gets or sets the key derivation function for the ":"获取或设置\r\n","A collection of assembly references.":"集合参考的集合。\r\n"," objects created from an array of ":" 从一个数组中创建的对象\r\n","The process was not started by this object.":"该对象没有启动该过程。\r\n"," that enables receiving all of the data from the source.":" 这使得从源中接收所有数据。\r\n","Locates the specified type from this assembly and creates an instance of it using the system activator, with optional case-sensitive search.":"从此组件中找到指定的类型，并使用系统激活器和可选的病例敏感搜索创建它的实例。\r\n"," class for deserialization of SOAP-encoded XML data types that map to collections or enumerations.":" 用于对SOAP编码的XML数据类型进行映射到收集或枚举的类。\r\n","Represents a writer that provides a fast, non-cached, forward-only way to generate streams or files that contain XML data.":"代表一个作者，该作者提供了一种快速，非空缺，仅远前的方式来生成包含XML数据的流或文件。\r\n"," for an invalid enumeration value.":"对于无效的枚举值。\r\n","Returns a hash code based on the value of a node.":"根据节点的值返回哈希代码。\r\n","Writes the XML declaration with the version \"1.0\".":"用版本“ 1.0”来写XML声明。\r\n","Places mappings for a type in the ":"将类型的映射放在\r\n","Generates a mapping to an XML Schema element for a .NET type, using the specified type, attribute, and namespace.":"使用指定的类型，属性和名称空间生成.NET类型的XML模式元素的映射。\r\n","Gets the XML local name of the XML node being deserialized.":"获取XML节点的XML本地名称，该名称被序列化。\r\n","When overridden in a derived class, writes raw markup manually from a string.":"在派生的班级中覆盖时，请从字符串中手动写下原始标记。\r\n"," and allows the overriding of events that occur during deserialization.":" 并允许在避难化过程中发生的事件的压倒一切。\r\n","Edits the component and returns a value indicating whether the component was modified based upon a given context.":"编辑组件并返回一个值，该值指示是否根据给定上下文修改了组件。\r\n","Selects all the child nodes of the current node that have the local name and namespace URI specified.":"选择具有本地名称和名称空间URI的当前节点的所有子节点。\r\n","Gets the encoding attribute for the document.":"获取文档的编码属性。\r\n"," serializes a class as an XML root element.":" 将类序列化为XML根元素。\r\n"," and returns the typed result.":" 并返回打字结果。\r\n","Adds a new object to the ":"在\r\n","Initializes an instance of a ":"初始化一个实例\r\n","Represents a reader that provides document type definition (DTD), XML-Data Reduced (XDR) schema, and XML Schema definition language (XSD) validation.  \r\n  \r\n This class is obsolete. Starting with the .NET Framework 2.0, we recommend that you use the ":"代表一个提供文档类型定义（DTD），XML-DATA减少（XDR）架构和XML模式定义语言（XSD）验证的读者。\r\n  \r\n 这个课程已过时。从.NET Framework 2.0开始，我们建议您使用\r\n","Represents the exception that is thrown when incorrectly trying to create or access a relation.":"代表错误地尝试创建或访问关系时抛出的例外。\r\n","Adds a Range header to a request for a specific range from the beginning or end of the requested data.":"从请求数据的开头或结尾添加范围标题为特定范围的请求。\r\n","Encapsulates the current execution context of the Extensible Stylesheet Language for Transformations (XSLT) processor allowing XML Path Language (XPath) to resolve functions, parameters, and namespaces within XPath expressions.":"封装了用于转换的扩展样式语言（XSLT）处理器的当前执行上下文，允许XML Path Language（XPATH）解决XPath Expressions中的函数，参数和名称空间。\r\n","Removes every attribute in the source collection from its parent element.":"从其父元素中删除源集合中的每个属性。\r\n","Stores element and attribute names in a ":"存储元素和属性名称\r\n","Asynchronously writes out an entity reference as ":"异步将实体参考写为\r\n"," class using an object that maps one type to another.":" 使用将一种类型映射到另一种类型的对象的类。\r\n","Writes this XDocument's underlying XML tree to the specified ":"将此Xdocument的基础XML树写入指定的\r\n","Executes the transform using the input document specified by the URI and outputs the results to stream. The ":"使用URI指定的输入文档执行转换，并输出结果流。这\r\n","Gets or sets a value that specifies how the reader handles entities.":"获取或设置一个指定读者如何处理实体的值。\r\n","Provides mappings between code entities in .NET Web service methods and the content of Web Services Description Language (WSDL) messages that are defined for SOAP Web services.":"提供.NET Web服务方法中的代码实体与Web服务说明语言（WSDL）消息的内容之间提供映射，这些消息是为SOAP Web服务定义的。\r\n"," as an encoded SOAP XML element.":" 作为编码的SOAP XML元素。\r\n","Returns a collection of the ancestor elements of this node.":"返回该节点的祖先元素的集合。\r\n","Serialize this element to a file, optionally disabling formatting.":"将此元素序列化为文件，可选地禁用格式。\r\n",".NET Core and .NET 5+ only: In all cases.":".NET CORE和.NET 5+：在所有情况下。\r\n","Searches the set for a given value and returns the equal value it finds, if any.":"搜索设置以获取给定值，并返回其找到的相等值（如果有）。\r\n"," Preserve":" 保存\r\n","Returns a collection of the child nodes of every document and element in the source collection.":"返回源集合中每个文档和元素的子节点的集合。\r\n","Gets or sets the default value of an XML element or attribute.":"获取或设置XML元素或属性的默认值。\r\n","The text would result in a non-well formed XML document.  \r\n  \r\n ":"该文本将导致非井形形成的XML文档。\r\n  \r\n \r\n","sampleObject(100)":"样品对象（100）\r\n","The ICMP echo request failed because there is no valid route between the source and destination computers.":"ICMP ECHO请求失败了，因为源计算机和目标计算机之间没有有效的途径。\r\n","Serialize this element to a file.":"将此元素序列化为文件。\r\n","Write this element to an ":"将此元素写入\r\n","Gets or sets a value indicating whether to normalize white space and attribute values.":"获取或设置一个值，以指示是否标准化空白和属性值。\r\n","Gets or sets an object that allows you to distinguish between a set of choices.":"获取或设置一个允许您区分一组选择的对象。\r\n","Gets a pointer to the byte at the current position of the reader.":"在读者的当前位置上获取指向字节的指针。\r\n"," module contains constants used as control characters. These constants can be used anywhere in your code.":"模块包含用作控制字符的常数。这些常数可以在您的代码中的任何地方使用。\r\n",", optionally preserving white space, setting the base URI, and retaining line information.":"，可选地保留空白，设置基本URI并保留线路信息。\r\n","Returns the remainder resulting from dividing two specified ":"返回剩余的，由两个指定的\r\n","Gets the Superscripts and Subscripts Unicode block (U+2070-U+209F).":"获取上标和下标Unicode块（U+2070-U+209F）。\r\n","This is not the first write method called after the constructor.":"这不是构造函数之后的第一个写入方法。\r\n",". Each object to be serialized can itself contain instances of classes, which this overload overrides with other classes. This overload also specifies the default namespace for all the XML elements and the class to use as the XML root element.":"。每个要序列化的对象本身都包含类的实例，该超负荷与其他类覆盖。此过载还指定了所有XML元素的默认名称空间，将类用作XML root Element的类。\r\n"," class using the specified exception message and ":" 使用指定的异常消息和\r\n","Gets an enumerator to enumerate the values in the JSON array represented by this JsonElement.":"获取枚举者来枚举以此JSONELEMENT表示的JSON数组中的值。\r\n","Allows you to override property, field, and class attributes when you use the ":"当您使用该属性时，您可以覆盖属性，字段和类属性\r\n"," method is used to write valid XML.":" 方法用于编写有效的XML。\r\n"," is not one of the node types listed in the table below.":" 不是下表中列出的节点类型之一。\r\n","Includes mappings for a type for later use when import methods are invoked.":"包括用于调用导入方法时的类型映射。\r\n"," value from the current stream and advances the current position of the stream by one byte.":" 从当前流的值，并通过一个字节提高流的当前位置。\r\n","Called by servers to begin an asynchronous operation to authenticate the client, and optionally the server, in a client-server connection. The authentication process uses the specified server credentials and authentication options. This method does not block.":"由服务器调用以开始异步操作，以在客户端服务器连接中对客户端进行身份验证和服务器。身份验证过程使用指定的服务器凭据和身份验证选项。此方法不会阻止。\r\n","A64: SSRA Vd.8B, Vn.8B, #n":"A64：SSRA VD.8B，VN.8B，＃N\r\n","Converts the specified Boolean value to the equivalent 32-bit signed integer.":"将指定的布尔值转换为等效的32位签名整数。\r\n"," objects defined in ":" 定义的对象\r\n"," conforms to the XML Schema definition language (XSD) schema provided.":" 符合XML模式定义语言（XSD）架构。\r\n"," is not provided, or the prefix cannot be found in the supplied ":" 未提供，或者在提供的前缀中找不到\r\n","Deserializes an object from an XML element in a SOAP message that contains a reference to a ":"从SOAP消息中的XML元素中对象进行对象，该对象包含对A的引用\r\n","All namespaces that are defined locally at the current node.":"所有在当前节点上本地定义的名称空间。\r\n","This method validates that an ":"此方法证明了\r\n","The filename is ":"文件名是\r\n","Retrieves a substring of text elements from the current ":"从当前检索文本元素的子字符串\r\n","Gets or sets the XML Schema definition language (XSD) data type of the SOAP attribute generated by the ":"获取或设置XML模式定义语言（XSD）数据类型\r\n","Used by the GetSchema method to create the IsBestMatch column in the DataTypes collection.":"由GetChema方法使用来创建数据类型集合中的ISBESTMATCH列。\r\n","Asynchronously writes out the namespace-qualified name. This method looks up the prefix that is in scope for the given namespace.":"异步写出名称空间合格的名称。此方法查找给定名称空间范围的前缀。\r\n"," to the specified writer.":" 给指定的作者。\r\n","Produces a ":"产生a\r\n"," can deserialize a specified XML document.":" 可以对指定的XML文档进行挑选。\r\n"," to the child node with the local name and namespace URI specified.":" 到指定本地名称和名称空间URI的子节点。\r\n","Represents the TLS_DH_anon_WITH_CAMELLIA_256_CBC_SHA cipher suite.":"代表TLS_DH_ANON_WITH_CAMELLIA_256_CBC_SHA CIPHER SUITE。\r\n","Gets the XML document object into which the XML document is being deserialized.":"获取XML文档对象的XML文档被估算的。\r\n","Gets or sets a value that determines whether a property's name uses a case-insensitive comparison during deserialization. The default value is ":"获取或设置一个值，该值确定属性的名称是否在避难化过程中使用不敏感的比较。默认值是\r\n","Creates a new child node at the beginning of the list of child nodes of the current node using the XML contents of the ":"使用XML内容的XML内容在当前节点的子节点列表的开头创建一个新的子节点\r\n","Asynchronously flushes whatever is in the buffer to the underlying streams and also flushes the underlying stream.":"异步将缓冲区中的任何东西冲向下面的流，还冲洗了下面的流。\r\n"," class that can serialize objects of the specified type into XML documents, and deserialize XML documents into object of a specified type. If a property or field returns an array, the ":" 可以将指定类型的对象序列化为XML文档的类，并将XML文档置于指定类型的对象中。如果属性或字段返回数组，则\r\n","Searches for the specified method whose parameters match the specified generic parameter count, argument types and modifiers, using the specified binding constraints.":"搜索使用指定的绑定约束，其参数匹配其参数匹配指定的通用参数计数，参数类型和修饰符。\r\n"," that is already an attribute of another ":" 那已经是另一个的属性\r\n","Gets the node type for this node.":"获取此节点的节点类型。\r\n"," is greater than the logical address space.":" 大于逻辑地址空间。\r\n"," of the current node without any namespace prefix.":" 当前节点没有任何名称空间前缀。\r\n"," encounters an XML element of unknown type during deserialization.":"在避难所化过程中遇到未知类型的XML元素。\r\n"," is not valid name value with parameter header value information.":"与参数标头值信息无效的名称值。\r\n","Asynchronously writes out the specified name, ensuring it is a valid NmToken according to the W3C XML 1.0 recommendation (https://www.w3.org/TR/1998/REC-xml-19980210#NT-Name).":"异步写出指定名称，确保根据W3C XML 1.0推荐是有效的NMToken（https://www.org/tr/1998/rec-xml-19980210#nt-name）。\r\n","The JSON token value cannot be read as a ":"JSON令牌值不能读为\r\n"," and makes it available via properties on ":" 并通过属性上的属性提供\r\n","Returns the smaller of two 16-bit unsigned integers.":"返回两个16位未签名的整数中的较小。\r\n"," object that compares strings according to the rules of a specified culture and string options.":" 根据指定文化和字符串选项的规则比较字符串的对象。\r\n","Represents a collection that can contain many different types of permissions.":"表示可以包含许多不同类型的权限的集合。\r\n"," that is the specified number of years away from the specified ":" 那是距指定的年数的指定数年\r\n","Searches for the last occurrence of a ":"搜索最后一次\r\n"," has the same name as an entry from the same archive that's already been extracted.":" 与已经提取的同一存档的条目具有相同的名称。\r\n"," XML elements in a SOAP message.":" SOAP消息中的XML元素。\r\n","Makes the ":"制作\r\n","Gets the value of the XML node at which the ":"获取XML节点的值\r\n","Asynchronously writes out the given white space.":"异步写出给定的空白。\r\n","Returns a value that indicates whether all elements in the first vector are greater than or equal to all the corresponding elements in the second vector.":"返回一个值，该值指示第一个向量中的所有元素是否大于或等于第二个向量中的所有相应元素。\r\n","Asynchronously writes out all the attributes found at the current position in the ":"异步写出在当前位置发现的所有属性\r\n","Specifies that the certificate trust list (CTL) is not valid for this use.":"指定证书信任列表（CTL）对于此用途无效。\r\n","The underlying stream is null or closed.":"基础流为空或封闭。\r\n",", with an option to read the inner element.":"，有一个读取内部元素的选项。\r\n"," to serialize or deserialize an object as encoded SOAP.":" 序列化或应对对象的编码肥皂。\r\n","The return type of the XPath expression is a node set.":"XPath表达式的返回类型是节点集。\r\n","Splits a string into a maximum number of substrings based on specified delimiting characters and, optionally, options.":"根据指定的划界字符和选项将字符串分配到最大数量的子字符串中。\r\n","Evaluates the specified XPath expression and returns the typed result.":"评估指定的XPATH表达式并返回键入结果。\r\n","Gets the value at the specified position in the one-dimensional ":"在一维中的指定位置获取值\r\n","<any>":"<any>\r\n","Returns a collection of the child elements of every element and document in the source collection.":"返回源集合中每个元素和文档的子元素的集合。\r\n","Returns all namespaces that are defined locally at the current node.":"返回当前节点本地定义的所有名称空间。\r\n","Generates internal type mappings for information from a Web service method.":"生成内部类型映射以获取Web服务方法的信息。\r\n","Gets the current node's value as a ":"获取当前节点的值\r\n","Gets a collection of schemas that belong to the same namespace.":"获取属于同一名称空间的模式集合。\r\n","Selects a single node in the ":"在\r\n"," class that is empty, has the default initial capacity, and is sorted according to the specified ":" 为空的类，具有默认的初始容量，并根据指定的\r\n",", are valid.":"，有效。\r\n","Gets the file pointer to the COFF symbol table.":"获取文件指针到Coff符号表。\r\n","Enables data binding.":"启用数据绑定。\r\n","NMTOKEN type.":"nmtoken类型。\r\n","Gets or sets a value that indicates whether the .NET type maps to an XML element or attribute of any type.":"获取或设置一个指示.NET类型映射到XML元素还是任何类型的属性的值。\r\n","Converts a value to a 16-bit signed integer.":"将值转换为16位签名的整数。\r\n","The text content of a node. Equivalent to the Document Object Model (DOM) Text and CDATA node types. Contains at least one character.":"节点的文本内容。等效于文档对象模型（DOM）文本和CDATA节点类型。至少包含一个字符。\r\n","The string ":"字符串\r\n"," None":" 没有任何\r\n","Used by ":"使用\r\n"," array to the collection, starting at a specified target index.":" 从指定的目标索引开始到该集合的数组。\r\n"," is an empty string  \r\n  \r\n -or-  \r\n  \r\n ":" 是一个空字符串\r\n  \r\n -或者-\r\n  \r\n \r\n","Asynchronously writes out a comment <!--...--> containing the specified text.":"异步写出评论<！--...->包含指定文本。\r\n","When overridden in a derived class, returns the item's value as the type specified using the ":"当在派生类中覆盖时，将项目的值作为使用该项目的值返回\r\n","Gets a collection of groups matched by the regular expression.":"获取与正则表达式匹配的组集合。\r\n","The last node to delete specified is not a valid sibling node of the current node.":"指定删除的最后一个节点不是当前节点的有效兄弟姐妹节点。\r\n","Indicates the position of the catalog name in a qualified table name in a text command.":"在文本命令中指示目录名称在合格的表名中的位置。\r\n"," class with the specified exception message.":" 具有指定异常消息的类。\r\n","Gets the numeric value of the intermediate language (IL) instruction.":"获取中间语言（IL）指令的数值。\r\n","Terminates an advisory connection previously established through the ":"终止以前通过\r\n","Returns an XML qualified name, with invalid characters replaced by escape sequences.":"返回XML合格的名称，无效的字符被Escape序列取代。\r\n"," provides additional run-time arguments and the XmlResolver resolves the XSLT ":" 提供额外的运行时间参数，XMLResolver可以解决XSLT\r\n",". (Get or set.)":"。 （获取或设置。）\r\n","Writes the text representation of the specified Boolean value to the standard output stream.":"将指定布尔值的文本表示形式写入标准输出流。\r\n","Signifies that the code was generated by the serialization infrastructure and can be reused for increased performance, when this attribute is applied to an assembly.":"表示该代码是由序列化基础架构生成的，并且当将此属性应用于程序集时，可以重复使用以提高性能。\r\n"," value which is the result of division of this instance and the specified ":" 值是该实例的划分和指定的结果\r\n","Writes a SOAP 1.2 RPC result element with a specified qualified name in its body.":"写下SOAP 1.2 RPC结果元素，其身体中有指定的合格名称。\r\n","Gets or sets a value that determines whether XML strings are translated into valid .NET type names.":"获取或设置一个确定XML字符串是否转化为有效的.NET类型名称的值。\r\n"," object to write an XML attribute that has no namespace specified for its name.":" 对象编写没有指定名称的名称空间的XML属性。\r\n"," already has an extension object associated with it.":" 已经有一个与之关联的扩展对象。\r\n","Returns a filtered collection of the ancestor elements of this node. Only elements that have a matching ":"返回该节点的祖先元素的过滤集合。只有匹配的元素\r\n","Asynchronously writes raw markup manually from a string.":"异步从字符串手动写下原始标记。\r\n","The object ":"物体\r\n","When overridden in a derived class, gets an ":"当在派生的班级中覆盖时，\r\n"," will add closing tags to all unclosed element tags when the ":"当\r\n"," XML element.":" XML元素。\r\n","References the specified object, which makes it ineligible for garbage collection from the start of the current routine to the point where this method is called.":"引用指定的对象，从当前例程的开头到调用此方法的点，这使其不符合垃圾集合的资格。\r\n"," for a SOAP 1.1 return value.":" 对于SOAP 1.1返回值。\r\n","When overridden in a derived class, decodes a sequence of bytes from the specified byte array into a set of characters.":"当在派生类中覆盖时，将指定字节数组的字节序列解码为一组字符。\r\n","Setting this property when the reader is closed (":"关闭读者时设置此属性（\r\n"," is not positioned on an element, text, processing instruction, or comment node.":" 不在元素，文本，处理指令或注释节点上。\r\n"," is positioned on the root node, a namespace node, or the specified value is invalid.":" 位于根节点，名称空间节点或指定值无效。\r\n","Loads an assembly given its ":"给定装置加载\r\n","document()":"文档（）\r\n","Returns a collection of the child nodes of this element or document, in document order.":"根据文档顺序返回该元素或文档的子节点的集合。\r\n","Provides an interface to a given function defined in the Extensible Stylesheet Language for Transformations (XSLT) style sheet during runtime execution.":"在运行时执行期间，在“可扩展样式”语言中定义的给定函数（XSLT）样式表的给定函数提供了一个接口。\r\n","Indicates that the property supports the COM ":"表示该物业支持com\r\n"," as a stream.":" 作为流。\r\n","Searches for an element that matches the conditions defined by the specified predicate, and returns the first occurrence within the entire immutable list.":"搜索与指定谓词定义的条件匹配的元素，并返回整个不可变列表中的第一次出现。\r\n","#xD":"#xd\r\n","Gets a value that indicates whether the schemas have been compiled.":"获取一个指示模式是否已编译的值。\r\n","Generates a mapping to an XML Schema element for a .NET type, using the specified type and namespace.":"使用指定的类型和名称空间生成.NET类型的XML模式元素的映射。\r\n","Provides an accessor to the ":"提供了\r\n","Gets the friendly name that is displayed by the UI prompt.":"获取UI提示符显示的友好名称。\r\n"," class for the given code identifiers, with the given type-sharing option.":" 给定代码标识符的类，带有给定的类型共享选项。\r\n","Gets or sets the object that contains other objects whose values get filled in by the callback implementation.":"获取或设置包含其他对象的对象，其值通过回调实现填充其值。\r\n","Loads the element containing an object reference at a specified array index onto the top of the evaluation stack as type ":"将包含对象引用的元素加载在指定数组索引上\r\n","Determines whether an XML attribute name indicates an XML namespace.":"确定XML属性名称是否指示XML名称空间。\r\n","Loads the XSLT style sheet specified by a URL.":"加载由URL指定的XSLT样式表。\r\n","Thrown for XML Schema Definition Language (XSD) validation errors.":"为XML模式定义语言（XSD）验证错误。\r\n"," to set its ":" 设置它的\r\n","A comment, such as ":"评论，例如\r\n"," to the previous sibling node of the current node.":" 到当前节点的先前兄弟姐妹节点。\r\n","Asynchronously writes out the attribute with the specified prefix, local name, namespace URI, and value.":"异步用指定的前缀，本地名称，名称空间URI和值写出属性。\r\n"," information for the current node.":" 当前节点的信息。\r\n"," objects created from an array of types.":" 由类型数组创建的对象。\r\n","Indicates how the output is formatted.":"指示输出格式的格式。\r\n"," property minus one or is negative.":" 财产减去一个或负数。\r\n"," that represents a bitwise left-shift assignment operation.":" 这代表了一个位左移分配操作。\r\n","When overridden in a derived class, gets the item's value as a ":"当在派生类中覆盖时，将项目的值作为一个\r\n","Generates explicitly ordered serialization code as specified through the ":"生成通过\r\n"," for each of the element parts of a literal SOAP message definition, and specifies whether enclosing elements are included.":" 对于文字肥皂消息定义的每个元素部分，并指定是否包括包含元素。\r\n","Generates internal type mapping information for a single, (SOAP) literal element part defined in a WSDL document.":"为WSDL文档中定义的单个（SOAP）字面元素部分生成内部类型映射信息。\r\n","Gets or sets the XML data type of the generated XML element.":"获取或设置生成的XML元素的XML数据类型。\r\n","When overridden in a derived class, gets a value indicating whether the current encoding can be used by mail and news clients for displaying content.":"当在派生类中覆盖时，获得一个值，指示邮件和新闻客户端是否可以使用当前编码来显示内容。\r\n","An error occurred during deserialization. The original exception is available using the ":"避难化期间发生了错误。原始例外可用于使用\r\n","VCVTDQ2PD ymm, xmm/m128":"VCVTDQ2PD YMM，XMM/M128\r\n",", optionally specifying formatting behavior.":"，可选地指定格式行为。\r\n"," is positioned on a node that cannot be deleted such as the root node or a namespace node.":" 位于无法删除的节点上，例如root节点或名称空间节点。\r\n","Encapsulates a method that has no parameters and returns a value of the type specified by the ":"封装一个没有参数的方法，并返回\r\n",", constrained to ":"，被约束\r\n","Date and time data with time zone awareness. Date value range is from January 1,1 AD through December 31, 9999 AD. Time value range is 00:00:00 through 23:59:59.9999999 with an accuracy of 100 nanoseconds. Time zone value range is -14:00 through +14:00.":"日期和时间数据带有时区意识。日期价值范围是从1月1日的公元到公元9999年12月31日。时间值范围是00:00:00至23：59：59.999999，精度为100纳秒。时区值范围为-14：00至+14：00。\r\n","When overridden in a derived class, writes text one buffer at a time.":"当在派生的班级中覆盖时，一次写一个缓冲区。\r\n"," objects to initialize a new instance of the ":" 对象初始化的新实例\r\n","Represents nullability information.":"表示无效信息。\r\n","The attribute does not contain a valid ":"该属性不包含有效的\r\n"," affects.":" 影响。\r\n"," derivation.":" 推导。\r\n"," that indicates that an object being deserialized cannot be instantiated because the constructor throws a security exception.":" 这表明无法实例化的对象无法实例化，因为构造函数会引发安全性异常。\r\n"," for more efficient serialization.":" 为了更有效的序列化。\r\n"," contains a specific schema.":" 包含特定的模式。\r\n","The XML data string parameter is ":"XML数据字符串参数为\r\n"," object that adds a specified number of years to the value of this instance.":" 将指定年数添加到此实例的值的对象。\r\n"," does not reference the start of a valid scalar value in ":" 不参考有效标量值的开始\r\n","Adds the specified content as children to this ":"将指定的内容添加到孩子\r\n","Stores an object that is being deserialized from a SOAP-encoded ":"存储一个从肥皂编码的物体进行的对象\r\n"," items without further expansion of its backing storage.":" 项目没有进一步扩展其备用存储。\r\n","IPv6 Encapsulating Security Payload header.":"IPv6封装安全有效负载标头。\r\n","Determines whether the input name conflicts with another name within the ":"确定输入名称是否冲突与其他名称\r\n","Gets or sets the internal subset for this Document Type Definition (DTD).":"获取或设置此文档类型定义（DTD）的内部子集。\r\n","Represents the builder of a Portable PDB image.":"代表便携式PDB图像的构建器。\r\n","Allows you to obtain the line number in the source file at which the method is called.":"允许您在调用该方法的源文件中获取行号。\r\n",", you do not require a remote host connection before sending and receiving data. With ":"，在发送和接收数据之前，您不需要远程主机连接。和\r\n","Asynchronously creates a new ":"异步创建一个新的\r\n"," delegate instance, plus the method's inputs; also serves as the parameter for the method.":" 委托实例，加上方法的输入；还用作该方法的参数。\r\n","Gets the type referenced by the specified type handle.":"获取指定类型句柄引用的类型。\r\n","Gets the previous sibling node of this node.":"获取此节点的先前兄弟姐妹节点。\r\n","Returns a new string in which a specified string is inserted at a specified index position in this instance.":"返回一个新的字符串，其中指定的字符串在本例中指定的索引位置插入。\r\n","Gets or sets the background color of the console.":"获取或设置控制台的背景颜色。\r\n","Gets or sets the XML declaration for this document.":"获取或设置此文档的XML声明。\r\n"," class given the constructor for the custom attribute, the arguments to the constructor, a set of named property or value pairs, and a set of named field or value pairs.":" 给定自定义属性的构造函数，构造函数的参数，一组命名属性或值对以及一组命名字段或值对。\r\n","The cryptographic service provider cannot be found.  \r\n  \r\n -or-  \r\n  \r\n The key container was not found.":"无法找到加密服务提供商。\r\n  \r\n -或者-\r\n  \r\n 找不到关键容器。\r\n","Remove authorization rules that contain the same SID as the specified authorization rule from the ACL, and then add the specified authorization rule to the ACL.":"删除包含与ACL指定授权规则相同的SID的授权规则，然后将指定的授权规则添加到ACL。\r\n"," to the next namespace node matching the ":" 到匹配的下一个名称空间节点\r\n","Gets or sets a value indicating whether to enable support for embedded script blocks.":"获取或设置一个值，指示是否启用嵌入式脚本块的支持。\r\n"," points to, respecting the values of ":" 指向，尊重\r\n","The text string contains an invalid surrogate pair.":"文本字符串包含无效的替代对。\r\n"," object from a ":" 来自a的对象\r\n","Returns a collection of nodes that contains all nodes in the source collection, sorted in document order.":"返回一个节点集合，该节点包含源集合中的所有节点，并按文档顺序排序。\r\n","Gets the object associated with the given namespace.":"获取与给定名称空间关联的对象。\r\n","Places mappings for derived types in the ":"将派生类型的映射放在\r\n","Indicates that the first week of the year begins on the first occurrence of the designated first day of the week on or after the first day of the year. The value is 1.":"表明一年中的第一周是在一年中或之后的一周中或之后的第一天开始的第一天开始。值为1。\r\n","Replaces a range of sibling nodes from the current node to the node specified.":"从当前节点替换一系列兄弟节点到指定的节点。\r\n","Asynchronously writes the start of an attribute with the specified prefix, local name, and namespace URI.":"异步地写入指定的前缀，本地名称和名称空间URI的属性开始。\r\n","Provides configuration and statistical information for a network interface.":"为网络接口提供配置和统计信息。\r\n","Contains a mapping of one type to another.":"包含一种类型的映射到另一种类型。\r\n","Represents an XML attribute.":"代表XML属性。\r\n"," class for deserialization of types from SOAP-encoded, non-root XML data.":" 从SOAP编码的非Root XML数据中进行类型的类型的类别。\r\n","Executes the transform using the input document specified by the URI and outputs the results to a ":"使用URI指定的输入文档执行转换，并将结果输出到\r\n","Gets or sets a value that indicates whether to include the type in SOAP-encoded XML Schema documents.":"获取或设置一个值，该值指示是否在SOAP编码的XML模式文档中包含类型。\r\n","The type of the eighth parameter of the method that this delegate encapsulates.":"该委托封装的方法的第八参数的类型。\r\n","Asynchronously writes out a processing instruction with a space between the name and text as follows: <?name text?>.":"异步写出一个处理指令，其名称和文本之间的空间如下：<？name text？>。\r\n","Read methods are generated.":"读取方法是生成的。\r\n"," class using the specified custom type.":" 使用指定的自定义类型的类。\r\n"," to the parent node of the current node.":" 到当前节点的父节点。\r\n","Gets or sets the assembly's version number.":"获取或设置汇编的版本号。\r\n","Populates ":"人口稠密\r\n","Gets the ID of the object.":"获取对象的ID。\r\n","Closes the current method.":"关闭当前方法。\r\n"," that indicates that a value for an XML element does not match an enumeration type.":" 这表明XML元素的值与枚举类型不匹配。\r\n","The current type is not an enumeration.":"当前类型不是枚举。\r\n"," data source.":" 数据源。\r\n","null=\"true\"":"null =“ true”\r\n","Represents an item in the XQuery 1.0 and XPath 2.0 Data Model.":"代表XQUERY 1.0和XPATH 2.0数据模型中的项目。\r\n"," to which you want to output.  \r\n  \r\n If the style sheet contains an ":" 您要输出。\r\n  \r\n 如果样式表包含\r\n","Writes this processing instruction to an ":"将此处理指令写给\r\n","Gets a comparer that can compare the relative position of two nodes.":"获取可以比较两个节点的相对位置的比较。\r\n","Creates a new child node at the end of the list of child nodes of the current node using the nodes in the ":"在当前节点的子节点列表的末尾创建一个新的子节点\r\n","Returns a value that indicates whether the entity (user) represented by this claims principal is in the specified role.":"返回一个值，该值指示该索赔代表的实体（用户）是否在指定角色中。\r\n"," represents a Web service method return value, as opposed to an output parameter.":" 代表Web服务方法返回值，而不是输出参数。\r\n","Equivalent to HTTP status 413. ":"等效于HTTP状态413。\r\n","Instructs an ":"指示一个\r\n"," object to a string representation.":" 目的对字符串表示。\r\n","Gets the number of objects in the collection.":"获取集合中的对象数。\r\n","Gets or sets the type of the Web service method member code entity that is represented by this mapping.":"获取或设置该映射表示的Web服务方法成员代码实体的类型。\r\n"," implementations for the     public and private keys of a ":" 用于公共和私人钥匙的实施\r\n"," parameter specifies the base class member that is overridden.":" 参数指定被覆盖的基类成员。\r\n"," object generation by Visual Studio and the XSD.exe .NET Framework tool. This method is not intended to be used directly from your code.":" 通过Visual Studio和XSD.EXE .NET框架工具生成对象。此方法不打算直接从您的代码中使用。\r\n","Tracks the maximum defined ACE type in the enumeration.":"跟踪枚举中最大定义的ACE类型。\r\n"," serializes and deserializes SOAP methods.":" 序列化和应对肥皂方法。\r\n"," and outputs the result to a ":" 并将结果输出到\r\n","Contains HTTP proxy settings for the ":"包含HTTP代理设置\r\n","Converts the value of the specified double-precision floating-point number to an equivalent 16-bit unsigned integer.":"将指定的双精度浮点数的值转换为等效的16位未签名整数。\r\n","Default credentials are not supported for file Uniform Resource Identifiers (URIs).":"对于文件统一资源标识符（URI），不支持默认凭据。\r\n"," how to serialize an object type into encoded SOAP XML.":" 如何将对象类型序列化为编码的SOAP XML。\r\n","Compiles the style sheet contained in the ":"编译包含的样式表\r\n"," property was set to a value other than the ":" 属性设置为除了\r\n"," element to the ":" 元素\r\n"," attribute class for the specified supported OS platform.":" 指定支持的OS平台的属性类。\r\n",", and the user has canceled the operation or an unspecified I/O error occurs.":"，用户已取消操作或未指定的I/O错误。\r\n"," function and embedded script blocks is disabled.":" 功能和嵌入式脚本块被禁用。\r\n","Gets the deserialized, but unreferenced, object.":"获取避难所，但没有引用的对象。\r\n"," structure is no longer needed.":" 不再需要结构。\r\n","Creates a new  object that is a copy of the current instance.":"创建一个新对象，该对象是当前实例的副本。\r\n"," delegate and its input data for a later invocation.":" 委托及其输入数据以进行以后的调用。\r\n"," instance by using the specified stream.":" 实例使用指定的流。\r\n","Converts a string formatted as an expanded XML name (that is,":"将格式为扩展的XML名称转换为\r\n","Represents a selection that occurs when the user releases the mouse button immediately after a component has been selected. If the newly selected component is already selected, it is promoted to be the primary selected component rather than being canceled.":"表示选择组件后立即释放鼠标按钮时发生的选择。如果已经选择了新选择的组件，则将其晋升为主要选定组件，而不是被取消。\r\n"," and references the specified namespaces and encoding style.":" 并引用指定的名称空间和编码样式。\r\n","Returns a collection of the sibling elements before this node, in document order.":"按照文档顺序，在此节点之前返回同级元素的集合。\r\n","Represents the universal class tag for a ":"代表一个通用类标签\r\n"," that indicates that a SOAP-encoded collection type cannot be modified and its values cannot be filled in.":" 这表明无法修改SOAP编码的收集类型，并且无法填充其值。\r\n","Specifies various options to use when generating .NET types for use with an XML Web Service.":"指定在生成.NET类型时要使用的各种选项，以与XML Web服务一起使用。\r\n","Produces a base-64 byte array from an input string.":"从输入字符串产生基本64字节数组。\r\n"," class for the specified file on the specified path, using the specified encoding and buffer size. If the file exists, it can be either overwritten or appended to. If the file does not exist, this constructor creates a new file.":" 使用指定的编码和缓冲区大小的指定路径上指定文件的类。如果文件存在，则可以被覆盖或附加到。如果该文件不存在，则该构造函数将创建一个新文件。\r\n","A tree fragment.":"树碎片。\r\n","Creates a new sibling node before the currently selected node using the XML contents of the ":"在当前选择的节点使用XML内容之前创建一个新的兄弟节点\r\n","Gets the index of the last node in the selected set of nodes.":"获取所选节点集中最后一个节点的索引。\r\n"," object that corresponds to no namespace.":" 对应于没有名称空间的对象。\r\n","Contains the list of possible WebSocket errors.":"包含可能的Websocket错误列表。\r\n","Gets a value that indicates whether the column at the specified index contains a null value.":"获取一个指示指定索引处的列是否包含null值的值。\r\n","Creates a new instance of the specified type defined in the specified assembly.":"创建指定组件中定义的指定类型的新实例。\r\n","The input document cannot be found.":"找不到输入文档。\r\n"," serializes items inserted into an array returned by a public field or read/write property.":" 序列化插入公共字段返回或读/写属性的数组中的项目。\r\n","Serializes objects into SOAP-encoded ":"将对象序列化为肥皂编码\r\n","Indicates Thursday.":"指示星期四。\r\n","Contains the LINQ to XML extension methods.":"包含LINQ到XML扩展方法。\r\n","Gets the name of the computer the associated process is running on.":"获取关联过程正在运行的计算机名称。\r\n"," column names.":" 列名。\r\n","Gets the hash code for the URI.":"获取URI的哈希代码。\r\n","Asynchronously writes raw markup manually from a character buffer.":"异步从角色缓冲区手动写下原始标记。\r\n","The fully qualified type name that includes the namespace (or namespaces) and type.":"完全合格的类型名称，其中包括名称空间（或名称空间）和类型。\r\n","Destroys the specified component and removes it from the designer container.":"破坏指定的组件并将其从设计器容器中删除。\r\n"," is not a valid name according to the W3C XML specification.  \r\n  \r\n The ":" 根据W3C XML规范不是有效名称。\r\n  \r\n 这\r\n","Notify if the delivery is successful.":"通知交货是否成功。\r\n","Gets or sets a value indicating the type of validation to perform.":"获取或设置一个指示要执行的验证类型的值。\r\n"," specified, using the ":" 指定，使用\r\n","Writes an XML attribute where the namespace prefix is provided manually.":"写一个XML属性，其中手动提供名称空间前缀。\r\n"," class with the specified format provider.":" 具有指定格式提供商的类。\r\n","Writes out the specified name, ensuring it is a valid name according to the W3C XML 1.0 recommendation.":"写出指定的名称，确保根据W3C XML 1.0建议是有效名称。\r\n","Represents an XML processing instruction.":"代表XML处理指令。\r\n","Gets the place in the line where the unknown element occurs if the XML reader is an ":"如果XML读取器是一个\r\n"," and writes out the resulting text.":" 并写出结果文字。\r\n","Converts a string containing a Uniform Resource Identifier (URI) to an ":"将包含统一资源标识符（URI）的字符串转换为\r\n","Creates a new sibling element before the current node using the namespace prefix, local name, and namespace URI specified, with the value specified.":"使用指定的值，使用名称空间前缀，本地名称和指定的名称空间URI在当前节点之前创建一个新的同级元素。\r\n","Output this ":"输出此\r\n","Gets or sets the XML element name given to the serialized array.":"获取或设置给序列化数组的XML元素名称。\r\n","The expression does not evaluate to the correct XPath type.":"该表达式未评估正确的XPATH类型。\r\n","Writes an XML element with an ":"写一个XML元素\r\n"," object that represents the XML schema associated with the specified namespace.":" 代表与指定名称空间关联的XML架构的对象。\r\n","#xA":"#xa\r\n","Creates a new child node at the beginning of the list of child nodes of the current node using the XML string specified.":"使用指定的XML字符串在当前节点的子节点列表的开头创建一个新的子节点。\r\n","Gets a hash code for this ":"为此获取哈希代码\r\n","When overridden in a derived class, writes the given text content.":"在派生类中覆盖时，写给定的文本内容。\r\n"," scope exists.":" 存在范围。\r\n","When overridden in a derived class, causes the next call to the ":"当在派生类中覆盖时，将导致下一个呼叫\r\n"," to the first child node of the current node.":" 到当前节点的第一个子节点。\r\n","Evaluates the variable at runtime and returns an object that represents the value of the variable.":"在运行时评估变量，并返回代表变量值的对象。\r\n"," is not positioned on a recognized node type.":" 不在识别的节点类型上。\r\n","Represents the unary dynamic operation at the call site, providing the binding semantic and the details about the operation.":"代表呼叫站点上的一般动态操作，提供绑定的语义及其有关操作的细节。\r\n","Indicates that the .NET class library method to which this attribute is applied is unlikely to be affected by servicing releases, and therefore is eligible to be inlined across Native Image Generator (NGen) images.":"指示应用该属性的.NET类库方法不太可能受到服务版本的影响，因此有资格在天然图像发生器（NGEN）图像上嵌入。\r\n","Gets or sets the source switch value.":"获取或设置源开关值。\r\n"," array contains a null value or is empty.":" 数组包含一个空值或为空值。\r\n","Gets or sets a specified collection item.\r\n        \r\n        When setting a value to this indexer property, the following behavior is observed:\r\n- If the key previously existed in the collection and the value is ":"获取或设置指定的收集项目。\r\n        \r\n        在为此索引属性设置值时，会观察到以下行为：\r\n - 如果以前存在的密钥在集合中存在，并且值为\r\n","Replaces the attributes of this element with the specified content.":"用指定的内容替换此元素的属性。\r\n","Initializes callback methods that populate objects that map to SOAP-encoded XML data.":"初始化填充对象的回调方法将映射到SOAP编码的XML数据。\r\n","Reads the text content at the current position as an ":"在当前位置读取文本内容\r\n","Removes the annotations of the specified type from this ":"从此删除指定类型的注释\r\n","Returns the XML for this streaming element, optionally disabling formatting.":"返回此流元素的XML，可选地禁用格式。\r\n"," to override the default way it serializes a class.":" 为了覆盖默认方式，它序列化类。\r\n",".  \r\n  \r\n -or-  \r\n  \r\n The resulting number of characters is greater than the maximum number that can be returned as an int.":"。\r\n  \r\n -或者-\r\n  \r\n 所产生的字符数大于可以作为int返回的最大数字。\r\n","Serialize this streaming element to an ":"序列化此流元素\r\n"," to a file, overwriting an existing file, if it exists.":" 到一个文件，如果存在，则覆盖现有文件。\r\n","Gets any component in the collection matching the specified name.":"获取与指定名称匹配的集合中的任何组件。\r\n"," was specified to handle validation errors.":" 被指定以处理验证错误。\r\n","Returns the specified Unicode character value; no actual conversion is performed.":"返回指定的Unicode字符值；没有实际的转换。\r\n","SmtpClient":"smtpclient\r\n"," is not 2, 8, 10, or 16.":" 不是2、8、10或16。\r\n","The culture for which the resource is localized. If the resource is not localized for this culture, the resource manager uses fallback rules to locate an appropriate resource.\r\n\r\n If this value is ":"资源本地化的文化。如果资源未针对这种文化进行本地化，则资源经理使用后备规则来定位适当的资源。\r\n\r\n 如果此值为\r\n","Asynchronously encodes the specified binary bytes as ":"异步将指定的二进制字节编码为\r\n","Evaluates the ":"评估\r\n","Gets the combination of modifier and console keys that interrupted the current process.":"获取打断当前过程的修饰符和控制台键的组合。\r\n","Removes the first occurrence of a specific schema from the ":"从\r\n","Gets or sets the character string to use when indenting. This setting is used when the ":"缩进时获取或设置要使用的字符串。当\r\n"," to a new array.":" 到一个新数组。\r\n","Returns a copy of the ":"返回\r\n","Writes an XML node object within the body of a named XML element.":"在命名XML元素的正文中写入XML节点对象。\r\n","Gets a value that indicates whether the current node has any child nodes.":"获取一个指示当前节点是否具有任何子节点的值。\r\n"," used for resolving DTD references.":" 用于解决DTD参考。\r\n","When overridden in a derived class, writes out all the attributes found at the current position in the ":"当在派生类中覆盖时，写下在当前位置的所有属性\r\n","Automatically marshal strings appropriately for the target operating system. See Charsets and marshaling for details. Although the common language runtime default is ":"为目标操作系统适当地自动元帅字符串。有关详细信息，请参见charsets and guresing。虽然通用语言运行时默认值为\r\n","Delegate used by the ":"由\r\n","Writes an XML element whose body contains a valid XML qualified name. ":"写一个XML元素，其身体包含有效的XML合格名称。\r\n"," does not follow the constraints of an XML name.":" 不遵循XML名称的约束。\r\n","Performs key derivation using a specified hash algorithm.":"使用指定的哈希算法执行密钥推导。\r\n","Represents an XML namespace. This class cannot be inherited.":"代表XML名称空间。这个类不能被继承。\r\n","When setting, the ":"设置时，\r\n"," and references the specified namespaces.":" 并引用指定的名称空间。\r\n","Send a GET request to the specified Uri and return the response body as a byte array in an asynchronous operation.":"将GET请求发送到指定的URI，并在异步操作中以字节阵列返回响应主体。\r\n","Reads the value of the ":"读取的价值\r\n","int32x4_t vqrdmlahq_laneq_s32 (int32x4_t a, int32x4_t b, int32x4_t v, const int lane) A32: VQRDMLAH.S32 Qd, Qn, Dm[lane] A64: SQRDMLAH Vd.4S, Vn.4S, Vm.S[lane]":"int32x4_t vqrdmlahq_laneq_s32 (int32x4_t a, int32x4_t b, int32x4_t v, const int lane) A32: VQRDMLAH.S32 Qd, Qn, Dm[lane] A64: SQRDMLAH Vd.4S, Vn.4S, Vm.S[lane]\r\n"," object and outputs the results to a ":" 对象并将结果输出到\r\n","The XPath query is not valid.":"XPath查询无效。\r\n","Removes this node from its parent.":"从父母那里删除此节点。\r\n"}