{" to get the trailing edge of the character; ":"要获得角色的尾随边缘；","The beginning index position within the collection at which the first child element is removed.":"删除第一个子元素的集合中的开始索引位置。"," that represents the vertical size of the content element that can be scrolled. This property has no default value.":"这表示可以滚动的内容元素的垂直大小。 该属性没有默认值。","A floating-point value that specifies the vertical scroll position, in device-independent units (1/96th inch per unit).  \n  \n Setting this property causes the text editing control to scroll to the specified vertical offset. Reading this property returns the current vertical offset.  \n  \n The value of this property is 0.0 if the text editing control is not configured to support scrolling.  \n  \n This property has no default value.":"浮点值指定垂直滚动位置，以独立于设备的单位（每单位1/96英寸）。 \n  \n  设置此属性会导致文本编辑控件滚动到指定的垂直偏移。 读取此属性返回当前的垂直偏移。 \n  \n  如果未配置文本编辑控件以支持滚动，则此属性的值为0.0。 \n  \n  该属性没有默认值。"," to be paginated and displayed by the viewer.  \n  \n The default property is null.":"观看者分页并展示。 \n  \n  默认属性为null。"," to get the leading edge of the character.":"要获得角色的前沿。","The total number of child elements to remove from the collection.":"从集合中删除的儿童元素总数。"," that represents the horizontal size of the content element that can be scrolled. This property has no default value.":"这表示可以滚动的内容元素的水平大小。 该属性没有默认值。","A floating-point value that specifies the vertical size of the scrollable content area, in device-independent units (1/96th inch per unit).  \n  \n The value of this property is 0.0 if the text editing control is not configured to support scrolling.  \n  \n This property has no default value.":"浮点值指定可滚动内容区域的垂直尺寸（以设备无关的单位（每单位1/96英寸））。 \n  \n  如果未配置文本编辑控件以支持滚动，则此属性的值为0.0。 \n  \n  该属性没有默认值。"," object that can be used to enumerate the logical children of the viewer.  \n  \n This property has no default value.":"可以用来列举观众的逻辑子女的对象。 \n  \n  该属性没有默认值。","A rectangle for an edge of the character at the specified character index, or ":"在指定字符索引处的字符边缘的矩形，或","The object to set the property on.":"设置属性的对象。","The page number for the current master page, or 0 if no Document is currently loaded.  \n  \n This property has no default value.":"当前主页的页码，如果当前没有加载文档，则为0。 \n  \n  该属性没有默认值。","The element that controls scrolling properties, such as extent, offset, or viewport size. This property has no default value.":"控制滚动属性的元素，例如范围，偏移量或视口大小。 该属性没有默认值。","A floating-point value that specifies the horizontal size of the scrollable content area, in device-independent units (1/96th inch per unit).  \n  \n The value of this property is 0.0 if the text editing control is not configured to support scrolling.  \n  \n This property has no default value.":"浮点值指定可滚动内容区域的水平尺寸，独立于设备的单位（每单位1/96英寸）。 \n  \n  如果未配置文本编辑控件以支持滚动，则此属性的值为0.0。 \n  \n  该属性没有默认值。","The zero-based character index of a position in content to examine for a spelling error.":"基于零的字符索引在内容中的位置，以检查拼写错误。","The object to which the attached property value is set.":"设置附加属性值的对象。"," control has focus and mouse capture; otherwise ":"控制具有焦点和鼠标捕获； 否则"," that represents the vertical offset of the scrolled content. The default is 0.0.":"这代表了滚动内容的垂直偏移。 默认值为0.0。","The number of pages in the current document, or 0 if no document is currently loaded.  \n  \n This property has no default value.":"当前文档中的页面数量，如果当前未加载文档，则为0。 \n  \n  该属性没有默认值。"," is virtualizing; otherwise ":"虚拟化； 否则","The length of any spelling error that includes the character specified by charIndex, or 0 if the specified character is not part of a spelling error.":"包括Charindex指定的字符的任何拼写错误的长度，如果指定字符不是拼写错误的一部分，则为0。"," that is used to draw the ticks.":"用来画滴答。"," value that indicates whether a vertical ":"表示垂直的值","A read-only collection of the active ":"活跃的只读集合","One of the enumeration values that specifies whether ":"指定是否的枚举值之一"," to use to draw tick marks. The default value is ":"用来绘制刻度标记。 默认值是","The beginning character index for any spelling error that includes the character specified by ":"任何拼写错误的开头字符索引，其中包括由 "," that represents the vertical size of the content's viewport. This property has no default value.":"这代表了内容视口的垂直大小。 该属性没有默认值。"," uses container recycling.":"使用容器回收。"," objects contained within the viewer.  \n  \n This property has no default value.":"查看器中包含的对象。 \n  \n  该属性没有默认值。"," if the direction of increasing value is to the left for a horizontal ":"如果增加价值的方向是水平的左侧"," that represents the horizontal size of the content's viewport. The default is 0.0.":"这代表了内容视口的水平大小。 默认值为0.0。",", or -1 if the specified character is not part of a spelling error.":"，或-1如果指定的字符不是拼写错误的一部分。"," if the changed item is a direct child of this ":"如果更改的项目是直接的孩子"," or down for a vertical ":"或垂直下来","The cells added to the selection.":"细胞添加到选择中。","The horizontal change in position of the ":"位置的水平变化"," structure that specifies the constraints on the size of the text box.":"指定文本框大小的约束的结构。"," if a selection range is displayed; otherwise, ":"如果显示选择范围； 否则，","The cells removed from the selection.":"从选择中取出的细胞。"," if the changed item is an indirect descendant of the ":" 如果更改的项目是 "," control, resulting from the drag operation.":"控制，由拖动操作产生。"," structure indicating the new size of the text box.":"结构指示文本框的新尺寸。","The largest possible value for a tick mark. The default value is 100.0.":"tick标记的最大可能值。 默认值为100.0。","The added cells.":"添加的单元格。","The vertical change in position of the ":"位置的垂直变化","Contains data regarding the changed item.":"包含有关更改项目的数据。"," object for the text box.":"文本框的对象。","The list of cells removed.":"删除细胞列表。","The smallest possible value for a tick mark. The default value is zero (0.0).":"tick标记的最小值。 默认值为零（0.0）。"," if the changed item in an ":"如果在一个中更改的项目","A Boolean value that indicates whether the drag operation was canceled by a call to the ":"一个布尔值，指示是否通过呼叫取消拖动操作","The zero-based line index of the line to scroll into view.":"该行的基于零的行索引滚动到视图中。"," associated with this collection.":"与此集合相关联。"," enumeration value that identifies the position of the ":"确定位置的枚举价值"," affects the layout for this panel; otherwise, ":"影响此面板的布局； 否则，","The event handler delegate.":"活动处理程序代表。","The zero-based character index of the first character in the selection.":"选择中第一个字符的基于零的字符索引。","The first date to add to the collection.":"第一个日期添加到集合中。"," that uses the handler.":"使用处理程序。","The length of the selection, in characters.":"选择的长度，字符。","The last date to add to the collection.":"最后一个日期添加到集合中。"," can virtualize items that are grouped or organized in a hierarchy.":"可以在层次结构中分组或组织的虚拟化项目。"," layout of a ":"布局","The zero-based insertion position index of the caret.":"Caret的基于零的插入位置指数。"," if a drag operation was canceled; otherwise, ":"如果取消拖动操作； 否则，","The event identifier (ID).":"事件标识符（ID）。","A value that represents the total buffer area on either side of the row or column of tick marks. The default value is zero (0.0).":"一个代表行两侧的总缓冲区区域或刻度标记列的值。 默认值为零（0.0）。"," that is listening for this event.":"那是在听这个事件。","The horizontal difference between the point at which the user pressed the left mouse button and the point at which the user released the button during a drag operation of a ":"用户按下左鼠标按钮的点与用户在拖动操作期间释放按钮的点之间的水平差"," values that specifies how manually entered characters are cased. The default is ":"指定手动输入字符的套管的值。 默认值为","The event handler that is to be added.":"要添加的活动处理程序。","The items that were unselected during this event.":"在此活动期间未选择的项目。","The last value in a range of values for a selection. The default value is -1.0.":"选择范围的最后值。 默认值为-1.0。"," control. There is no default value.":"控制。 没有默认值。","The position of the item to generate and make visible.":"物品生成和可见的位置。","The total number of lines in the text box, or -1 if layout information is not available.":"文本框中的行总数，如果没有布局信息，则为-1。","The first value in a range of values for a selection. The default value is -1.0.":"选择范围的第一个值。 默认值为-1.0。","The items that were selected during this event.":"此事件期间选择的项目。","The vertical difference between the point at which the user pressed the left mouse button and the point at which the user released the button during a drag operation of a ":"用户按下左鼠标按钮的点与用户在拖动操作期间释放该按钮的点之间的垂直差","The distance between tick marks. The default value is one (1.0).":"刻度标记之间的距离。 默认值是一个（1.0）。"," that represents the coordinate space within a ":"代表一个内部的坐标空间","An enumerator for the logical child elements of the ":"用于逻辑子元素的枚举者","The handler to invoke.":"处理程序要调用。","The horizontal change in the ":"水平变化","The items that were selected since the last time the ":"自上次选择的项目"," position since the last ":"自上次以来的位置","The maximum number of characters that can be manually entered into the text box. The default is 0, which indicates no limit.":"可以手动输入文本框的最大字符数。 默认值为0，表示没有限制。"," that specifies the locations of the tick marks. The default value is ":"这指定了刻度标记的位置。 默认值是","Data about the event.":"有关事件的数据。","The maximum number of visible lines. The default is ":"可见线的最大数量。 默认值为"," event occurred.":"事件发生。","The vertical change in the ":"垂直变化","String representation of a ":"字符串表示","The old offset of the viewport.":"视口的旧偏移。","The minimum number of visible lines. The default is 1.":"最小数量可见线。 默认值为1。","A horizontal change in position of the mouse during a drag operation. There is no default value.":"在拖动操作过程中，鼠标位置的水平变化。 没有默认值。","The items that were unselected since the last time the ":"自上次以来未选择的项目"," is checked; false if the ":"被检查； 如果是错误的","A vertical change in position of the mouse during a drag operation. There is no default value.":"在拖动操作过程中，鼠标位置的垂直变化。 没有默认值。","The new offset of the viewport":"视口的新偏移","The computed ":"计算的"," is unchecked; otherwise ":"没有选中； 否则","The currently selected text in the text box.":"当前选择的文本在文本框中。","The horizontal offset of the mouse click with respect to the screen coordinates of the ":"鼠标的水平偏移相对于屏幕坐标。"," that is used to arrange the control.":"用于安排控件。"," if the control supports three states; otherwise, ":"如果控件支持三个州； 否则，"," from which the handler is being removed.":"从中删除处理程序。","The number of characters in the current selection in the text box. The default is 0.":"文本框中当前选择中的字符数。 默认值为0。","The vertical offset of the mouse click with respect to the screen coordinates of the ":"鼠标的垂直偏移相对于屏幕坐标","Size that a toolbar overflow panel assumes to position child elements.":"工具栏溢流面板假定将子元素放置的大小。"," values that determines where to display the tooltip with respect to the ":"确定在何处显示工具提示的值","The character index for the beginning of the current selection.":"当前选择开始的字符索引。","Logical parent of the new collection.":"新系列的逻辑父。","The horizontal offset of the mouse click with respect to the upper-left corner of the bounding box of the ":"鼠标的水平偏移相对于左上角的左上角","Specifies the event handler that is to be removed.":"指定要删除的事件处理程序。","A string containing the text contents of the text box. The default is an empty string (\"\").":"包含文本框的文本内容的字符串。 默认值是一个空字符串（“”）。",", or that specifies to not show a tooltip. The default is ":"，或指定不显示工具提示。 默认值为","A new collection.":"一个新系列。"," index that is relative to the generated (realized) items. -1 is a special value that refers to a fictitious item at the beginning or the end of the items list.":"相对于生成（已实现的）项目的索引。 -1是一个特殊的值，它是指在项目列表的开头或结尾处的虚拟项目。"," of child content. The default is ":"儿童内容。 默认值为","A double value that represents the recommended width of the ":"代表建议宽度的双重值"," values that specifies the horizontal alignment of the contents of the text box. The default is ":"指定文本框内容的水平对齐的值。 默认值为",", which specifies that a tooltip is not displayed.":"，这指定未显示工具提示。"," offset that is relative to the ungenerated (unrealized) items near the indexed item. An offset of 0 refers to the indexed element itself, an offset 1 refers to the next ungenerated (unrealized) item, and an offset of -1 refers to the previous item.":"相对于索引项目附近的未生成（未实现的）项目的抵消。 0的偏移是指索引元素本身，偏移1是指下一个未加生的（未实现的）项目，偏移量为-1是指以前的项目。"," assumes to position its children.":"假设将其子女定位。"," that represents the vertical size of the viewport of the content. The default is 0.0.":"这代表了内容视口的垂直大小。 默认值为0.0。"," index that is relative to the generated (realized) items.":"相对于生成（已实现的）项目的索引。","The precision of the ":"精度"," collection that contains text decorations to apply to the text box. The default is ":"包含文本装饰的集合适用于文本框。 默认值为"," offset that is relative to the ungenerated (unrealized) items near the indexed item.":"相对于索引项目附近的未生成（未实现的）项目的抵消。","The measurement constraints; a ":"测量约束； 一个"," that displays in the tooltip, specified as the number of digits that appear to the right of the decimal point. The default is zero (0).":"在工具提示中显示，指定为小数点右侧的数字数。 默认值为零（0）。","The name of the script function to execute.":"执行脚本函数的名称。"," values that indicates how the text box should wrap text. The default is ":"表示文本框应包装文本的值。 默认值为","The index of the child.":"孩子的索引。","The number of symbols that have been added to the control.":"已添加到控件中的符号数量。"," cannot return a size larger than the constraint.":"不能返回大于约束的大小。"," that decreases the value of the ":"这降低了","The object returned by the Active Scripting call.":"主动脚本调用返回的对象。"," object that contains the child at the specified index.":"在指定索引处包含孩子的对象。"," by the same amount as the ":"与","The parameters to pass to the script function.":"传递到脚本函数的参数。","The area that is provided for the ":"为","The position at which the change occurred.":"发生变化的位置。"," property. The default ":"财产。 默认值","Returns the object of the ":"返回","A string that contains the type of the object and the number of columns.":"包含对象类型和列数的字符串。","The URL to navigate to.":"导航到的URL。","The number of symbols that have been removed from the control.":"从控件中删除的符号数量。"," objects are ":"对象是"," objects that display data. The default is ":"显示数据的对象。 默认值为"," at the specified index in the list of visual child elements. The index must be a number between zero (0) and the value of the ":"在视觉子元素列表中的指定索引中。 索引必须是零（0）和值之间的数字","The name of the frame to display the document's content in.":"框架的名称显示文档的内容。"," caused by the text change.":"由文本更改引起。","HTTP POST data to send to the server when the source is requested.":"当请求源时，HTTP发布数据要发送到服务器。"," property minus one (1).":"财产减去一（1）。","A time delay in milliseconds. The default is the system key press delay. For more information, see ":"毫秒的时间延迟。 默认值是系统键按延迟。 有关更多信息，请参阅"," for the logical children of this row.":"对于这一行的逻辑孩子。","HTTP headers to send to the server when the source is requested.":"请求源时，HTTP标头要发送到服务器。","The changes that occurred during this event. For more information, see ":"此事件期间发生的更改。 有关更多信息，请参阅","The number of visual children for the current row.":"当前行的视觉儿童数量。","The size of the available space for the track.":"轨道可用空间的大小。"," that increases the value of the ":"这增加了","The layout ":"布局"," to navigate to.":"你点点头。","A collection of objects that contains information about the changes that occurred.":"包含有关发生变化的信息的对象集合。","An object that represents the desired size of the control's header, in device-independent units (1/96th inch per unit) and in logical units.":"一个代表控件标头的所需尺寸的对象，独立于设备的单元（每单位1/96英寸）和逻辑单元。"," for this command is ":"因为这个命令是"," that is required by the ":"这是由"," that contains the content for a document.":"其中包含文档的内容。"," appropriate for this text change.":"适合此文本更改。","An object that represents the desired size of the control's items, in device-independent units (1/96th inch per unit) and in logical units.":"代表控件项目所需大小的对象，以独立于设备的单位（每单位1/96英寸）和逻辑单元中。"," that increases the value of the slider by the same amount as the ":"这将滑块的价值增加与","Specifies whether to refresh without cache validation.":"指定是否在没有缓存验证的情况下刷新。","The string that identifies the specified item.":"标识指定项目的字符串。","The horizontal displacement of the ":"水平位移"," objects for this command are ":"此命令的对象是"," that is the container element which is used to display the next item.":"那是用于显示下一个项目的容器元素。"," value that indicates whether there is a document to navigate back to.":"表示是否有文档可以导航到的值。","A time in milliseconds between commands that change the ":"命令之间的千分之一的时间改变了","The name of the property that identifies the item to the user.":"将项目标识为用户的属性名称。","The vertical displacement of the ":"垂直位移","Is ":"是"," value that indicates whether there is a document to navigate forward to.":"表示是否有文档可以向前导航的值。","The string that identifies the item.":"标识该项目的字符串。"," if the returned ":"如果返回",". The default is the system key repeat rate. For more information, see SystemParametersInfo (SPI_GETKEYBOARDSPEED).":"。 默认值是系统密钥重复速率。 有关更多信息，请参见SystemParameterSinfo（Spi_getKeyboardsPeed）。","The change in ":"变化","The name of the property that identifies an item.":"标识项目的属性的名称。","A Document object.":"文档对象。"," is newly generated (realized); otherwise, ":"是新生成的（实现的）； 否则，"," if the direction of increasing value is to the left for a horizontal slider or down for a vertical slider; otherwise, ":"如果增加价值的方向是在水平滑块或向下垂直滑块的左侧； 否则，"," that corresponds to the displacement of the ":"对应于","The element from which to read the property.":"读取属性的元素。"," object that maps to the item at the specified index.":"在指定索引上映射到该项目的对象。"," that is an instance of a ":"那是一个实例"," moves immediately to the location of a mouse click; otherwise, ":"立即移动到鼠标点击的位置； 否则，","The specified point.":"指定点。","The measurement constraints. A ":"测量约束。 一个"," class, implemented by the host application, that can be accessed by script from a hosted document.":"由主机应用程序实现的类，可以通过托管文档从脚本访问。"," requires the position of the ":"需要","The arguments for the ":"关于","The panel for which to return an appropriate ":"返回适当的面板","The distance between the ":"距离","The element that will display the item.":"将显示该项目的元素。"," for the current HTML document.":"对于当前的HTML文档。"," to be a tick mark; otherwise, ":"成为tick痕； 否则，"," appropriate for use by the specified panel.":"适用于指定面板使用。"," that reduces the ":"这减少了","The index of desired item.  \n  \n The ":"所需项目的索引。 \n  \n  这"," element and its children.":"元素及其孩子。","The element to write the property to.":"将属性写入的元素。"," to use. The default is ":"使用。 默认值为"," is pressed. The default is a ":"被按下。 默认值为"," for the desired index.":"对于所需的索引。","The largest value of a selected range of values of a ":"选定范围的值的最大值"," control that has default settings.":"具有默认设置的控制。"," that represents the uniform height of all items that are contained within the ":"这代表了所有包含的物品的均匀高度","The band of the ":"乐队",". The default is zero (0.0).":"。 默认值为零（0.0）。"," that is the index which maps to the specified ":"那是映射到指定的索引"," that increases the ":"这增加了"," that represents the uniform width of all items that are contained within the ":"这代表了所有包含的项目的均匀宽度","The distance between tick marks. The default is (1.0).":"刻度标记之间的距离。 默认值为（1.0）。"," in which the toolbar is positioned. The default is 0.":"该工具栏的位置。 默认值为0。","The container to prepare. Normally, ":"准备的容器。 一般，"," value that represents the physical orientation of content within the ":"代表内容物理方向的值"," exchanged positions and the direction of increasing value is reversed; otherwise ":"交换位置和增加价值的方向是逆转的； 否则"," value that defines how to position the tick marks in a ":"定义如何将刻度标记定位的值","The position of a toolbar on the band of a ":"工具栏在频段上的位置"," is the result of the previous call to ":"是上一次呼吁的结果"," as horizontal or vertical. The default value is ":"作为水平或垂直。 默认值是","The largest allowable ":"最大的允许","A resource key that represents the default style for buttons on the toolbar.":"代表工具栏上按钮的默认样式的资源密钥。"," with respect to the slider bar. The default is ":"关于滑块。 默认值为","The radius value applied to every corner of the rectangle.":"半径值应用于矩形的每个角落。",". The default is 1.":"。 默认值为1。"," index of the element to remove. ":"要删除的元素索引。","A resource key that represents the default style for check boxes on the ":"表示代表复选框的默认样式的资源密钥","The radius of the top-left corner.":"左上角的半径。","A set of tick marks to display for a ":"一组刻度标记要显示"," must refer to a previously generated (realized) item, which means its offset must be zero.":"必须参考先前生成的（已实现的）项目，这意味着其偏移必须为零。","The smallest allowable ":"最小的允许","A resource key that represents the default style for combo boxes on the toolbar.":"代表工具栏上组合框的默认样式的资源密钥。","The audio source location.":"音频源位置。","The radius of the top-right corner.":"右上角的半径。"," number of elements to remove, starting at ":"从"," if there are items on the toolbar that are not visible; otherwise, ":"如果工具栏上的项目不可见； 否则，"," enumeration value that indicates whether the ":"枚举价值表明是否","The text-editing control whose collection of lexicon files is retrieved.":"检索了其收集词典文件的文本编辑控制。","The radius of the bottom-right corner.":"右下角的半径。",", that specifies the position of the item to start generating items at.":"，指定项目开始生成项目的位置。"," control that is used with the ":"与"," if the overflow area is visible; otherwise, ":"如果可见溢流区域； 否则，","The collection of lexicon file locations.":"词典文件位置的集合。",". The default is a ":"。 默认值为","The radius of the bottom-left corner.":"左下角的半径。"," that specifies the direction which to generate items.":"这指定了生成项目的方向。","The text-editing control to check. Example controls include ":"文本编辑控件要检查。 示例控件包括","The size of the visible area of the scrollable content. The default is ":"可滚动内容的可见区域的大小。 默认值为"," object that tracks the lifetime of the generation process.":"跟踪生成过程的寿命的对象。"," and contains the same corner radius values as this ":"并包含与此相同的角半径值","A resource key that represents the default style for menus on the toolbar.":"表示工具栏上菜单的默认样式的资源键。"," if the spelling checker is enabled on the text-editing control; otherwise, ":"如果在文本编辑控件上启用了拼写检查器； 否则，",", which means that the content size is not defined.":"，这意味着未定义内容大小。","Specifies the position of the item to start generating items at.":"指定项目开始生成项目的位置。","The toolbar orientation. The default is ":"工具栏方向。 默认值为","An integer between 0 and 2 that specifies the number of child elements in the ":"0到2之间的整数指定儿童元素数量","A resource key that represents the default style for radio buttons on the toolbar.":"代表工具栏上无线电按钮的默认样式的资源密钥。"," contains the same corner radius values as this ":" 包含与此相同的角半径值 "," that specifies whether to start at a generated (realized) item.":"这指定是否在生成（已实现的）项目上开始。","The text-editing control on which to enable or disable the spelling checker. Example controls include ":"用于启用或禁用拼写检查器的文本编辑控件。 示例控件包括 ","A resource key that represents the default style for separators on the toolbar.":"代表工具栏上分隔符默认样式的资源密钥。","The zero-based index of the first element to reuse. ":"第一个要重复使用的元素的零索引。"," of the area for the grid to use.":"用于使用网格的区域。"," of the grid that is rendered to display the child elements that are visible.":"用于显示可见的子元素的网格。","A Boolean value that specifies whether the spelling checker is enabled on the text-editing control.":"布尔值指定是否在文本编辑控件上启用了拼写检查器。"," have equal values for all corners (same values for ":"所有角的值相等（相同的值"," that becomes visible.":"那变得可见。","A resource key that represents the default style for text boxes on the toolbar":"代表工具栏上文本框的默认样式的资源密钥","); ":"）；","A bounding rectangle that identifies the coordinate space to make visible.":"一个边界矩形，可识别坐标空间以使可见。"," of the available area for the grid.":"网格可用区域的位置。","The text-editing control to which the spelling checker is applied. Example controls include ":"应用拼写检查器的文本编辑控件。 示例控件包括","A resource key that represents the default style for toggle buttons on the toolbar.":"代表工具栏上切换按钮的默认样式的资源密钥。"," have different values for one or more corners.":"一个或多个角有不同的值。"," based on the child content of the grid and the ":"基于网格的儿童内容和"," that is visible.":"那是可见的。"," value that determines the spelling reform rules.":"决定拼写改革规则的价值。"," have different values for one or more corners (different values for ":"一个或多个角的值不同（不同的值"," if the spelling checker is enabled on the control; otherwise, ":"如果在控件上启用了拼写检查器； 否则，"," if the toolbar cannot be moved inside the toolbar tray; otherwise, ":"如果工具栏无法在工具栏内移动； 否则，","The number of columns that are in the grid. The default is 0.":"网格中的列数。 默认值为0。","The degree to which content is horizontally offset from the containing viewport.":"内容水平从包含的视口水平偏移的程度。"," have identical corners.":"有相同的角落。","The spelling reform rules that are used by the spelling checker. The default value is ":"拼写检查器使用的拼写改革规则。 默认值是","The number of empty cells that are in the first row of the grid. The default is 0.":"网格第一行中的空单元格数。 默认值为0。","Index of the visual child.":"视觉孩子的索引。","The degree to which content is vertically offset from the containing viewport.":"内容垂直偏移与包含的视口的程度。","The radius of the bottom-left corner. The default is 0.":"左下角的半径。 默认值为0。","The radius of the bottom-right corner. The default is 0.":"右下角的半径。 默认值为0。","The index number of the visible child.":"可见孩子的索引号。","The number of rows that are in the grid. The default is 0.":"网格中的行数。 默认值为0。"," if scrolling is possible; otherwise, ":"如果可以滚动； 否则，"," for French and ":"对于法语和","The radius of the top-left corner. The default is 0.":"左上角的半径。 默认值为0。","Drawing context to use to render the ":"绘制上下文用于渲染"," object to print.":"要打印的对象。","The radius of the top-right corner. The default is 0.":"右上角的半径。 默认值为0。"," for German.":"对于德语。"," that represents, in device independent pixels, the vertical size of the extent.  \n  \n This property has no default value.":"这表示在设备独立像素中，垂直大小的程度。 \n  \n  该属性没有默认值。"," (a string).":"（字符串）。","A brush to use for the background color of the ":"用于用于背景颜色的刷子","A description of the job that is to be printed. This text appears in the user interface (UI) of the printer.":"要打印的作业的描述。 该文本出现在打印机的用户界面（UI）中。"," that represents, in device independent pixels, the horizontal size of the extent. This property has no default value.":"这表示在设备独立像素中，范围的水平尺寸。 该属性没有默认值。","The text used to replace the misspelled text.":"用于替换拼写错误的文本的文本。","An enumerator to the children of a ":"一个枚举的孩子"," to print.":"打印。"," for the binding.":"用于绑定。"," that represents, in device independent pixels, the horizontal offset. This property has no default value.":"这代表了设备独立像素的水平偏移。 该属性没有默认值。","The collection of spelling suggestions for the misspelled word.":"拼写错误的单词的拼写建议的集合。"," that listens to the event.":"这会听到活动。","The number of visible ":"可见的数量"," if a user clicks Print; ":"如果用户点击打印；"," element that controls scrolling behavior. This property has no default value.":"控制滚动行为的元素。 该属性没有默认值。","The object from which to get namespace information.":"获取名称空间信息的对象。"," that this element should use to arrange its child elements.":"该元素应该用来安排其子元素。","The previous visual parent.":"以前的视觉父母。"," if a user clicks Cancel; or ":"如果用户点击取消； 或者"," that represents, in device independent pixels, the vertical offset of the scrolled content. Valid values are between zero and the ":"这表示在设备独立像素中，滚动内容的垂直偏移。 有效值在零和"," if the control has a drop shadow; otherwise, ":"如果控件有落下阴影； 否则，"," element and its child elements.":"元素及其子元素。","A returned object used for viewing XML namespaces that relate to the binding on the passed object element. This object should be cast as ":"返回的对象用于查看与传递对象元素上绑定有关的XML名称空间。 该对象应施放为"," minus the ":"减去"," that represents coordinate space within a visual.":"这代表视觉中的坐标空间。"," if a user closes the dialog box without clicking Print or Cancel.":"如果用户在不单击打印或取消的情况下关闭对话框。"," control when it opens, and that specifies how the control interacts with screen boundaries. The default is ":"控制何时打开，并指定控件如何与屏幕边界相互作用。 默认值为"," to use for namespace evaluation in the passed element.":"用于传递元素中的名称空间评估。"," that represents, in device independent pixels, the vertical size of the viewport for this content. This property has no default value.":"这表示在独立的设备独立像素中，该内容的视口的垂直大小。 该属性没有默认值。"," if the option to print the current page is enabled; otherwise, ":"如果启用了打印当前页面的选项； 否则，","Data passed to the asynchronous data dispatcher.":"数据传递给异步数据调度程序。"," in the coordinate space that is made visible.":"在可见的坐标空间中。"," that represents, in device independent pixels, the horizontal size of the viewport for this content. This property has no default value.":"这表示在独立的设备独立像素中，该内容的视口水平尺寸。 该属性没有默认值。"," structure that defines the rectangle that is used to position the ":" 定义用于定位矩形的结构 "," that represents the highest page number that can be used in a page range in the Print dialog box.":"这表示可以在“打印”对话框中的页面范围内使用的最高页码。"," if content can scroll in the horizontal dimension; otherwise, ":"如果内容可以在水平尺寸中滚动； 否则，"," to evaluate the path relative to the data item itself; otherwise, ":"评估相对于数据项本身的路径； 否则，"," stays open until it is closed by the user clicking the mouse button outside the ":"保持打开"," that represents the lowest page number that can be used in a page range in the Print dialog box.":"这表示可以在“打印”对话框中的页面范围内使用的最低页码。","Returns the action that occurred.":"返回发生的操作。"," property or x:Name Directive of the element of interest. You can refer to elements in code only if they are registered to the appropriate ":"属性或X：感兴趣元素的姓名指令。 您只有在将其注册到适当的情况下才能参考代码中的元素"," if content can scroll in the vertical dimension; otherwise, ":" 如果内容可以在垂直维度中滚动;否则, "," that represents the range of pages that are printed.":"这表示打印的页面范围。","The object from which the property value is read.":"读取属性值的对象。","Integer that represents the number of items involved in the change.":"代表更改中涉及的项目数的整数。"," that represents the vertical size of the extent. The default value is 0.0.":"这代表了范围的垂直大小。 默认值为0.0。",". For more information, see WPF XAML Namescopes.  \n  \n The default is ":"。 有关更多信息，请参见WPF XAML名称。 \n  \n  默认值为"," value that represents the type of page range to print.":"代表要打印的页面范围的类型。","The object's ":"对象的","Integer that represents the number of UI elements involved in the change.":"代表更改中涉及的UI元素数量的整数。",", which returns the default binding mode value of the target dependency property. However, the default value varies for each dependency property. In general, user-editable control properties, such as those of text boxes and check boxes, default to two-way bindings, whereas most other properties default to one-way bindings.  \n  \n A programmatic way to determine whether a dependency property binds one-way or two-way by default is to get the property metadata of the property using ":"，它返回目标依赖项属性的默认绑定模式值。 但是，每个依赖项属性的默认值都会变化。 通常，用户编辑的控制属性，例如文本框和复选框的控制属性，默认为双向绑定，而大多数其他属性默认为单向绑定。 \n  \n  默认情况下，确定依赖性属性是单向还是双向绑定的一种程序化方法是使用该属性的属性元数据"," that represents the horizontal size of the extent. The default value is 0.0.":"这代表了程度的水平尺寸。 默认值为0.0。"," that represents the height of the printable page area.":"这代表了可打印页面区域的高度。"," whose layout clip is desired.":"需要其布局剪辑。","The object to which the attached property is written.":"附加属性的对象。"," and then check the Boolean value of the ":" 然后检查布尔值的 "," that represents the horizontal offset of the scrolled content. The default value is 0.0.":"这代表了滚动内容的水平偏移。 默认值为0.0。"," that represents the width of the printable page area.":"这代表了可打印页面区域的宽度。"," that represents the visible region of an ":"代表一个可见区域"," of child content.":"儿童内容。","The desired value.":"所需的值。"," that the user selected.":"用户选择的。"," event should be raised when the binding source value is updated; otherwise, ":"更新绑定源值时，应提高事件； 否则，"," object that defines the scope of the operation. There is one dispatcher per layout engine instance.":"定义操作范围的对象。 每个布局引擎实例有一个调度程序。"," to expand.":"扩大。"," that owns scrolling for this ":"为此拥有滚动"," event should be raised when the binding target value is updated; otherwise, ":"更新绑定目标值时，应提高事件； 否则，"," that represents the vertical offset of the scrolled content. The default value is 0.0.":"这代表了滚动内容的垂直偏移。 默认值为0.0。"," that was being processed by the layout engine at the moment of an unhandled exception.":"在未经治疗的异常时，布局引擎正在处理。"," that is used the next time the Print button in the dialog box is clicked.  \n  \n Setting this ":" 下次单击对话框中的\"打印\"按钮时将使用此功能。  \n  \n 设置此 "," that represents the vertical size of the content's viewport. The default value is 0.0.":"这代表了内容视口的垂直大小。 默认值为0.0。"," and all its child elements were expanded; otherwise, ":"它的所有子元素都扩大了； 否则，"," attached event should be raised on the bound object when there is a validation error during source updates; otherwise, ":"当源更新期间存在验证错误时，应在界对象上提出附件事件； 否则，"," whose layout slot is desired.":"需要其布局插槽。"," object that provides information about the annotated object.":"提供有关注释对象的信息的对象。"," property does not validate or modify the specified ":"属性不验证或修改指定的"," to use as a container for content.":"用作内容容器。"," for a particular ":"特定"," that represents the layout slot of the element.":" 表示元素的布局槽。","The path to the binding source. The default is ":"结合源的路径。 默认值为","The name of the author who created the sticky note.":"创建粘性音符的作者的名字。"," object specifying the relative location of the binding source to use. The default is ":"对象指定绑定源使用的相对位置。 默认值为","Provides the item that was previously selected and the item that is currently selected for the ":"提供先前选择的项目，以及当前为该项目选择的项目","The event data for a mouse event.":"鼠标事件的事件数据。",".  If needed, use the ":"。 如果需要，请使用"," because the control has a ":"因为控件有一个"," for the control's caption. The default is the value of ":"为控件的标题。 默认值是","The object to use as the binding source.":"用作绑定源的对象。","The item to check whether it is an item container.":"检查是否为物品容器的物品。","-specific ":"-特定 "," in its style.":"以其风格。"," representing the font size. The default is the value of ":"表示字体大小。 默认值是"," if multiple items in the ":"如果在","A method that provides custom logic for handling exceptions that the binding engine encounters during the update of the binding source value.":"一种为处理异常提供自定义逻辑的方法，该异常在更新绑定源值期间遇到的绑定引擎会遇到。"," that is valid for a given printer.":"这对于给定的打印机有效。","The selected object in the ":"选定的对象"," structure representing the degree of stretching compared to a font's normal aspect ratio. The default is ":" 表示与字体正常宽高比相比的拉伸程度的结构。 默认值为 "," can be selected at a time; otherwise, ":"可以一次选择； 否则，",", which returns the default ":"，它返回默认值 "," if no item is selected. The default value is ":"如果未选择项目。 默认值是"," if the option to print the selected pages is enabled; otherwise, ":"如果启用打印所选页面的选项； 否则，"," is currently performing a bulk update to the ":"目前正在执行批量更新"," structure representing the style of the caption as normal, italic, or oblique. The default is the value of ":"结构代表标题的样式正常，斜体或倾斜。 默认值是","The value of the property that is specified by the ":"由"," value of the target dependency property. However, the default value for most dependency properties is ":"目标依赖属性的值。 但是，大多数依赖关系属性的默认值是"," if the option is available; otherwise, ":" 如果选项可用；否则, ","The items in the ":"这些项目","A string that contains the path that is used to get the ":"一个包含用于获取的路径的字符串"," structure representing the weight of the font, for example, bold, ultrabold, or extralight. The default is the value of ":"代表字体重量的结构，例如粗体，超毛或外观。 默认值是",", while the ":"，而","The context, including source and destination, of the serialized stream.":"序列化流的上下文，包括源和目的地。"," that are selected.":"选择的。"," if the control is active; otherwise, ":"如果控件处于活动状态； 否则，"," property has a default value of ":"属性的默认值为","The actual size used by the ":"所使用的实际尺寸 "," that describes the error condition.":"描述了错误条件。"," if the control is expanded; otherwise, ":"如果控件扩展； 否则，"," to which to add child content.":" 向其添加子内容。",".  \n  \n A programmatic way to determine the default ":"。 \n  \n  确定默认值的程序化方法"," to use to display the object.":" 以用于显示对象。"," if the nested items of a ":"如果 a 的嵌套项"," if the mouse cursor is over the anchor; otherwise, ":"如果鼠标光标在锚点上； 否则，","The underlying error condition that caused the ":"导致的基本错误条件"," child content.":"儿童内容。"," are visible; otherwise, ":"可见； 否则，"," value of a dependency property is to get the property metadata of the property using ":"依赖属性的价值是使用该属性的属性元数据"," shows actual values; ":"显示实际值；"," and then check the value of the ":"然后检查"," representing the width of the pen. The default is the value of ":" 表示笔的宽度。 默认值为 "," if the containing ":"如果包含"," does not have a defined parent and the ":"没有定义的父母"," shows generic progress. The default is ":"显示通用进度。 默认值为"," value indicating the type of note. The default is ":"表示音符类型的值。 默认值为"," is returned. Otherwise, the return values are the same as ":"退回。 否则，返回值与"," query. The default is ":"询问。 默认值为"," has keyboard focus; otherwise, ":" 具有键盘焦点；否则, ","The name that specifies which ":"指定哪个名称","The available size that this element can give to the child. You can use infinity as a value to indicate that the element can size to whatever content is available.":"此元素可以给孩子的可用大小。 您可以使用无穷大作为值，以表明该元素可以大小到可用的任何内容。","The content.":"内容。","The object that can provide services for the markup extension. May be ":"可以为标记扩展提供服务的对象。 或许","An object that represents the viewport and cache sizes of the ":"表示视口和缓存大小的对象"," controls are mutually exclusive.  The default is an empty string.":"控件是互斥的。 默认值是一个空字符串。"," structure that has the ":"结构","An object that represents the desired size of the ":"代表所需大小的对象","The value to set on the binding target property.":"在绑定目标属性上设置的值。","The element to which the style will be applied.":"应用样式的元素。"," to be added as the initial contents of the new ":"将作为新的最初内容添加",", in pixels and in logical units.":"，以像素和逻辑单元的形式。"," properties both equal to zero (0).":"属性都等于零（0）。","Returns an application-specific style to apply; otherwise, ":"返回适用应用程序的特定样式； 否则，"," to which this binding belongs.":"这种绑定所属的。"," indicating a position from which to search for the next spelling error.":"指示从搜索下一个拼写错误的位置。","An object that represents the desired size of the control's items, in pixels and in logical units.":"一个代表控件项目所需大小的对象，以像素和逻辑单元为单位。"," control can contain transparent content; otherwise, ":"控制可以包含透明内容； 否则，","A composite string that specifies how to format the contents of the ":"一个指定如何格式化内容的复合字符串"," that displays the ":"显示"," in which to search for the next spelling error, starting at the specified ":"在其中搜索下一个拼写错误，从指定的","The amount of time, in milliseconds, to wait before updating the binding source.":"在更新绑定源之前等待的时间，以毫秒为单位。"," content of the ":"内容的内容","A string that specifies how to format the binding if it displays the bound value as a string.":"字符串指定如何格式化绑定，如果将绑定值显示为字符串。"," objects if they are displayed as strings.":"如果对象显示为字符串。"," that points to the next spelling error in the contents of the ":"这指出了在内容中的下一个拼写错误"," parent of the collection.":"该系列的父母。"," delegate method that provides placement information for the ":"委托法提供了安置信息","The value that is used in the target when the value of the source is ":"当源值为值时，目标中使用的值","The logical parent of the elements in the collection.":"集合中元素的逻辑父。"," to apply to any ":"申请任何"," if no next spelling error exists.":" 如果没有下一个拼写错误存在。"," calling this method. This only recognizes manager objects of type ":"调用此方法。 这仅识别类型的管理器对象","The index position of the added element.":"添加元素的索引位置。"," that does not have a ":"那没有"," is displayed with a drop shadow; otherwise, ":"显示带有落下阴影； 否则，"," object specifying the position to retrieve a ":"指定检索位置的对象"," whose logical parent is being cleared.":"他们的逻辑父母正在清除。"," property defined. The default is ":"定义属性。 默认值为"," that you can use to access the logical child elements of a ":" 您可以使用它来访问 ",", this method always returns a ":"，此方法总是返回一个 ","The binding source object that this ":"此绑定源对象 ","The element to find.":"要查找的元素。"," specifying the closest insertion position for the ":"指定最接近的插入位置"," object of the current binding expression.":"当前绑定表达式的对象。","The content of the currently selected ":"当前选择的内容 "," enumeration value that determines the orientation of the ":"枚举价值决定了","The index position of the element where copying begins.":"复制开始的元素的索引位置。"," specified, regardless or whether or not the supplied ":"指定，无论是否提供"," that can list the members of this collection.":"可以列出此集合的成员。","The binding source object for this ":"绑定的源对象"," control when the control opens, and that specifies how the control interacts with screen boundaries. The default is ":"控制何时打开控件，并指定控件如何与屏幕边界相互作用。 默认值为","A composite string that specifies how to format the content of the currently selected ":"一个指定如何格式化当前选择的内容的复合字符串","The element whose index position is required.":"需要索引位置的元素。","The name of the binding source property for this ":"此绑定源属性的名称","The rectangle that is used to position the ":"用于定位的矩形"," if it is displayed as a string.":"如果显示为字符串。"," is inside a character's bounding box.  \n  \n If ":"在角色的边界框中。 \n  \n  如果","The index position of the element.  -1 if the element is not in the collection.":"元素的索引位置。 -1如果该元素不在集合中。"," of the selected item.":"选定的项目。"," does not fall within any character bounding box.":"不属于任何字符边界框。"," that is the logical parent of the ":"那是逻辑上的父母"," if the validation rules succeed; otherwise, ":"如果验证规则成功； 否则，","The index position where you want to insert the element.":"您要插入元素的索引位置。"," that this binding expression belongs to. This property returns ":"这种结合表达属于。 此属性返回"," enumeration value that defines an animation to open and close a ":"定义动画以打开和关闭的枚举值"," of the currently selected item. The default is ":"当前选择的项目。 默认值为"," specifying the closest insertion position for the supplied point, or ":" 为提供的点指定最近的插入位置，或 ","The element to insert into the ":"要插入的元素"," is not part of a  ":" 不是a的一部分  "," and the supplied ":"和所提供的"," control closes when ":"控制关闭时","The element to remove from the collection.":"从集合中删除的元素。","The alignment of tab headers relative to tab content. The default is ":"选项卡标题相对于选项卡内容的对齐方式。 默认值为 "," if the parent binding has a failed validation rule; otherwise, ":"如果父母绑定的验证规则失败； 否则，"," that you want to remove.":"您要删除。"," if the target has a value that has not been written to the source; otherwise, ":"如果目标具有未写入源的值； 否则，"," is not within any character's bounding box. Note that the ":"不在任何角色的边界框中。 请注意","Old value of the content property.":"内容属性的旧价值。"," control closes when a mouse or keyboard event occurs outside the ":" 当鼠标或键盘事件发生在 "," returned is usually the position between two characters. Use the ":"返回通常是两个字符之间的位置。 使用"," object from which this ":"从中从中","The index position of the element where removal begins.":"该元素开始删除的索引位置。","Returns the string representation of a ":"返回一个字符串表示","New value of the content property.":"内容属性的新值。"," whose logical parent is set.":"设置其逻辑父。"," property of the returned ":"返回的财产"," object is created.":"创建对象。"," if the object was found in the list; otherwise, ":"如果在列表中找到对象； 否则，"," to determine which of the two characters the ":"确定两个字符中的哪个"," value that describes the status of the binding expression.":"描述结合表达式状态的值。","Old value of the content template property.":"内容模板属性的旧值。"," to add to or subtract from the ":"添加或从"," corresponds to.":"对应于。","The object to insert to the list.":"插入列表的对象。"," element. The default is 1.":"元素。 默认值为1。","The element that is the binding target object of this binding expression.":"是该结合表达式的结合目标对象的元素。","New value of the content template property.":"内容模板属性的新值。"," that specifies a position and logical direction that resolves to a character to examine for a spelling error. Use the ":"这指定了一个位置和逻辑方向，该方向可以解决到角色以检查拼写错误。 使用","The total number of elements the collection can contain.":"该集合可以包含的元素总数。","The binding target property of this binding expression.":"该结合表达的结合目标特性。","The highest possible ":"最高的","Old value of the content template selector.":"内容模板选择器的旧值。"," to specify the direction of the character to examine.":"指定角色检查的方向。","The actual number of elements in the collection.":"集合中的实际元素数。"," that caused this instance of ":"这导致了这一实例"," of the range element. The default is 1.":"范围元素。 默认值为1。","New value of the content template selector.":"内容模板选择器的新值。"," possible ":"可能的"," object containing the details of the spelling error found at the character indicated by ":"包含在字符处发现的拼写错误的细节的对象"," to be invalid.":"无效。"," that you can use to synchronize access to the ":"您可以用来同步访问对"," of the range element. The default is 0.":"范围元素。 默认值为0。"," is selected; otherwise, ":"选择； 否则，"," objects that caused this instance of ":"导致此实例的对象"," if no spelling error exists at the specified character.":"如果指定字符没有拼写错误。"," element. The default is 0.1.":"元素。 默认值为0.1。"," if the list has a fixed size; otherwise, ":"如果列表的尺寸固定； 否则，"," to be invalid.  The value is ":"无效。 值是","An object deriving from the abstract ":"从摘要派生的对象"," object covering any misspelled word that includes the character specified by ":"对象涵盖任何拼写错误的单词，其中包含由字符指定的字符","The current magnitude of the range control. The default is 0.":"范围控制的当前大小。 默认值为0。"," structure specifying constraints on the size of the ":"结构指定对大小的约束"," if the list is read-only; otherwise, ":"如果列表是只读的； 否则，","The event data for a ":"事件数据"," class, to be added as the initial content.":"类，将作为初始内容添加。"," if there are no errors.":"如果没有错误。"," structure indicating the new size of the ":"结构表示新的大小"," object to add ":"要添加的对象","The amount of time, in milliseconds, the ":"以毫秒为单位的时间"," within the hosting parent element that the ":"在托管父元素中"," if every ":"如果每个"," object specifying the position of the input caret.  \n  \n By default, the caret is at the first insertion position at the beginning of the content hosted by the ":"对象指定输入范的位置。 \n  \n  默认情况下，Caret处于由该内容开始的第一个插入位置"," waits while it is pressed before it starts repeating. The default is the value of ":"等待在开始重复之前按下它。 默认值是","The handler to add.":"处理程序要添加。",". See ":"。 看"," succeeds and the values are committed to the sources; otherwise, ":"成功，价值观致力于来源； 否则，"," should use to arrange itself and its child elements. Sizing constraints may affect this requested size.":"应该用来安排自己及其子元素。 尺寸约束可能会影响此请求的大小。","The object to turn valid.":"对象有效。","The amount of time, in milliseconds, between repeats after repeating starts. The default is the value of ":"重复启动后重复之间的时间，以毫秒为单位。 默认值是"," for more information on text position terminology like \"insertion position\".":"有关文本位置术语的更多信息，例如“插入位置”。"," used to arrange the element.":"用于安排元素。","The object that contains the specified property.":"包含指定属性的对象。"," object to read the value from.":"对象从中读取值。"," in the coordinate space of the ":"在坐标空间"," is enabled in a ":"在一个"," object that represents the contents of the ":"代表内容的对象","The property whose proposed value to get.":"提议获得的属性。"," used to generate validation error feedback on the adorner layer.":"用于在装饰层上生成验证错误反馈。"," for which to return a ":"为此返回"," and the size of the content is larger than the display area; otherwise, ":"内容的大小大于显示区域； 否则，",".  \n  \n By default, this property is set to an empty ":"。 \n  \n  默认情况下，此属性设置为空","The proposed property value.":"提议的财产价值。"," attached property of the specified element.":"指定元素的附加属性。",".  Specifically, the empty ":"。 具体而言，空的"," to return a ":"返回"," enumeration value that defines whether the ":"枚举价值定义了是否","The element from which to get the ":"获得的元素","When this method returns, contains an object that represents the proposed property value. This parameter is passed uninitialized.":"当此方法返回时，包含一个代表建议属性值的对象。 该参数通过非初始化。"," to the insertion point closest to ":"到最接近的插入点"," object to mark as invalid.":"对象标记为无效。"," is displayed horizontally or vertically. The default is ":"水平或垂直显示。 默认值为"," contains a single ":"包含一个"," if value is the proposed value for the specified property; otherwise, ":"如果值是指定属性的拟议值； 否则，",", whether or not ":"，无论是否"," object to remove ":"对象要删除",", which contains a single ":"，其中包含一个"," that is used with a ":"与"," if all validation rules succeed; otherwise, ":"如果所有验证规则成功； 否则，"," is inside a character's bounding box; ":"在角色的边界框中；","The handler to remove.":"处理程序要卸下。","The amount of the scrollable content that is currently visible. The default is 0.":"当前可见的可滚动内容的数量。 默认值为0。"," which contains no text.":"其中不包含文字。"," objects that contains information for each binding in the ":"包含每个绑定信息的对象"," is not inside a character's bounding box.":"不在角色的边界框中。"," if the user can interact with ":"如果用户可以与"," enumeration value that describes the type of ":"描述类型的枚举价值"," object to set ":"要设置的对象"," if each source in the binding can discard pending changes and restore the original values; otherwise, ":"如果绑定中的每个源可以丢弃待处理并恢复原始值； 否则，"," to the specified point, or ":"到指定点或"," to use to generate validation error feedback on the adorner layer.":"用于在装饰层上生成验证错误反馈。"," object containing the current selection in the ":"包含当前选择的对象"," movement that caused the event.":"引起事件的动作。"," has a failed validation rule; otherwise, ":"验证规则失败； 否则，"," and the specified point does not fall within a character bounding box in the ":"并且指定点不属于字符的边界框",".  \n  \n The default returned ":"。 \n  \n  默认值返回"," of the specified element.":"指定元素的。","The value that corresponds to the new location of the ":"对应于与新位置相对应的值"," has an ":"有一个","The rule that detected validation error.":"检测到验证错误的规则。"," content area.":"内容区域。"," contains a proposed value that has not been written to the source; otherwise, ":"包含尚未写入源的提议值； 否则，","The event handler to call.":"活动处理程序要致电。"," property value of ":"属性价值"," for which to generate and return a collection of bounding rectangles.":"为其生成和返回边界矩形的集合。"," object with the validation error.":"具有验证错误的对象。",". An empty ":"。 一个空","The sources that are used by the Binding objects in the ":"绑定对象使用的源","The current object along the event's route.":"沿活动路线的当前对象。"," renders as a caret in the text area with no selection.":"在文本区域中呈现为男人，没有选择。","Information about the error.":"有关错误的信息。","A read-only collection of bounding rectangles for the specified ":"指定矩形的仅读取矩形集合","The name that identifies the ":"标识的名称","The value that corresponds to the new position of the ":"对应于新位置的值"," movement that caused the ":"引起的运动"," that represents the calculated height in device independent pixels. The default value is 0.0.":"这表示设备独立像素的计算高度。 默认值为0.0。"," event occurs when the state of a ":"事件发生在一个状态","A zero-based index specifying the ":"基于零的索引指定","The exception that caused the validation failure. This parameter is optional and can be set to ":"导致验证失败的例外。 此参数是可选的，可以设置为","The object whose scrolling orientation is retrieved.":"检索其滚动方向的对象。"," changes; otherwise, ":"变化; 否则，"," child to return.  This value must be between 0 and (":"孩子返回。 此值必须在0和（"," object of this ":"这个对象"," that represents the height of the row. The default value is 1.0.":"这代表了行的高度。 默认值为1.0。","The direction that cells can scroll.":"细胞可以滚动的方向。","The object that this ":"这个对象"," that represents the maximum height.":"这代表最大高度。"," minus 1)":"负1）","An object that provides additional context for this ":"为此提供其他上下文的对象"," is assigned to.":"被分配给。"," that represents the minimum allowable height. The default value is 0.":"这代表最小允许的高度。 默认值为0。","The object whose scrolling orientation is set.":"设置其滚动方向的对象。"," child at the specified index.":"指定索引的孩子。"," object, if the error is the result of an exception.":"对象，如果错误是异常的结果。"," reuses target values that have not been committed to the source; otherwise, ":"重复使用尚未投入源的目标值； 否则，","The scrolling orientation.":"滚动方向。"," that represents the offset of the row. The default value is 0.0.":"这代表了行的偏移。 默认值为0.0。"," object specifying the parameters to hit test for.":"对象指定要达到测试的参数。"," object, if the error is the result of a validation rule.":"对象，如果错误是验证规则的结果。","The event handler to invoke, in this case the ":"活动处理程序要调用，在这种情况下"," for the specified hit test parameters.":"对于指定的HIT测试参数。"," objects that caused ":"引起的对象","Element that listens to this event.":"倾听此事件的元素。",", in the coordinate space of the ":"，在坐标空间","Event handler to add.":"活动处理程序要添加。","The target upon which the ":"目标","The object to invoke the handler on.":"调用处理程序的对象。"," objects that validate the source objects in the ":"验证源对象中的对象",", for which to return the corresponding ":"，为此返回相应的"," value that indicates whether the error is a new error or an existing error that has now been cleared.":"表示错误是现在已清除的新错误还是现有错误的值。"," that represents the updated extent height.":"这代表了更新的范围高度。","The pending new item.":"待处理的新项目。","The item container element.":"项目容器元素。"," object that caused this ":"引起这一点的对象"," if the item belongs to the collection view; otherwise, ":"如果该项目属于收集视图； 否则，"," found at the specified Point, or ":"在指定点找到，或","Boolean value, ":"布尔价值，"," that represents the change in extent height.":"这代表了高度的变化。","The item at the specified position in the view.":"视图中指定位置的项目。","Whether or not the value checked against the ":"是否检查值"," if no such ":"如果没有"," that represents the updated extent width.":"这表示更新的范围宽度。","Value of the property, ":"财产的价值，","The index of the item in the collection, or ":"集合中项目的索引，或","Information about the invalidity.":"有关无效性的信息。"," that represents the change in extent width.":"这代表了宽度的变化。"," structure specifying any constraints on the size of the ":"结构指定对大小的任何约束"," if the keyboard focus is within the ":"如果键盘焦点在"," that represents the change in horizontal offset for a ":"这代表了水平偏移的变化",".have the same values.":"。具有相同的值。"," element whose ":"元素谁"," if the item does not exist in the collection view.":"如果该项目在集合视图中不存在。","Old value of the source.":"来源的旧价值。"," that represents the updated value of the horizontal offset for a ":"这代表了水平偏移的更新值","An object that provides additional information about the invalidity.":"提供有关无效性的其他信息的对象。"," if the specified item belongs to the view or if there is not filter set on the collection view; otherwise, ":"如果指定的项目属于视图，或者在集合视图上没有过滤设置； 否则，","New value of the source.":"来源的新值。","Arguments for the associated event.":"相关事件的论点。","First object to compare.":"比较的第一个对象。"," if the value is valid; otherwise, ":"如果值有效； 否则，"," that represents the change in vertical offset of a ":"这代表了垂直偏移的变化","The element that is used to display the specified item.":"用于显示指定项目的元素。"," to render the control on.":"呈现控制。","Second object to compare.":"比较的第二个对象。","A valid instance of ":"一个有效的实例"," that represents the updated vertical offset of a ":"这代表了一个更新的垂直偏移","The specified item to display.":"要显示的指定项目。","A serialization service manager object for this object.":"此对象的序列化服务管理器对象。"," that represents the updated viewport height of a ":"这代表了一个更新的视口高度","Less than zero means ":"小于零的手段","One of the enumeration values that specifies when the validation rule runs.":"验证规则运行时指定的枚举值之一。","Event handler to remove.":"活动处理程序要删除。"," that represents the change in vertical viewport height for a ":"这代表了垂直视口高度的变化"," to have the validation rule run when the target of the ":"在目标的目标时运行验证规则","Mouse coordinates relative to the content host.":"鼠标相对于内容主机进行协调。",", a value of zero means they are equal, and over zero means ":"，零值表示它们相等，超过零均值","Object on which to set the property.":"设置属性的对象。"," that represents the updated value of the viewport width for a ":"这代表了视口宽度的更新值"," is updated; otherwise, ":"已更新； 否则，"," if the view supports custom filtering; otherwise, ":"如果视图支持自定义过滤； 否则，"," is always synchronized with the current item in the ":"始终与当前项目同步","The value from the binding target to check.":"从绑定目标到检查的值。","The element that has been hit.":"被击中的元素。"," that represents the change in viewport width for a ":" 这表示视口宽度的变化 "," is never synchronized with the current item; ":"永远不会与当前项目同步；","For a default instance of ":"对于默认实例","The binding expression that uses the validation rule.":"使用验证规则的绑定表达式。"," is synchronized with the current item only if the ":"仅当","The brush used to fill the background of the content area, or ":"用于填充内容区域的背景的刷子或","One of the following:  \n  \n ":"以下之一：","The bounding rectangle that identifies the coordinate space to make visible.":"识别坐标空间以使可见空间的边界矩形。"," to not use a background brush. The default is ":"不使用背景刷。 默认值为"," uses a ":"使用","The binding group that uses the validation rule.":"使用验证规则的绑定组。","A string that specifies how the items are filtered.":"一个指定项目过滤的字符串。"," that represents the visible region.":" 即表示可见区域。","The amount by which each line of text is offset from the baseline, in device independent pixels. ":"在设备独立的像素中，每条文本的数量都偏移了基线。"," if the validation rule runs when the target of the ":"如果验证规则在目标的目标","The index of first item in the current selection. The default value is negative one (-1).":"当前选择中的第一项索引。 默认值为负一个（-1）。","A method that provides the logic for the selection of the ":"一种为选择的逻辑提供逻辑的方法"," on which adorners are rendered.":"在哪些装饰物上呈现。"," indicates that an optimal baseline offset is automatically calculated from the current font characteristics. The default is ":"表明根据当前字体特性自动计算出最佳基线偏移量。 默认值为","One of the enumeration values.  The default is ":"枚举值之一。 默认值为","The first item in the current selection or ":"当前选择中的第一项或"," as a function of the parent group and its level. The default is ":"作为父组及其级别的函数。 默认值为"," if the content is allowed to scroll; otherwise, ":"如果允许内容滚动； 否则，","The conditions for breaking content after the current element.":"当前元素之后破坏内容的条件。",". A ":"。 一个"," to remove settings from.":"从中删除设置。"," if the selection is empty.":"如果选择为空。","A read-only collection of the top-level groups, or ":"顶级组的仅阅读集合，或"," to the end of content in the ":"到内容的末尾"," control to use to create the ":"用于创建的控制"," value indicates that the ":"值表明"," if the list of items is already in the correct order for grouping; otherwise, ":"如果项目列表已经按正确的分组顺序排列； 否则，"," interface that implements the ":"实现","The value of the selected item.":"所选项目的值。"," to the beginning of content in the ":"到内容的开始"," acts as the scrolling client. This property has no default value.":"充当滚动客户端。 该属性没有默认值。"," for a custom ":"为了定制","A collection of objects that describes the properties of the items in the collection.":"描述集合中项目属性的对象集合。","The path used to get the ":"用于获取的路径","The vertical size of the extent. This property has no default value.":"垂直尺寸的程度。 该属性没有默认值。"," object specifying the preferred font family, or a primary preferred font family with one or more fallback font families. The default is the font determined by the ":" 对象指定首选字体族，或具有一个或多个后备字体族的主要首选字体族。 默认值是由 ","The item to prepare for display.":"准备显示的项目。","One of the enumeration values that specifies the position of the new item placeholder in the ":"指定新项目占位符位置的枚举值之一","The horizontal size of the extent. This property has no default value.":"范围的水平尺寸。 该属性没有默认值。","The specified object to evaluate.":"指定的对象进行评估。","The desired font size to use in device independent pixels). The default is determined by the ":"所需的字体大小用于设备独立像素）。 默认值由","The style to use for the view mode. The default value is the style for the ":"用于视图模式的样式。 默认值是","The item to display in the ":"要在","The collection to access.":"要访问的集合。","The horizontal offset. This property has no default value.":"水平偏移。 该属性没有默认值。"," class specifying the desired font-stretching characteristics to use. The default is ":"指定所需的字体拉伸特性要使用的类。 默认值为","The vertical offset of the scrolled content. Valid values are between zero and the ":"滚动内容的垂直偏移。 有效值在零和","The style of a ":"风格","The content of the item to display.":"要显示的项目的内容。","The action to perform on the collection.":"在集合上执行的动作。"," class specifying the desired font style. The default is determined by the ":"指定所需字体样式的类。 默认值由","The container for the item.":"该项目的容器。","The index position of the wanted ":"想要的指数位置","The vertical size of the viewport for this content. This property has no default value.":"该内容的视口的垂直尺寸。 该属性没有默认值。"," will write to the collection; otherwise, ":"会写信给收藏； 否则，"," class specifying the desired font weight. The default is determined by the ":"指定所需字体重量的类。 默认值由"," limit that ":"限制这一点","The object from which to remove bindings.":"从中删除绑定的对象。","The horizontal size of the viewport for this content. This property has no default value.":"该内容的视口水平尺寸。 该属性没有默认值。"," that references the style to use for ":"引用了要使用的样式","The brush used to apply to the text contents. The default is ":"用于应用文本内容的刷子。 默认值为"," if this element can scroll; otherwise, ":"如果此元素可以滚动； 否则，","The object from which to remove the binding.":"从中删除绑定的对象。"," cannot exceed.":"不能超过。","An enumerator that can iterate elements hosted by this ":"可以迭代此元素的枚举者","The size that a tab panel assumes to position child elements.":"标签面板假设将子元素放置的大小。","The dependency property from which to remove the binding.":"从中删除绑定的依赖性属性。","The size of the tab panel.":"标签面板的大小。"," elements that comprise the contents of the ":"构成内容的元素","The single child of a ":"一个单身的孩子"," dependency property.":"依赖性属性。","The collection to remove synchronized access from.":"该集合以删除同步访问。"," to indicate that automatic breaking and hyphenation of words is enabled; otherwise, ":"表明启用了单词的自动破坏和连字符； 否则，"," element. This property has no default value.":" 元素。 此属性没有默认值。","The size of the panel.":"面板的大小。","The object from which to get ":"获取的对象","The height of line, in device independent pixels, in the range of 0.0034 to 160000. A value of ":"线的高度，在设备独立像素中，范围为0.0034至160000。","The collection that needs synchronized access.":"需要同步访问的集合。"," that determines how content fits in the available space. The default is ":"这决定了内容如何符合可用空间。 默认值为"," (equivalent to an attribute value of \"":"（等同于属性值","A size that is the layout size of the ":"大小是布局大小"," if the content is stationary when the user drags the ":"如果用户拖动内容时，内容是静止的","The object to lock when accessing the collection.":"访问集合时要锁定的对象。","Constraint size is an upper limit. The return value should not exceed this size.":"约束大小是上限。 返回值不应超过此尺寸。","The rate ":"比率","\") indicates that the line height is determined automatically from the current font characteristics. The default is ":"”）表示线高是根据当前字体特性自动确定的。默认值为","An object that is passed to the callback.":"传递给回调的对象。"," that determines how scaling is applied to the contents of a ":"这决定了如何将缩放应用应用于A的内容","A string that specifies the text to append to the current contents of the text control.":"一个指定文本以附加到文本控件当前内容的字符串。"," slows in device-independent units (1/96th inch per unit) per squared millisecond.":"减慢独立的单位（每单位1/96英寸）每平方毫秒。","The callback that is invoked whenever access to the collection is required. You can use it to ensure that the collection is accessed by one thread at a time.":"每当需要访问集合时被调用的回调。 您可以使用它来确保一次线程访问集合。","The mechanism by which a line box is determined for each line of text within the ":"确定线条框的每条文本线框的机制"," children.":"孩子们。"," object that refers to a new change block.":"引用新变化块的对象。","A value that specifies how ":"指定如何的值","Size that ":"大小","The object where ":"对象的位置"," structure specifying the amount of padding to apply, in device independent pixels. The default is ":" 在设备独立像素中指定要应用的填充量的结构。 默认值为 ","Arguments of the event. These arguments will include details about which mouse button was depressed, and the handled state.":"事件的参数。 这些论点将包括有关哪种鼠标按钮被压抑的详细信息以及处理状态。"," reacts to touch manipulation.":" 对触摸操作作出反应。"," will assume.":"会假设。","Elements hosted by the content host.":"内容主机托管的元素。"," is.":" 是。","The mouse wheel arguments that are associated with this event.":"与此事件相关的鼠标轮辩论。","The binding target property from which to retrieve the binding.":"从中取回结合的绑定目标属性。","The final size of the arranged ":"排列的最终尺寸","The text contents of this ":"文字内容","The ratio of scrolling offset to translate manipulation offset.":"滚动偏移的比率是翻译操作偏移的比例。","The arguments that are associated with the ":"与",". Note that all non-text content is stripped out, resulting in a plain text representation of the ":"。 请注意，所有非文本内容均已删除，导致了纯文本表示","The parameters for hit testing within a visual object.":"在视觉对象中击中测试的参数。","Position of the element in the collection.":"元素在集合中的位置。"," object set on the given property or ":"在给定属性或"," object that specifies the control template that is currently active.":"指定当前活动的控制模板的对象。","The result of the hit test.":"热门测试的结果。"," contents. The default is ":"内容。 默认值为","Visual at the specified position in the ":"视觉在指定位置"," object has been set.":"对象已设置。"," object that specifies a new control template to use.":"指定新的控制模板的对象。","The upper limit ":"上限","The binding target property from which to retrieve the ":"从中取回的绑定目标属性","The camera that projects the 3-D contents to the 2-D surface.":"将3D内容物投向2-D表面的相机。"," values that specifies the desired alignment. The default is ":"指定所需对齐的值。 默认值为"," if the redo operation was successful; otherwise, ":"如果重做操作成功； 否则，","The computed desired limit ":"计算的所需限制"," if there is no undo command available (the undo stack is empty).":"如果没有可用命令（撤消堆栈为空）。","Required arguments for this event.":"此事件所需的参数。"," children of the ":"孩子的孩子"," collection that contains text decorations to apply to this element. The default is ":"包含文本装饰的收藏品适用于此元素。 默认值为"," object that is set on the given property or ":"在给定属性上设置的对象或","Required arguments that describe this event.":"需要描述此事件的参数。"," (no text decorations applied).":"（没有应用文本装饰）。","A double value that specifies the horizontal offset to scroll to.":"指定水平偏移到滚动的双重值。","Integer that represents the number of Visuals in the Children collection of the ":"代表儿童收藏中视觉效果数量的整数"," if no binding object has been set.":" 如果没有设置绑定对象。"," that contain information about the change in the scrolling state.":"其中包含有关滚动状态更改的信息。","The binding target object where ":"绑定目标对象"," containing one or more ":"包含一个或多个","A double value that specifies the vertical offset to scroll to.":"一个双重值指定要滚动的垂直偏移。","The size of the cache before the viewport.":"视口前的高速缓存大小。"," objects that define effects to apply to the text of the ":"定义效果的对象适用于文本","The size of the cache after the viewport.":"视口之后的缓存大小。"," if the undo operation was successful; otherwise, ":"如果撤消操作成功； 否则，"," that contains information about the gesture.":" 其中包含有关手势的信息。"," object associated with the given property or ":" 与给定属性关联的对象或 "," if the undo stack is empty.":"如果撤消堆栈为空。","The size of the cache after the viewport when the ":"视口后缓存的大小"," (no effects applied).":"（没有效果）。","The position that the content scrolls to.":"内容滚动到的位置。"," if none exists. If a ":" 如果不存在。 如果一个 "," is virtualizing.":"虚拟化。"," if pressing the ENTER key inserts a new line at the current cursor position; otherwise, the ENTER key is ignored. The default value is ":"如果按下Enter键在当前光标位置插入一条新线路； 否则，将忽略Enter密钥。 默认值是"," values that specifies the text trimming behavior to employ. The default is ":"指定文本修剪行为的值。 默认值为","The element on which to set the property value.":"设置属性值的元素。"," can convert the specified type to a ":"可以将指定类型转换为"," if pressing the TAB key inserts a tab character at the current cursor position; ":"如果按下选项卡键在当前光标位置插入一个选项卡字符；"," object is set on the property, the ":" 对象设置在属性上， "," object that specifies the currently effective typography variations. For a list of default typography values, see ":"指定当前有效版式变化的对象。 有关默认字体值列表，请参见","The object on which to set the ":"设置的对象"," to get binding groups for.  This method returns ":"获得绑定组。 此方法返回","The number of visual children hosted by the ":"视觉儿童的数量由","An object that provides the culture information that is used during conversion.":"提供转换过程中使用的文化信息的对象。"," if pressing the TAB key moves the focus to the next control that is marked as a tab stop and does not insert a tab character.  \n  \n The default value is ":"如果按下选项卡键将焦点移动到标记为标签停止的下一个控件，并且不会插入选项卡字符。 \n  \n  默认值是"," to convert to another type.":"转换为另一种类型。","The zero-based index of the line to retrieve the initial character index for.":"该行的基于零的索引，用于检索初始字符索引。"," to have the content remain stationary when the user drags the ":"当用户拖动用户时，要让内容保持静止"," objects that are associated with this element or its descendant elements.":"与此元素或其后代元素关联的对象。"," if automatic word selection is enabled; otherwise, ":"如果启用了自动单词选择； 否则，"," child to add to the collection.":"孩子要添加到收藏中。"," scrolls in terms of logical units; ":"滚动在逻辑单元方面；","The zero-based index for the first character in the specified line.":"指定行中第一个字符的基于零索引。","The index position of the item that is generated and made visible.":"生成和可见的项目的索引位置。"," if the most recent undo action can be redone; otherwise, ":"如果最新的撤消行动可以重做； 否则，"," objects that are associated with the specified element and have invalid values or target values have not been updated the source.":" 与指定元素关联且具有无效值或目标值的对象尚未更新源。","A point in ":"一个点"," scrolls in terms of physical units. The default is ":"滚动在物理单位方面。 默认值为"," coordinate-space for which to return an index.":"返回索引的坐标空间。"," if the specified property is data-bound; otherwise, ":"如果指定的属性是数据限制的； 否则，"," if the most recent action can be undone; otherwise, ":"如果最近的行动可以撤销； 否则，","The element to get the ":"获得的元素"," that indicates whether the horizontal scroll bar is visible. The default is ":"这表明水平滚动条是否可见。 默认值为"," attached property from.":"附有的属性。","The brush that is used to paint the caret of the text box.":"用于绘制文本框的套件的刷子。","The binding target of the binding.":"结合的结合目标。"," to return the nearest index if there is no character at the specified point; ":"如果指定点没有字符，则返回最近的索引；"," that indicates whether the vertical scroll bar is visible. The default is ":" 表示垂直滚动条是否可见。 默认值为 ","A floating-point value that specifies the vertical size of the visible content area, in device-independent units (1/96th inch per unit).  \n  \n The value of this property is 0.0 if the text-editing control is not configured to support scrolling.  \n  \n This property has no default value.":"浮点值指定可见内容区域的垂直尺寸，独立于设备的单位（每单位1/96英寸）。 \n  \n  如果未配置文本编辑控件以支持滚动，则此属性的值为0.0。 \n  \n  该属性没有默认值。","The target property of the binding.":"绑定的目标属性。","The size of the cache before and after the viewport when the ":"视口前后缓存的大小"," to return -1 if there is no character at the specified point.":"如果指定点没有字符，则返回-1。","The horizontal offset of the visible content.":"可见内容的水平偏移。","A floating-point value that specifies the horizontal size of the visible content area, in device-independent units (1/96th inch per unit).  \n  \n The value of this property is 0.0 if the text editing control is not configured to support scrolling.  \n  \n This property has no default value.":"浮点值指定可见内容区域的水平尺寸，独立于设备的单位（每单位1/96英寸）。 \n  \n  如果未配置文本编辑控件以支持滚动，则此属性的值为0.0。 \n  \n  该属性没有默认值。"," object that describes the binding.":"描述绑定的对象。"," should virtualize an item; otherwise, ":"应该虚拟化项目； 否则，","The index of the character that is closest to the specified point, or -1 if no valid index can be found.":"最接近指定点的字符的索引，如果找不到有效的索引，则为-1。","A floating-point value that specifies the horizontal scroll position, in device-independent units (1/96th inch per unit).  \n  \n Setting this property causes the text editing control to scroll to the specified horizontal offset. Reading this property returns the current horizontal offset.  \n  \n The value of this property is 0.0 if the text editing control is not configured to support scrolling.  \n  \n This property has no default value.":"浮点值指定水平滚动位置，以独立于设备的单位（每单位1/96英寸）。 \n  \n  设置此属性会导致文本编辑控件滚动到指定的水平偏移量。 阅读此属性返回当前的水平偏移。 \n  \n  如果未配置文本编辑控件以支持滚动，则此属性的值为0.0。 \n  \n  该属性没有默认值。","The vertical offset of the visible content.":"可见内容的垂直偏移。"," created for and associated with the specified property. The ":"为指定属性创建并关联。 这","The object from which the attached property value is read.":"读取所附属性值的对象。","The zero-based index for the first visible line in the text box.":"文本框中第一条可见行的基于零的索引。"," that represents the vertical size of the extent. The default is 0.0.":"这代表了范围的垂直大小。 默认值为0.0。","A value that is defined by the ":"由"," that represents the horizontal size of the extent. The default is 0.0.":"这代表了程度的水平尺寸。 默认值为0.0。"," is virtualizing its content; otherwise ":"正在虚拟化其内容； 否则"," class is the base class of ":" 类是基类 "," enumeration.  \n  \n The default value is ":"枚举。 \n  \n  默认值是"," if this control defines custom keyboard scrolling behavior; otherwise, ":"如果此控件定义自定义键盘滚动行为； 否则，","The zero-based index for the last visible line in the text box.":"文本框中最后一个可见行的基于零的索引。"," virtualizes the grouped items in its collection; otherwise, ":"虚拟化集合中的分组项目； 否则，","An object that replaces the ":"一个替代的对象"," that represents the horizontal offset of the scrolled content. The default is 0.0.":"这代表了滚动内容的水平偏移。 默认值为0.0。"," if the text box displays selected text when the text box does not have focus; otherwise, ":"如果文本框在文本框没有焦点时显示选定的文本； 否则，","The zero-based character index for which to retrieve the associated line index.":"基于零的字符索引，用于检索关联的线索引。","The element whose position to find.":"找到位置的元素。"," when an item container is removed from the visual tree.":"从视觉树中卸下项目容器时。"," value that indicates whether a horizontal ":"表示水平的值"," if the contents of the text editing control are read-only to a user; otherwise, the contents of the text editing control can be modified by the user. The default value is ":"如果文本编辑控件的内容仅对用户读取； 否则，用户可以修改文本编辑控件的内容。 默认值是","The zero-based index for the line that contains the specified character index.":"包含指定字符索引的行的零基索引。","The position of the specified item, relative to the ":"相对于指定项目的位置","The object that originated the event.":"起源于事件的对象。"," should be displayed. The default is ":"应该显示。 默认值为","The zero-based line index for which to return a character count.":"基于零的线索引，用于返回字符计数。"," if a read-only text box displays a caret; otherwise, ":"如果仅阅读文本框显示出面； 否则，","A value that indicates whether scrolling is measured as items in the collection or as pixels.":"一个值表示滚动是在集合中还是像素中测量滚动的值。","The collection to add. The default is an empty collection.":"要添加的集合。 默认值是一个空的集合。","The number of characters in the specified line.":"指定行中的字符数。"," reacts to touch manipulation.  The default is ":"反应触摸操纵。 默认值为"," if the text box has focus and selected text; otherwise, ":"如果文本框有焦点和选定的文本； 否则，","The object from which the ":"从中","The zero-based line index for which to retrieve the currently displayed text.":"基于零的行索引，用于检索当前显示的文本。","The ratio of scrolling offset to translate manipulation offset. The default is 1.":"滚动偏移的比率是翻译操作偏移的比例。 默认值为1。","The collection to be registered for cross-thread access.":"该集合要注册以进行跨线程访问。"," property is read.":"属性已阅读。"," if undo support is enabled; otherwise, ":"如果启用了撤消支持； 否则，","A string containing a copy of the text currently visible on the specified line.":"一个包含当前在指定行上可见的文本副本的字符串。","The parent of the collection to register.":"收集的父母要注册。","The brush that highlights selected text.":"突出显示选定文本的刷子。","One of the enumeration values that specifies whether the object uses container recycling.":"指定对象是否使用容器回收的枚举值之一。","The collection to access on a thread other than the one that created it.":"除了创建它的线程以外的线程上访问的集合。","The zero-based character index indicating a position from which to search for the next spelling error.":"基于零的字符索引表示搜索下一个拼写错误的位置。"," object that provides access to spelling errors in the text contents of a ":"提供对文本内容中拼写错误的访问的对象","The index position within the collection at which the child element is inserted.":"插入子元素的集合中的索引位置。","An object used to synchronize the collection.":"用于同步集合的对象。"," values that specifies the direction in which to search for the next spelling error, starting at the specified ":"指定搜索下一个拼写错误的方向的值，从指定的","The number of actions stored in the undo queue. The default is -1, which means the undo queue is limited to the memory that is available.":"存储在撤消队列中的动作数量。 默认值为-1，这意味着撤消队列仅限于可用的内存。","A delegate to the method that performs the operation on the collection.":"委派在集合上执行操作的方法。","The character index for the beginning of the next spelling error in the contents of the text box, or -1 if no next spelling error exists.":"文本框内容中下一个拼写错误的开始的字符索引，如果不存在下一个拼写错误，则为-1。"," writes to the collection; otherwise, ":"写信给该系列； 否则，","The zero-based character index of the character for which to retrieve the rectangle.":"基于零的字符索引，用于检索矩形的字符。","The underlying collection.":"基础系列。","A rectangle for the leading edge of the character at the specified character index, or ":"在指定字符索引处的字符前缘的矩形，或"," if the item belongs to the view; otherwise, ":"如果该项目属于视图； 否则，"," if a bounding rectangle cannot be determined.":"如果无法确定边界矩形。"," object that you can use to enumerate the items in the view.":"您可以用来列举视图中项目的对象。"}