{"The current drag point's X coordinate":"当前拖动点的X坐标","first character in array to measure":"数组中要测量的第一个字符","The transition to use for this scene change. A\n            value of null causes the scene change to happen with no transition.":"用于此场景更改的过渡。 A\n            null值将导致场景更改发生，而没有转换。","string containing input converted to HTML":"包含转换为HTML的输入的字符串","canvas on which the span should be rendered":"应该在其上呈现跨度的画布","the maximum size of the cache before returning. May be -1\n                       to evict even 0-sized elements.":"返回之前缓存的最大大小。 可能是-1\n                       驱逐甚至0大小的元素。","the proportion with which the text size is changed.":"更改文本大小的比例。","The maximum number of characters of ":"的最大字符数 ","the text size, either in physical pixels or device-independent pixels.":"文本大小，以物理像素或与设备无关的像素为单位。","how to move the cursor, one of CURSOR_AFTER,\n            CURSOR_AT_OR_AFTER, CURSOR_BEFORE,\n            CURSOR_AT_OR_BEFORE, or CURSOR_AT":"如何移动光标，CURSOR_AFTER之一,\n            CURSOR_AT_OR_AFTER，CURSOR_BEFORE,\n            CURSOR_AT_OR_BEFORE，或CURSOR_AT","true if the title only presents optional information.":"如果标题仅显示可选信息，则为true。","the day of the month (in the range [1,31])":"月份的某一天（在[1,31]范围内）","the formatter with the formatted date/time range appended to the string buffer.":"带有附加到字符串缓冲区的格式化日期/时间范围的格式化程序。","Specific items to place first as defined by\n                   queryIntentActivityOptions().":"根据以下定义，首先放置的特定项目\n                   queryIntentActivityOptions()。","true if the action view was expanded, false otherwise.":"如果操作视图已展开，则为true，否则为false。","\n                    if the frame is not presented yet.":"\n                    如果框架尚未呈现。"," field\n of this TransitionValues object and are keyed from\n a String value. For example, to store a view's rotation value,\n a transition might call\n ":" 领域\n 这个TransitionValues对象，并从\n 一个字符串值。 例如，存储视图的旋转值,\n 过渡可能会调用\n ","the intersection of this range and the other range":"该范围与另一范围的交点","The Context the transition is running in, through which it can\n                   access the current theme, resources, etc.":"过渡正在运行的上下文，通过它可以\n                   访问当前主题，资源等。","A String containing the name of the attribute, or null if the\n                    attribute cannot be found.":"包含属性名称的字符串，如果\n                    找不到属性。","True if x is greater than y, false otherwise":"如果x大于y，则为True，否则为false","The collection whose contents are to be used to determine which\n            values to keep.":"其内容将用于确定哪个集合的集合\n            要保持的价值观。","Returns true if this array map contains a key for every entry\n            in <var>collection</var>, else returns false.":"如果此数组映射包含每个条目的键，则返回true\n            在<var>collection</var>中，else返回false。","the typeface":"字体","Filled in with the smallest width and height\n            that the application will encounter, in pixels (not dp units).  The x\n            (width) dimension here directly corresponds to\n            ":"用最小的宽度和高度填充\n            应用程序将遇到的，以像素为单位（而不是dp单位）。  的x\n            （宽度）尺寸在这里直接对应于\n            "," if the View\n                             did not exist in the end state.":" 如果视图\n                             端状态中不存在。","the log tag to use while logging the timings":"记录计时时要使用的日志标记","Context to use to load the localized units":"用于加载本地化单元的上下文","The layout direction.":"的布局方向。","to compute the exponential of":"计算指数","The current drag point's Y coordinate":"当前拖动点的Y坐标","maximum number of characters to measure":"要测量的最大字符数","The scene which, when applied, will cause the given\n            transition to run.":"场景，当应用时，将导致给定的\n            过渡到运行。","paint used to draw text, which should be left unchanged on exit":"用于绘制文本的油漆，退出时应保持不变","the character sequence to append.":"要追加的字符序列。","The month.":"月份。","content description. The default value is null.":"内容描述。 默认值为null。"," to\n                                           consider from the input string. ":" 到\n                                           从输入字符串考虑。 ","color integer that defines the background color":"定义背景颜色的颜色整数","true if this action mode has been given a hint to consider the\n                    title/subtitle display to be optional.":"如果此操作模式已被提示考虑\n                    标题/字幕显示是可选的。","the Paint object that is requesting this information":"请求此信息的Paint对象","the zero-based month number (in the range [0,11])":"从零开始的月份编号（在[0,11]范围内）","a point in time in UTC milliseconds":"UTC毫秒的时间点","Intent describing the kinds of items to populate in the\n                   list as defined by queryIntentActivityOptions().":"意图描述要填充在\n                   由queryIntentActivityOptions()定义的列表。","the blending mode used to apply the tint to this item's icon":"用于将色调应用于此项目图标的混合模式","the numerator of the rational":"理性分子","the denominator of the rational":"理性的分母",". The target view will already be stored in\n the transitionValues structure when this method is called.":". 目标视图将已存储在\n 调用此方法时transitionValues结构。","The refresh period in nanoseconds.":"刷新周期以纳秒为单位。","The attributes of the XML tag that is inflating the transition.":"膨胀转换的XML标记的属性。","The resource identifier, 0 if none.":"资源标识符，如果没有，则为0。","The bits that represent the half-precision float value":"表示半精度浮点值的位","Returns true if the key exists, else false.":"如果键存在，则返回true，否则返回false。","last modified time in milliseconds since epoch.  Returns zero if\n                the file does not exist or an I/O error is encountered.":"自epoch以来的最后修改时间以毫秒为单位。  如果返回零\n                文件不存在或遇到I/O错误。","The font family for this typeface.  Examples include\n                          \"monospace\", \"serif\", and \"sans-serif\"":"这种字体的字体家族。  例子包括\n                          \"monospace\"，\"serif\"和\"sans-serif\"",", except the value here is in raw\n            screen pixels rather than dp units.  Your application may of course\n            still get smaller space yet if, for example, a soft keyboard is\n            being displayed.":"，除了这里的值在raw\n            屏幕像素而不是dp单位。  你的申请当然可以\n            仍然得到更小的空间，但如果，例如，软键盘是\n            正在显示。","The name of this transition.":"这个过渡的名称。","a string to be displayed with each log":"与每个日志一起显示的字符串","size value to be formatted, in bytes":"要格式化的大小值，以字节为单位","Offset to apply to the X axis.  If gravity is LEFT this\n                        pushes it to the right; if gravity is RIGHT it pushes it to\n                        the left; if gravity is CENTER_HORIZONTAL it pushes it to the\n                        right or left; otherwise it is ignored.":"偏移以应用于X轴。  如果重力离开这个\n                        把它推到右边；如果重力是对的，它就把它推到右边。\n                        左边;如果重力是CENTER_HORIZONTAL它推它到\n                        向右或向左；否则忽略。","The local state object sent to the system by startDragAndDrop().":"StartDragAndDrop()发送给系统的本地状态对象。","a float number":"浮点数","byte array of results for each character in src":"src中每个字符的结果字节数组","The transition that will play when the given scene is\n            entered. A value of null will result in the default behavior of\n            using the default transition instead.":"给定场景时将播放的过渡是\n            进去了。 Null值将导致默认行为\n            改为使用默认转换。","left position of the line relative to input canvas, in pixels":"线相对于输入画布的左侧位置，以像素为单位","the character to append.":"要追加的字符。","What day of the week the week should start.":"一周中的哪一天应该开始。","The content description.":"的内容描述。"," disables this\n                                           feature.":" 禁用此功能\n                                           特征。","The current ActionMode":"当前动作模式","the background color of this span.":"这个跨度的背景颜色。","a styled text.":"样式化的文本。","a bit mask of formatting options":"格式化选项的位掩码","Additional options controlling how the items are added.":"控制项目添加方式的其他选项。","the Julian day in the timezone for this Time object":"这个时间对象时区的儒略日","the tint applied to this item's icon":"应用于此项目图标的色调","the rational to be compared":"要比较的理性","The start time in nanoseconds or ":"以纳秒为单位的开始时间或 ","true when the ChangeBounds will resize by changing the clip bounds during the\n            view animation or false when bounds are changed. The default value is false.":"当ChangeBounds将通过在\n            更改边界时查看动画或false。 默认值为false。","the listener to be added to the current set of listeners\n            for this animation.":"要添加到当前侦听器集的侦听器\n            对于这个动画。","The half-precision float value represented by this object":"此对象表示的半精度float值","A String containing the namespace of the attribute, or null if th\n                    attribute cannot be found.":"包含属性命名空间的字符串，如果为null，则为\n                    找不到属性。","Returns true if the value exists, else false.":"如果值存在，则返回true，否则返回false。","the input array to decode":"要解码的输入数组","Filled in with the largest width and height\n            that the application will encounter, in pixels (not dp units).  Your\n            application may of course still get larger space than this if,\n            for example, screen decorations like the status bar are being hidden.":"用最大的宽度和高度填充\n            应用程序将遇到的，以像素为单位（而不是dp单位）。  你的\n            应用程序当然可能仍然得到比这更大的空间，如果,\n            例如，像状态栏这样的屏幕装饰正在隐藏。","the font family name":"字体家族名称","a label to associate with this split.":"与此拆分相关联的标签。","Algorithm object to use for determining how to interpolate in two\n                              dimensions. If null, a straight-path algorithm will be used.":"算法对象用于确定如何插入两个\n                              尺寸。 如果为null，则将使用直线路径算法。","Offset to apply to the Y axis.  If gravity is TOP this pushes\n                        it down; if gravity is BOTTOM it pushes it up; if gravity is\n                        CENTER_VERTICAL it pushes it down or up; otherwise it is\n                        ignored.":"偏移以应用于Y轴。  如果重力在顶部，这会推动\n                        它向下;如果重力是底部它推动它向上;如果重力是\n                        CENTER_VERTICAL它向下或向上推;否则它是\n                        被忽略了。","the base of the operation.":"操作的基础。"," if a drag event listener returned ":" 如果拖动事件侦听器返回 ","formatted string with the number":"带有数字的格式化字符串","array of characters to apply mirror operation":"要应用镜像操作的字符数组","The scene being exited when the given transition will\n            be run":"当给定的过渡将退出的场景\n            被运行","right position of the line relative to input canvas, in pixels":"线相对于输入画布的正确位置，以像素为单位","the first index of the subsequence of ":"的子序列的第一个索引 ","Canvas into which the span should be rendered.":"绘制跨度的画布。"," in response to\n            ":"响应","string containing the timezone to use.":"字符串包含要使用的时区。","The first day of the month using a constants such as\n              ":"一个月的第一天使用一个常数，如\n              ","Assuming maximum length of the string (in dip), assuming font size 42.\n                                This is roughly 50 characters for ":"假设字符串的最大长度（在dip中），假设字体大小为42。\n                                这大约是50个字符。 ","The item that was clicked":"被点击的项目","top position of the line relative to input canvas, in pixels":"线的最高位置相对于输入画布，以像素为单位","a start index of shaping target in the text.":"文本中目标的开始索引。","the distance, in pixels, between the bullet point and the paragraph.":"项目符号点与段落之间的距离（以像素为单位）。","Optional array in which to place the menu items\n                   that were generated for each of the <var>specifics</var> that were\n                   requested. Entries may be null if no activity was found for that\n                   specific action.":"用于放置菜单项的可选数组\n                   这是为每个<var>细节</var>生成的\n                   请求。 如果没有找到该项的活动，则条目可能为null\n                   具体行动。","Modifier associated with the numeric shortcut.":"与数字快捷方式关联的修饰符。","the UTC milliseconds for the beginning of the Julian day":"儒略日开始的UTC毫秒","ActionMode being created":"正在创建ActionMode","a string containing the formatted date/time.":"包含格式化日期/时间的字符串。","the listener invoked for all the callbacks, this must\n            not be null. If the listener implements the ":"为所有回调调用的侦听器，这必须\n            不是null。 如果侦听器实现 ","a negative integer, zero, or a positive integer as this object is less than,\n                    equal to, or greater than the specified rational.":"负整数、零或正整数，因为此对象小于,\n                    等于或大于指定值。","true if the transition should track the parent\n            container of target views and animate parent changes.":"如果过渡应跟踪父级，则为true\n            目标视图和animate父级更改的容器。","The number of menu items that were added.":"添加的菜单项数量。","This transition object.":"此过渡对象。","The value to hash":"哈希值","controls certain features of the decoded output.\n                          Pass ":"控制解码输出的某些特征。\n                          通行证 ","The action provider.":"行动提供者。","the ISO week number.":"ISO周数。","the elapsed time in seconds.":"经过几秒钟的时间。","A String containing the value of the attribute, or null if the\n                    attribute cannot be found.":"包含属性值的字符串，如果\n                    找不到属性。","The key of the value to retrieve.":"要检索的值的键。"," object to receive the metrics.":" 对象来接收所述度量。","the typeface set":"字体集","The algorithm object used to interpolate along two dimensions.":"用于沿二维插值的算法对象。","The value to apply the unit to.":"要应用单元的值。","Gravity constants to modify the placement within the\n            display.":"重力常数修改内的位置\n            显示。","A View on which the Transition will act, must be non-null.":"过渡将采取行动的观点，必须是无效的。","the exponent of the operation.":"运算的指数。","first character in array to mirror":"数组中镜像的第一个字符","The scene being entered when the given transition will\n            be run":"给定过渡时进入的场景将\n            被运行"," that is\n            appended.":" 这就是\n            附后。","Current text.":"当前文本。",". If the system did not send ":". 如果系统没有发送 ","Which column day is in.":"哪一栏日在.","a given Time object to compare against":"要与之比较的给定时间对象",".<br />\n                                Usually ellipsizing should be left to the view showing the string. If a\n                                string is used as an input to another string, it might be useful to\n                                control the length of the input string though. ":".<br/>\n                                通常ellipsizing应该留给显示字符串的视图。 如果一个\n                                字符串被用作另一个字符串的输入，它可能对\n                                控制输入字符串的长度。 ","baseline of the text relative to input canvas, in pixels":"文本相对于输入画布的基线（以像素为单位）","a length of shaping target in the text.":"在文本中塑造目标的长度。","the bullet point color, as a color integer":"子弹点颜色，作为颜色整数","Menu used to populate action buttons":"用于填充操作按钮的菜单","the divided value of the numerator and denominator as a ":"分子和分母的除以值作为一个 "," then it will also be set as the listener for\n            these callbacks (for example when using the ":" 然后它也将被设置为侦听器\n            这些回调（例如，当使用 ","Used to indicate whether the view bounds should be modified or the\n                              clip bounds should be modified by ChangeBounds.":"用于指示是否应修改视图边界或\n                              剪辑边界应通过ChangeBounds进行修改。","The newly added sub-menu":"新增的子菜单"," disables this\n                                feature.":"禁用这个 \n                                 特征。","bottom position of the line relative to input canvas, in pixels":"线相对于输入画布的底部位置，以像素为单位","A hash code value for a half-precision float value":"半精度浮点数值的哈希码值"," to decode standard Base64.":" 解码标准Base64。","This Item so additional setters can be called.":"此项因此可以调用其他setter。"," to recycle, or null to use a temporary one.":" 回收，或null使用临时的。"," if an item should not be in a group.":"如果一个物品不应该在小组中。","The namespace of the attribute to get the value from.":"要从中获取值的属性的命名空间。","Returns the value associated with the given key,\n            or null if there is no such key.":"返回与给定键关联的值,\n            如果没有这样的键，则为null。","true if anything was deleted; false otherwise.":"如果删除了任何内容，则为true；否则为false。","the url string":"url字符串","View to use for presenting this item to the user.":"查看用于向用户展示此项目的使用。","Set to the real size of the display.":"设置为显示器的真实尺寸。","The class used to determine the start delay of\n                                         Animators created by this Transition. A null value\n                                         indicates that no delay should be used.":"用于确定启动延迟的类\n                                         由这种过渡创建的动画师。 空值\n                                         表示不应使用延迟。","Current display metrics to use in the conversion -- \n                           supplies display density and scaling information.":"要在转换中使用的当前显示指标 -- \n                           提供显示密度和缩放信息。","The rectangle of the display in which the object is\n            being placed.":"对象所在的显示器的矩形\n            被放置。"," if you do not need a unique ID.":"如果您不需要唯一的ID。","to compute sqrt of":"计算sqrt","The Transition to which the target is added.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).addTarget(someView);</code>":"目标添加到的过渡。\n            返回相同的对象使得在过程中链式调用更容易\n            建筑，如\n            <code>transitionSet。addTransitions(new Fade())。addTarget(someView);</code>","maximum number of characters to mirror":"要镜像的最大字符数","The complex floating point value multiplied by the appropriate \n            metrics depending on its unit.":"复杂的浮点值乘以适当的 \n             指标取决于其单元。","A start delay to use with the Animator created by <code>transition</code>. The\n            delay will be offset by the minimum delay of all <code>TransitionPropagation</code>s\n            used in the Transition so that the smallest delay will be 0. Returned values may be\n            negative.":"用于<code>transition</code>创建的动画器的启动延迟。 该\n            延迟将被所有<code>TransitionPropagation</code>s的最小延迟所抵消\n            在过渡中使用，以便最小的延迟将是0。 返回的值可能是\n            否定。","Start character index for span.":"Span的开始字符索引。","the last index of the subsequence of ":"的子序列的最后一个索引 "," if you do not care about the\n                   order. See ":"如果您不在乎 \n                    命令。 看"," before\n            ":" 以前\n            ","The row, 0-5, starting from the top.":"行，0-5，从顶部开始。","true if this time is greater than the given time":"如果此时间大于给定时间，则为true","a text direction.":"个文字方向。","A non-null child transition to be added to this set.":"将添加到该集合中的非无效的儿童过渡。","the bullet point color, as a color integer.":"的子弹点颜色，作为颜色整数。","The current ActionMode being destroyed\n":"正在销毁的当前ActionMode\n"," if this rational is a (positive or negative) infinite value;\n                    ":" 如果这个理性是一个（正或负）无限值;\n                    ","true if this time is less than the given time":"如果这段时间小于给定时间",", or if the listener returned ":"，或者如果听众返回"," created from\n            ":" 创建于\n            ","Set to true to track parent changes or false to only track changes\n                            of the transitioning view without considering the parent change.":"设置为true以跟踪父更改或false以仅跟踪更改\n                            在不考虑父级变化的情况下过渡视图。","Flags controlling cleaning behavior (Can be ":"控制清洁行为的标志（可以是 ","The column, 0-6, starting from the left.":"列，0-6，从左侧开始。","current text":"当前文本","An integer":"一个整数","the timezone to use.":"使用时区。","the input String to decode, which is converted to\n                          bytes using the default charset":"要解码的输入字符串，将其转换为\n                          使用默认字符集的字节","the base time":"基准时间"," if this is a finite number value (or ":"如果这是有限的数字值（或","whether parent changes will be tracked by the ChangeTransform.":"父级更改是否会由Changetransform跟踪。",",\n                         and ":"，，，， \n                          和","The name of the attribute to get the value from.":"要从中获取值的属性的名称。","Returns the index of the key if it exists, else a negative integer.":"如果存在，则返回键的索引，否则返回负整数。","The text view.":"的文本视图。","first ":"第一的","the url string.":"的url字符串。"," used to calculate Animator start\n            delays. This is null by default.":" 用于计算Animator start\n            延误。 默认情况下为null。","The day at a particular row, column":"特定行的一天"," object to receive the size information.":" 对象来接收所述尺寸信息。","Layout resource to use for presenting this item to the user.":"用于向用户呈现此项的布局资源。","Supplies the current object position; returns with it\n            modified if needed to fit in the display.":"提供当前对象位置；随其返回\n            如果需要修改以适应显示器。","Spannable whose text is to be marked-up with links":"跨度可以通过链接标记其文本","The class on which the Property is declared.":"声明属性的类。","the listener to be removed from the current set of\n            listeners for this transition.":"从当前组中删除的听众 \n             这个过渡的听众。","The type to include when running this transition.":"运行此转换时要包含的类型。"," if this rational is a <em>Not-a-Number (NaN)</em> value;\n                    ":"如果此理性为<em> not-a-number（nan）</em>值；","true if replacements were made":"如果更换，则为true","CharSequence The coerced string value.  If the value is\n                    null or the type is not known, null is returned.":"CharSequence强制字符串值。  如果值为\n                    null或类型未知，则返回null。","End character index for span.":"Span的结束字符索引。","The identifier to find.":"的标识符来查找。","Mask to define which kinds of links will be searched.":"掩码以定义将搜索哪些链接。","a consumer of the shape result.":"形结果的消费者。","a reference to this object.":"对此对象的引用。","This transitionSet object.":"此transitionSet对象。","the radius of the bullet point, in pixels.":"子弹点的半径，以像素为单位。","ActionMode being prepared":"正在准备的行动模式","Edge of the replacement closest to the leading margin.":"替换的边缘最接近领先边缘。","whether longpress should be enabled.":"是否应启用longpress。"," object in which to put the DragEvent object.":" 放入DragEvent对象的对象。","start character index of the line":"行的开始字符索引","the data to decode":"要解码的数据","the CharSequence.":"魅力。","the radius, in pixels, of the bullet point.":"子弹点的半径，像素。","True if at least one link is found and applied.":"如果找到并应用了至少一个链接，则为正确。","The menu item object, or null if there is no item with\n                    this identifier.":"菜单项对象，或null如果没有任何项 \n                     这个标识符。","the text to truncate":"截断的文字","The half-precision float value with the same bit pattern":"具有相同位模式的半精度浮点数值","how to format the date portion.":"如何格式化日期部分。","The cleaned string":"清洁的字符串","Flags to store in the Parcel.":"旗帜存放在包裹中。","<code>true</code> when a changed parent should execute the\n                                       transition inside the scene root's overlay or <code>false</code>\n                                       if a parent change only affects the transform of the transitioning\n                                       view.":"<code>true</code>当更改的父级应该执行\n                                       场景根复盖或<code>false</code>内的过渡\n                                       如果父级更改只影响转换的转换\n                                       视图。"," instance to compare":" 实例进行比较","What to return if the \"id\" attribute isn't found.":"如果找不到\"id\"属性，返回什么。","The desired index, must be between 0 and ":"所需的索引，必须介于0和 ","The text buffer.":"的文本缓冲区。","Which row (0-5).":"哪一行（0-5）。","the position of the rounded corner on the display.":"圆角在显示器上的位置。","The alphabetic shortcut key. This is the shortcut when\n                   using a keyboard with alphabetic keys.":"字母快捷键。 这是捷径当\n                   使用带有字母键的键盘。","<code>true</code> when a changed parent should execute the transition\n            inside the scene root's overlay or <code>false</code> if a parent change only\n            affects the transform of the transitioning view.":"<code> true </code>当更改的父何时应执行过渡 \n             在场景内部的覆盖物或<code> false </code>中，如果父母仅更改 \n             影响过渡视图的转换。","The gravity to convert to absolute (horizontal) values.":"转换为绝对（水平）值的重力。","The value to be represented by the ":"由 ","The Transition to which the target class was added.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).addTarget(ImageView.class);</code>":"目标类添加到的过渡。\n            返回相同的对象使得在过程中链式调用更容易\n            建筑，如\n            <code>transitionSet。addTransitions(new Fade())。addTarget（ImageView。类);</代码>","Returns the key stored at the given index.":"返回以给定索引存储的密钥。","The target view, must be non-null.":"目标视图必须是非null。","int Resulting value.":"int结果值。"," if this is a (potentially infinite) number value":" 如果这是一个（可能是无限的）数字值","the rounded corner of the given position. Returns ":"给定位置的圆角。 返回","used to retrieve the current Locale and Resources.":"用于检索当前区域设置和资源。","The data type identifier.":"的数据类型标识符。","The modifier associated with the shortcut. It should\n                   be a combination of ":"与快捷方式关联的修饰符。 它应该 \n                    合并","A string to be converted to a ":"要转换为一个的字符串","gravity converted to absolute (horizontal) values.":"重力转换为绝对（水平）值。","true if the item backed by this provider should have an associated submenu":"如果此提供程序支持的项应具有关联的子菜单，则为true","The position of the Transition to retrieve.":"过渡的位置来检索。","Top of the line.":"最重要的。","true if longpress is enabled, else false.":"如果启用longpress，则为true，否则为false。","Transition The Transition from which the target is removed.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).removeTarget(someView);</code>":"过渡到取出目标的过渡。 \n             返回相同的对象使得更容易在链条 \n             建筑，例如 \n             <code> transitionSet.AddTransitions（new Fade（））。removetArget（someview）; </code>","the position within the input array at which to start":"输入数组中要启动的位置"," if this rational is finite zero value;\n                    ":"如果此合理为有限的零值；","TextView whose text is to be marked-up with links":"要用链接标记文本的TextView","the bullet point color":"子弹点颜色","end character index of the line":"行的结束字符索引","the Paint with which to measure the text":"用来测量文本的油漆"," if child transitions will play at the same\n            time, ":"如果儿童过渡会在相同的 \n             时间，","Set to true to allow a check mark, false to\n                       disallow. The default is false.":"设置为true以允许检查标记，false \n                        不允许。 默认值为false。","Baseline.":"基线。","the gravity to check for horizontal pull":"检查水平拉力的重力","start index, inclusive.":"开始索引，包括在内。","The index of the menu item to return.":"返回的菜单项的索引。","the current position of the margin":"边缘的当前位置","The current motion event.":"当前的运动事件。","line number in the current text layout":"当前文本布局中的行号","how to format the time portion.":"如何格式化时间部分。","True if the value is a NaN, false otherwise":"如果值是NaN，则为True，否则为false","the number of bytes of input to decode":"分解输入的字节数","second ":"第二 ","Bottom of the line.":"行的底部。","the string to split":"要拆分的字符串"," if they will play in sequence.":"如果他们将按顺序播放。","The root of the tree in which to search":"要在其中搜索的树的根","the base direction of the paragraph; if negative, the margin\n is to the right of the text, otherwise it is to the left.":"段落的基本方向； 如果负数，边距 \n  是在文本的右边，否则是左侧。","True if the event was handled.":"如果事件已处理，则为True。","the horizontal width available for the text (in pixels)":"可用于文本的水平宽度（以像素为单位）","the digits of the month to display in one\n            of the 6 rows of a calendar month display.":"要在一个月内显示的数字\n            一个日历月的6行显示。","The id of a target view, must be a positive number.":"目标视图的id必须是正数。","True if the value is positive infinity or negative infinity,\n                    false otherwise":"如果值为正无穷大或无穷大，则为true， \n                     否则为错误","The root of the View hierarchy running the transition.":"运行过渡的视图层次结构的根。","the length to check, must not be negative and not greater than\n                       ":"检查的长度不得是负面的，也不大于"," consumed the event,\n                         else false.":"消费活动， \n                          否则错误。","this writer.":"这位作家。","The key under which to store the value.  If\n            this key already exists in the array, its value will be replaced.":"存储值的密钥。  如果\n            这个键已经存在于数组中，它的值将被替换。","The data value.":"的数据值。"," if there is none.":" 如果没有。","the number of entries in the auto text dictionary":"自动文本字典中的条目数","A half-precision float value":"半精度浮点数值","The Transition to which the targetId is added.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).addTarget(someId);</code>":"添加靶标的过渡。 \n             返回相同的对象使得更容易在链条 \n             建筑，例如 \n             <code> transitionSet.AddTransitions（new Fade（））。addtarget（someid）; </code>","the string for \"1 more\" in the current locale":"当前语言环境中的“ 1个”字符串","true if all chars in the range are to be considered in a RTL direction,\n                     false otherwise.":"如果要在RTL方向上考虑该范围内的所有字符，则是真的 \n                      否则为错误。","X coordinate from which to start the search":"x坐标从哪些开始搜索","true if the MenuItem this ActionProvider is bound to is visible, false if\n                    it is invisible. The default implementation returns true.":"如果此ActionProvider绑定到的MenuItem可见，则为true，如果\n                    它是看不见的。 默认实现返回true。","True if the value is normalized, false otherwise":"如果值归一化，则为true，否则为错误","The type of the target view, must be non-null.":"目标视图的类型必须是非null。","The context locale.":"上下文环境。","the string representation of a rational value.":"有理值的字符串表示形式。","True if the display is still valid.":"如果显示仍然有效，则为true。","mask to define which kinds of links will be searched":"掩码以定义将搜索哪些类型的链接","Set to true to display a check mark, false to hide\n                           it.  The default value is false.":"设置为true显示复选标记，false隐藏\n                           它。  默认值为false。","true if the supplied gravity has an horizontal pull":"如果提供的重力具有水平拉力，则为true","True if x is less than y, false otherwise":"如果x小于y，则为false，否则为否则","the string for \"%d more\" in the current locale":"当前语言环境中的“％d”字符串","The transitionName of a target view, must be non-null.":"目标视图的过渡名称必须是非零的。","the char array.":"char阵列。","The menu item.":"的菜单项。","the start of the span":"跨度的开始","Y coordinate from which to start the search":"y协调从哪些启动搜索","Transition The Transition from which the target is removed.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).removeTarget(someType);</code>":"过渡到取出目标的过渡。 \n             返回相同的对象使得更容易在链条 \n             建筑，例如 \n             <code> transitionSet.AddTransitions（new Fade（））。removetArget（lody stype）; </code>","the data to encode":"要编码的数据","Paint instance.":"油漆实例。","how to format the time portion.\n":"如何格式化时间部分。\n","Whether the context directionality is RTL.":"上下文方向性是否为rtl。","The display's name.":"显示的名称。","the top of the line":"行的顶部","The Transition to which the target transitionName is added.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).addTarget(someName);</code>":"添加目标过渡名称的过渡。 \n             返回相同的对象使得更容易在链条 \n             建筑，例如 \n             <code> transitionSet.AddTransitions（new Fade（））。addtarget（somename）; </code>","The transition to be removed.":"要移除的过渡。","the regular expression to match":"要匹配的正则表达式","the line height":"线高","Direction to look":"看的方向","The Transition from which the targetId is removed.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).removeTargetId(someId);</code>":"从中取出靶标的过渡。 \n             返回相同的对象使得更容易在链条 \n             建筑，例如 \n             <code> transitionSet.AddTransitions（new Fade（））。removetArgetID（SONEID）; </code>","Which row day is in.":"哪一行的日子。","Font metrics, can be null.":"字体指标可以为null。"," to use to help check.\n":"用于帮助检查。","a negative result if ":"一个负面的结果，如果 ","The keyboard meta states used for movement.":"用于移动的键盘元状态。","The transition that created the Animator":"创建动画师的过渡","the listener invoked for all the callbacks, or null to stop\n                       listening for context clicks.":"为所有回调调用的侦听器，或null停止\n                       监听上下文点击。","orientation of this display.":"此显示的方向。","an array of strings. The array will be empty if text is empty":"一系列字符串。 如果文本为空，则数组将为空","Localized version of \"AM\" or \"PM\".":"“ AM”或“ PM”的本地化版本。","The holder for any values that the Transition\n            wishes to store. Values are stored in the <code>values</code> field\n            of this TransitionValues object and are keyed from\n            a String value. For example, to store a view's rotation value,\n            a transition might call\n            <code>transitionValues.values.put(\"appname:transitionname:rotation\",\n            view.getRotation())</code>. The target view will already be stored in\n            the transitionValues structure when this method is called.":"持有人的任何值 \n             希望存储。 值存储在<code>值</code>字段中 \n             此过渡值对象，并从 \n             字符串值。 例如，要存储视图的旋转值， \n             过渡可能会打电话 \n             <code> transitionValues.values.put（“ appName：transitionName：旋转”， \n             view.getRotation（））</code>。 目标视图已经存储在 \n             调用此方法时的过渡值结构。","the name of the forthcoming value. May not be null.":"即将到来的值的名称。 可能不是null。","The value to store for the given key.":"为给定键存储的值。","String The coerced string value.  If the value is\n                    null or the type is not known, null is returned.":"字符串强制字符串值。  如果值为\n                    null或类型未知，则返回null。"," is earlier, a positive result if\n                    ":"是较早的，如果","font metrics of the paint, in integers":"油漆的字体指标，整数","The transitionName of a target view, must not be null.":"目标视图的过渡名称不得无效。","The absolute value of the specified half-precision float":"指定的半精度浮点数的绝对值","A new action view.":"新的操作视图。","the key code from ":"来自","the rational value represented by ":"表示的理性值 ","function used to create ":"用于创建的函数 ","The new content description.":"的新内容描述。",",\n                          ":"，，，，","a string containing only whitespace.":"仅包含空格的字符串。","The values for a specific target in the start scene.":"开始场景中特定目标的值。","True if x is less than or equal to y, false otherwise":"如果x小于或等于y，则为True，否则为false","the string to split\n":"拆分的字符串","The root of the transition hierarchy.":"过渡层次结构的根。","Returns the old value that was stored for the given key, or null if there\n            was no such key.":"返回给定键存储的旧值，或者如果在那里为null \n             不是这样的关键。","the listener invoked for all the callbacks, or\n                   null to stop listening for double-tap gestures.":"听众调用所有回调，或者 \n                    零以停止收听双击手势。","the length to check, must not be negative and not greater than\n                     ":"要检查的长度，不得为负，不得大于\n                     ","One of the constants defined in ":"定义的常数之一","controls certain features of the encoded output.\n                          Passing ":"控制编码输出的某些特征。\n                          传球 "," to use to help check.":"用于帮助检查。","the gravity to check for vertical pull":"检查垂直拉力的重力","first CharSequence to check":"首先检查CharSequence","CharSequence whose directionality is to be estimated.":"CharSequence，其方向性是要估计的。","the baseline of the line":"线的基线","MenuItem to create the action view for":"menuitem创建动作视图"," is earlier, or 0 if they are equal.":"是较早的，如果它们相等，则为0。"," to play this set's child\n            transitions together, ":" 来玩这一套的孩子\n            一起过渡, ","Width of the span.":"跨距的宽度。","The values for the target in the end scene.":"最终场景中目标的值。","the default paint for the layout.  Styles can override\n            various attributes of the paint.":"布局的默认油漆。 样式可以覆盖 \n             油漆的各种属性。","The down motion event of the first tap of the double-tap.":"双击的第一次点击的下调事件。",".\n                          Note that in most languages, ":"。 \n                           请注意，在大多数语言中，","Regex pattern to be used for finding links":"将用于查找链接的正则模式","The width of the size, in pixels":"大小的宽度，像素","true if the supplied gravity has a vertical pull":"如果提供的重力有垂直拉力，则是真的","The array whose contents are to be retrieved.":"要检索的内容的数组。","Offset from the <x, y> to the edge of the nearest view. Note that this array\n                   may already be populated with values.":"从<x,y>偏移到最近视图的边缘。 注意这个数组\n                   可能已经填充了值。","Whether the row and column fall within the month.":"行和列是否落在月份内。","The state of the display: one of ":"显示的状态：之一","a finite value. May not be ":"有限的价值。 未必","The larger of the two specified half-precision values":"两个指定的半精度值中的较大","Identifier associated with the menu item.":"与菜单项关联的标识符。","the format string, as described in ":"格式字符串，如所述","The key code.":"的关键代码。","The smallest half-precision float value toward negative infinity\n                    greater than or equal to the specified half-precision float value":"朝向负无穷大的最小半精度浮点数值\n                    大于或等于指定的半精度浮点数值","second CharSequence to check":"检查第二个","a string containing the desired format.":"包含所需格式的字符串。","A complex data value holding a unit, magnitude, and \n                        mantissa.":"一个复杂的数据值，包含一个单位、大小和 \n                        尾数。","drawable to be rendered":"可绘制呈现","A Animator to be started at the appropriate time in the\n            overall transition for this scene change. A null value means no animation\n            should be run.":"在适当时间开始的动画师 \n             这个场景的整体过渡变化。 零值意味着没有动画 \n             应该运行。","The Transition from which the targetName is removed.\n            Returning the same object makes it easier to chain calls during\n            construction, such as\n            <code>transitionSet.addTransitions(new Fade()).removeTargetName(someName);</code>":"从其中删除targetName的过渡。\n            返回相同的对象使得在过程中链式调用更容易\n            建筑，如\n            <code>transitionSet。addTransitions(new Fade())。removeTargetName(someName);</code>","If true then the item will be invokable; if false it is\n                   won't be invokable.":"如果为true，则该项目将是不可调用的;如果为false，则为\n                   不会被调用的。","the date to format":"格式的日期","The number of days in the month.":"当月的天数。","the wrapping width for the text.":"文本的包装宽度。","The nearest touchable view, or null if none exists.":"最近的可触摸视图，如果不存在，则无效。","The view that was clicked.\n":"点击的视图。"," results in output that\n                          adheres to RFC 2045.":" 结果输出\n                          遵守RFC2045。","The motion event that occurred during the double-tap gesture.":"双击手势期间发生的运动事件。","URL scheme string (eg <code>http://</code>) to be\n                                 prepended to the links that do not start with this scheme.":"URL方案字符串（例如<code> http：// </code>）为 \n                                  备用到不以此方案开头的链接。"," used for the icon.":"用于图标。","the horizontal scale factor.":"水平量表因子。","The first half-precision float value to compare.":"比较的第一个半精度浮点值。"," unless this writer is lenient.":"除非这位作者宽大。"," to play the child\n            transitions in sequence.":" 扮演孩子\n            按顺序过渡。","The speed at which propagation occurs, relative to the duration\n                                    of the transition. A speed of 4 means it works 4 times as fast\n                                    as the duration of the transition. May not be 0.":"相对于持续时间，发生传播的速度 \n                                     过渡。 4的速度意味着其工作速度的4倍 \n                                     作为过渡的持续时间。 可能不是0。","'s estimated overall directionality is RTL. Otherwise returns\n                     false.":"估计的总体方向性是RTL。 否则返回\n                     错误。","the bottom of the line":"底线","The number of pixels specified by the data and its desired\n            multiplier and units.":"数据指定的像素数及其所需的 \n             乘数和单位。","context used to retrieve the drawable from resources":"用于从资源中检索可绘制的上下文","The height of the size, in pixels":"大小的高度，以像素为单位","true if a and b are equal":"如果A和B相等，则为","Url scheme string (eg ":"URL方案字符串（例如","The down motion event of the single-tap.":"单打的下调事件。","the new action view":"新操作视图","The map whose contents are to be retrieved.":"要检索其内容的地图。","String whose directionality is to be estimated.":"将要估计的方向性的字符串。","The second half-precision float value to compare":"比较的下半精度浮点值","the literal string value, or null to encode a null literal.":"文字字符串值或编码null文字的null。","The new icon (as a Drawable) to be displayed.":"要显示的新图标（作为绘制）。"," containing the requested text":"包含请求的文字","Contains focused. Cannot be null.":"包含重点。 不能无效。","\n                          will return the same as ":"\n                          将返回相同的 ","The number of child transitions in the TransitionSet.":"过渡集中的儿童过渡数量。","the position within the input array at which to\n                          start":"输入阵列中的位置 \n                           开始","Additional option flags or 0.":"附加选项标志或0。","the insets from each edge which avoid the display cutout as returned by\n                              ":"从每个边缘插入，避免显示切口返回\n                              ","The smaller of the two specified half-precision values":"两个指定的半精度值中较小的一个","a String containing the current time expressed in the current locale.":"包含在当前区域设置中表示的当前时间的字符串。","the start of the line":"线的开始"," to be\n                      prepended to the url of links that do not have\n                      a scheme specified in the link text":"成为 \n                       备用到没有的链接的URL \n                       链接文本中指定的方案","Submenu that will be displayed":"将显示的子菜单","the input text containing \"^1\"-style\n            placeholder values.  This object is not modified; a copy is\n            returned.":"包含“^1”风格的输入文本 \n             占位符价值。 此对象未修改； 副本是 \n             回来。","The duration set on this transition, in milliseconds, if one has been\n            set, otherwise returns a negative number.":"在此过渡上设置的持续时间，以毫秒为单位，如果一个已经\n            置，否则返回负数。","A complex data value.":"复杂的数据值。","the string representation of a size value.":"大小值的字符串表示。","The callback to use to find the epicenter of the Transition.":"用于查找过渡的震中的回调。","The value ":"价值","whether to left, right, or center the text.  Styles can\n            override the alignment.":"是向左、向右还是居中文本。  样式可以\n            复盖对齐。","The offset from displaying everything starting on the very first\n              box.  For example, if the calendar is set to display the first day of\n              the week as Sunday, and the month starts on a Wednesday, the offset is 3.":"从第一个开始显示所有内容的偏移量\n              盒子。  例如，如果日历设置为显示\n              星期为星期日,月份从星期三开始,偏移量为3.","The behavior of this transition, a combination of\n            ":"这种转变的行为，结合\n            ","Used to identify the source of a log message.  It usually identifies\n                   the class or activity where the log call occurs.":"用于识别日志消息的来源。 它通常可以识别 \n                    日志呼叫发生的类或活动。","the meta key state":"元键状态","the number of bytes of input to encode":"要编码的输入字节数","the end of the line":"线的末端","The TransitionValues object that holds the information by\n            which visibility is determined.":"通过 \n             确定哪些可见性。","This ContextMenu so additional setters can be called.":"这个ContextMenu所以可以调用额外的setter。","The string to be parsed":"要解析的字符串","An integer constant describing the style for this span. Examples\n                         include bold, italic, and normal. Values are constants defined\n                         in ":"一个整数常量，用于描述此跨度的样式。 例子：\n                         包括粗体，斜体和正常。 值是定义的常量\n                         在 ","A floating point value corresponding to the complex data.":"与复杂数据相对应的浮点值。","the size value represented by ":"大小值代表","The down motion event.\n":"的下运动事件。\n","the epicenter as specified by the\n            ":"由","drawable resource id based on which the drawable is retrieved":"可绘制资源id，根据其检索可绘制资源","The key of the mapping to remove.":"映射的键来移除。","in milliseconds since Jan 1, 1970 GMT":"格林尼治标准时间1970年1月1日以来的毫秒","Whether the context directionality is RTL":"上下文方向性是否为RTL","the parcel":"包裹","A half-precision float value represented by the string":"字符串表示的半精度浮点值","The message you would like logged.":"您想要记录的消息。","meta keys to clear, may be a combination of ":"元密钥清除，可能是","The new icon (as a resource ID) to be displayed.":"要显示的新图标（作为资源ID）。",".\n                          Undefined lengths will return ":".\n                          未定义的长度将返回 "," or null if no callback exists.":"或如果不存在回调，则为null。","drawable's Uri source":"可绘制的URI来源","Has focus now.":"现在集中注意力了。","The complex floating point value multiplied by the appropriate \n            base value depending on its unit.":"复杂的浮点值乘以适当的 \n             基本价值取决于其单位。","Returns the value that was stored under the key, or null if there\n            was no such key.":"返回存储在密钥下的值 \n             不是这样的关键。","If the given identifier exists and is shown, returns\n                    true; else returns false.":"如果给定的标识符存在并显示，则返回\n                    true;else返回false。","The filter that is used to allow the client code\n                      additional control over which pattern matches are\n                      to be converted into links.\n":"用于允许客户端代码的筛选器\n                      额外控制哪些模式匹配是\n                      要转换成链接。\n","The value of the specified half-precision float rounded to the nearest\n                    half-precision float value":"指定的半精度浮子的价值舍入到最近的 \n                     半精度的浮点值","CharSequences substituted into the template.  The\n            first is substituted for \"^1\", the second for \"^2\", and so on.":"CharSequences代入模板。  该\n            第一个被替换为\"^1\"，第二个被替换为\"^2\"，依此类推。","\n                          but may return something different in the future.":"但是可能会在将来返回一些不同的东西。","the blending mode used to apply the tint, may be\n                            ":"用于应用色调的混合模式可能是","true if this ActionProvider overrides the visibility of the MenuItem\n                    it is bound to, false otherwise. The default implementation returns false.":"如果此ActionProvider复盖MenuItem的可见性，则为true\n                    它是必然的，否则是错误的。 默认实现返回false。","the left bounding rect of the display cutout in pixels. If null is passed,\n                             it's treated as an empty rectangle (0,0)-(0,0).":"显示切口的左边界矩形（以像素为单位）。 如果传递null,\n                             它被视为一个空矩形（0,0）-（0,0）。","string in the RFC 3339 format.":"RFC3339格式的字符串。"," is numerically equal to ":" 在数值上等于 ","Key event message.":"关键事件消息。","The collection whose contents are to be used to remove keys.":"内容的集合用于删除密钥。","The complex unit type.":"复杂的单元类型。","The time interpolator used by the transition":"过渡使用的时间内插器","factor by which to scale the font size to get the\n            default line spacing":"缩放字体大小以获得\n            默认行间距","the first object in the Pair":"对中的第一个对象","one of the constants for HOUR, MINUTE, SECOND, etc.":"一个小时，分钟，第二等的常数之一。","the new CharSequence produced by doing the replacement":"通过进行替换产生的新char序列","A Path along which the points should be interpolated. The returned Path\n            must start at point <code>(startX, startY)</code>, typically using\n            ":"点应该被插值的路径。 返回的路径\n            必须从点<code>(startX,startY)</code>开始，通常使用\n            ","True if the view reference by <code>values</code> is visible,\n            false otherwise.":"如果视图引用<code>值</code>可见，则为True,\n            否则是假的。","true if this is the first line of its paragraph":"如果这是其段落的第一行，则为true","the top bounding rect of the display cutout in pixels.  If null is passed,\n                             it's treated as an empty rectangle (0,0)-(0,0).":"以像素为单位的显示切口的顶部边界rect。 如果通过了无效， \n                              它被视为一个空矩形（0,0） - （0,0）。","the InputStream to read the source data from":"读取源数据的输入流"," to clear tint":"清除色调","The resource identifier used for the icon.":"用于图标的资源标识符。","The first down motion event that started the fling.":"开始一扔的第一个向下运动事件。","width":"阔度","Context for the application":"应用程序的上下文","the locale into which the skeleton should be localized":"骨架应本地化到的区域设置","the current meta state bits.":"当前元状态位。","Whether directionality \"reset\" should also be done before a string being\n            bidi-wrapped, not just after it.":"是否方向性\"重置\"也应该在字符串之前完成\n            bidi-wrapped，而不仅仅是在它之后。","An exception to log":"日志的异常","drawable resource id based on which the drawable is retrieved.":"可绘制资源id，根据其检索可绘制资源。","The behavior supported by this transition, a combination of\n                        ":"这种过渡支持的行为，结合","The target to ignore when running this transition.":"运行此转换时要忽略的目标。"," and end at <code>(endX, endY)</code>.":"并在<code>（endx，endy）</code>结束。","Direction to look.":"方向看。","The body of text against which the pattern\n                  was matched":"模式所针对的文本正文\n                  被匹配","an integer in which each bit set to one represents a pressed\n                    or locked meta key.":"一个整数，每个位设置为一个代表一个按压 \n                     或锁定的元密钥。","listener to set":"要设置的侦听器","The half-precision float value to convert to single-precision":"要转换为单精度的半精度浮点值",",\n                          or ":",\n                          或 ",", a\n                     value less than ":"，一\n                     值小于 ","The root of the transition hierarchy":"过渡层次结构的根","true if this value is a color":"如果此值是颜色，则为true","The keycode of the shortcut key.":"快捷键的键码。","Returns true if any keys were removed from the array map, else false.":"如果从数组映射中删除了任何键，则返回true，否则返回false。","A list of zero or more of ":"零个或多个 ","the second object in the pair":"对中的第二个对象","the maximum value for the field.":"字段的最大值。","true if the request is for the first line of a paragraph,\n false for subsequent lines":"如果请求是针对段落的第一行，则为true,\n 对于后续行false","The text that should be checked for caps modes.":"应该检查caps模式的文本。","amount to add to the default line spacing":"添加到默认行间距的数量","the right bounding rect of the display cutout in pixels.  If null is\n                             passed, it's treated as an empty rectangle (0,0)-(0,0).":"显示切口的右边界矩形（以像素为单位）。  如果null为\n                             通过，它被视为一个空矩形（0,0）-（0,0）。","The character sequence used for the title.":"用于标题的字符序列。","The move motion event that triggered the current onFling.":"触发当前onFling的move运动事件。","a skeleton as described above":"如上所述的骨架","bit flags for controlling the decoder; see the\n                   constants in ":"用于控制解码器的位标志；请参阅\n                   常量在 ","the canvas":"画布","The width of the size":"尺寸的宽度","the bottom bounding rect of the display cutout in pixels.  If null is\n                              passed, it's treated as an empty rectangle (0,0)-(0,0).":"以像素为单位的显示切口的底部边界rect。 如果为null \n                               通过，它被视为一个空矩形（0,0） - （0,0）。","Suggestions for the string under the span":"Span下字符串的建议","the tint to apply, may be ":"适用的色调可能是 ","The input CharSequence.":"输入CharSequence。","The tag to check.":"要检查的标签。","the OutputStream to write the encoded data to":"输出流将编码数据写入","Whether to add the target to or remove the target from the\n            current list of excluded targets.":"是否将目标添加到或从目标中删除\n            排除目标的当前列表。","A Path to be used as a pattern for two-dimensional motion.":"要用作二维运动的图案的路径。","The next focusable view, or null if none exists.":"下一个可聚焦视图，如果不存在，则为null。","drawable's uri source":"drawable的uri源","The index of the first character in s that was\n                  matched by the pattern - inclusive":"S中第一个字符的索引\n                  匹配的模式-包括","The choreographer for this thread.":"这个线程的编舞。","Localized month of the year.":"一年中的本地化月份。","A normalized single-precision float value":"规范化的单精度浮点数值","the buffer in which the meta key would have been pressed.":"元键被按下的缓冲区。"," is numerically less than ":" 在数值上小于 ","The View to make appear. This will be in the target scene's View hierarchy and\n                        will be VISIBLE.":"要显示的视图。 这将在目标场景的视图层次结构和\n                        将可见。","Returns the value that was stored at this index.":"返回存储在此索引中的值。","a Pair that is templatized with the types of a and b":"用a和b类型模板化的一对","If the given shortcut exists and is shown, returns\n                    true; else returns false.":"如果给定的快捷方式存在并显示，则返回\n                    true;else返回false。","The existing parser for which you would like an\n                          AttributeSet.":"您想要的现有解析器\n                          属性集。",",\n                           ":",\n                           ","Location in the text at which to check.":"要检查的文本中的位置。","the drawable to be added":"要添加的drawable","The string resource identifier used for the title.":"用于标题的字符串资源标识符。","the time in UTC milliseconds":"UTC毫秒的时间","a string pattern suitable for use with ":"适合与使用的字符串模式 ","The velocity of this fling measured in pixels per second\n              along the x axis.":"这一扔的速度以每秒像素为单位\n              沿x轴。","The height of the size":"尺寸的高度","the path of the highlight or cursor; can be null":"高亮显示或光标的路径；可以为null","Additional flags indicating how this span is handled in TextView":"指示如何在TextView中处理此跨度的其他标志","the insets for the curved areas in waterfall display.":"瀑布显示中弯曲区域的插入.","The Intent to associated with the item.  This Intent\n                          object is <em>not</em> copied, so be careful not to\n                          modify it later.":"项相关联的意图。  这个意图\n                          对象不是复制的，所以要注意不要复制\n                          稍后修改它。","Input CharSequence after applying the above processing.":"在应用上述处理之后输入CharSequence。","bit flags for controlling the encoder; see the\n                   constants in ":"用于控制编码器的位标志；请参阅\n                   常量在 ","The level to check.":"的水平来检查。","the Path defining a pattern of motion between two coordinates.":"在两个坐标之间定义运动模式的路径。","The type to ignore when running this transition.":"运行此转换时要忽略的类型。","the source string that was saved during construction":"在构造过程中保存的源字符串","The index of the last character in s that was\n                  matched - exclusive":"S中最后一个字符的索引\n                  匹配-独家","The frame callback to run during the next frame.":"在下一帧期间运行的帧回调。","some time in the past.":"过去的一段时间。","The single-precision float value to convert to half-precision":"要转换为半精度的单精度float值","Contains focusedRect. Cannot be null.":"包含focusedRect。 不能为null。","META_SHIFT_ON, META_ALT_ON, META_SYM_ON":"META_SHIFT_ON，META_ALT_ON，META_SYM_ON",",\n                     and a value greater than ":",\n                     和大于的值 ","The target values in the start scene":"开始场景中的目标值","The collection whose contents are to be used to determine which\n            keys to keep.":"其内容将用于确定哪个集合的集合\n            要保管的钥匙。","The group to be removed.  If there are no items in this\n                      group, nothing happens.":"要移除的组。  如果这里没有项目\n                      组，什么都没发生。","The Matcher object from which grouped text will\n                                 be extracted":"匹配器对象，从中分组文本将\n                                 被提取",".\n                           If none are provided, then the default match order will be set.":".\n                           如果没有提供，则将设置默认匹配顺序。","the distance between the drawable and the text":"drawable和文本之间的距离","The modes to be checked: may be any combination of\n            ":"要检查的模式：可以是\n            ","An AttributeSet you can use to retrieve the\n                    attribute values at each of the tags as the parser moves\n                    through its XML document.":"一个属性集，你可以用来检索\n                    解析器移动时每个标记处的属性值\n                    通过其XML文档。"," used for the header.":" 用于标题。","the offset from UTC in seconds":"UTC的偏移量（以秒为单位）"," object that properly formats the date.":" 正确设置日期格式的对象。","The velocity of this fling measured in pixels per second\n              along the y axis.":"这一扔的速度以每秒像素为单位\n              沿y轴。","Potential key in the mapping":"映射中的潜在键","the paint for the highlight":"高光的油漆","bounding rectangle in pixels. In case of no bounding rectangle, an empty rectangle\n            is returned.":"以像素为单位的边界矩形。 在没有边界矩形的情况下，空矩形\n            被归还。","Locale of the suggestions":"建议的地点","The numeric shortcut key.  This is the shortcut when\n                            using a 12-key (numeric) keyboard.":"的数字快捷键。  这是捷径当\n                            使用12键（数字）键盘。","The algorithm to be used to estimate the CharSequence's overall direction.\n                   See ":"用于估计CharSequence整体方向的算法。\n                   见 ","non-null name of explicit termination method. Printed by warnIfOpen.":"显式终止方法的非空名称。 由warnIfOpen印刷。","The root of the hierarchy in which scene changes\n            and transitions will take place.":"场景更改的层次结构的根\n            过渡将发生。","The priority/type of this log message":"此日志消息的优先级/类型","Whether to add the target type to or remove it from the\n            current list of excluded target types.":"是否将目标类型添加到或从\n            排除的目标类型的当前列表。"," of the text to which the span is attached.":" 跨度所附加的文本。","The regex matcher state that found this URL text":"找到此URL文本的regex匹配器状态","The delay time in milliseconds.":"以毫秒为单位的延迟时间。","the minimum elapsed time (in milliseconds) to report\n                       when showing relative times. For example, a time 3 seconds in\n                       the past will be reported as \"0 minutes ago\" if this is set to\n                       ":"要报告的最短经过时间（以毫秒为单位）\n                       示相对时间时。 例如，一个时间3秒在\n                       如果设置为\"0分钟前\"，过去将报告为\"0分钟前\"\n                       ","A hexadecimal string representation of the specified value":"指定值的十六进制字符串表示形式","The starting point of the search.":"搜索的起点。","0 if inactive, 1 if active, 2 if locked.":"0如果不活动，1如果活动，2如果锁定。","The target values in the end scene":"结束场景中的目标值"," is numerically greater\n                     than ":" 数字上更大\n                     比 ","The new value to store at this index.":"要在此索引处存储的新值。","The item to be removed.  If there is no item with this\n                      identifier, nothing happens.":"要移除的项目。  如果没有这个项目\n                      标识符，没有任何反应。","A String comprising all of the non-null matched\n                                 groups concatenated together":"包含所有非空匹配的字符串\n                                 组连接在一起","The length of the delay, in milliseconds.":"延迟的长度，以毫秒为单位。","the paint. The this should be left unchanged on exit.":"的油漆。 退出时应保持不变。","The token returned from ":"令牌从 ","Returns the actual capitalization modes that can be in effect\n            at the current position, which is any combination of\n            ":"返回可以生效的实际大小写模式\n            在当前位置，这是任何组合的\n            ","The text to display for the item.":"要为项目显示的文本。","the Julian day":"朱利安日"," object that formats the date in long form.":" 将日期格式化为长格式的对象。","true if the key is defined in the mapping":"如果键在映射中定义，则为true","The initial on down motion event that started the longpress.\n":"启动longpress的初始on down motion事件。\n","the amount to temporarily translate the\n                   canvas while rendering the highlight":"临时翻译的金额\n                   在渲染高光时画布","a list of bounding ":"边界列表 ","Listener that will respond to expand/collapse events":"将响应展开/折叠事件的侦听器","locale Locale of the suggestions":"语言环境建议的语言环境","any object to match against the ANDROID_OBJECT_FILTER\n        environement variable":"要与ANDROID_OBJECT_FILTER匹配的任何对象\n        环境变量"," for pre-defined heuristics.":" 于预先定义的启发式。","The view hierarchy of this scene, added as a child\n            of sceneRoot when this scene is entered.":"此场景的视图层次结构，作为子级添加\n            当这个场景被输入时，sceneRoot。","Used to identify the source of a log message.":"用于标识日志消息的来源。"," for this span.  If multiple locales are associated with this\n            span, only the first locale is returned.  ":" 为了这个跨度。  如果多个区域设置与此相关联\n            span，只返回第一个locale。  ","The id of a target whose children should be ignored when running\n            this transition.":"运行时应忽略其子项的目标的id\n            这种转变。","The text that was matched":"匹配的文本","The frame callback to remove.":"要删除的帧回调。","the elapsed time (in milliseconds) at which\n                       to stop reporting relative measurements. Elapsed times greater\n                       than this resolution will default to normal date formatting.\n                       For example, will transition from \"7 days ago\" to \"Dec 12\"\n                       when using ":"经过的时间（以毫秒为单位）\n                       以停止报告相对测量。 经过的时间更大\n                       比此分辨率将默认为正常的日期格式。\n                       例如，将从\"7days ago\"过渡到\"Dec12\"\n                       使用时 ","A string representation of the specified value":"指定值的字符串表示形式","The view tree to look inside. Cannot be null":"视图树向内看。 不能为null","the event for which to evaluate the meta state.":"为其评估元状态的事件。","An Animator to be started at the appropriate time in the\n            overall transition for this scene change. A null value means no animation\n            should be run.":"在适当的时间启动动画师\n            此场景变化的整体过渡。 空值表示没有动画\n            应该运行。","The half-precision float value to compare to the half-precision value\n                     represented by this ":"要与半精度值进行比较的半精度浮点值\n                     由此表示 ","Returns the previous value at the given index.":"返回给定索引处的前一个值。","The group of items to operate on.":"要操作的项目组。","The Matcher object from which digits and plus will\n                                be extracted":"数字和加号将从该匹配器对象\n                                被提取","The startDelay set on this transition, in milliseconds, if one has\n            been set, otherwise returns a negative number.":"在此转换上设置的startDelay，以毫秒为单位，如果有\n            已设置，否则返回负数。","the layout containing this line\n":"包含此行的布局\n","the uncompressed buffer size":"未压缩的缓冲区大小","The newly added menu item.":"新添加的菜单项。","the Locale for which we want the layout direction. Can be null.":"我们想要布局方向的区域设置。 可以为null。"," object that properly formats the time.":" 正确格式化时间的对象。","Number of weeks since the epoch":"自纪元以来的周数","Index to begin at":"索引开始于","The first down motion event that started the scrolling.":"开始滚动的第一个向下运动事件。","s, one for each display cutout area. No empty Rect is\n            returned.":"s，每个显示切口区域一个。 没有空的Rect是\n            回来了。","Suggestions for the string under the span. Only the first up to\n            ":"Span下的字符串的建议。 只有第一个到\n            ","This menu item instance for call chaining":"此菜单项实例用于调用链接","which line to examine (0..getLineCount() - 1)":"检查哪一行（0。.getLineCount()-1)","Whether to directionally isolate the CharSequence to prevent it from garbling\n                the content around it":"是否直接隔离CharSequence以防止它乱码\n                它周围的内容","The display metrics with which to compare.":"要与之比较的显示度量。","The ViewGroup on which the current scene will be returned":"返回当前场景的ViewGroup","An exception to log.\n":"日志的异常。\n"," is specified.":" 被指定。","The x coordinate of the starting point.":"起点的x坐标。","Whether to add the target to or remove the target from the\n            current list of excluded-child targets.":"是否将目标添加到或从目标中删除\n            当前排除子目标列表。","The time in nanoseconds when the frame started being rendered,\n in the ":"帧开始呈现的时间，以纳秒为单位,\n 在 ","a String object containing the elapsed time.":"包含经过时间的字符串对象。","The truncated half-precision float value of the specified\n                    half-precision float value":"指定的截断半精度浮点数值\n                    半精度浮点数值","The starting point of the search. Null means the default cluster":"搜索的起点。 Null表示默认集群","the Editable text where the replacement was made":"进行替换的可编辑文本","The target visibility in the start scene":"开始场景中的目标可见性","; a\n                     value less than ":"；一\n                     值小于 ","Returns the value stored at the given index.":"返回存储在给定索引处的值。","Set to true to allow a check mark, false to\n                             disallow.  The default is false.":"设置为true以允许复选标记，false为\n                             不允许。  默认值为false。","the list of target IDs":"目标Id列表","A String comprising all of the digits and plus in\n                                the match":"一个字符串，包括所有的数字和加\n                                比赛"," or\n                                     ":" 或\n                                     ","The field identifier constant from the generated class.":"生成的类中的字段标识符常量。","Resource identifier of title string.":"标题字符串的资源标识符。","the layout direction. This may be one of:\n            ":"的布局方向。 这可能是一个:\n            ","The julian day for the Monday of the given week since the epoch":"自纪元以来给定一周的星期一的儒略日","Number of mappings to remove\n            \n            <p>For indices outside of the range <code>0...size()-1</code>,\n            the behavior is undefined.</p>":"要删除的映射数\n            \n            <p>对于范围<code>0之外的索引。..尺寸()-1</代码>,\n            行为未定义。</p>","the context to use for the content resolver":"用于内容解析器的上下文","The move motion event that triggered the current onScroll.":"触发当前onScroll的move运动事件。"," contains all the cutout paths based on display coordinate. Returns\n            null if there is no cutout on the display.":" 包含基于显示坐标的所有切口路径。 申报表\n            如果显示器上没有切口，则为null。","The object to receive invokations.":"接收调用的对象。","Optional. If not null, it returns the extent of the line":"可选择的。 如果不为null，则返回行的范围","Input CharSequence after applying the above processing. ":"在应用上述处理之后输入CharSequence。 "," will be considered. Null values not permitted.":" 将被考虑。 不允许空值。","True if the display metrics are equal.":"如果显示指标相等，则为True。","The current Scene set on this ViewGroup. A value of null indicates that\n            no Scene is currently set.":"在此ViewGroup上设置的当前场景。 Null值表示\n            当前未设置任何场景。","The message you would like logged.\n":"您想要记录的消息。\n","The entire list of locales that are associated with this span.":"与此跨度关联的区域设置的整个列表。","The y coordinate of the starting point.":"起点的y坐标。","The id of a target to ignore when running this transition.":"运行此转换时要忽略的目标的id。"," timebase.  Divide this value by ":" 时间段。  将此值除以 ","context for resources":"资源的上下文","A float value":"浮点数值","The next cluster, or null if none exists":"下一个集群，如果不存在，则为null","the start of the replaced region":"被替换区域的开始","The target visibility in the end scene":"端场景中的目标可见性",";\n                     and a value greater than ":";\n                     和大于的值 ","the object to add.":"要添加的对象。","If set to true, only one item in this group can be\n                             checked at a time; checking an item will automatically\n                             uncheck all others in the group.  If set to false, each\n                             item can be checked independently of the others.":"如果设置为true，则此组中只能有一项\n                             一次检查；检查一个项目将自动\n                             取消选中组中的所有其他人。  如果设置为false，则每个\n                             项目可以独立于其他项目进行检查.","The intent will be sent when the wrapped text is deleted or modified.\n                                 When the pending intent is sent, ":"当包装文本被删除或修改时，意图将被发送。\n                                 当挂起的意图被发送, ","The PrintWriter where you would like output to go.":"您希望输出的PrintWriter。","The token to call ":"要调用的令牌 ","the list of target transitionNames":"目标传递名称列表","The group identifier that this item should be part of.\n                   This can be used to define groups of items for batch state\n                   changes. Normally use ":"此项应属于的组标识符。\n                   这可用于为批处理状态定义项目组\n                   变化。 通常使用 ","the end of the replaced region; the location of the cursor":"替换区域的末端； 光标的位置","The julian day to calculate the week number for":"计算周数的儒略日",".\n            \n            Be careful: this code will need to be updated when vertical scripts will be supported":".\n            \n            小心：当支持垂直脚本时，需要更新此代码","a state set or state spec.":"状态集或状态规范。","true if 24 hour time format is selected, false otherwise.":"如果选择了24小时时间格式,则为true,否则为false.","The distance along the X axis that has been scrolled since the last\n              call to onScroll. This is NOT the distance between ":"自上次滚动以来沿X轴的距离\n              呼叫onScroll。 这不是之间的距离 ","the insets for the curved areas of a waterfall display in pixels or ":"瀑布显示的弯曲区域的插入，以像素或 ","the Y-coordinate of the baseline":"基线的Y坐标","\n                is ":"\n                是 ","if not null, this class will get notified when the user\n                                           selects one of the suggestions.  On Android\n                                           ":"如果不为null，该类将在用户时收到通知\n                                           选择其中一个建议。  在Android上\n                                           ","of event to look up":"要查找的事件","The id of a standard layout resource file.":"标准布局资源文件的id。","The numeric shortcut key. This is the shortcut when\n                   using a numeric (e.g., 12-key) keyboard.":"的数字快捷键。 这是捷径当\n                   使用数字（例如12键）键盘。","The desired log priority:\n            ":"所需的日志优先级:\n            ","the filter to be applied to the <code>TextPaint</code>":"要应用于<code>TextPaint</code>的过滤器","The x coordinate of the ending point.":"终点的x坐标。","The name of a target to ignore when running this transition.":"运行此转换时要忽略的目标的名称。","\n to convert it to the ":"\n 将其转换为 ","time in milliseconds":"以毫秒为单位的时间","Index of the desired attribute, 0...count-1.":"所需属性的索引，0。..计数-1。","the FrameMetrics object to copy.":"要复制的FrameMetrics对象。","The View to make disappear. This will be in the target scene's View\n                        hierarchy or in an ":"使之消失的观点。 这将在目标场景的视图中\n                        层次结构或在 ","A half-precision float value providing the magnitude of the result":"提供结果大小的半精度浮点数值"," if this set is modified, ":" 如果此集被修改, ","If true the items will be enabled, else they will be disabled.":"如果为true，项目将被启用，否则它们将被禁用。"," is\n                                 added in the intent to describe how the text changed.":" 是\n                                 在意图中添加，以描述文本如何变化。","The class on which the property is declared.":"声明属性的类。","The state of the superclass of this view":"此视图的超类的状态","the list of target views":"目标视图列表"," if an item should not be in a\n                   group.":" 如果一个项目不应该在\n                   组。","Which week day is the first day of the week, see\n                       ":"哪一周的一天是一周的第一天，见\n                       ","the text to be restored if the user presses DEL":"如果用户按下DEL，则要还原的文本","the string to be encoded":"要编码的字符串","an array of required (if positive) or\n                   prohibited (if negative) ":"所需的数组（如果是正数）或\n                   禁止（如果否定） ","the context is required only if the time is shown":"仅在显示时间时才需要上下文"," if there are no curved areas or they don't overlap with the window.":" 如果没有弯曲区域或它们不与窗口重叠。","\n              and ":"\n              和 ","the offset":"的偏移量","the default paint for the layout":"布局的默认绘制","the tag code, or -1 if no tag has that name":"标记代码，如果没有标记具有该名称，则为-1","The context used in the process of inflating\n            the layout resource.":"膨胀过程中使用的上下文\n            的布局资源。","A string tag to associate with each printed log statement.":"要与每个打印的日志语句关联的字符串标记。"," and later this\n                                           parameter is always ignored.":" 后来这个\n                                           参数始终被忽略。","the mask filter for this span":"此跨度的掩码过滤器","The y coordinate of the ending point.":"终点的y坐标。","the callback used to find the epicenter of the Transition.":"用于查找过渡震中的回调。"," containing relative time.":" 含相对时间。","What to return if the attribute isn't found.":"如果找不到属性，返回什么。","The numeric modifier associated with the shortcut. It should\n                   be a combination of ":"与快捷方式关联的数字修饰符。 它应该\n                   是一个组合 ","the metric to retrieve":"要检索的指标"," time base.\n":" 时基。\n","A half-precision float value providing the sign of the result":"提供结果符号的半精度浮点值"," and will be\n                        VISIBLE.":" 并将\n                        可见。","The collection whose contents are to be retrieved.":"要检索其内容的集合。","color integer that defines the text color":"定义文本颜色的颜色整数","If true the items are visible, else they are hidden.":"如果为true，则这些项目是可见的，否则它们是隐藏的。","The type that this property represents.":"此属性表示的类型。","parcel to read from":"可供阅读的包裹","Unique item ID. Use ":"唯一的项目ID。 使用方法 ","the list of target Types":"目标类型列表","when, if ever, to automatically capitalize.":"如果有的话，自动大写。","the start time in UTC milliseconds":"UTC毫秒的开始时间"," states.":" 国家。","Weeks since the epoch":"纪元以来的几周","the encoded string":"编码后的字符串","One of the following action constants, in the order in which they usually occur\n            during a drag and drop operation:\n            <ul>\n             <li>":"以下操作常量之一，按它们通常发生的顺序\n            在拖放操作期间:\n            <ul>\n             <李>","true if the character is RTL, false if it is LTR":"如果字符是RTL，则为true，如果是LTR，则为false","The distance along the Y axis that has been scrolled since the last\n              call to onScroll. This is NOT the distance between ":"自上次滚动以来沿Y轴的距离\n              呼叫onScroll。 这不是之间的距离 ","The scene for the given root and layout id":"给定根和布局id的场景","the wrapping width for the text":"文本的换行宽度","code to look up":"查找代码","for caches that do not override ":"对于不重写的缓存 ","an array of suggestion texts for this span":"这个跨度的一系列建议文本","The maximum angle of the arc on a circle describing the Path\n                                  between the start and end points.":"描述路径的圆上弧的最大角度\n                                  始点和终点之间。","the paint used for drawing the text":"用于绘制文本的油漆","An array of property names as described in the class documentation for\n            ":"类文档中描述的属性名称数组\n            ","If true, the string returned will include the correct\n            preposition (\"at 9:20am\", \"on 10/12/2008\" or \"on May 29\").":"如果为true，返回的字符串将包括正确的\n            介词(\"上午9时20分\"、\"2008年10月12日\"或\"5月29日\")。","Resulting value.":"结果值。","The alphabetic modifier associated with the shortcut. It should\n                   be a combination of ":"与快捷方式关联的字母修饰符。 它应该\n                   是一个组合 ","the value of the metric or -1 if it is not available.":"度量的值或-1（如果不可用）。","The parcel to write into.":"要写入的包裹。","A value with the magnitude of the first parameter and the sign\n                    of the second parameter":"具有第一个参数的大小和符号的值\n                    第二个参数","Returns true if this array set contains a value for every entry\n            in <var>collection</var>, else returns false.":"如果此数组集包含每个条目的值，则返回true\n            在<var>collection</var>中，else返回false。",". The target view will already be stored in\n the transitionValues structure when this method is called.\n":". 目标视图将已存储在\n 调用此方法时transitionValues结构。\n","the foreground color of this span.":"此跨度的前景色。","The lower endpoint (inclusive)":"下端点（含）","If true the menu will use alphabetic shortcuts; else it\n                            will use numeric shortcuts.":"如果为true，菜单将使用字母快捷键;否则它\n                            将使用数字快捷方式。","ClassLoader to use for reading":"用于读取的ClassLoader","whether to automatically do spelling corrections.":"是否自动做拼写更正。"," if you do not need a\n                   unique ID.":" 如果你不需要\n                   唯一ID。","The resource id of the transition to load":"转换到加载的资源id","the end time in UTC milliseconds":"以UTC毫秒为单位的结束时间"," state":" 国家","the time to test":"测试的时间","the string to be examined":"要检查的字符串","</li>\n             <li>":"</李>\n             <李>","the invalid character":"无效字符","The root of the view hierarchy affected by this scene.":"受此场景影响的视图层次结构的根。","The down motion event\n":"向下运动事件\n","whether to left, right, or center the text":"是向左、向右还是居中文本","the name of the tag, or null if no tag has that number":"标记的名称，如果没有标记具有该编号，则为null",", this is\n                the maximum number of entries in the cache. For all other caches,\n                this is the maximum sum of the sizes of the entries in this cache.":"，这是\n                缓存中的最大条目数。 对于所有其他缓存,\n                这是此缓存中条目大小的最大总和。","The maximum angle of the arc on a circle describing the Path\n                    between the start and end points.":"描述路径的圆上弧的最大角度\n                    始点和终点之间。","the locale of the suggestions. An empty string is returned if no locale is specified.":"建议的区域设置。 如果未指定区域设置，则返回空字符串。","source text":"源文本","the color of the quote stripe.":"报价条纹的颜色。",". The default implementation returns <code>null</code>.":". 默认实现返回<code>null</code>。","a relative time string to display the time expressed by millis.  Times\n            are counted starting at midnight, which means that assuming that the current\n            time is March 31st, 0:30:\n            <ul>\n              <li>\"millis=0:10 today\" will be displayed as \"0:10\"</li>\n              <li>\"millis=11:30pm the day before\" will be displayed as \"Mar 30\"</li>\n            </ul>\n            If the given millis is in a different year, then the full date is\n            returned in numeric format (e.g., \"10/12/2008\").":"一个相对时间字符串来显示用millis表示的时间。  时代\n            从午夜开始计算，这意味着假设当前\n            时间是3月31日0:30:\n            <ul>\n              <li>\"millis=0:10today\"将显示为\"0:10\"</li>\n              <li>\"millis=前一天晚上11:30\"将显示为\"Mar30\"</li>\n            </ul>\n            如果给定的日期在不同的年份，则完整日期为\n            以数字格式返回（例如，\"10/12/2008\"）。","The end time in nanoseconds or ":"以纳秒为单位的结束时间或 ","Namespace of attribute to retrieve.":"要检索的属性的命名空间。","How the item should display. One of\n            ":"项应该如何显示。 其中一个\n            ","The half-precision float value represented by this object\n                    converted to type ":"此对象表示的半精度float值\n                    转换为类型 ","Returns the index of the value if it exists, else a negative integer.":"如果存在，则返回值的索引，否则返回负整数。","The flags to use for parceling.":"用于打包的旗帜。","The TransitionValues captured at the start or end of the Transition.":"在过渡开始或结束时捕获的TransitionValues。","bitmap to be rendered at the beginning of the text":"要在文本开头呈现的位图","The item count.":"项计数。","the width of the stripe.":"条纹的宽度。","The number of milliseconds to hide for.":"要隐藏的毫秒数。","the buffer whose text and state are to be cleared.":"要清除其文本和状态的缓冲区。",". SHOW_AS_ACTION_NEVER is the default.":"。 show_as_action_never是默认值。","The upper endpoint (inclusive)":"上端点（含）","The order for the item. Use ":"项的顺序。 使用方法 ","The loaded Transition object":"加载的过渡对象","the time to describe, in milliseconds":"描述以毫秒为单位的时间","The StringBuilder where you would like output to go.":"您希望输出的StringBuilder。","true if epoch.":"如果是时代，那就是真的。","a bit mask of options See\n            ":"选项的位掩码见\n            ","</li>\n            </ul>":"</李>\n            </ul>","true if str is null or zero length":"如果str为null或零长度，则为true","The up motion event that completed the first tap":"完成第一次敲击的向上运动事件","The runnable whose ":"的runnable其 ","this value is no longer used by BoringLayout":"BoringLayout不再使用此值","to search for":"搜寻","true if the entry is being removed to make space, false\n                if the removal was caused by a ":"如果条目被删除以腾出空间，则为false\n                如果移除是由 ","The minimum angle of the arc on a circle describing the Path\n                                  between two nearly horizontally-separated points.":"描述路径的圆上弧的最小角度\n                                  在两个几乎水平分隔的点之间。","the object to be spanned over the appended text.":"要跨越附加文本的对象。","the locale of the suggestions. ":"建议的区域设置。 ","\n                    if there is no frame data.":"\n                    如果没有帧数据。","The interpolator set on this transition, if one has been set, otherwise\n            returns null.":"插值器设置在这个过渡上，如果一个已经设置，否则\n            返回null。"," method will\n            be called when this scene is entered":"方法将 \n             输入此场景时被称为","The first half-precision value":"第一个半精度值","The attribute to retrieve.":"要检索的属性。","the base context":"基本上下文"," is returned if no locale is specified.":"如果未指定语言环境，则将返回。","The minimum arc along the circle between two points aligned near horizontally.":"沿着两个点之间的圆形最小弧形在水平附近对齐。","the object to remove.":"要移除的对象。"," for the View at the time the values\n            were captured.":" 对于当时的视图，值\n            被俘。","the width of the gap between the stripe and the text.":"条纹和文本之间的间隙的宽度。","the start index of the context":"上下文的开始索引","true if this action mode considers the title and subtitle fields\n                    as optional. Optional titles may not be displayed to the user.":"如果此操作模式考虑标题和副标题字段，则为true\n                    作为可选的。 可选标题可能不会显示给用户。","the values from captureStartValues, This may be ":"来自cautrestartvalues的值，这可能是","The second half-precision value":"下半部分值的值","This MenuItem instance for call chaining.":"这个MenuItem实例用于呼叫链接。","padding width, in pixels, between the bitmap and the text":"位图和文本之间的填充宽度（以像素为单位）","Modifier associated with the keyboard shortcut.":"与键盘快捷键相关联的修改器。","whether to automatically do spelling corrections.\n":"是否自动做拼写更正。\n"," reference":" 参考资料","True if the window containing the view that started this action mode\n                   now has focus, false otherwise.":"如果包含启动此动作模式的视图的窗口 \n                    现在有了重点，否则是错误的。","the width of the quote stripe.":"报价条纹的宽度。","The resource id of the transition manager to load":"要加载的过渡管理器的资源id","The minimum angle of the arc on a circle describing the Path\n                                  between two nearly vertically-separated points.":"描述路径的圆圈上弧的最小角度 \n                                   在两个几乎垂直分离的点之间。"," if you do not care\n                   about the order. See ":" 如果你不在乎\n                   关于命令。 见 ","the base direction of the paragraph; if negative, the margin\n            is to the right of the text, otherwise it is to the left.":"段落的基本方向； 如果负数，边距 \n             是在文本的右边，否则是左侧。","the UTC milliseconds since the epoch, or ":"自纪元以来的UTC毫秒，或 ","The new text to be displayed.":"要显示的新文本。","the View's center x coordinate, relative to the screen, at the time the values\n            were captured.":"视图的中心x坐标相对于屏幕，当时值 \n             被俘虏。","the (non-inclusive) end index of the context":"上下文的（非包容）端索引","the ISO 3166-1 alpha-2 code for the country as can be obtained using\n                ":"国家的ISO3166-1阿尔法-2代码，可使用\n                ","True if x is equal to y, false otherwise":"如果x等于y，则为true，否则否则","a string containing the formatted date/time range.":"包含格式化日期/时间范围的字符串。","The ClipData sent to the system by startDragAndDrop().":"StartDragAndDrop()发送到系统的ClipData。"," instance that contains information about FontMetrics and\n                           line width":" 包含有关FontMetrics和\n                           线宽","The desired placement of the object, as defined by the\n                           constants in this class.":"对象的所需位置，由\n                           此类中的常量。"," clamped to this range.":"夹在此范围内。","The loaded TransitionManager object":"已加载的过渡管理器对象","a CharSequence that will be inserted between the tokens. If null, the string\n                \"null\" will be used as the delimiter.":"将在令牌之间插入的CharSequence。 如果为null，则字符串\n                \"null\"将用作分隔符。","The group identifier that this item should be part of.\n                   This can also be used to define groups of items for batch state\n                   changes. Normally use ":"该项目应成为一部分的组标识符。 \n                    这也可以用于定义批处理状态的一组项目 \n                    变化。 通常使用","the current time in milliseconds":"以毫秒为单位的当前时间","the new value for ":"新的价值 ","container to add events into":"将事件添加到容器中","The side that is used to calculate the transition propagation. Must be one of\n                        ":"用于计算过渡传播的一侧。 一定是\n                        ","The number of frames.":"的帧数。","List of strings whose values we are checking against.":"我们正在检查其值的字符串列表。","the View's center y coordinate, relative to the screen, at the time the values\n            were captured.":"视图的中心y坐标相对于屏幕，当时值 \n             被俘虏。","The color of the underline for that span, or 0 if there is no underline":"该跨度的下划线的颜色，如果没有下划线，则为0","The horizontal size of the object.":"物体的水平尺寸。","the resource ID of the theme to be applied on top of\n                              the base context's theme":"要应用的主题的资源ID\n                              基本上下文的主题"," if the range is within this inclusive range, ":"如果该范围在此包含范围内，"," if the\n                               View did not exist in the start state.":" 如果\n                               视图在启动状态下不存在。","true if the action view was collapsed, false otherwise.":"如果操作视图已折叠，则为true，否则为false。","the capitalization rules to consider.":"要考虑的资本化规则。","Resource ID of a string to set as the subtitle":"要设置为字幕的字符串的资源ID","The frame index.":"框架索引。"," if this set was modified, ":" 如果修改了这个集, ","the proportion with which the text is scaled.":"缩放文本的比例。","The minimum angle of the arc on a circle describing the Path\n                    between two nearly vertically-separated points.":"描述路径的圆上弧的最小角度\n                    在两个几乎垂直分离的点之间。","the theme being modified":"主题正在修改","The vertical size of the object.":"物体的垂直大小。","the values from captureEndValues. This may be ":"来自CaptureEndValues的值。 这可能是","the string to parse":"要解析的字符串","the layout containing this line":"包含此行的布局","The resource id of the new text to be displayed.":"要显示的新文本的资源id。","The edge of the scene to use for Views appearing and disappearing. One of\n                             ":"场景的边缘用于出现和消失的视图。 之一","Resource ID of a string to set as the title":"字符串的资源ID设置为标题","The presented time in nanoseconds or ":"纳秒或","1 if the run is RTL, otherwise 0":"1如果运行为RTL，否则为0","The array whose contents are to be removed.":"要删除内容的数组。","IDs that can be passed to ":"可以传递给的id ","The largest half-precision float value toward positive infinity\n                    less than or equal to the specified half-precision float value":"朝向正无穷大的最大半精度浮点数值\n                    小于或等于指定的半精度浮点数值","true if the resulting time value is in UTC time":"如果产生的时间值在UTC时间中，则为true","the Formatter used for formatting the date range.\n            Note: be sure to call setLength(0) on StringBuilder passed to\n            the Formatter constructor unless you want the results to accumulate.":"用于格式化日期范围的格式化程序。\n            注意：请务必在传递到的StringBuilder上调用setLength(0\n            格式化程序构造函数，除非您希望结果累积。","the style resource being applied to <var>theme</var>":"应用于<var>主题</var>的样式资源","The root of the View hierarchy to end transitions on.":"视图层次结构的根部结束过渡的根源。","true if the request is for the first line of a paragraph,\n            false for subsequent lines":"如果请求是段落的第一行，则为the， \n             false用于后续行","The ClipDescription that was part of the ClipData sent to the system by\n                startDragAndDrop().":"作为发送到系统的ClipData的一部分的ClipDescription\n                startDragAndDrop（）。","set whether to include extra space beyond font ascent and descent which is\n                              needed to avoid clipping in some scripts":"设置是否包括超出字体上升和下降的额外空间\n                              需要避免在某些脚本中剪切","The group identifier that the items should be part of.\n                   This can also be used to define groups of items for batch state\n                   changes. Normally use ":"项应属于的组标识符。\n                   这也可用于为批处理状态定义项目组\n                   变化。 通常使用 ","an array objects to be joined. Strings will be formed from the objects by\n                calling object.toString(). If tokens is null, a NullPointerException will be thrown. If\n                tokens is empty, an empty string will be returned.":"要连接的数组对象。 字符串将通过以下方式从对象中形成\n                调用对象。toString（）。 如果令牌为null，则会引发NullPointerException。 如果\n                令牌为空，将返回一个空字符串。","The collection whose contents are to be used to remove values.":"内容的集合用于删除值。","The new text to be displayed as the condensed title.":"新文本将显示为冷凝标题。","the minimum timespan to report. For example, a time 3 seconds in the\n                past will be reported as \"0 minutes ago\" if this is set to MINUTE_IN_MILLIS. Pass one of\n                0, MINUTE_IN_MILLIS, HOUR_IN_MILLIS, DAY_IN_MILLIS, WEEK_IN_MILLIS":"报告的最短时间跨度。 例如，时间3秒在\n                如果设置为MINUTE_IN_MILLIS，过去将报告为\"0分钟前\"。 通过其中一个\n                0,MINUTE_IN_MILLIS,HOUR_IN_MILLIS,DAY_IN_MILLIS,WEEK_IN_MILLIS",", if it exists. If non-null,\n                this removal was caused by a ":"，如果存在的话。 如果非null,\n                这次搬迁是由一个 ","The event type tag code":"事件类型标记代码","The root of the View hierarchy to run the transition on.":"运行转换的视图层次结构的根。","Information about the ":"有关","the offset for the margin.":"保证金的偏移。"," if this is the first time a style is being\n                         applied to <var>theme</var>":"如果这是风格的第一次 \n                          应用于<var>主题</var>",",\n                        ":",\n                        ","The Scene to change to":"改变的场景","The collection whose contents are to be checked against.":"要检查其内容的集合。","Value returned if attribute doesn't exist or no\n                                match is found.":"如果属性不存在或不存在，则返回值\n                                找到匹配。","the minimum timespan to report. For example, a time\n                       3 seconds in the past will be reported as \"0 minutes ago\" if\n                       this is set to MINUTE_IN_MILLIS. Pass one of 0,\n                       MINUTE_IN_MILLIS, HOUR_IN_MILLIS, DAY_IN_MILLIS,\n                       WEEK_IN_MILLIS":"最低时间板进行报告。 例如，时间 \n                        过去3秒将报告为“ 0分钟前” \n                        这将设置为minute_in_millis。 通过0之一， \n                        minute_in_millis，hour_in_millis，day_in_millis， \n                        Week_in_millis","a bit mask of formatting options, such as\n                       ":"一些格式选项的蒙版，例如",". Otherwise it was caused by\n                an eviction or a ":"。 否则是由 \n                 驱逐或","The bundle of the arguments set.":"参数集的束。"," if the value is within this inclusive range, ":" 如果值在此包含范围内, "," representation.":"表示。","The transition to use for this change. A\n            value of null causes the TransitionManager to use the default transition.":"用于此更改的过渡。 一个 \n             零的值会导致过渡管理器使用默认过渡。","the text in which an insertion is being made.":"正在插入的文本。","The new tooltip text.":"新的工具提示文本。","The frame of the containing space, in which the object\n                             will be placed.  Should be large enough to contain the\n                             width and height of the object.":"包含空间的框架，其中对象\n                             将被放置。  应该足够大，以容纳\n                             对象的宽度和高度。","The holder for any values that the Transition\n wishes to store. Values are stored in the ":"转换的任何值的持有者\n 希望存储。 值存储在 ","the extension of this range and the value.":"该范围的扩展和值。","The type of this instance.":"此实例的类型。"," if you do not\n                   care about the order. See ":" 如果你不\n                   关心秩序。 见 ","the edge of the scene to use for Views appearing and disappearing. One of\n                    ":"用于视图出现和消失的场景边缘。 其中一个\n                    ","Tag to associate with this ActionMode":"要与此ActionMode关联的标记","Receives the computed frame of the object in its\n                           container.":"接收对象的计算框架 \n                            容器。","The unbiased exponent of the specified value":"指定值的无偏指数","the extension of this range and the other range.":"该范围和其他范围的扩展。","true if the supplied when is today else false":"如果今天何时提供的否则，则是真的"," or similar\n                methods, or ":" 或类似\n                方法，或 ","an array objects to be joined. Strings will be formed from the objects by\n                calling object.toString(). If tokens is null, a NullPointerException will be thrown. If\n                tokens is an empty array, an empty string will be returned.":"要连接的数组对象。 字符串将通过以下方式从对象中形成\n                调用对象。toString（）。 如果令牌为null，则会引发NullPointerException。 如果\n                令牌是一个空数组，将返回一个空字符串。","the time in UTC milliseconds since the epoch.":"自纪元以来以UTC毫秒为单位的时间。","a bit mask of options":"选项的位掩码","a text":"一个文本"," if the items should not be in\n                   a group.":" 如果项目不应该在\n                   一组。","layout metric for the given text. null if given text is unable to be handled by\n                    BoringLayout.":"给定文本的布局度量。 如果给定的文本无法由\n                    无聊的。","Returns true if any values were removed from the array set, else false.":"如果从数组集中删除了任何值，则返回true，否则返回false。","The number of bytes written":"写入的字节数"," if the countryCode is unrecognized":"如果国家码未被识别","to be converted":"要转换","The input string":"输入字符串","1 if the value is positive, -1 if the value is negative":"1如果值为正，-1如果值为负","a paint":"油漆","Index in to 'options' or defaultValue.":"索引到\"选项\"或defaultValue。","the previous value mapped by ":"映射的前一个值 ","whether the character being inserted should be capitalized.":"插入的字符是否应该大写。","Theme to consume in the wrapper, a value of null resets the theme to the default":"要在包装器中使用的主题，值为null将主题重置为默认值","the offset into that text where the insertion is being made.":"插入的文本的偏移量。","If true then the item will be visible; if false it is\n                   hidden.":"如果为true，则该项目将可见;如果为false，则为\n                   隐藏起来。","the intersection of this range and the other range.":"该范围与另一范围的交点。","The current activity component name as defined by\n                   queryIntentActivityOptions().":"定义的当前活动组件名称\n                   queryIntentActivityOptions()。","Tag associated with this ActionMode":"与此ActionMode关联的标记","The new maximum size.":"新的最大尺寸。","the time zone to compute the string in. Use null for local\n            or if the FORMAT_UTC flag is being used.":"计算字符串的时区。 本地使用null\n            或者如果正在使用FORMAT_UTC标志。","The order for the items. Use ":"项的顺序。 使用方法 ","input text to convert":"输入要转换的文本","A predicate which returns true for elements to be removed":"对于要删除的元素返回true的谓词","The tooltip text.":"工具提示文本。","A value to log":"要记录的值","The significand, or significand, of the specified vlaue":"指定vlaue的显着或显着","to compute the cosine of, in radians":"计算以弧度为单位的余弦","Name of attribute to retrieve.":"要检索的属性名称。","The display flags.":"的显示标志。","<code>true</code> if the size is in device-independent pixels, <code>false</code>\n            otherwise":"<code>true</code>如果大小在与设备无关的像素中，<code>false</code>\n            否则的话","Item that was collapsed":"崩溃的物品","Item that was expanded":"扩大的项目","The menu item that was invoked.":"调用的菜单项。","The battery object associated with the device, never null.":"与设备关联的电池对象，永不为空。","The controller number of the device.":"器的控制器编号。","The input device descriptor.":"的输入设备描述符。","The axis constant.":"的轴常数。"}