{"\n                constants.":"常数。","The additional session information, or an empty ":"其他会话信息或空的"," if the given TV content rating is blocked, ":"如果给定的电视内容额定值被阻止"," to retreive the position of.":" 撤退的位置。","index of the audio, video, or subtitle track currently selected for playback;\n            a negative integer is returned when there is no selected track for ":"当前选择进行播放的音频，视频或字幕曲目的索引； \n             当没有选定的轨道的轨道时，返回负整数",",\n                 ":"，，，，","Optional callback through which you can receive the\n            scanned URI and MIME type; If null, the file will be scanned but\n            you will not get a result back.":"可选回调，您可以通过它收到 \n             扫描的URI和MIME类型； 如果null，将扫描文件，但 \n             您将不会获得结果。","the maximum absolute amplitude measured since the last call, or\n            0 when called for the first time":"自上次通话以来测得的最大绝对振幅，或 \n             0首次被要求","The volume control type for this volume provider":"此卷提供程序的卷控制类型","Whether the given ":"是否给定","the listener called when new data is available":"当有新数据可用时，侦听器打电话给侦听器","The end time used to filter programs. The returned programs should have\n                       ":"用于过滤程序的结束时间。 返回的程序应该有","A non-negative number used as an initial hint on\n                the video frame rate to be used when using vsync as the sync source. A negative\n                number is used to clear a previous hint.":"一个非负号，用作初始提示 \n                 使用Vsync作为同步源时要使用的视频帧速率。 负面 \n                 数字用于清除以前的提示。","A volume value between ":"之间的音量值","A callback used to monitor status of the TV inputs.":"用于监视电视输入状态的回调。","Size of reading range. It must be a non-negative value at most Integer.MAX_VALUE.":"阅读范围的大小。 在最多integer.max_value上，它必须是一个非负值。","index of the route to remove\n":"拆除路线的索引","an extra code, specific to the error type\n":"一个额外的代码，特定于错误类型\n","icon drawable to use to represent this group\n":"用于表示该组的可绘制图标"," list for channel mapping":"频道映射列表"," or\n            when ":"或者 \n             什么时候","the number of the output port to open":"要打开的输出端口的编号","indicates the event type":"指示事件类型","The handler to post events to.\n":"将事件发布到的处理程序。\n","a number ranging from 0.0f to 3.0f, 4.0f or 5.0f according to\n                the rating style.":"一个数字范围从0.0f到3.0f，4.0f或5.0f根据\n                的评级风格。"," that is less than this time.":"那比这次少了。","the volume control ID or ":"音量控制ID或"," is supported.":"得到支持。","system wide unique audio session identifier. The Equalizer will be\n            attached to the MediaPlayer or AudioTrack in the same audio session.":"系统范围内唯一的音频会话标识符。 均衡器将是\n            附加到同一音频会话中的MediaPlayer或AudioTrack。","the capture size in bytes.":"捕获大小以字节为单位。","the receiver to disconnect":"接收器断开连接","Supply true to keep the screen on, false to allow it\n            to turn off.":"供您保持屏幕启用，false以允许它 \n             把关掉。","the object's storage unit ID":"对象的存储单元ID","The GL texture name of a valid and bound input texture.":"有效且绑定的输入纹理的GL纹理名称。","array of ":"数组","an secondary error code":"次要错误代码","the Content URI of the data you want to play":"要播放的数据的内容URI","The mime type of the content.":"内容的mime类型。","The token for the connected session.":"连接会话的令牌。","The start time used to filter programs. The returned programs will have a\n                       ":"用于过滤程序的开始时间。 返回的程序将有一个"," instance whose key code is one of\n     ":" 实例，其关键代码是\n     "," if it isn't set.":"如果没有设置。","null if the rating style is invalid, or the rating is out of range,\n                a new Rating instance otherwise.":"null如果评分样式无效，或者等级不超出范围，则 \n                 否则，一个新的评级实例。","true if the visualizer is active, false otherwise":"如果可视化器处于活动状态，则为true，否则为否则","a SoundPool object, or null if creation failed":"SoundPool对象，如果创建失败，则为null","A new UserRouteInfo for use by the application":"供应用程序使用的新UserRouteInfo",",\n     ":"，，，，","The width of the input texture in pixels.":"像素中输入纹理的宽度。","the list of storage IDs, or null if fetching storage IDs fails":"存储ID列表或null如果获取存储ID失败",", or -1 if it cannot be found.":"，或-1，如果找不到。","The text for the given key, or ":"给定键的文本，或 ","The value to set it to, between 0 and the reported max.":"将其设置为0和报告的最大值之间的值。","the path to the file that has been scanned.":"已扫描的文件的路径。"," containing the set of attributes and values\n            available for the media being generated by this instance of\n            MediaRecorder.\n            The attributes are descibed in ":" 包含属性和值集\n            可用于此实例生成的媒体\n            MediaRecorder。\n            属性被描述在 ","The callback to receive time shift position changes. A value of ":"接收时移位置变化的回调。 的值 ","the mininum capture size is returned in first array element and the maximum in second\n            array element.":"最小捕获大小以第一个数组元素和第二个数组元素的最大值返回。","A non-negative number representing\n                the maximum deviation of the playback rate from the playback rate\n                set. (":"一个非负数表示\n                播放速率与播放速率的最大偏差\n                设置。 (","Resource ID of an icon drawable to use to represent this group\n":"可绘制用于表示此组的图标的资源ID\n"," to signify there is no valid\n                 information for the field.":"要表示没有有效的 \n                  该领域的信息。","The context to use for querying.":"用于查询的上下文。"," that the status change will be delivered to.":" 状态更改将被传递到。","The connection state of this route: ":"此路由的连接状态: "," is not one of audio, video, or subtitle.":" 不是音频、视频或字幕之一。","the description of the microphone":"麦克风的描述","The listener to add":"要添加的侦听器","Flags from ":"来自","the Uri for the file if the scanning operation succeeded\n and the file was added to the media database, or null if scanning failed.\n":"如果扫描操作成功，则文件的URI \n  并将文件添加到媒体数据库中，或者如果扫描失败，则将文件添加到null。"," object for the thread on which to execute\n            the callback. If <code>null</code>, the handler on the main looper will be used.":" 要执行的线程的对象\n            的回调。 如果<code>null</code>，将使用主looper上的处理程序。","Context used to resolve the correct configuration to load":"用于解析正确配置以加载的上下文","frequency in milliHertz which is to be equalized via the returned band.":"以毫赫兹为单位的频率，通过返回的频带进行均衡。","The width of the virtual display in pixels. Must be\n greater than 0.":"以像素为单位的虚拟显示器的宽度。 必须是\n 大于0。","A ringtone URI, or null if one cannot be found.":"如果找不到铃声URI，则为null。","Array of track info. The total number of tracks is the array length.\n            Must be called again if an external timed text source has been added after any of the\n            addTimedTextSource methods are called.":"轨道信息数组。 轨道总数是数组长度。 \n             如果在任何一个后添加了外部定时文本源，则必须再次调用 \n             调用了addTimedTextSource方法。","the device's ID":"设备的ID","The URI of the input media.":"输入媒体的URI。","The mime type of the file. Must be one of the mime types listed above.":"文件的MIME类型。 必须是上面列出的MIME类型之一。","value between 0 and getVolumeMax\n":"0和getVolumeMax之间的值","frequency band whose frequency range is requested. The numbering of the bands\n starts from 0 and ends at (number of bands - 1).":"频带的频段范围。 乐队的编号 \n  从0开始，以（频段数-1）结束。","optional byte array of data that may be associated with the event\n":"可能与事件相关联的数据的可选字节数组\n","The sampling rate of the content.":"内容的采样率。","The enabled notification listener component.\n                       May be null.":"启用的通知侦听器组件。 \n                        可能是无效的。"," to include with the volume\n                       request.":"包括卷 \n                        要求。"," to be used for the video portion of\n            the media.":" 要用于的视频部分\n            媒体。"," that is greater than or equal to\n                              ":" 即大于等于\n                              ","the new ":"新的 ","true for a \"thumb up\" rating, false for \"thumb down\".":"\"拇指向上\"评级为true，\"拇指向下\"为false。","the number of input ports":"输入端口的数量","true if currently playing, false otherwise":"如果目前播放，则为false，否则","The default route, which is guaranteed to never be null.":"默认路由，保证永远不会为null。","an asset file descriptor":"资产文件描述符","the ID of the storage unit":"存储单元的ID","DRM initialization data in the content, or ":"内容中的DRM初始化数据或","The number of audio channels in the content.":"内容中的音频频道数量。","the headers to be sent together with the request for the data":"与数据请求一起发送的标题","The file path of external timed text source file.":"外部定时文本源文件的文件路径。","The session's tag.":"会议的标签。","The height of the input texture in pixels.":"以像素为单位的输入纹理的高度。","frequency band whose gain is requested. The numbering of the bands starts\n from 0 and ends at (number of bands - 1).":"频带的增益。 乐队的编号开始 \n  从0到（频段数-1）结束。",",\n               or ":"，，，， \n                或者",",\n     or ":",\n     或 ","True if capture from this MediaRecorder must be marked as privacy\n            sensitive, false otherwise.":"如果从此MediaRecorder捕获必须标记为隐私，则为True\n            敏感，否则是假的。","\n                       removes the existing callback.":"\n                       删除现有回调。","true if the device is private":"如果设备是私有的","sync source":"同步源","the priority of the sound. Currently has no effect. Use\n                            a value of 1 for future compatibility.":"声音的优先级。 目前没有效果。 利用 \n                             未来兼容性的值为1。","which category to return":"返回哪个类别","array of bytes where the FFT should be returned":"应返回FFT的字节数组","The language of the content, using either ISO 639-1 or 639-2/T\n                   codes.  Specify null or \"und\" if language information is only included\n                   in the content.  (This will also work if there are multiple language\n                   tracks in the content.)":"内容的语言，使用ISO 639-1或639-2/t \n                    代码。 如果仅包含语言信息，则指定null或“ und” \n                    在内容中。 （如果有多种语言，这也将起作用 \n                    内容中的曲目。）","the offset into the file where the data to be played starts, in bytes":"在启动数据启动数据的文件中的偏移量，字节","One of the constants listed below at the end of the class.":"下面在类末尾列出的常量之一。","the number of audio channels. Usually it is either 1 (mono) or 2\n            (stereo).":"音频频道的数量。 通常是1（单声道）或2 \n             （立体声）。","The GL texture name of the output texture.":"输出纹理的GL纹理名称。"," for each TV input that describes its meta information.":" 于描述其元信息的每个TV输入。","The URI of the icon representing this route, or null if none.":"表示此路由的图标的URI，如果没有，则为null。","frequency band whose center frequency is requested. The numbering of the bands\n starts from 0 and ends at (number of bands - 1).":"频带的中心频段。 乐队的编号 \n  从0开始，以（频段数-1）结束。","the controller to get the session command":"获取会话命令的控制器","the category at index":"索引的类别"," instance to store\n               the measurement values.":"实例存储 \n                测量值。","tolerance factor. A non-negative number representing\n                the maximum deviation of the playback rate from the playback rate\n                set. (":"公差因子。 代表非负号 \n                 播放率与播放率的最大偏差 \n                 放。 （（"," to be on top of another regular surface, ":"要在另一个常规表面上","the directionality of microphone":"麦克风的方向性","true if the ringtone contains haptic channels.":"如果铃声包含触觉通道，则为true。","The width of the content (in pixels)":"内容的宽度（以像素为单位）","The existing callback to remove.":"现有的回调要删除。","The height of the virtual display in pixels. Must be\n greater than 0.":"以像素为单位的虚拟显示器的高度。 必须是\n 大于0。","Delta to apply to the current volume\n":"Delta应用于当前卷\n","\n                       otherwise.":"否则。","A list of controllers for ongoing sessions.":"正在进行的会话的控制器列表。"," in case of success, ":"如果成功，","target video scaling mode. Must be one of the supported\n            video scaling modes; otherwise, IllegalArgumentException will be thrown.":"目标视频缩放模式。 必须是受支持的其中一个\n            视频缩放模式；否则将抛出IllegalArgumentException。","list of the connected controllers.":"连接控制器的列表。","the frequency response of the microphone":"麦克风的频率响应","The <code>TvInputInfo</code> object that contains new information.":"<code> tvInputinfo </code>包含新信息的对象。","The end time used to filter programs. The returned programs will have\n                       ":"用于过滤节目的结束时间。 返回的程序将有\n                       ","if true, match the start volume of the\n                        new ":"如果为true，则匹配\n                        新的 ","The height of the content (in pixels)":"内容的高度（以像素为单位）","whether to loop or not":"是否循环","The density of the virtual display in dpi. Must be greater\n than 0.":"DPI中虚拟显示的密度。 必须更大 \n  比0。","The description of the route, or null if none.\n":"路线的描述，如果没有，则无效。","the offset into the file where the data to be played starts,\n            in bytes. It must be non-negative":"到要播放的数据开始的文件中的偏移量,\n            以字节为单位。 它必须是非负的"," if the playback active, ":"如果播放活动，","the MtpStorageInfo, or null if fetching storage info fails":"MtpStorageInfo，如果获取存储信息失败，则为null","left volume scalar":"左音量标量","the group of the microphone or ":"麦克风或","The ID of the TV input associated with the recording session.":"与录音会话相关的电视输入的ID。","\n            if no recognizable DRM format is found;":"\n            如果没有找到可识别的DRM格式;"," that is less than or equal to\n                       ":"小于或等于","null if the key does not exist or the stored value for the key is null":"null如果键不存在或键的存储值为null","null if an invalid rating style is passed, a new Rating instance otherwise.":"null如果传递了无效的评级样式，则新的评级实例否则。","the maximum width in pixels":"以像素为单位的最大宽度","the length in bytes of the data to be played. It must be\n            non-negative.":"播放数据字节的长度。 肯定是 \n             非负。"," to the current volume of the existing\n                        ":"到现有的当前卷","A combination of virtual display flags. See ":"虚拟显示标志的组合。 看","\n                when its result is received.":"当收到结果时。","The context to use to create the session.":"用于创建会话的上下文。","the number of output ports":"输出端口的数量","index of the track.":"曲目索引。","a sound ID. This value can be used to play or unload the sound.":"一个声音ID。 此值可用于播放或卸载声音。","the length in bytes of the data to be played":"要播放的数据以字节为单位的长度","right volume scalar":"正确的音量标量","The ID of the program to point to.":"该程序指向的ID。"," if the group is unknown":"如果该组未知","The meta data value associate with the given keyCode on success;\n            null on failure.":"元数据值与成功时给定的密钥码相关联;\n            失败时为空。","the audio encoder to use.":"的音频编码器来使用。","the maximum height in pixels":"像素的最大高度","The FileDescriptor of the output media file.":"输出媒体文件的归档术语。","a session to be added.":"要添加的会话。","the ID of the session":"会话的ID","the power/wake mode to set":"设置的电源/唤醒模式","the path to the audio file":"音频文件的路径","The name of the parameter to adjust.":"要调整的参数的名称。","index of the preset. The valid range is [0, number of presets-1].":"预设的索引。 有效范围为[0，预设数-1]。","Whether to include DRM ringtones.\n            Obsolete - no longer has any effect":"是否包括DRM铃声。\n            过时-不再有任何效果","The ID of the recorded program to point to.":"录制程序的ID指向。","the audio encoding bit rate in bits per second.":"音频编码比特率以每秒的位数。","the audio session ID.\n            The audio session ID is a system wide unique identifier for the audio stream played by\n            this MediaPlayer instance.\n            The primary use of the audio session ID  is to associate audio effects to a particular\n            instance of MediaPlayer: if an audio session ID is provided when creating an audio effect,\n            this effect will be applied only to the audio content of media players within the same\n            audio session and not to the output mix.\n            When created, a MediaPlayer instance automatically generates its own audio session ID.\n            However, it is possible to force this player to be part of an already existing audio session\n            by calling this method.\n            This method must be called before one of the overloaded <code> setDataSource </code> methods.":"音频会话ID。 \n             音频会话ID是一个系统宽的唯一标识符，用于播放的音频流 \n             此MediaPlayer实例。 \n             音频会话ID的主要用途是将音频效果与特定 \n             MediaPlayer的实例：如果在创建音频效果时提供了音频会话ID， \n             此效果仅适用于同一媒体播放器的音频内容 \n             音频会话，而不是输出组合。 \n             创建时，MediaPlayer实例会自动生成自己的音频会话ID。 \n             但是，可以强迫该玩家成为已经存在的音频会话的一部分 \n             通过调用此方法。 \n             必须在超载<code> setDataSource </code>方法之一之前调用此方法。","A Bitmap containing a representative video frame, which\n                    can be null, if such a frame cannot be retrieved.":"包含代表性视频框架的位图，该视频框架 \n                     如果无法检索这样的框架，则可以为空。","index of the route to return":"返回路线的索引","The audio file.":"的音频文件。"," to be on top of its window, ":" 在它的窗户上, ","The format of the output media file.":"输出媒体文件的格式。","the non-null attributes characterizing this ringtone.":"表征该铃声的非零属性。","information of the session with the given id.\n                    null if the session is released or ID is not valid.":"带有给定ID的会话信息。 \n                     null如果会话已发布或ID无效。","frequency band that will have the new gain. The numbering of the bands starts\n            from 0 and ends at (number of bands - 1).":"频带将具有新的收益。 乐队的编号开始 \n             从0到（频段数-1）结束。","The remote user info from either\n                       ":"来自任何一个的远程用户信息\n                       ","the application context":"应用程序上下文","The new value to set the parameter to.":"将参数设置为的新值。","\n               in case of failure.":"\n               在故障的情况下。","Whether DRM ringtones will be included.":"是否将包括DRM铃声。","the Context to use":"使用的上下文","the AudioProfile to use":"使用的副主管","icon drawable to use to represent this route\n":"图标可绘制用来表示这条路线\n","null if no such graphic is found.":"如果找不到这样的图形，则为空。","The ID of the watch next program to point to.":"手表下一个程序的ID要指向。","the route at index":"索引的路线","true if the MediaPlayer is currently looping, false otherwise":"如果MediaPlayer当前正在循环，则为true，否则为false","the object's thumbnail, or null if reading fails":"对象的缩略图，如果读取失败，则为null","The ID of the TV input associated with the session.":"会话相关联的电视输入的ID。","The desired thumbnail kind, such as\n                       ":"所需的缩略图，例如","The path of the output media file.":"输出媒体文件的路径。","The ID of the TV input that created the given recorded program.":"创建给定录制程序的电视输入的ID。","defaultValue if the key does not exist or the stored value for the key is null":"defaultValue如果键不存在或键的存储值为null","the resource ID":"资源ID"," that were set with\n                ":"与","array of bytes where the waveform should be returned":"字节数组应返回波形","the ID of the previous request":"先前请求的ID","the sampling rate for audio in samples per second.":"每秒样品中音频的采样率。","the Uri from which to get the datasource":"获取数据源的URI","Resource ID of an icon drawable to use to represent this route\n":"可用于表示此路线的图标的资源ID"," if the remote user is trusted and its package name matches with the UID.\n                       ":"如果远程用户被信任，并且其软件包名称与UID匹配。","new gain in millibels that will be set to the given band. getBandLevelRange()\n            will define the maximum and minimum values.":"将把新收益设置为给定带。 getBandlevelrange（） \n             将定义最大值和最小值。","a rating value greater or equal to 0.0f, or a negative value if the rating style is\n               not percentage-based, or if it is unrated.":"大于或等于0.0f的评级值，如果评级样式为负值，则为负值\n               不是基于百分比的，或者如果它是未评级的。","The listener to receive update callbacks on.":"侦听器接收更新回调。","A short name for debugging purposes.":"用于调试目的的短名称。","file descriptor to write the data to for the file transfer.":"文件描述符将数据写入文件传输。",", to avoid discontinuity.":"，以避免不连续。"," for the full\n list of flags.":" 为全\n 标志列表。"," is a channel URI.":"是通道URI。","0-based index of the video frame. The frame index must be that of\n                   a valid frame. The total number of frames available for retrieval can be queried\n                   via the ":"视频框架的0基索引。 框架索引必须是 \n                    有效的框架。 可以查询可检索的框架总数 \n                    通过"," containing the set of attributes and values\n            available for the media being handled by this instance of MediaPlayer\n            The attributes are descibed in ":"包含一组属性和值 \n             可用于由MediaPlayer的这种实例处理的媒体 \n             该属性在","The URI of a recorded program.":"录制程序的URI。","a MediaPlayer object, or null if creation failed":"媒体播放器对象，如果创建失败，则无效","the audio source to use":"使用的音频源","The desired thumbnail size.":"所需的缩略图大小。","the device's properties":"设备的属性","a list of available audio presentations for a given valid audio track index.\n            The list will be empty if the source does not contain any audio presentations.":"给定有效音轨索引的可用音频演示的列表。\n            如果源不包含任何音频演示文稿，列表将为空。","the name of a ":"一个名称","The media format for the track.  This must not be an empty\n               MediaFormat.":"曲目的媒体格式。 这一定不能是空的 \n                MediaFormat。"," or the default attributes if none were set.":"或如果没有设置，则默认属性。","Name to display to the user to describe this route\n":"向用户显示以描述此路线的名称","the microphone's id":"麦克风的id","information of the controller which is trying to connect.":"试图连接的控制器的信息。","a FileDescriptor object":"一个备用的对象","a rating value greater or equal to 0.0f, or a negative value if the rating style is\n               not star-based, or if it is unrated.":"评级值更大或等于0.0F，或者如果评分样式为负值 \n                不是基于恒星的，或者如果没有恒星。","newly created session2 token":"新创建的Session2令牌","The EffectFactory instance for this context.":"此上下文的效果实例。","the maximum capture rate expressed in milliHertz":"Millihertz表示的最大捕获率","the A/V sync params to apply":"要应用的A/V同步参数","new preset that will be taken into use. The valid range is [0,\n            number of presets-1].":"将使用的新预设。 有效范围是[0， \n             预设1]。","true if the file transfer succeeds":"如果文件传输成功，则为","A bundle for additional information about this session.\n                               Controllers can get this information by calling\n                               ":"一个捆绑包，以获取有关此会话的其他信息。 \n                                控制器可以通过致电获取此信息","The stream type.":"的流类型。","The image file.":"图像文件。","route types":"路线类型","the microphone's index in its group or ":"麦克风在其小组中的索引或","The surface to which the content of the virtual display\n should be rendered, or null if there is none initially.":"虚拟内容显示的表面 \n  如果最初没有，则应渲染，或者为null。","the raw resource id (<var>R.raw.&lt;something></var>) for\n                         the resource to use as the datasource":"原始资源ID（<var> r.raw。＆lt; sosings> </var>） \n                          用作数据源的资源"," key.":"钥匙。","The time position to seek to, in milliseconds since the epoch.":"自时代以来，以毫秒为单位的时间位置。","the Camera to use for recording":"用于录制的相机","Resource ID of the name to display to the user to describe this route\n":"名称的资源ID向用户显示以描述此路线","a String key":"字符串键","Latitude in degrees. Its value must be in the range [-90,\n            90].":"纬度为程度。 它的值必须在[-90， \n             90]。","The application context to create a TvRecordingClient with.":"创建TvRecordingClient的应用程序上下文。",".\n                               An ":"。 \n                                一个","of the track.":"曲目。"," is a channel URI for a pass-through input.":"是通道输入输入的通道URI。","the device's type":"设备的类型","the volume, linearly represented as a value between 0.f and 1.f.":"该音量线性表示为0.f和1.f之间的值。","the reason why the request has failed":"请求失败的原因"," instance for the controller to connect to, or ":"控制器连接到或","A context used for querying.":"用于查询的上下文。","the playback params.":"播放参数。","offset to the start of the sound":"偏移到声音的开始","the Equalizer on which the interface is registered.":"接口注册的均衡器。","The ringtone ":"铃声","The name of the effect to create.":"创建效果的名称。","the A/V sync params":"A/V同步参数","the sampling rate in milliHertz.":"Millihertz中的采样率。","path to destination for the file transfer.\n                 This path should be in the external storage as defined by\n                 ":"通往文件传输目的地的路径。 \n                  此路径应在外部存储中定义","The intent that will be sent for the media button events sent\n                by remote controls.\n                This intent needs to have been constructed with the ":"发送的媒体按钮事件将发送的意图发送 \n                 通过遥控器。 \n                 这种意图需要用","The id of the currently active item in the queue or\n                    ":"队列中当前活动项目的ID或","Callback to call when the virtual display's state\n changes, or null if none.":"虚拟显示状态时要回电 \n  更改或无效，如果没有。"," object describing the conditional access system.":"描述条件访问系统的对象。","Rate at which frames should be captured in frames per second.\n            The fps can go as low as desired. However the fastest fps will be limited by the hardware.\n            For resolutions that can be captured by the video camera, the fastest fps can be computed using\n            ":"应以每秒框架捕获的框架的速率。 \n             FPS可以根据需要走低。 但是，最快的FPS将受到硬件的限制。 \n             对于可以由摄像机捕获的分辨率，可以使用最快的FPS计算","The callback to receive recording status changes.":"收到记录状态更改的回调。","The playback params.":"播放参数。","Longitude in degrees. Its value must be in the range\n            [-180, 180].":"经度为程度。 它的价值必须在范围内 \n             [-180，180]。","Callback to remove":"回调要删除","\n                    to reject connection":"拒绝连接","true if the key exists in this metadata, false otherwise":"如果关键存在于此元数据中，则为false，否则为否则","A Bitmap containing the requested video frame, or null if the retrieval fails.":"包含请求的视频框架的位图，如果检索失败，则null。","Status to display to the user to describe what the endpoint\n of this route is currently doing\n":"显示向用户显示以描述端点的状态 \n  这条路线当前正在做"," if the\n            index in the group is unknown":"如果是 \n             小组中的索引未知","The video file.":"视频文件。","system wide unique audio session identifier. The AcousticEchoCanceler\n            will be applied to the AudioRecord with the same audio session.":"系统广泛的唯一音频会话标识符。 声学技术 \n             将通过同一音频会话应用于Audiorecord。","the SurfaceHolder to use for displaying the video":"用于显示视频的表面持有人"," will be thrown if this contains\n                               any non-framework Parcelable objects.":"如果其中包含 \n                                任何非框架包装对象。"," is a channel URI for a tuner input.":"是调谐器输入的通道URI。","our MidiDeviceInfo":"我们的MidideViceInfo","length of the sound":"声音长度","true if the HapticGenerator is enabled.":"如果启用了Hapticgenerator，则正确。","the ID of the previous request to create this session provided in\n                             ":"先前请求创建此会话的ID","The extras for this state or null.":"该状态或无效的附加功能。","The UUID of the crypto scheme. If not known beforehand, it can be retrieved\n            from the source through ":"加密计划的UUID。 如果事先未知，可以检索 \n             从来源到","a MediaTimestamp object if a timestamp is available, or ":"如果有时间戳，则中介对象或","requested capture size":"请求的捕获尺寸"," to be checked.":"被检查。","A new Effect instance.":"一个新的效果实例。","an open ":"开放","\n                action, and have a component that will handle the intent (set with\n                ":"动作，并具有将处理意图的组件（设置","The handler to invoke the callback on.":"处理程序调用回调。","The ID of TV input for the given channel.":"给定频道的电视输入ID。","Definition of the route to remove":"删除路线的定义","the angle to be rotated clockwise in degrees.\n            The supported angles are 0, 90, 180, and 270 degrees.":"以程度顺时针旋转的角度。 \n             支撑角度为0、90、180和270度。","additional parameter qualifier (e.g the band for band level parameter).":"附加参数预选赛（例如，带级参数的频段）。"," to be used by the media player.":"媒体播放器使用。","a session that needs notification update.":"需要通知更新的会话。","The android.media.MediaCodec.CryptoInfo structure\n                        to be filled in.":"android.media.mediacodec.cryptoinfo结构 \n                         被填补。",". For higher\n            resolutions the fastest fps may be more restrictive.\n            Note that the recorder cannot guarantee that frames will be captured at the\n            given rate due to camera/encoder limitations. However it tries to be as close as\n            possible.":"。 更高 \n             决议最快的FPS可能更加限制。 \n             请注意，录音机不能保证将在 \n             由于相机/编码器的限制，给定速率。 但是它试图与 \n             可能的。","Whether this session is active or not.":"本会话是否处于活动状态。","the location of the microphone":"麦克风的位置","The time position where the frame will be retrieved.\n            When retrieving the frame at the given time position, there is no\n            guarentee that the data source has a frame located at the position.\n            When this happens, a frame nearby will be returned. If timeUs is\n            negative, time position and option will ignored, and any frame\n            that the implementation considers as representative may be returned.":"将检索框架的时间位置。 \n             在给定时间位置检索框架时，没有 \n             Guarentee认为数据源在该位置上有一个框架。 \n             发生这种情况时，将返回附近的框架。 如果是时代 \n             负，时间位置和选项将被忽略，任何框架 \n             可以将实施视为代表。","array of MidiReceivers":"一系列中级媒介","the route affected by this event":"受此活动影响的路线","A simple description of this metadata.":"这个元数据的简单描述。","AcousticEchoCanceler created or null if the device does not implement AEC.":"如果设备未实现AEC，则创建或无效。","a streamID returned by the play() function":"play（）函数返回的流媒体"," on which the callback should be\n invoked, or null if the callback should be invoked on the calling\n thread's main ":"回调应为 \n  调用，如果应在呼叫上调用回调，则为null \n  线程的主",". Can be\n                             ":"。 可"," or registering a ":"或注册","The last time the position was updated.":"该职位上次更新时。","the format of the object":"对象的格式","original bitmap source":"原始位图源","Domain-specific data for this request.":"此请求的特定域数据。"," is a program URI.":"是程序URI。","the audio session ID to be used by the media player,\n                see ":"媒体播放器使用的音频会话ID， \n                 看","the number of routes tracked by this router":"该路由器跟踪的路线数量","OnDataCaptureListener registered":"OnDataCaptureListener注册","The name of the effect.":"效果的名称。","system wide unique audio session identifier. The HapticGenerator will be\n                                applied to the players with the same audio session.":"系统广泛的唯一音频会话标识符。 Hapticgenerator将是 \n                                 通过相同的音频会话应用于播放器。","The track index for this sample.":"该样本的轨道索引。"," is a default.":"是默认值。",") registered with\n                ":"）注册","a persistent input surface created by\n                      ":"由","True if playing, false otherwise.":"如果播放，则为false。"," if no timestamp\n                    is available, e.g. because the media player has not been initialized.":"如果没有时间戳 \n                     可用，例如 因为媒体播放器尚未初始化。","a session to be removed.":"要删除的会话。"," for the device":"对于设备","true iff the sample flags contain ":"是的，如果示例标志包含","the maximum level in dB or ":"DB或","an integer indicating the new volume value that should be used, always\n     between 0 and the value set by ":"一个整数，指示应使用的新卷值，始终 \n      在0和设置的值之间","The key the value is stored under":"值存储在下面的关键","True if the session is active, false otherwise.":"如果会话处于活动状态，则为false，否则为false。","the offset in milliseconds from the start to seek to":"从一开始就以毫秒为单位的偏移","true if the device implements acoustic echo cancellation, false otherwise.":"如果设备实现声音回声取消，则为true，否则为false。","A Bitmap of size dst_widthxdst_height containing a representative\n                    video frame, which can be null, if such a frame cannot be retrieved.":"大小dst_widthxdst_height包含代表的位图 \n                     视频框架，如果无法检索这样的框架，则可以为null。","the number of the port that was opened":"打开的港口数量","a soundID returned by the load() function":"LOAD（）函数返回的声音","The callback to call.":"回电。","true if the object is abstract":"如果对象是抽象的，则为true","sessions":"会议"," if this session is created without any request.":"如果创建此会话，则没有任何请求。","type flags indicating which types this route should be used for.\n                         The route must support at least a subset.":"类型标志，指示该路线应用于哪种类型。 \n                          该路线必须至少支持一个子集。","rate in milliHertz at which the capture should be updated":"在Millihertz中应更新捕获的比率","The encoded sample.":"编码样本。","true if the device was successfully opened.":"如果设备成功打开，则为是真的。"," is a recorded program URI.":"是录制的程序URI。","whether to loop or not.":"是否循环。"," to obtain a new session.":"获得新会议。","latitude in degrees. Its value must be in the\n            range [-90, 90].":"纬度为程度。 它的价值必须在 \n             范围[-90，90]。","true, if the effect is supported on this platform.":"是的，如果在此平台上支持效果。","targeted width":"目标宽度","The name of the private command to send. This <em>must</em> be a scoped name,\n                       i.e. prefixed with a package name you own, so that different developers will not\n                       create conflicting commands.":"要发送的私人命令的名称。 此<em>必须</em>是一个范围的名称， \n                        即带有您拥有的软件包名称的前缀，因此不同的开发人员不会 \n                        创建冲突的命令。","The current speed of playback.":"当前的播放速度。","HapticGenerator created or null if the device does not support HapticGenerator or\n                                    the audio session is invalid.":"如果设备不支持Hapticgenerator或 \n                                     音频会话无效。","the height of the video, or 0 if there is no video,\n            no display surface was set, or the height has not been determined\n            yet. The OnVideoSizeChangedListener can be registered via\n            ":"视频的高度，如果没有视频，则为0 \n             没有设置显示表面，否则尚未确定高度 \n             然而。 可以通过","\n                before this new RemoteControlClient can itself be registered with\n                ":"在此新的remotecontrolclient本身可以注册之前","the Context to use when resolving the Uri.":"解决URI时要使用的上下文。","the device info":"设备信息","the offset in milliseconds from the start to seek to.\n            When seeking to the given time position, there is no guarantee that the data source\n            has a frame located at the position. When this happens, a frame nearby will be rendered.\n            If msec is negative, time position zero will be used.\n            If msec is larger than duration, duration will be used.":"从一开始就偏移了毫秒。 \n             在寻求给定时间位置时，无法保证数据源 \n             有一个位于该位置的框架。 发生这种情况时，附近的框架将被渲染。 \n             如果MSEC为负，则将使用零时间位置。 \n             如果MSEC大于持续时间，则将使用持续时间。","A controller for this session.":"本会话的控制器。","the playback params to use. ":"播放参数要使用。"," if maximum SPL is unknown":"如果最大SPL未知","an integer indicating whether the volume is to be increased\n     (positive value) or decreased (negative value).\n     For bundled changes, the absolute value indicates the number of changes\n     in the same direction, e.g. +3 corresponds to three \"volume up\" changes.\n":"一个整数，指示是否要增加音量 \n      （正值）或降低（负值）。 \n      对于捆绑的更改，绝对值表示更改的数量 \n      在相同的方向上，例如 +3对应于三个“音量上”更改。","left volume value (range = 0.0 to 1.0)":"左音量值（范围= 0.0到1.0）","Route to select":"选择路线"," containing the set of attributes and values\n            available for the media container being handled by this instance\n            of MediaExtractor.\n            The attributes are descibed in ":"包含一组属性和值 \n             可用于此实例处理的媒体容器 \n             MediaExtractor。 \n             该属性在","The handler on which the callback should be invoked, or\n            null if the callback should be invoked on the calling thread's looper.":"应调用回调的处理程序，或 \n             null如果应在调用线程的循环器上调用回调。","a long value":"一个长的价值","The buffer information related to this sample.":"与此样本有关的缓冲信息。"," for the MTP or PTP device":"对于MTP或PTP设备","longitude in degrees. Its value must be in the\n            range [-180, 180].":"经度为程度。 它的价值必须在 \n             范围[-180，180]。","the requested enable state":"请求的启用状态","The time position where the frame will be retrieved.\n            When retrieving the frame at the given time position, there is no\n            guarantee that the data source has a frame located at the position.\n            When this happens, a frame nearby will be returned. If timeUs is\n            negative, time position and option will ignored, and any frame\n            that the implementation considers as representative may be returned.":"将检索框架的时间位置。 \n             在给定时间位置检索框架时，没有 \n             确保数据源具有位于该位置的框架。 \n             发生这种情况时，将返回附近的框架。 如果是时代 \n             负，时间位置和选项将被忽略，任何框架 \n             可以将实施视为代表。","true if this player loops when playing.":"如果该玩家在比赛时循环循环。","information of the new session.\n                               The ":"新会议的信息。 \n                                这","handle of the target file":"目标文件的句柄","The effect that has been updated.":"已更新的效果。","The context for accessing content provider.":"访问内容提供商的上下文。","true if a waveform capture is requested: the onWaveFormDataCapture()\n            method will be called on the OnDataCaptureListener interface.":"如果请求波形捕获：onWaveFormDataCapture（） \n             方法将在OnDataCaptuRelistener接口上调用。","targeted height":"目标高度","The desired default URI to open.":"所需的默认URI打开。"," if this object contains ":" 如果此对象包含 ","The Looper running the event loop.":"运行事件循环的循环。","The name of the event to send":"要发送的事件的名称","the MediaRouter reporting the event":"Mediarouter报告活动","true if the HapticGenerator is available on the device.":"如果在设备上可用触觉加速器，则为true。","the SurfaceHolder to use for displaying the video, may be null.":"用于显示视频的表面持有人可能是无效的。","the output port's port number":"输出端口的端口号","An optional bundle to send with the command.":"与命令一起发送的可选捆绑包。","\n            to provide a notification when the height is available.":"\n            高度可用时提供通知。","the executor to execute the callback on":"执行人执行回调","the minimum level in dB or ":"DB或","the mode indicating where exactly to seek to.\n            Use ":"指示确切位置的模式。\n            使用方法 "," from which to obtain the media\n                container data.":"从中获得媒体 \n                 容器数据。","right volume value (range = 0.0 to 1.0)":"正确的音量值（范围= 0.0到1.0）"," is the ratio between desired playback rate and normal one. 1.0 means\n                normal playback speed. 0.0 means pause. Value larger than 1.0 means faster playback,\n                while value between 0.0 and 1.0 for slower playback. <b>Note:</b> the normal rate\n                does not change as a result of this call. To restore the original rate at any time,\n                use speed of 1.0.":"是所需的播放率与正常播放率之间的比率。 1.0表示 \n                 正常的播放速度。 0.0表示暂停。 大于1.0的值表示更快的播放， \n                 而值在0.0到1.0之间，播放速度较慢。 <b>注意：</b>正常率 \n                 由于这个电话不会改变。 为了随时恢复原始费率， \n                 使用1.0的速度。","The result code from ":"结果代码从 ","a hint on how the frame is found. Use\n            ":"提示如何找到框架。 利用"," of the session must be unique.":"会话的内容必须是唯一的。","the maximum duration in ms (if zero or negative, disables the duration limit)":"MS中的最大持续时间（如果零或负，则禁用持续时间限制）","a String value, or null":"字符串值或null",".\n            \n             Additional vendor-specific fields may also be present in\n             the return value.":".\n            \n             其他特定于供应商的字段也可能存在于\n             的返回值。","handle of the object to delete":"要删除的对象的句柄","system-wide unique audio session identifier. The LoudnessEnhancer\n            will be attached to the MediaPlayer or AudioTrack in the same audio session.":"系统范围唯一的音频会话标识符。 Loudnessenhancer \n             将在同一音频会话中附加到Mediaplayer或Audiotrack上。","The domain string. For example, \"com.android.tv\".":"域字符串。 例如，“ com.android.tv”。","a new AssetFileDescriptor pointing to the file. You own this descriptor\n            and are responsible for closing it when done. This value may be ":"一个指向文件的新的AssetFiledScriptor。 您拥有此描述符 \n             并负责在完成后关闭它。 这个值可能是","The channel ID to be browsable.":"可浏览的通道ID。","true if the HapticGenerator effect is successfully enabled. Otherwise, return false.":"如果成功启用了Hapticgenerator效应，则为正确。 否则，返回false。","output port open count":"输出端口开放计数","A value that gives more information about the update. See the effect's\n                        documentation for more details on what this object is.":"提供有关更新的更多信息的值。 看到效果的 \n                         文档以获取有关此对象的更多详细信息。","the effect on which the interface is registered.":"接口注册的效果。","options used during thumbnail extraction":"缩略图提取过程中使用的选项","size of the file in bytes":"以字节为单位的文件大小","the list of routes that contains at least one of the route features in discovery\n            preferences registered by the application":"发现中至少包含一个路线特征之一的路线列表 \n             申请注册的首选项","Route that has become available for use\n":"已可供使用的路线\n"," if one wants to seek to a sync frame\n            that has a timestamp earlier than or the same as msec. Use\n            ":"如果一个人想寻求同步框架 \n             该时间戳比MSEC早或相同。 利用","Whether there is any data left to extract. Returns false if the end of input has been\n                reached.":"是否剩下任何数据要提取。 如果输入的结束已经结束，则返回false \n                 到达。","The resulting data from ":"来自","the playback rate being used.":"播放率正在使用。","the current position in milliseconds":"以毫秒为单位的当前位置","true if a frequency capture is requested: the onFftDataCapture() method will be\n            called on the OnDataCaptureListener interface.":"如果请求频率捕获，则为true：onFftDataCapture()方法将为\n            ondatacapturelistener接口上调用。","Supplies a ":"提供","The URI for the TV program to record, built by\n                       ":"电视节目录制的URI，由\n                       ","the timestamp in microsecond for the timed metadata":"定时元数据微秒的时间戳","The rating system string. For example, \"US_TV\".":"评分系统字符串。 例如，“ US_TV”。","Set to false if you want the MetadataEditor to contain the metadata that\n                was previously applied to the RemoteControlClient, or true if it is to be created empty.":"如果您希望MetadataEditor包含以下元数据，请设置为false\n                以前应用于RemoteControlClient，如果要创建为空，则为true。","The type whose default sound should be set. One of\n                       ":"应设置其默认声音的类型。 之一","true if the application has been granted control of the effect\n engine, false otherwise.\n":"如果已授予该效果的控制，则为true \n  引擎，否则为错误。","Any extras included with the event":"活动包括的任何额外费用","the effect target gain expressed in mB. 0mB corresponds to no amplification.":"MB中表达的效应目标增益。 0MB对应于无扩增。"," in case of success,\n            ":"如果成功，"," to which extracted data is output.":"提取的数据是输出的。","the width of the video, or 0 if there is no video,\n            no display surface was set, or the width has not been determined\n            yet. The OnVideoSizeChangedListener can be registered via\n            ":"视频的宽度，如果没有视频，则为0,\n            未设置显示面，或宽度尚未确定\n            然而。 该OnVideoSizeChangedListener可以通过注册\n            ","stream priority (0 = lowest priority)":"流优先级（0=最低优先级）","the buffer that holds the data to play. This buffer will be returned\n                to the client via registered callback.":"保存数据的缓冲区。 此缓冲区将被返回 \n                 通过注册回调给客户端。","Domain-specific data for this request. Keys <em>must</em> be a scoped\n                       name, i.e. prefixed with a package name you own, so that different developers will\n                       not create conflicting keys.":"此请求的特定域数据。 键<em>必须</em>是范围 \n                        名称，即带有您拥有的软件包名称，以便不同的开发人员将 \n                        不创建冲突的钥匙。","the metadata array for the timed metadata. No data copying is made.\n                It should not be null.":"定时元数据的元数据阵列。 没有进行数据复制。 \n                 它不应为无效。","The caller's context.":"来电者的上下文。"," if minimum SPL is unknown":" 如果最小SPL未知"," if one wants to seek to a sync frame\n            that has a timestamp later than or the same as msec. Use\n            ":"如果一个人想寻求同步框架 \n             它的时间戳比MSEC晚或相同。 利用","the ID of the released session.":"释放的会话的ID。","the maximum filesize in bytes (if zero or negative, disables the limit)":"最大文件大小以字节为单位（如果为零或负值，则禁用限制）","a new MetadataEditor instance.":"一个新的元数据eDitor实例。"," if one wants to retrieve a sync frame\n            that has a timestamp earlier than or the same as timeUs. Use\n            ":" 如果要检索同步帧\n            它的时间戳早于timeUs或与timeUs相同。 使用方法\n            ","a CharSequence value, or null":"CharSequence值，或null","A token that can be used to create a MediaController for this\n                    session":"一个可用于创建媒体控制器的令牌 \n                     会议","system wide unique audio session identifier. The NoiseSuppressor\n            will be applied to the AudioRecord with the same audio session.":"系统广泛的唯一音频会话标识符。 噪音抑制器 \n             将通过同一音频会话应用于Audiorecord。","new effect state.\n":"新效应状态。","The content rating string. For example, \"US_TV_PG\".":"内容额定字符串。 例如，“ US_TV_PG”。","a map of uuid-to-bytes, with the uuid specifying\n            the crypto scheme, and the bytes being the data specific to that scheme.\n            This can be ":"uuid-to-bytes的映射，uuid指定\n            加密方案，字节是特定于该方案的数据。\n            这可以是 ","The names of the parsers to sniff the content with. If empty, a default\n                array of names is used.":"用解析器的名称嗅探内容。 如果为空，则默认 \n                 使用名称数组。","loop mode (0 = no loop, -1 = loop forever)":"循环模式（0 = no loop，-1 =永远的循环）","true if the deletion succeeds":"如果删除成功，则为true","The stream, see ":"小溪，看 ","the input port's port number":"输入端口的端口号","the ID of this request":"此请求的ID","The token for the session.":"会议的令牌。","file descriptor to read the data from.":"文件描述符来读取数据。","the orientation of the microphone or ":"麦克风或","The ID of the TV input for the given channel.":"给定频道的电视输入的ID。","raw, uninterpreted content of this metadata access unit; for ID3 tags this includes\n            everything starting from the 3 byte signature \"ID3\".":"此元数据访问单元的原始，未解释的内容； 对于ID3标签，这包括 \n             从3个字节签名“ ID3”开始的一切。","A listener to send optional app-specific hints when creating a controller.\n                            ":"创建控制器时发送可选应用程序特定提示的侦听器。\n                            ","playback rate (1.0 = normal playback, range 0.5 to 2.0)":"播放率（1.0 =正常播放，范围0.5至2.0）","The route that was changed\n":"更改的路线\n","the timestamp since the instance is created, or -1 if unknown.":"自实例创建以来的时间戳，如果未知，则为-1。","a Set of String keys":"一组字符串键","the device info, or null if fetching device info fails":"设备信息或null如果获取设备信息失败","NoiseSuppressor created or null if the device does not implement noise\n            suppression.":"如果设备无法实现噪声，则创建或无效 \n             抑制。"," if one wants to retrieve a sync frame\n            that has a timestamp later than or the same as timeUs. Use\n            ":"如果一个人想检索同步框架 \n             它的时间戳比时间戳或时间段或相同。 利用","the index of the track to be deselected. The valid range of the index\n            is 0..total number of tracks - 1. The total number of tracks as well as the type of\n            each individual track can be found by calling ":"要取消选择的轨道的索引。 索引的有效范围\n            为0。.曲目总数-1。 轨道的总数以及轨道的类型\n            每个单独的轨道可以通过调用找到 ","A new instance.":"一个新实例。"," used to check if this TV input is hidden.":" 用于检查此电视输入是否隐藏。"," pointing to the default sound to set.":" 指向要设置的默认声音。"," if the source does not contain PSSH info.":"如果源不包含PSSH信息。","system wide unique audio session identifier. The AutomaticGainControl\n            will be applied to the AudioRecord with the same audio session.":"系统广泛的唯一音频会话标识符。 自动control \n             将通过同一音频会话应用于Audiorecord。"," in case of failure.":" 在故障的情况下。","The direction to adjust the volume in.":"调整音量的方向。","\n            to provide a notification when the width is available.":"\n            宽度可用时提供通知。","input port open status":"输入端口打开状态","the timestamp associated with this metadata access unit in microseconds;\n            0 denotes playback start.":"与此元数据访问单元相关的时间戳； \n             0表示播放开始。","metadata of the entry":"条目的元数据","The route that was added":"添加的路线","an integer used to identify audioData. It will be returned to\n                the client along with audioData. This helps applications to keep track of audioData,\n                e.g., it can be used to store the output buffer index used by the audio codec.":"用于标识audioData的整数。 它将返回到\n                与audioData一起的客户端。 这有助于应用程序跟踪audioData,\n                例如，它可以用于存储音频编解码器使用的输出缓冲器索引。"," if one wants to seek to a sync frame\n            that has a timestamp closest to or the same as msec. Use\n            ":" 如果要寻求同步帧\n            它具有与msec最接近或相同的时间戳。 使用方法\n            ","The file to use.":"要使用的文件。"," if one wants to retrieve a sync frame\n            that has a timestamp closest to or the same as timeUs. Use\n            ":"如果一个人想检索同步框架 \n             它的时间戳最接近或相同。 利用","A media session object or null.":"媒体会话对象或null。","AutomaticGainControl created or null if the device does not implement AGC.":"如果设备未实现AGC，则创建或无效。","The number of fields in the metadata.":"元数据中的字段数。","true if the device implements noise suppression, false otherwise.":"如果设备实现噪声抑制，则为true，否则为错误。","The sub-rating strings. For example, \"US_TV_D\" and \"US_TV_L\".":"子评级字符串。 例如，\"US_TV_D\"和\"US_TV_L\"。","The stream type, see ":"流类型，请参阅 ","The callback object":"回调对象","The URI of a channel.":"通道的URI。","the MediaPlayer the update pertains to":"MediaPlayer的更新与"," if one wants to retrieve a frame that may\n            or may not be a sync frame but is closest to or the same as timeUs.\n            ":"如果一个人想检索一个可能的框架 \n             或者可能不是同步框架，但与Timeus最接近或相同。","the package name of the application that selected the route":"选择路由的应用程序的包名称"," if orientation\n            is unknown":" 如果方向\n            未知","the metadata update listener":"元数据更新听众"," for unset.":" 为未设置。","non-zero streamID if successful, zero if failed":"如果成功，则非零streamID，如果失败，则为零","a string containing the rating information, which can later be stored in the\n                    database.":"包含评级信息的字符串，后来可以存储在 \n                     数据库。","The group the route was added to":"小组添加了路线","the audio underrun count, or -1 if unknown.":"音频欠载计数，如果未知，则为-1。"," if one wants to seek to a frame that may\n            or may not be a sync frame but is closest to or the same as msec.\n            ":"如果一个人想寻找一个可能的框架 \n             或可能不是同步框架，但与MSEC最接近或相同。","true if the device implements automatic gain control, false otherwise.":"如果设备实现自动增益控制，则为true，否则为false。","handle of the object to read":"要读取的对象的句柄","the duration in milliseconds, if no duration is available\n                    (for example, if streaming live content), -1 is returned.":"持续时间（以毫秒为单位），如果没有持续时间可用\n                    （例如，如果流式传输实时内容），则返回-1。","The name of the parser that will be associated with the created instance.":"将与创建的实例关联的解析器的名称。"," often has larger performance overhead compared\n            to the other options if there is no sync frame located at timeUs.":"相比之下，通常具有更大的性能 \n             如果在TimeUS上没有同步框架，则进行其他选项。"," if the user marked this TV input hidden in settings. ":" 如果用户将此电视输入标记为隐藏在设置中。 ","requested enable state":"请求的启用状态","the listener to be called to retrieve the playback position":"被打电的听众以检索播放位置","The type(s), one or more of ":"类型、一个或多个 ","the priority level requested by the application for controlling the BassBoost\n            engine. As the same engine can be shared by several applications, this parameter indicates\n            how much the requesting application needs control of effect parameters. The normal priority\n            is 0, above normal is a positive number, below normal a negative number.":"应用程序控制BassBoost要求的优先级 \n             引擎。 由于可以通过多个应用程序共享相同的引擎，因此此参数指示 \n             请求应用程序需要控制效果参数。 正常优先级 \n             IS 0，高于正常值，是一个正数，低于正常A负数。","Any flags to pass with the command.":"命令传递的任何标志。"," often has larger performance overhead compared\n            to the other options if there is no sync frame located at msec.":"相比之下，通常具有更大的性能 \n             如果在MSEC上没有同步框架，则进行其他选项。","the destination byte buffer":"目标字节缓冲区","the size of the object (this should match\n                 ":"物体的大小（这应该匹配"," to which track data and samples are pushed.":"推动跟踪数据和样品的推向。","the route you want to transfer the current media to. Pass ":"您要将当前媒体转移到的路线。 经过","true if just unloaded, false if previously unloaded":"如果只是卸载，则为true","the rectangle region to render the characters in the timed text.\n            If no bounds information is available (a null is returned), render the\n            timed text at the center bottom of the display.":"呈现定时文本中的字符的矩形区域。\n            如果没有边界信息可用（返回null），则呈现\n            显示中心底部的定时文本。","A Bitmap containing a representative video frame, which can be null,\n                    if such a frame cannot be retrieved. ":"包含代表性视频框架的位图，可以为null， \n                     如果无法检索这样的框架。","the presentation timestamp in microseconds for the first frame\n                in the buffer.":"第一帧的呈现时间戳（以微秒为单位）\n                缓冲区中。"," used to load the custom label.":"用于加载自定义标签。","object info of the created entry, or null if sending object info fails":"创建的条目的对象信息，如果发送对象信息失败，则为null","the property name\n            \n            Standard fields names are:\n            ":"属性名称 \n            \n             标准字段名称是：","the port's port number":"端口的端口号","system wide unique audio session identifier. The BassBoost will be\n            attached to the MediaPlayer or AudioTrack in the same audio session.":"系统广泛的唯一音频会话标识符。 Bassboost将是 \n             在同一音频会话中附带到Mediaplayer或Audiotrack上。","an open file descriptor to be written into.":"要写入的打开文件描述符。","the position update listener to be called":"位置更新侦听器被称为","If true, the previously retrieved\n                       ":"如果是真的，先前检索","the index of the track to be selected. The valid range of the index\n            is 0..total number of track - 1. The total number of tracks as well as the type of\n            each individual track can be found by calling ":"要选择的曲目索引。 索引的有效范围 \n             IS 0 ..轨道的总数 -  1.轨道总数和类型 \n             可以通过打电话找到每个单独的曲目","the type of metadata that can be edited. The supported key is\n                ":"可以编辑的元数据类型。 支持的密钥是\n                ","the sample ID of the sound loaded.":"加载声音的示例ID。","the characters as a String object in the TimedText. Applications\n            should stop rendering previous timed text at the current rendering region if\n            a null is returned, until the next non-null timed text is received.":"字符作为序列文本中的字符串对象。 申请 \n             应停止在当前渲染区域渲染以前的定时文本 \n             返回零，直到接收到下一个非零定时文本为止。","the PresetReverb on which the interface is registered.":"注册接口的PresetReverb。","The handler that events should be posted on.\n":"事件应该发布的处理程序。\n","a raw scalar in range 0.0 to 1.0, where 0.0 mutes this player, and 1.0\n              corresponds to no attenuation being applied.":"在0.0到1.0范围内的原始标量，其中0.0使这个玩家静音，而1.0\n              对应于没有被施加衰减。","the percentage (0-100) of the content\n                that has been buffered or played thus far\n":"含量的百分比（0-100\n                到目前为止已经缓冲或播放\n","the ID of the route initially being connected":"最初连接的路由的ID"," key":"钥匙","supported event code. Can be null if device does not provide the property.":"支持的事件代码。 如果设备不提供属性，则可以为null。","Domain-specific data for this tune request. Keys <em>must</em> be a scoped\n                       name, i.e. prefixed with a package name you own, so that different developers will\n                       not create conflicting keys.":"此tune请求的域特定数据。 键<em>必须是一个范围\n                       名，即前缀一个你自己的包名，这样不同的开发者会\n                       不创建冲突的密钥。","the geometric location of the microphone or ":"麦克风的几何位置或 "," object containing the domain, rating system, rating and\n                    sub-ratings information encoded in ":" 包含域、评级系统、评级和\n                    编码于 ","the file object to be written into.":"要写入的文件对象。","The route index within group that info was added at\n":"该信息被添加到组内的路由索引\n","the media duration in milliseconds, or -1 if unknown.":"媒体持续时间以毫秒为单位，如果未知，则为-1。","the status of the load operation (0 = success)\n":"负载操作的状态（0 =成功）","a value between 0.0f and 1.0f.":"值在0.0F和1.0F之间。","an optional bundle of app-specific arguments sent by\n                                ":"可选的应用程序特定参数","the priority level requested by the application for controlling the Virtualizer\n            engine. As the same engine can be shared by several applications, this parameter indicates\n            how much the requesting application needs control of effect parameters. The normal priority\n            is 0, above normal is a positive number, below normal a negative number.":"应用程序控制虚拟机要求的优先级级别 \n             引擎。 由于可以通过多个应用程序共享相同的引擎，因此此参数指示 \n             请求应用程序需要控制效果参数。 正常优先级 \n             IS 0，高于正常值，是一个正数，低于正常A负数。","a mask of the measurements to perform. The valid values are\n     ":"要执行的测量的掩模。 有效值为\n     ","The media button event to dispatch.":"要调度的媒体按钮事件。"," to check support for.":" 检查支持。","The pathname to use.":"要使用的路径名。"," to\n                         stop routing of the current media.":" 到\n                         止当前媒体的路由。","the sample size (or -1 if no more samples are available).":"样本量（如果没有更多样本可用，则为-1）。","The route whose presentation display changed":"显示显示的路线改变了","the object's data, or null if reading fails":"对象的数据，如果读取失败则为null","The URI of the channel whose logo is pointed to.":"徽标指向的通道的URI。","a CharSequence containing the TV input's custom label. ":"包含电视输入的自定义标签的CharSequence。 ","Specify an AudioTrack through which to render the audio data.":"指定用于呈现音频数据的AudioTrack。"," can\n                    be used to query the actual ":" 可以\n                    用于查询实际 ","an array of all MIDI devices":"所有MIDI设备的数组","is the key-set identifier of the offline keys being released when keyType is\n            ":"当keyType为\n            ","a non-null set of audio attributes":"一组非空的音频属性","The current playback state, one of the following values:\n                  ":"当前播放状态，以下值之一:\n                  ","The streame type used for tone playback (e.g. STREAM_MUSIC).":"用于音调播放的streame类型（例如STREAM_MUSIC）。","OnParameterChangeListener interface registered":"注册的OnParameterChangeListener接口"," will be stopped.":" 将被阻止。","The extras associated with the ":"与 ","the MediaPlayer that reached the end of the file\n":"到达文件末尾的MediaPlayer\n","the value returned if the key is not present":"如果键不存在，则返回的值","supported operation code. Can be null if device does not provide the property.":"支持的操作代码。 如果设备不提供该属性，则可以为null。","The input event.":"的输入事件。"," if the\n            geometric location is unknown":" 如果\n            几何位置未知","the number of network bytes read, or -1 if unknown.":"读取的网络字节数，如果未知，则为-1。","system wide unique audio session identifier. The Virtualizer will\n            be attached to the MediaPlayer or AudioTrack in the same audio session.":"系统范围内唯一的音频会话标识符。 虚拟器将\n            在同一音频会话中附加到MediaPlayer或AudioTrack。","The activity used to get a managed cursor.":"用于获取托管游标的活动。","the index of the media player track which contains this subtitle data.":"包含此字幕数据的媒体播放器轨道的索引。",", or null if none. The contents of this bundle\n                                may affect the result of session creation.":"，如果没有，则为null。 此捆绑包的内容\n                                可能会影响会话创建的结果。"," (to cancel any measurement)\n     or ":" (取消任何测量)\n     或 ","true if the event was sent to the session, false otherwise.":"如果事件被发送到会话，则为true，否则为false。","The parser names that support the given ":"支持给定的解析器名称 ","the callback to unregister":"取消注册的回调","the output format to use. The output format\n            needs to be specified before setting recording-parameters or encoders.":"要使用的输出格式。 输出格式\n            在设置记录参数或编码器之前需要指定。","size of the current sample in bytes or -1 if no more\n            samples are available.":"当前样本的大小以字节为单位，如果没有更多，则为-1\n            样品可用。","Route that has been removed from availability\n":"已从可用性中删除的路由\n","the storage unit to query":"要查询的存储单元","The ID of the channel whose logo is pointed to.":"标识所指向的频道的ID。"," if there is no\n                    custom label.":" 如果没有\n                    自定义标签。","The callback that will run. Use ":"将运行的回调。 使用方法 ","0-based index of the first video frame to retrieve. The frame index\n                   must be that of a valid frame. The total number of frames available for retrieval\n                   can be queried via the ":"第一视频帧的基于0的索引来检索。 帧索引\n                   必须是有效帧的帧。 可供检索的帧总数\n                   可透过 "," to open as a MIDI device":" 作为MIDI设备打开",". It should be set to null for other key requests, when\n            keyType is ":". 对于其他密钥请求，应将其设置为null，当\n            keyType是 ",",\n                  ":",\n                  ","the audio stream type":"音频流类型","strength of the effect. The valid range for strength strength is [0, 1000],\n where 0 per mille designates the mildest effect and 1000 per mille designates the strongest.":"强度的效果。 强度强度的有效范围是[0,1000],\n 其中0每密耳表示最温和的效果，1000每密耳表示最强。","The volume of the tone, given in percentage of maximum volume (from 0-100).":"音调的音量，以最大音量的百分比给出（从0-100）。","A command code for a command predefined in AndroidX media2.":"在AndroidX media2中预定义的命令的命令代码。","the MediaPlayer the error pertains to":"该MediaPlayer错误涉及到","null if there are no editable keys, or an array containing the keys.":"如果没有可编辑的键或包含键的数组，则为null。","The flags to set for this session.":"要为此会话设置的标志。","Event code.":"事件代码。"," if the event was handled by the view, ":" 如果事件由视图处理, ","the sensitivity of the microphone or ":"麦克风的灵敏度或 ","the video frames dropped, or -1 if unknown.":"视频帧丢失，如果未知，则为-1。","the channel mask of the content to virtualize.":"内容的信道掩码来虚拟化。","The context to used to get a cursor.":"用于获取游标的上下文。","the ID of the route":"路由的ID","the start time in microsecond for the subtitle data":"字幕数据的开始时间（微秒）","Visualizer object on which the listener is registered.":"注册侦听器的Visualizer对象。","The current set of flags for the session.":"会话的当前标志集。","the Context object, required for establishing a connection to\n            the media scanner service.":"上下文对象，用于建立与\n            媒体扫描仪服务。",", or the list of all\n                parsers available if no container specific format information is provided.":"，或所有的列表\n                如果未提供特定于容器的格式信息，则解析器可用。","the Surface to use for the preview":"用于预览的表面","the format of the object to return, or zero for all formats":"要返回的对象的格式，或所有格式为零","the AssetFileDescriptor for the file you want to extract from.":"要从中提取的文件的AssetFileDescriptor。","Type flag set indicating the routes that have been selected":"类型标志集，指示已选择的路由","The ID of the TV input to build a channels URI for. If ":"电视输入的ID为其构建频道URI。 如果 "," used to load the icon.":" 用于加载图标。"," to stop receiving callbacks.":" 停止接收回调。","number of consecutive video frames to retrieve. Must be a positive\n                   value. The stream must contain at least numFrames frames starting at frameIndex.":"要检索的连续视频帧数。 必须是积极的\n                   价值。 流必须至少包含从frameIndex开始的numFrames帧。"," to be called to receive the\n            result":" 被召唤来接收\n            结果","is the container-specific initialization data when the keyType is\n            ":"当keyType为\n            ","a 0 or positive value for the current media position expressed in ms\n               (same unit as for when sending the media duration, if applicable, with\n               ":"以ms表示的当前媒体位置的0或正值\n               （与发送媒体持续时间相同的单位，如果适用，\n               ","true is strength parameter is supported, false otherwise":"true表示支持强度参数，否则为false","send level scalar":"发送级别标量","the ID of the audio session this ToneGenerator belongs to or 0 if an error\n            occured.":"此ToneGenerator所属的音频会话的ID，如果出现错误，则为0\n            发生了。","The action of this custom command.":"此自定义命令的操作。","one of the keys supported in ":"其中一个键支持 ","the type of error that has occurred:\n ":"发生的错误类型:\n ","the component name of the BroadcastReceiver class":"BroadcastReceiver类的组件名称","If the given event is supported by the device or not.":"如果设备是否支持给定事件。","The type of the selected tracks. The type can be ":"所选轨道的类型。 类型可以是 "," if the sensitivity\n            is unknown":" 如果灵敏度\n            未知","the video frames played, or -1 if unknown.":"播放的视频帧，或-1，如果未知。","the mode for which virtualization processing is to be performed,\n    one of ":"要执行虚拟化处理的模式,\n    其中一个 ","the new discovery preference":"新发现首选项","the duration in microsecond for the subtitle data":"字幕数据的持续时间（以微秒为单位）","array of bytes containing the frequency representation.":"包含频率表示的字节数组。"," of all the ringtones available.":" 所有可用的铃声。","an optional object implementing the MediaScannerConnectionClient\n            interface, for receiving notifications from the media scanner.":"实现MediaScannerConnectionClient的可选对象\n            接口，用于接收来自媒体扫描器的通知。","The current playback info or null.":"当前播放信息或null。","The name of the backing parser implementation, or null if the backing parser\n                implementation has not yet been selected.":"支持解析器实现的名称，如果支持解析器，则为null\n                实施尚未选定。","the CamcorderProfile to use":"要使用的CamcorderProfile","the parent object to query, -1 for the storage root,\n                or zero for all objects":"要查询的父对象，-1为存储根,\n                或所有对象为零","the MediaDataSource for the media you want to extract from":"要从中提取的媒体的MediaDataSource","Route that has been selected for the given route types\n":"已为给定路由类型选择的路由\n",", builds a\n                       URI for all the TV inputs.":"，建立一个\n                       所有电视输入的URI。","a Drawable containing the TV input's icon. If the TV input does not have an icon,\n                    application's icon is returned. If it's unavailable too, ":"包含电视输入图标的Drawable。 如果电视输入没有图标,\n                    应用程序的图标返回。 如果它也不可用, ","The Handler that will run the callback. Use ":"将运行回调的处理程序。 使用方法 ","An list of Bitmaps containing the requested video frames. The returned\n                    array could contain less frames than requested if the retrieval fails.":"包含所请求的视频帧的位图列表。 返回的\n                    如果检索失败，数组包含的帧可能少于请求的帧。"," that will be used for delivering\n                           the result. If handler is null, then the thread used for the\n                           listener is unspecified.":" 这将用于交付\n                           结果。 如果handler为null，则用于\n                           侦听器未指定。",". Its meaning is\n            interpreted based on the mime type provided in the mimeType parameter.  It could\n            contain, for example, the content ID, key ID or other data obtained from the content\n            metadata that is required in generating the key request.\n            When the keyType is ":". 其含义是\n            根据mimeType参数中提供的mime类型进行解释。  它可以\n            包含例如内容ID、密钥ID或从内容获得的其他数据\n            生成密钥请求所需的元数据。\n            当keyType为 "," in the\n               ":" 在\n               ","the BassBoost on which the interface is registered.":"注册接口的BassBoost。","the AssetFileDescriptor for the file you want to play":"要播放的文件的AssetFileDescriptor","The type of tone generated chosen from the following list:\n            <ul>\n            <li>":"从以下列表中选择生成的音调类型:\n            <ul>\n            <李>","the identifier of the bitmap to set. The only valid value is\n                 ":"要设置的位图的标识符。 唯一有效的值是\n                 ","An extra bundle for this custom command.":"此自定义命令的额外捆绑包。","an extra code, specific to the error. Typically\n implementation dependent.\n ":"一个额外的代码，特定于错误。 通常情况下\n 依赖于实现。\n "," to send the media button event to.":" 以将媒体按钮事件发送到。","Operation code.":"操作代码。","The type of the tracks. The type can be ":"轨道的类型。 类型可以是 ","the device type of the microphone":"麦克风的设备类型","the sample rate, or -1 if unknown.":"采样率，如果未知，则为-1。","the ID of the session being released.":"正在释放的会话的ID。"," to force a particular processing mode, or\n     ":" 以强制特定的处理模式，或\n     ","the data array for the subtitle data. It should not be null.\n                       No data copying is made.":"字幕数据的数据阵列。 它不应该为null。\n                       不进行数据复制。","sampling rate of the audio visualized.\n":"音频的采样率可视化。\n","The type whose default sound should be returned. One of\n                       ":"应返回其默认声音的类型。 其中一个\n                       ","true if we are connected, false otherwise":"如果我们连接，则为true，否则为false"," to seek to.":" 去寻求。","the video encoder to use.":"的视频编码器来使用。","A transport controls instance.":"传输控制实例。","the object handles, or null if fetching object handles fails":"对象句柄，如果获取对象句柄失败，则为null","the FileDescriptor for the file you want to extract from.":"要从中提取的文件的FileDescriptor。","The ID of the channel to point to.":"要指向的信道的ID。"," used to load the label.":" 用于加载标签。"," to use MediaSync's\n                internal handler if it exists.":" 要使用MediaSync的\n                内部处理程序（如果存在）。","0-based index of the image.":"图像的基于0的索引。"," to open":" 要打开","The route that was removed":"被移除的路线","). Negative values imply that position is not\n               known (e.g. listening to a live stream of a radio) or not applicable (e.g. when state\n               is ":"). 负值意味着位置不是\n               已知（例如收听广播的实时流）或不适用（例如当状态\n               是 ",", it should be set to null.":"，应设置为null。","status of the set parameter operation.":"置参数操作的状态。","the path of the file, or the http/rtsp URL of the stream you want to play":"文件的路径，或要播放的流的http/rtsp URL","The type of tone generated":"产生的音调类型","The bitmap for the artwork, or null if there isn't any.":"图稿的位图，如果没有，则为null。","A command to find. Shouldn't be ":"查找的命令。 不应该是 ","the MediaPlayer the info pertains to.":"信息相关的媒体播放器。","The new metadata":"新元数据","If the given operation is supported by the device or not.":"如果给定的操作是否由设备支持。","this <code>PlaybackParams</code> instance.":"这个<code>PlaybackParams</code>实例。","the bitrate, or -1 if unknown.":"比特率，如果未知，则为-1。","If you handled the event, return ":"如果您处理了该事件，请返回 "," to stop forcing a mode.":" 停止强制模式。","the target volume":"目标体积","array of bytes containing the waveform representation.":"包含波形表示的字节数组。","the display duration for the subtitle":"字幕的显示持续时间"," pointing to the default sound for the sound type.":" 指向声音类型的默认声音。","The name of the parameter to set. See ":"要设置的参数的名称。 见 ","The concrete component name of the service that has\n been connected.":"具有的服务的具体组件名称\n 已连接。","the video encoding bit rate in bits per second.":"视频编码比特率以比特每秒为单位.","The current MediaMetadata or null.":"当前MediaMetadata或null。","the handle of the object":"对象的句柄","the path of the file, or the http URL of the stream\n            \n            <p>When <code>path</code> refers to a local file, the file may actually be opened by a\n            process other than the calling application.  This implies that the pathname\n            should be an absolute path (as any other process runs with unspecified current working\n            directory), and that the pathname should reference a world-readable file.\n            As an alternative, the application could first open the file for reading,\n            and then use the file descriptor form ":"文件的路径，或流的http URL\n            \n            <p>当<code>path</code>引用本地文件时，该文件实际上可能由\n            调用应用程序以外的进程。  这意味着路径名\n            应该是一个绝对路径（因为任何其他进程运行未指定的当前工作\n            目录），并且路径名应该引用一个世界可读的文件。\n            作为替代方案，应用程序可以首先打开文件进行读取,\n            然后使用文件描述符形式 ","a CharSequence containing the TV input's label. If the TV input does not have\n                    a label, its name is returned.":"包含电视输入标签的CharSequence。 如果电视输入没有\n                    个标签，返回其名称。","Specify a surface on which to render the video data.":"指定要在其上呈现视频数据的表面。","The ID of the pass-through input to build a channels URI for.":"为其构建通道URI的传递输入的ID。"," to be called\n                            to receive the result":" 被召唤\n                            接收结果"," and nothing had played yet).":" 而且还没有玩过）。","The group the route was removed from\n":"路线被删除的组\n","the requested still image, or null if the image cannot be retrieved.":"请求的静止图像，如果无法检索图像，则为null。","identifies the mime type of the content":"标识内容的mime类型","ID of the modified parameter. See ":"修改参数的ID。 见 ","the headers to be sent together with the request for the data\n                           The headers must not include cookies. Instead, use the cookies param.":"要与数据请求一起发送的标头\n                           标头不能包含cookie。 相反，使用cookie参数。","The tone duration in milliseconds. If the tone is limited in time by definition,\n            the actual duration will be the minimum of durationMs and the defined tone duration. Setting durationMs to -1,\n            is equivalent to calling ":"以毫秒为单位的音调持续时间。 如果根据定义，音调在时间上受到限制,\n            实际持续时间将是durationMs和定义的音调持续时间的最小值。 将持续时间设置为-1,\n            相当于调用 ","Returns a reference to the same MediaMetadataEditor object, so you can chain put\n                 calls together.":"返回对同一MediaMetadataEditor对象的引用，因此您可以链式put\n                 一起打电话。","A command code to find.\n                               Shouldn't be ":"个命令代码来查找。\n                               不应该是 ","the type of info or warning.\n ":"信息或警告的类型。\n ","The current state of playback":"播放的当前状态","the manufacturer name":"制造商名称","audio fallback mode":"音频回退模式","the channel count, or -1 if unknown.":"通道计数，如果未知，则为-1。","a non-null array whose length is 3 times the number of channels in the channel\n    mask.\n    If the method indicates the configuration is supported, the array will contain upon return\n    triplets of values: for each channel ":"长度为通道中通道数3倍的非空数组\n    面具。\n    如果该方法指示支持配置，则返回时数组将包含\n    值的三元组：对于每个通道 ",". If you want to allow the event to be\n                    handled by the next receiver, return ":". 如果你想允许事件是\n                    由下一个接收器处理，返回 ","the ID of the routing session":"路由会话的ID","The component name of the media browser service.":"媒体浏览器服务的组件名称。","the encoded subtitle data":"编码后的字幕数据",". For example,\n                       ":". 例如,\n                       "," constants for\n                documentation on possible values.":" 常量\n                关于可能值的文档。","declared in ":"声明于 ","The package name of of the session owner.":"会话所有者的包名称。","the MtpObjectInfo, or null if fetching object info fails":"如果获取对象信息失败，则为MtpObjectInfo或null",".\n            \n            <p>When <code>path</code> refers to a network file the\n            ":".\n            \n            <p>当<code>path</code>引用网络文件时，\n            ","the ID of the parent input, if exists. Returns ":"父输入的ID（如果存在）。 申报表 ","the synchronization audio session ID. The returned audio session ID is 0 if it has\n            not been set.":"的同步音频会话ID。 返回的音频会话ID为0，如果有\n            还没定下来。"," of the TV input service to build ID for.":" 为电视输入服务建立ID。"," for MIDI device notifications":" 对于MIDI设备通知","a value expressed as a ratio of 1x playback: 1.0f is normal playback,\n               2.0f is 2x, 0.5f is half-speed, -2.0f is rewind at 2x speed. 0.0f means nothing is\n               playing (e.g. when state is ":"以1x播放：1.0f的比率表示的值是正常播放,\n               2.0f是2x，0.5f是半速，-2.0f以2x速度倒带。 0.0f意味着什么都不是\n               播放（例如，当状态为 ","Type flag set indicating the routes that have been unselected":"类型标志集，指示未选择的路由","The IBinder of the Service's communication channel,\n which you can now make calls on.\n":"服务的通信信道的IBinder,\n 你现在可以打电话了。\n","the primary image, or null if it cannot be retrieved.":"主图像，如果无法检索，则为null。","specifies the type of the request. The request may be to acquire\n            keys for streaming, ":"指定请求的类型。 请求可能是获取\n            流式传输的密钥, "," ...":" ...","the cookies to be sent together with the request":"与请求一起发送的cookie","The method for controlling volume that is used by\n                       this provider.":"用于控制所使用的音量的方法\n                       这个提供者。","the identifier of a the metadata field to set. Valid values are\n      ":"要设置的元数据字段的标识符。 有效值为\n      ","an extra code, specific to the info. Typically\n implementation dependent.":"一个额外的代码，特定于信息。 通常情况下\n 依赖于实现。","The component name of the service.":"服务的组件名称。"," for this session's audio.":" 这次会议的音频。","the model name":"模型名称","pitch":"沥青","the video height, or -1 if unknown.":"视频高度，如果未知，则为-1。"," among the channels of the mask:\n    ":" 掩模的通道之中:\n    ","The type of the track to select. The type can be ":"要选择的轨道的类型。 类型可以是 ","Types of routes this callback is interested in":"此回调函数感兴趣的路由类型","The connection callback.":"的连接回调。","the display start time for the subtitle":"字幕的显示开始时间","The type of the defaultRingtoneUri, or -1.":"的类型，或-1。","The value to set for the given ":"为给定值设置的值 ","The current PlaybackState or null":"当前PlaybackState或null","the number of frames per second of video to capture":"要捕获的视频每秒帧数"," permission is required.":" 需要许可。","handle of the object to query":"要查询的对象的句柄"," if the parent input is\n                    not specified.":" 如果父输入是\n                    没有具体说明。","the synchronization event type.":"的同步事件类型。"," that will be used for delivering the\n                           device notifications. If handler is null, then the thread used for the\n                           callback is unspecified.":" 这将用于交付\n                           设备通知。 如果handler为null，则用于\n                           回调未指定。","the ID for the given TV input service.":"给定电视输入服务的ID。","A combination of the following flags:\n                 ":"以下标志的组合:\n                 ","The concrete component name of the service whose\n connection has been lost.\n":"服务的具体组件名称。\n 连接已丢失。\n","The time position in microseconds where the frame will be retrieved.\n            When retrieving the frame at the given time position, there is no\n            guarantee that the data source has a frame located at the position.\n            When this happens, a frame nearby will be returned. If timeUs is\n            negative, time position and option will ignored, and any frame\n            that the implementation considers as representative may be returned.":"帧将被检索的以微秒为单位的时间位置。\n            当在给定的时间位置检索帧时，没有\n            保证数据源具有位于该位置的帧。\n            发生这种情况时，将返回附近的帧。 如果timeUs是\n            负，时间位置和选项将被忽略，以及任何帧\n            该实施认为具有代表性的可以返回。","Route that has been unselected for the given route types\n":"为给定路由类型未选择的路由\n","the new parameter value.\n":"的新参数值。\n","the SurfaceHolder to use for video display":"用于视频显示的SurfaceHolder",", or for offline content\n            ":"，或用于离线内容\n            ","The maximum allowed volume.":"允许的最大音量。",",\n      ":",\n      ","the MediaPlayer that is ready for playback\n":"准备播放的MediaPlayer\n","The provider that will handle volume changes. May\n                       not be null.":"将处理卷更改的提供程序。 五月\n                       不是null。","extras of the token":"令牌的额外资料","the serial number":"序列号","a two-letter ISO 639-1 language code.":"两个字母的ISO639-1语言代码。","speed":"速度","the virtualization mode being used.\n                If virtualization is not active, the virtualization mode will be\n                ":"正在使用的虚拟化模式。\n                如果虚拟化未处于活动状态，则虚拟化模式将为\n                ","The ID of the track to select. ":"要选择的轨道的ID。 ","Callback to add":"回调添加","An optional bundle of service-specific arguments to send\n            to the media browser service when connecting and retrieving the root id\n            for browsing, or null if none. The contents of this bundle may affect\n            the information returned when browsing.":"要发送的特定于服务的参数的可选包\n            连接和检索根id时到媒体浏览器服务\n            用于浏览，如果没有，则为null。 此捆绑包的内容可能会影响\n            浏览时返回的信息。","an index in the array returned by ":"返回的数组中的索引 ","The ringtone type whose default should be returned.":"应返回其默认值的铃声类型。","\n                constants for documentation on the expected types.":"\n                用于预期类型文档的常量。","The current play queue or null.":"当前播放队列或null。","the path of the file, or the http URL\n            \n            <p>When <code>path</code> refers to a network file the\n            ":"文件的路径，或http URL\n            \n            <p>当<code>path</code>引用网络文件时，\n            ","the VideoProfile to use":"要使用的视频文件","the parent's handle, or zero if it is in the root of the storage":"父级的句柄，如果它位于存储的根目录中，则为零","the list of content ratings blocked by the user.":"用户阻止的内容评级列表。","the audio session ID of the event source being monitored.":"正在监视的事件源的音频会话ID。","the new requested position in the current media, expressed in ms.\n":"当前媒体中新请求的位置，以ms表示。\n","The URI of the channel to return preview programs for.":"返回预览节目的频道的URI。"," to unregister":" 取消注册","the path to the file to be scanned.":"要扫描的文件的路径。","expected output bitmap width":"预期输出位图宽度","The route with altered volume\n":"改变体积的路线\n","system-wide unique audio session identifier. The DynamicsProcessing\n            will be attached to the MediaPlayer or AudioTrack in the same audio session.":"全系统唯一音频会话标识符。 动态处理\n            将在同一音频会话中附加到MediaPlayer或AudioTrack。",", or to release previously acquired\n            keys (":"，或释放先前获得的\n            钥匙(","the property name":"属性名称","The current volume on the output.":"输出上的当前音量。","A list of items in the play queue.":"播放队列中的项目列表。"," (with a value\n      expressed in milliseconds),\n      ":" （带值\n      以毫秒表示）,\n      ","the MediaPlayer that issued the seek operation\n":"发出seek操作的MediaPlayer\n","event code":"事件代码","package name of the session":"会话的包名称","an IETF BCP 47 optional language region subtag based on a two-letter country code.":"基于双字母国家代码的ietf BCP47可选语言区域子标签。","true if the rating is \"heart selected\", false if the rating is \"heart unselected\",\n               if the rating style is not ":"如果评级为\"心脏选择\"，则为true，如果评级为\"心脏未选择\"，则为false,\n               如果评级样式不是 ",". Otherwise the value will be\n                ":". 否则该值将是\n                "," means to unselect the current\n                       track for a given type.":" 表示取消选择电流\n                       跟踪给定类型。","Flags to control the behavior of the callback.\n May be zero or a combination of ":"控制回调行为的标志。\n 可以是零或组合的 ","The id of the item to retrieve.":"要检索的项目的id。","this <code>SyncParams</code> instance.":"此<code>SyncParams</code>实例。"," of the default ringtone for the given type.":" 给定类型的默认铃声。","This instance, for convenience.":"此实例，为方便起见。","The supported rating type":"支持的评级类型","the headers associated with the http request for the stream you want to play.\n                   This can be ":"与要播放的流的http请求相关联的标头。\n                   这可以是 ","Start index of reading range. It must be a non-negative value at most\n                0xffffffff.":"读取范围的开始索引。 它最多必须是非负值\n                0xffffffff。","The ID of the TV input.":"电视输入的ID。","the media time of the anchor in microseconds":"锚点的媒体时间以微秒为单位","the width of the video to be captured":"要捕获的视频的宽度","the identifier of the bitmap to set. The only valid value is\n      ":"要设置的位图的标识符。 唯一有效的值是\n      ","the maximum size of a message this receiver can receive":"此接收器可以接收的消息的最大大小","The ID of the channel to return preview programs for.":"返回预览节目的频道的ID。","an optional mimeType for the file.\n            If mimeType is null, then the mimeType will be inferred from the file extension.":"文件的可选mimeType。\n            如果mimeType为null，那么将从文件扩展名推断出mimeType。","Context to resolve name resources":"解析名称资源的上下文","number of channels currently in use by the effect engine":"效果引擎当前使用的通道数","), which are identified by a keySetId.":"），由keySetId识别。","expected output bitmap height":"预期输出位图高度","the property value\n            \n            Standard fields names are:\n            ":"属性值\n            \n            标准字段名称为:\n            ","The long value for the given key":"给定键的长值","The volume control ID of this provider.":"此提供程序的音量控制ID。","The title of the play queue.":"播放队列的标题。","the MediaPlayer associated with this callback":"与此回调关联的MediaPlayer","the object's association description":"对象的关联描述","service name of the session. Can be ":"会话的服务名称。 可以是 ","the video frame rate, or -1 if unknown.":"视频帧速率，如果未知，则为-1。"," or if it is unrated.":" 或者如果它是未评级的。",".\n                Virtualization may not be active either because the effect is not enabled or\n                because the current output device is not compatible with this virtualization\n                implementation.":".\n                虚拟化可能不是活动的，因为效果没有启用或\n                因为当前输出设备与此虚拟化不兼容\n                执行。","The callback to receive events. A value of ":"接收事件的回调。 的值 ","Definition of the route to add":"要添加的路由的定义","The callback to receive the result on.":"接收结果的回调。","audio adjust mode":"音频调整模式","The position (in the ":"的位置（在 ","The parameter name to check support for. One of the ":"要检查支持的参数名称。 其中一个 ","The callback object, must not be null.":"回调对象不能为null。"," if no specific headers are to be sent with the\n                   request.":" 如果没有特定的头被发送与\n                   请求。","The session token for the browser, never null.":"浏览器的会话令牌，永不为空。","Size of reading range. It must be a non-negative value at most Integer.MAX_VALUE\n                or 0xffffffff. If 0xffffffff is specified, the method obtains the full bytes of object.":"读取范围的大小。 它最多必须是一个非负值整数。最大值\n                或0xffffffff。 如果指定了0xffffffff，则该方法获取object的完整字节。"," for a given TV input. ":" 于给定的电视输入。 ","the callback that will be run.":"将运行的回调。","the number of unique categories represented by this MediaRouter's known routes":"Mediarouter已知路线代表的独特类别数量"," corresponding to the\n                             media time in nanoseconds.":" 对应于\n                             媒体时间以纳秒为单位。","the height of the video to be captured":"要捕获的视频的高度","The identifier of a the metadata field to set. Valid values are\n      ":"要设置的元数据字段的标识符。 有效值为\n      ","maximum message size":"最大消息大小","The ID of the preview program to point to.":"要指向的预览程序的ID。","The caller's Context, required for establishing a connection to\n            the media scanner service.\n            Success or failure of the scanning operation cannot be determined until\n            ":"调用方的上下文，用于建立与\n            媒体扫描仪服务。\n            扫描操作的成功或失败直到\n            ","Array to write data.":"数组写数据。","The id of the parent media item whose list of children\n                       will be subscribed.":"父母媒体项目的ID \n                        将被订阅。","Config Current Config object used to setup this DynamicsProcessing effect.":"配置当前配置对象用于设置此动态处理效果.","route to add to this group\n":"添加到此组的路由\n","should be one of ":"应该是 ","the MediaDataSource for the media you want to play":"你想玩的媒体的媒体资源","the player to start after this one completes playback.":"播放器在此完成播放后启动。","the identifier of a the metadata field to set. Valid keys for a:\n     ":"要设置的元数据字段的标识符。 A的有效密钥:\n     ","The current volume.":"当前音量。","The intent to launch to show UI for this Session.":"启动以显示此会话的UI的意图。","route to add":"添加路线","The callback to receive the list of children.":"收到儿童名单的回调。","the timed text sample which contains the text\n                       needed to be displayed and the display format.\n":"包含文本的定时文本示例\n                       需要显示和显示格式。\n","the object's association type":"对象的关联类型","type of the token":"令牌的类型","true if the instance was not created with ":"如果实例不是用 ","the video width, or -1 if unknown.":"视频宽度，如果未知，则为-1。","the Virtualizer on which the interface is registered.":"注册接口的虚拟器。"," removes the existing\n                       callback.":" 删除现有的\n                       回调。","the width of the video":"视频的宽度","frame rate factor. A non-negative number representing\n                the maximum deviation of the playback rate from the playback rate\n                set. (":"帧速率因子。 一个非负数表示\n                播放速率与播放速率的最大偏差\n                设置。 (",") of the ringtone.":"）的铃声。","The handler to post updates on. If null the callers thread\n            will be used.\n":"发布更新的处理程序。 如果调用者线程为null\n            将被使用。\n","system wide unique audio session identifier. If audioSession\n             is not 0, the visualizer will be attached to the MediaPlayer or AudioTrack in the\n             same audio session. Otherwise, the Visualizer will apply to the output mix.":"系统广泛的唯一音频会话标识符。 如果有音调 \n              不是0，可视化器将连接到Mediaplayer或Adiotrack中 \n              同一音频会话。 否则，可视化器将应用于输出混合物。","the Context to use when resolving the Uri":"解析Uri时要使用的上下文","true if the rating is \"thumb up\", false if the rating is \"thumb down\",\n               if the rating style is not ":"如果等级为“拇指”，则为false，如果评分为“拇指下”， \n                如果评分样式不是","the listener called after a discontinuity":"侦听器在不连续后调用"," if the user enabled the parental controls, ":" 如果用户启用了家长控制, ","Name of the new category":"新类别的名称"," to enable, ":"启用，","the rate of the media clock in relation to the system time.":"媒体时钟相对于系统时间的速率。"," to signify there is no valid\n      information for the field.":" 表示没有有效的\n      字段的信息。","the number of the input port to open":"打开的输入端口的数量","a byte array containing the MIDI data":"包含MIDI数据的字节数组","The command to send":"发送的命令","The URI of the channel to return programs for.":"返回节目的频道的URI。","The TV content rating to check. Can be ":"电视内容等级要检查。 可","true for a \"heart selected\" rating, false for \"heart unselected\".":"对于“心脏选择”的评级，是正确的，因为“未选择的心脏”是错误的。","the video source to use":"要使用的视频源"," to disable.":"禁用。","Array of paths to be scanned.":"要扫描的路径阵列。","true if routes in this category may be grouped with one another":"如果该类别中的路线可以彼此分组","Size of bytes that are actually read.":"实际读取的字节大小。","the address of the microphone":"麦克风的地址","the EnvironmentalReverb on which the interface is registered.":"注册接口的EnvironmentalReverb。"," if the open is successful,\n                    or null in case of failure.":"如果公开成功， \n                     或在失败时无效。","the FileDescriptor for the file you want to play":"要播放的文件的FileDescriptor","The ID of the channel to return programs for.":"返回程序的频道的ID。","a new Rating instance.":"一个新的评级实例。"," representing the active microphones":" 表示活动麦克风","Resource ID of the name of the new category":"新类别名称的资源ID","the object's modification date":"对象的修改日期","the metadata to add.":"要添加的元数据。","The start time used to filter programs. The returned programs should have\n                       ":"用于过滤程序的开始时间。 返回的程序应该有","The max allowed volume.":"允许的最大音量。","The id of the parent media item whose list of children\n                       will be unsubscribed.":"子项列表的父媒体项的id\n                       将取消接收。","the new RouteCategory":"新的RouteCategory","Start index of reading range. It must be a non-negative value.":"开始阅读范围的索引。 它必须是一个非负值。","insert the new route before this index\n":"在此索引之前插入新路由\n","The listener to add.":"要添加的侦听器。","the current estimated playback position in milliseconds or a negative value\n                    if not available":"当前以毫秒或负值为毫秒的估计播放位置 \n                     如果没有","The path, or the URI (doesn't support streaming source currently)\n            of the input media file.":"路径或URI（当前不支持流源） \n             输入媒体文件。","the format code":"格式代码","the object size":"对象大小","uid of the session":"会议的uid","the inputPort to connect":"要连接的输入端口","the height of the video\n":"视频的高度\n"," pointing to the ringtone.":" 指向铃声。","The direction to change the volume in.":"更改音量的方向。","), or a negative\n                number representing the desire to clear a previous hint using these params.":"），或负\n                数字表示使用这些参数清除先前提示的愿望。","the Content URI of the data you want to extract from.\n            \n            <p>When <code>uri</code> refers to a network file the\n            ":"要从中提取的数据的内容URI。\n            \n            <p>当<code>uri</code>引用网络文件时，\n            ","The callback to receive the result on":"回调以接收结果","the maximum number of simultaneous streams for this\n                              SoundPool object":"最多同时流的数量 \n                               Soundpool对象","a 0 or positive value for the new playback position, expressed in ms.":"在MS中表达的新播放位置的0或正值。","Index to fetch":"获取索引","the length in bytes of the data to be extracted":"要提取的数据字节的长度","true if receiving artwork images was successfully disabled.":"如果成功禁用接收艺术品图像，则为true。","the port number of the output port to connect inputPort to.":"输出端口的端口号连接到InputPort。","Any parameters to include with the command":"命令中包含的任何参数","the offset of the first byte of the data in the array to be sent":"要发送的数组中数据的第一个字节的偏移量","A context used to query.":"用于查询的上下文。","Optional array of MIME types for each path.\n            If mimeType is null, then the mimeType will be inferred from the file extension.":"每个路径的可选mime类型数组。\n            如果mimeType为null，那么将从文件扩展名推断出mimeType。","The volume to set the output to.":"将输出设置为的音量。","the MediaRecorder that encountered the error":"遇到错误的MediaRecorder","The callback to be invoked when the unhandled input event is received.":"接收未处理的输入事件时要调用的回调。","the MediaCas object to use.":"使用的媒介对象要使用。","the priority level requested by the application for controlling the Equalizer\n            engine. As the same engine can be shared by several applications, this parameter indicates\n            how much the requesting application needs control of effect parameters. The normal priority\n            is 0, above normal is a positive number, below normal a negative number.":"应用程序请求的用于控制均衡器的优先级等级\n            引擎。 由于同一个引擎可以被多个应用程序共享，因此此参数指示\n            请求应用程序需要控制效果参数的程度。 正常优先级\n            为0，正常以上为正数，正常以下为负数。","the headers to be sent together with the request for the data.\n                   This can be ":"与数据请求一起发送的标题。 \n                    这可以","the value of the rating":"评级的价值","the timestamp of the message, based on ":"消息的时间戳，基于 ","the number of bytes of MIDI data in the array to be sent":"要发送的数组中的MIDI数据的字节数","the global ID for monitoring the MediaRecorder performance":"用于监视MediaRecorder性能的全局ID","The category the new route will belong to":"新路由将属于的类别","the offset into the file where the data to be extracted starts, in bytes":"在启动要提取数据的文件中的偏移，以字节为单位","the receiver to connect":"接收器连接","The identifier of a the metadata field to set. Valid values are\n                 ":"要设置的元数据字段的标识符。 有效值为\n                 ","null if the rating is out of range, a new Rating instance otherwise.":"null如果额定值不超出范围，则否则将是一个新的评级实例。"," that is greater than this time.":" 这比这次更伟大。"," of a sound or ringtone.":" 声音或铃声。","the image depth":"图像深度","the audio stream type as described in AudioManager\n                              For example, game applications will normally use\n                              ":"音频流类型如AudioManager中所述\n                              例如，游戏应用程序通常会使用\n                              ","The enabled notification listener component.\n            May be null.\n":"启用的通知侦听器组件。\n            可能为null。\n","the object's creation date":"对象的创建日期","Context the recorder belongs to":"记录器所属的上下文","route to remove\n":"移除路线\n","the image height":"图像高度"," to launch UI or null.":" 要启动UI或null。"," object if the connection is successful,\n                    or null in case of failure.":" 对象如果连接成功,\n                    或失败时为null。"," for the given URI, or null.":" 对于给定的URI，或null。","the sample-rate converter quality. Currently has no\n                              effect. Use 0 for the default.":"的采样速率转换器质量。 目前没有\n                              效果。 默认值使用0。","The enabled notification listener component.\n            May be null.":"启用的通知侦听器组件。\n            可能为null。","the image width":"图像宽度","the object's keyword list":"对象的关键字列表","the object's name":"对象的名称","the object handle":"对象句柄","the object's parent":"对象的父级","the protection status":"保护状态","the object's sequence number":"对象的序列编号","the storage ID":"存储ID"}