{"\n      A ":"一个","Tab to select":"选项卡要选择","The start PointF":"开始点","Map from packageName to visibility values which will be set before account\n                   is added. See ":"从Packagename到可见度值的地图将在帐户之前设置 \n                    被添加。 看",", which determines\n            the animation whose duration is returned.":"，决定 \n             返回持续时间的动画。","the Bundle containing the required credentials to create the\n            account. Contents of the Bundle are only meaningful to the authenticator. This Bundle is\n            provided by ":"包含所需凭证的捆绑包来创建 \n             帐户。 捆绑包的内容仅对身份验证器有意义。 这个捆绑包是 \n             由...提供","The touch screen event being processed.":"触摸屏事件正在处理。","View The current View with focus or null.":"以焦点或空查看当前视图。","Package name of the application to get account visibility":"申请的包装名称以获取帐户可见性","the listener to be removed from the current set of listeners for this\n                            animation.":"为此，要从当前听众集中删除的听众 \n                             动画。"," will be.\n            If you need to rebuild the dialog, call ":"将会。 \n             如果您需要重建对话框，请致电"," if the application successfully requested that the application's\n                data be erased; ":"如果应用程序成功要求该应用程序的 \n                 数据被删除；"," context to use for launching a new\n                authenticator-defined sub-Activity to prompt the user to delete an\n                account; used only to call startActivity(); if null, the prompt\n                will not be launched directly, but the ":"用于推出新的上下文 \n                 身份验证者定义的子活动，以提示用户删除 \n                 帐户; 仅用于调用startActivity（）; 如果无效，提示 \n                 不会直接启动，而是","The id of the dialog.":"对话框的ID。"," for possible values.":"对于可能的值。","Background drawable":"背景可绘制","An event.\n":"一个事件。"," which contains the value that future\n      invocations of the\n      ":"其中包含未来的价值 \n       调用","The trackball event being processed.":"轨迹球事件正在处理。"," may be\n                returned to the caller instead":"或许 \n                 返回呼叫者","The dialog arguments provided to ":"提供的对话论点","The end PointF":"端点","The file descriptor that the dump should be written to.  The file\n            descriptor is <em>not</em> closed by this function; the caller continues to\n            own it.":"应该写入转储的文件描述符。 文件 \n             描述符是<em>不是由此功能封闭的</em>。 来电者继续 \n             拥有它。","the listener to be removed from the current set of pause\n            listeners for this animation.":"从当前暂停集中删除的听众 \n             这个动画的听众。","a Bundle result or null if the result is to be returned via the response.":"如果要通过响应返回结果，则捆绑结果或null。","The id of the managed dialog.":"托管对话框的ID。","long The duration of the specified animation.":"长时间指定动画的持续时间。","int Visibility of given account.":"给定帐户的可见性。"," first.":"第一的。","True if the account was successfully added, false if the account already exists, the\n                    account is null, or another error occurs.":"如果成功添加了帐户，则为false，如果帐户已经存在，则 \n                     帐户为null，或者发生另一个错误。","\n      property should return.\n    ":"财产应返回。","The new event. This event is owned by the caller and cannot be used after\n            this method returns. Services wishing to use the event after this method returns should\n            make a copy.":"新活动。 此事件由来电者所有，不能在 \n             此方法返回。 希望在此方法返回之后使用事件的服务应 \n             制作副本。","Resource ID of a layout to inflate into the ActionBar.":"布局的资源ID膨胀到动作栏中。","The name of the package that is to be dumped.":"要倾倒的包裹的名称。","The dialog.  If you return null, the dialog will not be created.":"对话框。 如果返回null，则不会创建对话框。","the account whose credentials are to be checked, will never be null":"要检查凭证的帐户将永远不会为null","The generic motion event.":"通用运动事件。",", which determines\n            the animation whose interpolator is being returned.":"，决定 \n             返回其插值的动画。","The values that the property will animate between.":"属性将在之间动画的值。","Returns true if the Dialog was created; false is returned if\n            it is not created because ":"如果创建对话框，则返回true； false如果返回 \n             它不是因为"," which resolves to a Bundle with\n                ":"与","The length of the animation, in milliseconds.":"动画的长度，以毫秒为单位。"," for every\n                authenticator known to the AccountManager service.  Empty (never\n                null) if no authenticators are known.":"每个 \n                 AccountManager服务已知的身份验证者。 空（从不 \n                 null）如果不知道身份验证者。","The context of the trim, giving a hint of the amount of\n trimming the application may like to perform.  May be\n ":"修剪的上下文，给出了一定的迹象 \n  修剪应用程序可能需要执行。 或许","The Intent that was used to bind to this service,\n as given to ":"用来绑定到此服务的意图， \n  给予","Optional, a null value means match all packages belonging to the\n                               caller's UID. If this package belongs to another UID, you must hold\n                               ":"可选，零值表示匹配所有属于 \n                                来电者的uid。 如果此软件包属于另一个UID，则必须保持","An empty TaskStackBuilder - the application should add intents representing\n                           the desired task stack":"一个空的TaskStackBuilder-应用程序应添加代表的意图 \n                            所需的任务堆栈","The listener to send notifications to":"听众将通知发送给",",\n or ":"，，，， \n  或者","a Bundle of authenticator-specific options, may be null":"一堆身份验证者特定的选项可能为null","Custom navigation view to place in the ActionBar.":"自定义导航视图以放置在动作栏中。"," if activity was specified and an account\n                was removed or if active. If no activity was specified, the returned\n                Bundle contains only ":"如果指定活动并帐户 \n                 被删除或活跃。 如果未指定活动，则返回 \n                 捆绑包仅包含","The auth token type, an authenticator-dependent\n                string token, must not be null":"身份验证类型，依赖身份验证者 \n                 字符串令牌，不得无效"," which contains the\n      value that future invocations of the\n      ":"其中包含 \n       重视未来的援引","boolean Return true if this event was consumed.":"布尔返回，如果该事件被消费。","PropertyValuesHolder The constructed PropertyValuesHolder object.":"属性值持有人构建的属性值持有人对象。"," returns false.":"返回false。","the interpolator to be used by this animation":"该动画要使用的插装器","TimeInterpolator The interpolator that the specified animation uses.":"TimeInterPolator指定的动画使用的插值器。"," identifying the thread to use\n     for notifications, null for the main thread":"识别要使用的线程 \n      为了通知，主线程为空"," in order to retrieve it.":"为了检索它。","Whether the window of this activity has focus.":"此活动的窗口是否焦点。",".  Note that any extras that were included with\n the Intent at that point will ":"。 请注意，随附的任何附加功能 \n  那时的意图将",", true if the check succeeded, false otherwise\n            <li> ":"，如果支票成功，则为false，否则 \n             <li>","The options menu in which you place your items.":"您放置物品的选项菜单。","How this custom view should layout in the bar.":"该自定义视图应如何在栏中布局。","long The length of time, in milliseconds, to delay before launching the next\n            animation in the sequence.":"长时间长的时间（以毫秒为单位）延迟到下一个 \n             序列中的动画。","Callback that will manage lifecycle events for this action mode":"将在此操作模式下管理生命周期事件的回调","The object being animated":"动画的对象","The callback that should control the new action mode":"应该控制新动作模式的回调","The values that the named property will animate between.":"命名属性将动画之间的值。"," be seen here.":"在这里看到。","\n                needed to launch the actual account removal process, if authenticator\n                needs the activity launch. If an error occurred,\n                ":"如果身份验证者，需要启动实际的帐户删除过程 \n                 需要活动发布。 如果发生错误，"," value containing\n      a JNI Reference that was created.\n    ":"包含值 \n       创建的JNI参考。","True to add a notification to prompt the\n                user for a password if necessary, false to leave that to the caller":"是真的添加通知以提示 \n                 用户在必要时使用密码，错误将其留给呼叫者","The key event.":"关键事件。","true to show the user that selecting home will return one\n                                level up rather than to the top level of the app.":"确实向用户展示选择家庭将返回一个 \n                                 升级而不是应用程序的最高级别。","If true, the listener will be invoked\n     (on the handler thread) right away with the current account list":"如果是真的，听众将被调用 \n      （在处理程序线程上）立即与当前帐户列表","A process ID that used to belong to this package but died later; a value\n                               of 0 means to ignore this parameter and return all matching records.":"一个曾经属于此软件包但以后死亡的过程ID； 一个值 \n                                0表示忽略此参数并返回所有匹配记录。","used to set the result for the request. If the Constants.INTENT_KEY\n              is set in the bundle then this response field is to be used for sending future\n              results if and when the Intent is started.":"用于为请求设置结果。 如果stonstants.intent_key \n               设置在捆绑包中，然后将其用于发送未来的响应字段 \n               结果如果及时开始意图。","You must return true for the menu to be displayed;\n                    if you return false it will not be shown.":"您必须返回true才能显示菜单； \n                     如果您返回false，它将不会显示。","The key shortcut event.":"关键快捷键事件。"," which resolves to a Bundle with\n                at least the following fields on success:\n            <ul>\n            <li> ":"与 \n                 至少以下有关成功的领域： \n             <ul> \n             <li>","\n            Gets or sets the pre authentication data for the request. This property must be set by the application\n            before the request is made. Generally the value can be taken from ":"获取或设置请求的预验证数据。 该属性必须由应用程序设置 \n             提出请求之前。 通常可以从中获取价值",", which determines\n            the animation whose start delay is returned.":"，决定 \n             返回开始延迟的动画。","Total time an animation takes to finish, starting from the time ":"从时间开始，动画要完成的总时间","The ActionMode that was started, or null if it was canceled":"启动的动作模式，如果取消了","A combination of the bits defined by the DISPLAY_ constants\n                           defined in ActionBar.":"由显示_常数定义的位的组合 \n                            在动作栏中定义。","The information of gesture.":"手势的信息。","The property associated with this set of values. Should not be null.":"与此值集相关联的属性。 不应该为无效。"," if the operation was canceled for\n                 any reason, including the user canceling the creation process or\n                 adding accounts (of this type) has been disabled by policy\n            </ul>":"如果操作被取消 \n                  任何原因，包括取消创建过程或 \n                  添加（这种类型）的帐户已被策略禁用 \n             </ul>","The new action mode, or <code>null</code> if the activity does not want to\n                    provide special handling for this action mode. (It will be handled by the system.)":"新的动作模式或<code> null </code>如果活动不想 \n                     为此模式提供特殊处理。 （它将由系统处理。）"," identifying the thread to use for notifications, null for the\n                   main thread":"识别用于通知的线程 \n                    主线程","The maximum number of results to be returned; a value of 0\n                               means to ignore this parameter and return all matching records":"要退还的最大结果数； 值为0 \n                                意味着忽略此参数并返回所有匹配记录","the AccountType whose properties are to be edited.":"将要编辑属性的帐户类型。","The panel being created.":"正在创建面板。","\n            after the initial request, without any authentication data, receives the authorization request from the\n            server. The application must then store credentials in instance of ":"在初始请求之后，没有任何身份验证数据，从 \n             服务器。 然后，该应用程序必须以","The intent to start.":"开始的意图。","The view to show the context menu for.":"显示上下文菜单的视图。","long The start delay of the specified animation.":"长期以来指定动画的开始延迟。","The set of values to animate between.":"在之间进行动画的值集。","True if this event was consumed.":"如果消耗了此事件，则是真的。","A bit mask declaring which display options should be changed.":"一个掩码声明应更改哪些显示选项。"," - the name of the account you supplied\n            <li> ":" - 您提供的帐户的名称 \n             <li>","\n                     is called. ":"叫做。","True if the account was successfully deleted, false if the\n                    account did not exist, the account is null, or another error\n                    occurs.":"如果该帐户成功删除，则为the，如果 \n                     帐户不存在，帐户为null或其他错误 \n                     发生。","Whether the gesture was handled.":"是否处理手势。","a Bundle containing the result or the Intent to start to continue the request.\n              If this is null then the request is considered to still be active and the result should\n              sent later using response.":"包含结果或开始继续请求的意图的捆绑包。 \n               如果这是无效的，则认为该请求仍处于活动状态，结果应 \n               以后使用响应发送。","The menu inside the panel.":"面板内的菜单。","a list of ":"的清单","If true, the listener will be invoked (on the handler thread) right\n                   away with the current account list":"如果为true，则将调用听众（在处理程序线程）正确 \n                    与现有帐户列表一起","If >= 0, this code will be returned in\n                               onActivityResult() when the activity exits.":"如果> = 0，则将返回此代码 \n                                活动退出时。","The unique id of the performed gesture.":"执行手势的独特ID。"," will be returned if the animation or any\n                     child animation repeats infinite times.":"如果动画或任何 \n                      儿童动画重复无限的时间。","A resource ID of the animation resource to use for\n            the incoming activity.  Use 0 for no animation.":"动画资源的资源ID \n             传入活动。 使用0进行无动画。"," and\n            assign the instance to this propery before retrying the request.\n            ":"和 \n             在重试请求之前，将实例分配给此建议。","The parent ViewGroup of the View being hidden.":"视图的父景观组被隐藏。","true if the currently set custom view should be displayed, false otherwise.":"正确，如果应显示当前设置的自定义视图，否则为false。","The previously added listener to remove":"先前添加的侦听器删除","The touch screen event.":"触摸屏事件。"," - the auth token you wanted\n            </ul>\n            \n            (Other authenticator-specific values may be returned.)  If the user\n            must enter credentials, the returned Bundle contains only\n            ":" - 您想要的身份证 \n             </ul> \n            \n             （可以返回其他特定于认证者的值。）如果用户 \n             必须输入凭据，返回的捆绑包仅包含","The name of the property being animated. Can also be the\n                                case-sensitive name of the entire setter method. Should not be null.\n                                The setter must take exactly two <code>float</code> parameters.":"属性的名称是动画的。 也可以是 \n                                 整个设置方法的案例敏感名称。 不应该为无效。 \n                                 设置器必须完全采用两个<code> float </code>参数。","Additional options for how the Activity should be started.\n See ":"应如何启动活动的其他选项。 \n  看","Which panel is being created.":"正在创建哪个面板。","If set, only changes to accounts of given types will be reported.":"如果设置，将仅报告给定类型的帐户的更改。"," records matching the criteria, sorted in\n                    the order from most recent to least recent.":"符合标准的记录，分类 \n                     从最新到最近的订单。","to send the result back to the AccountManager, will never\n                       be null":"要将结果发送回到帐户管理器，永远不会 \n                        为null","true to show home, false otherwise.":"真实地展示回家，否则为错误。"," to rename":"重命名","The animation which was canceled.\n":"被取消的动画。","The trackball event.":"田径比赛。","The pre authentication data.":"预验证数据。","A resource ID of the animation resource to use for\n            the outgoing activity.  Use 0 for no animation.":"动画资源的资源ID \n             外向活动。 使用0进行无动画。","The View being hidden.":"视图被隐藏了。","Reply request code.  ":"回复请求代码。"," needed to launch a prompt.\n            \n            If an error occurred, ":"需要启动提示。 \n            \n             如果发生错误，","The Path along which the values should be animated.":"值应动画的路径。","The bitmap to contain the thumbnail.":"包含缩略图的位图。","The event to be processed.":"要处理的事件。","the type of account to authenticate with, will never\n                       be null":"要进行身份验证的帐户类型将永远不会 \n                        为null","The pids of the processes whose memory usage is to be\n            retrieved.":"记忆使用的过程的PID是 \n             检索。","The account to fetch an auth token for":"获取验证令牌的帐户","The name of the property being animated. Can also be the\n                                case-sensitive name of the entire setter method. Should not be null.":"属性的名称是动画的。 也可以是 \n                                 整个设置方法的案例敏感名称。 不应该为无效。","Desired prefix to prepend at each line of output.":"所需的前缀要在每条输出线处进行预处理。","The new visibility value of the child View, either\n            ":"儿童视图的新可见性价值要么","String name to be associated with the account.":"字符串名称与帐户关联。","Can be used to render into the bitmap.":"可以用来渲染到位图中。","true to display a title/subtitle if present.":"如果存在，请务必显示标题/字幕。"," if the operation is canceled for\n                 any reason, incluidng the user canceling a credential request\n            <li> ":"如果由于任何原因取消操作，包括取消凭据请求的用户<li>","The animation which reached its end.\n":"动画达到了结束。","a new Intent targeting the defined parent of this activity or null if\n                    there is no valid parent.":"针对此活动的定义父母或无效的新意图 \n                     没有有效的父。","The fragment making the call.":"碎片打电话。","The event to be processed. This event is owned by the caller and cannot be used\n            after this method returns. Services wishing to use the event after this method returns should\n            make a copy.":"要处理的事件。 此事件由来电者所有，不能使用 \n             此方法返回之后。 希望在此方法返回之后使用事件的服务应 \n             制作副本。","\n            If the request is to the server protected with a self-signed (or otherwise untrusted) SSL certificate, the request will\n            fail security chain verification unless the application provides either the CA certificate of the entity which issued the \n            server's certificate or, alternatively, provides the server public key. Whichever the case, the certificate(s) must be stored\n            in this property in order for AndroidClientHandler to configure the request to accept the server certificate.":"如果请求是对由自签名（或其他不信任）SSL证书保护的服务器的，则该请求将 \n             除非应用程序提供发行的实体的CA证书，否则故障安全链验证 \n             服务器的证书或提供服务器公钥。 无论哪种情况，必须存储证书 \n             在此属性中，以使AndroidClientHandler配置接受服务器证书的请求。","a bundle of session data created by\n                       ":"一组由会话数据创建的","Returns an array of memory information, one for each\n            requested pid.":"返回一系列内存信息，每个信息 \n             请求PID。","The auth token type, see ":"身份令牌类型，请参阅","The name of the property to associate with the set of values. This\n                                may also be the complete name of a setter function.":"与值集相关联的属性名称。 这个 \n                                 也可能是设置器函数的完整名称。","The raw file descriptor that the dump is being sent to.":"转储发送到的原始文件描述符。","true if CHANGE_APPEARING or CHANGE_DISAPPEARING animations are currently\n            running.":"是的，如果Change_pappearing或Change_disappeation当前是 \n             跑步。","Tag name to be inflated.":"标签名称要夸大。","If >= 0, this code will be returned in\n                    onActivityResult() when the activity exits, as described in\n                    ":"如果> = 0，则将返回此代码 \n                     on ActivityResult（）当活动退出时，如图所述","If true then the event will be consumed and not delivered to\n                    applications, otherwise it will be delivered as usual.":"如果为true，则该事件将被消费，而不会交付 \n                     申请，否则它将照常提供。","Callback to invoke when the request completes, null for\n                no callback":"请求完成后调用回调，null \n                 没有回调","true to use the activity logo, false to use the activity icon.":"真正使用活动徽标，false使用活动图标。","The trusted certs.":"值得信赖的证书。","The callback instance to register":"回调实例注册","The animation which was repeated.\n":"重复的动画。"," if the authenticator experienced an I/O problem\n                 creating a new auth token, usually because of network trouble\n            </ul>\n            If the account is no longer present on the device, the return value is\n            authenticator-dependent.  The caller should verify the validity of the\n            account before requesting an auth token.":"如果身份验证者遇到了I/O问题 \n                  创建一个新的身份令牌，通常是由于网络麻烦 \n             </ul> \n             如果该帐户不再存在设备上，则返回值为 \n             依赖身份验证者。 呼叫者应验证 \n             在请求验证令牌之前。"," used for adding account to\n                       device, or by ":"用于将帐户添加到 \n                        设备或通过","If true, display a notification and return null\n                if authentication fails; if false, prompt and wait for the user to\n                re-enter correct credentials before returning":"如果为true，请显示通知并返回null \n                 如果身份验证失败； 如果是错误的，请提示并等待用户 \n                 返回之前重新输入正确的凭据","true if any animations in the transition are running.":"正确，如果过渡中的任何动画正在运行。","The maximum number of entries to return in the list.  The\n            actual number returned may be smaller, depending on how many tasks the\n            user has started and the maximum number the system can remember.":"列表中返回的最大条目数。 这 \n             返回的实际数字可能较小，具体取决于多少任务 \n             用户已经启动，系统可以记住的最大数字。"," identifying the callback thread, null for\n                the main thread":"识别回调线程，null \n                 主线程","The PrintWriter to which you should dump your state.  This will be\n            closed for you after you return.":"您应该倾倒状态的印刷作者。 这将是 \n             返回后为您关闭。","If a new activity was launched then true is returned; otherwise\n                    false is returned and you must handle the Intent yourself.":"如果启动了一项新活动，则将返回真实； 否则 \n                     返回错误，您必须自己处理意图。","The context the view is being created in.":"正在创建视图的上下文。","The action to perform.":"执行的动作。","Converts <code>values</code> into float parameters for the setter.\n                                Can be null if the Keyframes have float[] values.":"将<code>值</code>转换为设置器的float参数。 \n                                 如果密钥帧具有float []值，则可以为null。","New description for the Home action when enabled":"启用家庭动作的新描述","\n            Specifies the connection read timeout.\n            ":"指定连接读取超时。","The view that should show a context menu.":"应该显示上下文菜单的视图。"," used for\n                       updating local credentials.":"用于 \n                        更新本地凭据。","The started animation.\n":"开始动画。"," context to use for launching a new\n                authenticator-defined sub-Activity to prompt the user for a password\n                if necessary; used only to call startActivity(); must not be null.":"用于推出新的上下文 \n                 身份验证者定义的子活动性，以提示用户获取密码 \n                 如有必要； 仅用于调用startActivity（）; 不能无效。","Whether the action was successfully performed.":"该动作是否成功执行。","Inflation attributes as specified in XML file.":"XML文件中指定的通货膨胀属性。","An auth token of the specified type for this account, or null\n                if authentication fails or none can be fetched.":"该帐户的指定类型的身份令牌或null \n                 如果身份验证失败或无需获取。","The IntentSender to launch.":"启动意图。","true if the specified transitionType is currently enabled, false otherwise.":"正确，如果当前启用了指定的TransitionType，否则为false。","additional arguments to the dump request.":"转储请求的其他论点。"," which resolves to the Account\n                after the name change. If successful the account's name will be the\n                specified new name.":"解决帐户 \n                 名称更改后。 如果成功，帐户的名称将是 \n                 指定的新名称。","Used to interpolate between values.":"用于在值之间插值。","Information about what to return.  May be any combination\n            of ":"有关返回的信息。 可能是任何组合 \n             的","Resource ID of a string to use as the new description\n                         for the Home action when enabled":"用作新描述的字符串的资源ID \n                          启用家庭动作","Returns true if the activity was in a state that it has started the process\n            of destroying its current instance; returns false if for any reason this could not\n            be done: it is currently visible to the user, it is already being destroyed, it is\n            being finished, it hasn't yet saved its state, etc.":"如果活动处于启动该过程状态，则返回为真 \n             破坏其当前实例； 如果出于任何原因，返回false \n             完成：目前对用户可见，已经被销毁了，它是 \n             完成后，它尚未保存其状态，等等。"," which resolves to a Bundle with\n                at least the following fields:\n            <ul>\n            <li> ":"与 \n                 至少以下领域： \n             <ul> \n             <li>","The root node if this service can retrieve window content.":"根节点如果此服务可以检索窗口内容。","The account whose password to clear":"其密码清除的帐户","Application context used to access resources":"用于访问资源的应用程序上下文","\n            Specifies the connect timeout\n            ":"指定连接超时","The parent that the created view will be placed\n in; ":"将放置创建视图的父母 \n  在;","a Bundle result or null if the result is to be returned via the\n                    response. The result will contain either:\n                    <ul>\n                    <li>":"捆绑结果或null如果要通过 \n                     回复。 结果将包含： \n                     <ul> \n                     <li>","The values at specific fractional times to evaluate between":"在特定分数时间时的值以评估"," to update visibility":"更新可见性","the ID to search for":"搜索的ID","The ViewGroup from which the View is being removed.":"视图被删除的视图组。","If non-null, this will be provided as the\n            intent parameter to ":"如果非核武器，则将其作为 \n             意图参数为","Returns a list of RecentTaskInfo records describing each of\n            the recent tasks.":"返回最近描述每个记录的近期记录列表 \n             最近的任务。","HTTPS connection object.":"HTTPS连接对象。","The generic motion event being processed.":"正在处理的通用运动事件。","Drag event":"阻力事件","The resource id of the animation to load":"动画的资源ID加载","The accessibility service info.":"可访问性服务信息。","The account to confirm password knowledge for":"确认密码知识的帐户"," - the auth token you wanted\n            </ul>\n            \n            (Other authenticator-specific values may be returned.)  If an auth token\n            could not be fetched, ":" - 您想要的身份证 \n             </ul> \n            \n             （可以返回其他特定于身份验证者的值。）如果auth令牌 \n             无法被取走，","A drawable to use for the up indicator, or null to use the theme's default":"可用于UP指示器的可绘图，或用于使用主题默认值的null","A PropertyValuesHolder for a multi-float parameter setter.":"多流线参数设置器的属性值持有人。","Intent flags in the original IntentSender that you\n            would like to change.":"您的原始意图中的意图标志 \n             想改变。","The maximum number of entries to return in the list.  The\n            actual number returned may be smaller, depending on how many services\n            are running.":"列表中返回的最大条目数。 这 \n             返回的实际数字可能较小，具体取决于多少服务 \n             正在跑步。","a view with given ID if found, or ":"如果找到给定ID的视图，或"," object used to control access to the content URIs.\n            Null if no content URIs are associated with the event or if permissions could not be granted.":"用于控制对内容uris的访问的对象。 \n             null如果没有内容与事件相关联或无法授予许可。","Package name of the application to modify account visibility":"修改帐户可见性的申请的包装名称","The animator object reference by the specified id":"指定ID的动画对象引用",", or\n                    <li>":"。 \n                     <li>","The View being removed from the ViewGroup.":"视图从ViewGroup中删除。","Instance of IHostnameVerifier to be used for this HTTPS connection":"用于此HTTPS连接的IhostNameVerifier的实例","Authenticator-specific options for the request;\n                if the ":"请求的身份验证者特定选项； \n                 如果是","The property being animated or complete name of the setter.\n                                Should not be null.":"该属性是动画或完整的设置者名称。 \n                                 不应该为无效。","The stroke width of the rectangle in pixels.\n                               Setting this value to zero results in no focus rectangle being drawn.":"像素中的矩形的中风宽度。 \n                                将此值设置为零会导致绘制无重点矩形。","Return true if you have consumed the event, false if you haven't.\n            The default implementation always returns false.":"如果您已经消费了事件，请返回True，如果没有返回，则false。 \n             默认实现始终返回false。","The account type required (see ":"所需的帐户类型（请参阅","Resource ID of a drawable to use for the up indicator, or null\n                         to use the theme's default":"可用于UP指示器的可绘图的资源ID或NULL \n                          使用主题的默认值","Returns a list of RunningServiceInfo records describing each of\n            the running tasks.":"返回runningServiceInfo记录的列表，描述了每一个 \n             运行任务。"," and\n                    ":"和","An orientation constant as used in\n            ":"在","New visibility value":"新的可见性值","Request provided by ":"提供的请求","Desired values for any bits set in\n            <var>flagsMask</var>":"设置的任何位的所需值 \n             <var> flagsmask </var>","The listener for layout bounds change.":"布局界限的侦听器会改变。","The animaton being paused.":"动画被暂停。","The id of the view to find.":"查找的视图。","Used to convert the animated value to setter parameters.":"用于将动画值转换为setter参数。"," string field is present, the\n                authenticator may use it directly rather than prompting the user;\n                may be null or empty":"存在字符串字段， \n                 身份验证者可以直接使用它，而不是提示用户； \n                 可能是空的或空的","The color of the rectangle.":"矩形的颜色。","), must not be\n                   null":"）， 必须不 \n                    无效的","The maximum number of entries to return in the list.  The\n            actual number returned may be smaller, depending on how many tasks the\n            user has started.":"列表中返回的最大条目数。 这 \n             返回的实际数字可能较小，具体取决于多少任务 \n             用户已经开始。","true to enable the home button, false to disable the home button.":"为了启用“主页”按钮，错误以禁用主页按钮。","A signal to cancel the operation in progress.":"取消正在进行的操作的信号。","The view if found or null otherwise.":"视图如果发现或否则为空。"," of the account that was\n                    added or local credentials were updated, and optional\n                    ":"帐户 \n                     添加或本地凭据已更新，可选","True, if visibility value was successfully updated.":"是的，如果成功更新了可见性值。","Returns an orientation constant as used in\n            ":"返回在","The animation being resumed.":"动画正在恢复。","Task in which the request is executed":"执行请求的任务","Always set to 0.":"始终设置为0。","A boolean value indicating whether the parents of\n            transitioning views should also be animated during the transition. Default value is true.":"布尔值，表明父母是否 \n             过渡期间也应在过渡期间动画。 默认值是正确的。","The name of the property being animated. Can also be the\n                                case-sensitive name of the entire setter method. Should not be null.\n                                The setter must take exactly two <code>int</code> parameters.":"属性的名称是动画的。 也可以是 \n                                 整个设置方法的案例敏感名称。 不应该为无效。 \n                                 设置器必须完全采用两个<code> int </code>参数。"," context to use for launching a new\n                authenticator-defined sub-Activity to prompt the user to enter a\n                password; used only to call startActivity(); if null, the prompt\n                will not be launched directly, but the necessary ":"用于推出新的上下文 \n                 身份验证者定义的子活动，以提示用户输入 \n                 密码; 仅用于调用startActivity（）; 如果无效，提示 \n                 不会直接启动，而是必要的","The display on which to set this region.":"设置此区域的显示。"," for checking\n                    the status of the account later, or\n                    <li>":"用于检查 \n                     稍后帐户的状态，或 \n                     <li>","The account to set an auth token for":"为设置auth令牌的帐户","Returns a list of RunningTaskInfo records describing each of\n            the running tasks.":"返回runningTaskInfo记录的列表，描述了每一个 \n             运行任务。","Drawable to show as an icon.":"可绘制以显示为图标。","The callback to send the action list. The actions list cannot\n                contain <code>null</code> elements. You can call this on any thread.":"回调发送操作列表。 动作列表不能 \n                 包含<code> null </code>元素。 您可以在任何线程上调用此。","The request code of the activity that you had\n                               given to startActivityForResult().  If there are multiple\n                               activities started with this request code, they\n                               will all be finished.":"您有活动的请求代码 \n                                给出startActivityForresult（）。 如果有多个 \n                                活动始于此请求代码，他们 \n                                都将完成。","The desired auth token type (see ":"所需的身份令牌类型（请参阅","The requested permissions. Must me non-null and not empty.":"请求的许可。 我必须无效而不是空。","ArrayList<Animator> The list of child animations of this AnimatorSet.":"ArrayList <animator>此Animatorset的儿童动画列表。"," which resolves to a Bundle\n                with these fields if activity or password was supplied and\n                the account was successfully verified:\n            <ul>\n            <li> ":"解决的捆绑 \n                 如果提供活动或密码，则使用这些字段 \n                 该帐户已成功验证： \n             <ul> \n             <li>"," for more details.  If options\n have also been supplied by the IntentSender, options given here will\n override any that conflict with those given by the IntentSender.\n":"更多细节。 如果选项 \n  意图人也提供了此处给出的选项 \n  覆盖与意图人给出的那些冲突。","Request data":"请求数据","Converts <code>values</code> into int parameters for the setter.\n                                Can be null if the Keyframes have int[] values.":"将<code>值</code>转换为设置器的int参数。 \n                                 如果密钥帧具有int []值，则可以为null。",", which determines the\n            animation whose animator is being set.":"，这决定了 \n             动画仪正在设置的动画。","Source context, from which an activity will be started.":"来源上下文，将启动活动。","The value in event.getKeyCode().":"event.getKeyCode（）中的值。"," to indicate an error\n                    </ul>":"指示错误 \n                     </ul>","Resource ID of a drawable to show as an icon.":"可绘制的资源ID显示为图标。","the region of the screen.":"屏幕的区域。","The type of the auth token, see {#getAuthToken}":"身份令牌的类型，请参阅{#getAuthToken}","The activity making the call.":"致电的活动。","Required features for the account (see\n                   ":"该帐户所需的功能（请参阅","A PropertyValuesHolder for a multi-int parameter setter.":"多INT参数设置器的属性值持有人。"," - the name of the account verified\n            <li> ":" - 已验证帐户的名称 \n             <li>","The animation being assigned. A value of <code>null</code> means that no\n            animation will be run for the specified transitionType.":"分配的动画。 <code> null </code>的值表示否 \n             动画将用于指定的TransitionType。","Application specific request code to match with a result\n               reported to ":"申请特定的请求代码与结果匹配 \n                报告给","The time, in milliseconds, to which the animation is advanced or rewound.\n                            Unless the animation is reversing, the playtime is considered the time since\n                            the end of the start delay of the AnimatorSet in a forward playing direction.":"动画是在毫秒中以毫秒为单位的时间。 \n                             除非动画逆转，否则播放时间被认为是 \n                             动画集的开始延迟的结束是向前播放的方向。","Target display id.":"目标显示ID。","Pre-configured connection instance":"预配置连接实例","a Bundle of private arguments to the current voice interaction service":"当前语音互动服务的一堆私人论点","the account to check, will never be null":"要检查的帐户，永远不会为null","The info.":"信息。","Description of the key event.":"关键事件的描述。","An adapter that will provide views both to display\n                           the current navigation selection and populate views\n                           within the dropdown navigation menu.":"一个适配器，将提供既可以显示的视图 \n                            当前的导航选择和填充视图 \n                            在下拉导航菜单中。","The auth token to add to the cache\n":"验证令牌要添加到缓存","Request code that had been used to start the\n                               activity.":"已用于启动的请求代码 \n                                活动。","), may be null or empty":"），可能为空或空"," - the type of the account\n            <li> ":" - 帐户的类型 \n             <li>",".\n               Should be >= 0.":"。 \n                应为> = 0。","The length of time, in milliseconds, that the transition animations\n            should last.":"过渡动画以毫秒为单位的时间长度 \n             应该持续。",", true if the removal of the account is\n            allowed, false otherwise\n            <li> ":"，如果删除帐户是正确的 \n             允许，否则错误 \n             <li>","The Cursor to be managed.":"要管理的光标。","Intent used to launch an activity.":"意图用于发起活动。","the current position in time of the animation in milliseconds":"当前动画时期的位置以毫秒为单位","Return <code>true</code> to prevent this event from being propagated\n            further, or <code>false</code> to indicate that you have not handled\n            this event and it should continue to be propagated.":"返回<code> true </code>以防止此事件传播 \n             此外，或<code> false </code>表示您尚未处理 \n             此事件，应该继续传播。","An OnNavigationListener that will receive events when the user\n                            selects a navigation item.":"一个onneNavigationListener，将在用户时接收事件 \n                             选择导航项目。","the region of the screen .":"屏幕的区域。","Key store to configure.":"要配置的关键存储。","The converter to use to convert values.":"用于转换值的转换器。","The account whose password is to be set. Cannot be\n                       ":"要设置密码的帐户。 不可能是","Operating mode.  Use ":"操作模式。 利用"," context to use for launching new sub-Activities to\n                   prompt to add an account, select an account, and/or enter a password, as necessary;\n                   used only to call startActivity(); should not be null":"用于启动新的子活性的上下文 \n                    提示添加帐户，选择一个帐户和/或根据需要输入密码； \n                    仅用于调用startActivity（）; 不应该为无效","true to notify the system that the activity wishes to be visible behind other\n                           translucent activities, false to indicate otherwise. Resources must be\n                           released when passing false to this method.":"诚然通知系统，该活动希望在其他方面可见 \n                            半透明的活动，虚假表示其他方式。 资源必须是 \n                            将错误传递给此方法时释放。","Number of pairs as returned by event.getRepeatCount().":"对event.getRepeatCount（）返回的对数。"," - true to indicate success\n            </ul>\n            \n            If no activity or password was specified, the returned Bundle contains\n            ":" - 表明成功 \n             </ul> \n            \n             如果未指定活动或密码，则返回的捆绑包包含"," if a call to start an activity on the target display is allowed for the\n            provided context and no ":"如果允许在目标显示上开始活动的电话 \n             提供上下文，没有",", which determines\n            the animation whose duration is being set.":"，决定 \n             设置持续时间的动画。","The key store.":"钥匙店。","The length of the animation, in milliseconds, of each of the child\n            animations of this AnimatorSet.":"每个孩子的动画的长度，以毫秒为单位 \n             该动画的动画。","A list of available system actions.":"可用系统操作的列表。","Drawable to show as a logo.":"可绘制以显示为徽标。","One or more values that the animation will animate between.":"动画将在两者之间进行动画的一个或多个值。","The intent to dispatch to the next activity.  For\n            correct behavior, this must be the same as the Intent that started\n            your own activity; the only changes you can make are to the extras\n            inside of it.":"打算派往下一个活动。 为了 \n             正确的行为，这必须与开始的意图相同 \n             您自己的活动； 您唯一可以做出的更改是额外的 \n             它的内部。","the account whose credentials are to be retrieved, will never be null":"要检索凭证的帐户将永远不会无效","The password to set, null to clear the password":"要设置的密码，无效以清除密码"," for the default\n                        operation.":"对于默认值 \n                         手术。","Authenticator-specific options to use for adding new accounts; may\n                   be null or empty":"用于添加新帐户的认证特定选项； 可能 \n                    无效或空","A Rect to be modified and returned by evaluate.":"一个要修改和通过评估返回的矩形。","Whether this AnimatorSet has gone past the initial delay, and at least one child\n                    animation has been started and not yet ended.":"这个动画仪是否已经超过了最初的延迟，至少一个孩子 \n                     动画已经开始，尚未结束。","The logic display id, must be ":"逻辑显示ID必须是","True if the key shortcut was handled.":"如果处理钥匙快捷方式，则是真的。","the resulting visibiity state. If true the activity will remain visible beyond\n                 ":"由此产生的可见性状态。 如果是正确的话，活动将仍然可见"," needed to launch the\n            password prompt.\n            \n            <p>Also the returning Bundle may contain ":"需要启动 \n             密码提示。 \n            \n             <p>还可以包含返回的捆绑包","Key store.":"钥匙店。","The length of time, in milliseconds, that the specified animation should run.":"指定动画应运行的时间长度，以毫秒为单位。"," will be thrown, ":"将被扔","the type of auth token to retrieve, will never be null":"要检索的auth令牌的类型，永远不会为空","Resource ID of a drawable to show as a logo.":"可绘图的资源ID显示为徽标。","Returns the single SharedPreferences instance that can be used\n                    to retrieve and modify the preference values.":"返回可以使用的单个共享Preferences实例 \n                     检索和修改首选项值。","Account whose user data is to be set. Must not be ":"将设置用户数据的帐户。 必须不","Authenticator-specific options to use for getting auth tokens; may\n                   be null or empty":"用于获得身份验证令牌的授权特定选项； 可能 \n                    无效或空","Returns a boolean indicating whether there was another Activity\n            to start: true if there was a next activity to start, false if there\n            wasn't.  In general, if true is returned you will then want to call\n            finish() on yourself.":"返回布尔值，指示是否还有其他活动 \n             开始：如果有下一个活动要开始，则为false \n             不是。 通常，如果返回true，您将要致电 \n             完成（）对自己。","The panel that the menu is in.":"菜单中的面板。"," for\n                             default display.":"为了 \n                              默认显示。","The start Rect":"启动rect"," if the next activity is translucent or not fullscreen. If false\n                 then the activity may not count on being visible behind other translucent activities,\n                 and must stop any media playback and release resources.\n                 Returning false may occur in lieu of a call to ":"如果下一个活动是半透明或不全面的。 如果是错误的 \n                  那么该活动可能无法指望其他半透明活动背后可见， \n                  并且必须停止任何媒体播放并发布资源。 \n                  返回的错误可能代替了电话"," indicating the last time the\n            credential was validated/created.\n            \n            If an error occurred,":"指示上次 \n             凭据已验证/创建。 \n            \n             如果发生错误，","The animation that is the dependency used in later calls to the\n methods in the returned ":"动画是稍后调用中使用的依赖项 \n  返回的方法","true if user has enforced background restrictions for this app, false otherwise.":"如果用户对此应用程序有强制性限制，则为false，否则为否则。","the authTokenType whose label is to be returned, will never be null":"归还标签的authtokentype，永远不会为null",", which determines\n            the animation whose interpolator is being set.":"，决定 \n             正在设置插装器的动画。","True if this activity's main window currently has window focus.":"如果此活动的主窗口当前具有窗口焦点，则为the。","The key manager factory or ":"关键经理工厂或"," if the authenticator failed to respond\n            <li> ":"如果身份验证者未能响应 \n             <li>","Position of the item to select.":"要选择的项目位置。","The menu item that was selected.":"选择的菜单项。","Any non-null non-empty string will be inserted as\n            pre-entered text in the search query box.":"任何非零非空字符串都将被插入 \n             搜索查询框中的预先输入文本。"," object. A null parameter will result\n in a null ":"目的。 零参数将结果 \n  在零中","String user data key to set.  Must not be null":"字符串用户数据键要设置。 一定不能无效","Executor on which to run the callback.":"执行人可以在其中运行回调。"," which resolves to a Bundle with at least the\n                    following fields:\n                    <ul>\n                    <li>":"至少与 \n                     以下字段： \n                     <ul> \n                     <li>","Whether or not the low memory kill will be reported in\n            ":"是否将记忆力杀死的记忆力较低","The end Rect":"末端矩形","The interpolator that the specified animation should use.":"指定的动画应使用的插值器。","the localized label of the auth token type, may be null if the type isn't known":"如果该类型未知，则身份令牌类型的本地化标签可能为空"," so\n                 the return value must be checked.":"所以 \n                  必须检查返回值。","Background drawable for the split bar":"可用于拆分条的背景","The trust manager factory.":"信托经理工厂。","The name of the package whose processes are to\n            be killed.":"该过程的名称为 \n             被杀死。","The new Intent object to return from getIntent":"从GetIntent返回的新意图对象"," - the name of the account\n                    <li>":" - 帐户的名称 \n                     <li>","The drawable state specs to match against":"可匹配的可绘制状态规格"," if the operation was canceled for\n                 any reason, including the user canceling the password prompt\n            <li> ":"如果操作被取消 \n                  任何原因，包括取消密码提示的用户 \n             <li>","The animations that will be started one after another.":"将彼此启动的动画。","The menu that is opened.":"打开的菜单。","If true, the initial query will be preselected, which means that\n            any further typing will replace it.  This is useful for cases where an entire pre-formed\n            query is being inserted.  If false, the selection point will be placed at the end of the\n            inserted query.  This is useful when the inserted query is text that the user entered,\n            and the user would expect to be able to keep typing.  ":"如果为true，则将预选初始查询，这意味着 \n             任何进一步的键入都将替换它。 这对于整个预先形成的情况很有用 \n             查询正在插入。 如果是错误的，则选择点将放置在 \n             插入查询。 当插入的查询是用户输入的文本时，这很有用， \n             并且用户期望能够继续打字。","The callback invoked when taking screenshot has succeeded or failed.\n                            See ":"拍摄屏幕截图时调用了回调，已成功或失败。 \n                             看","an array of features to check, will never be null":"一系列要检查的功能将永远不会为null","The length of time, in milliseconds, to delay before launching the next\n            animation in the sequence.":"在启动下一个之前，以毫秒为单位的时间长度延迟 \n             序列中的动画。","String value to set, ":"弦值设置，"," - the auth token you wanted\n                    </ul>\n            \n                    If an error occurred, ":" - 您想要的身份证 \n                     </ul> \n            \n                     如果发生错误，","The desired feature as defined in\n                             ":"所需的所需功能定义","Background drawable for the stacked row":"可用于堆叠行的背景"," if the authenticator experienced an I/O problem\n                 verifying the password, usually because of network trouble\n            </ul>":"如果身份验证者遇到了I/O问题 \n                  验证密码，通常是由于网络麻烦 \n             </ul>","HTTPS connection to return socket factory for":"HTTPS连接到返回套接字工厂","The animator to run when the specs match":"规格匹配时要运行的动画师","true if a transition is currently running on this activity, false otherwise.":"是的，如果当前在此活动上进行过渡，否则为false。","The animations that will be started simultaneously.":"将同时启动的动画。"," for details.":"有关详细信息。","An application can insert application-specific\n            context here, in order to improve quality or specificity of its own\n            searches.  This data will be returned with SEARCH intent(s).  Null if\n            no extra data is required.":"应用程序可以插入特定于应用程序 \n             在这里，为了提高自己的质量或特异性 \n             搜索。 此数据将以搜索意图返回。 null if \n             无需额外的数据。","density in terms of DPI":"DPI的密度","The default implementation returns true.":"默认实现返回true。",", true if the account has all the features,\n            false otherwise\n            <li> ":"，如果帐户具有所有功能，则为 \n             否则为错误 \n             <li>",", which determines\n            the animation whose start delay is being set.":"，决定 \n             设置启动延迟的动画。","The length of the animation, in milliseconds, of each of the child\n animations of this AnimatorSet.\n":"每个孩子的动画的长度，以毫秒为单位 \n  该动画的动画。"," to clear this user data key":"清除此用户数据密钥","Returns true if the requested feature is supported and now\n                    enabled.":"如果支持所请求的功能，现在返回true \n                     已启用。","the listener to be set.":"要设置的听众。","Instance of SSLSocketFactory ready to use with the HTTPS connection.":"SSLSocketFactory的实例可以与HTTPS连接一起使用。"," if no authenticator was registered for this\n                    account type or the authenticator failed to respond\n                    <li>":"如果没有为此注册身份验证者 \n                     帐户类型或身份验证者未能响应 \n                     <li>","If the activity is being torn down in order to be recreated with a new configuration,\n            returns true; else returns false.":"如果活动被拆除以便使用新配置重新创建 \n             返回真实； 否则返回false。","The account type associated with the authenticator\n                to adjust":"与身份验证者关联的帐户类型 \n                 调整","Resource ID of subtitle string to set":"字幕字符串的资源ID设置","true if Up navigation completed successfully and this Activity was finished,\n                    false otherwise.":"如果成功完成并且此活动完成，则为真实， \n                     否则为错误。","dimensions of square icons in terms of pixels":"平方图标的尺寸在像素方面","the IBinder for the AccountAuthenticator":"ibinder for Accountauthenticator","If false, this will only launch the search that has been specifically\n            defined by the application (which is usually defined as a local search).  If no default\n            search is defined in the current application or activity, global search will be launched.\n            If true, this will always launch a platform-global (e.g. web-based) search instead.":"如果是错误的，这只会启动专门的搜索 \n             由应用程序定义（通常定义为本地搜索）。 如果没有默认值 \n             搜索是在当前应用程序或活动中定义的，将启动全局搜索。 \n             如果为true，这将始终启动平台全球（例如基于Web的）搜索。","The windows if there are windows and the service is can retrieve\n                    them, otherwise an empty list.":"窗口如果有窗口，并且服务的设置可以检索 \n                     他们，否则一个空列表。","The length of time, in milliseconds, to delay before starting the animation.":"在启动动画之前，以毫秒为单位的时间长度。",")\n                       this account will need to be able to generate, null for none":"） \n                        该帐户将需要能够生成，无效","a view with given ID":"具有给定ID的视图","the interpolator to be used by each child animation of this AnimatorSet":"该动画仪的每个孩子动画要使用的插装器","Resource ID of title string to set":"标题字符串的资源ID设置","The animator sending out the notification.":"动画师发送通知。","If the activity is finishing, returns true; else returns false.":"如果活动正在完成，则返回真实； 否则返回false。"," if the operation was canceled for any reason,\n                    including the user canceling any operation\n                    <li>":"如果由于任何原因取消操作， \n                     包括取消任何操作的用户 \n                     <li>","The requested authentication.":"请求的身份验证。","to send the result back to the AccountManager, will never be null.":"要将结果发送回到帐户管理器，将永远不会无效。","The windows of all displays if there are windows and the service is can retrieve\n                    them, otherwise an empty list. The key of SparseArray is display ID.":"如果有窗口，则所有显示器的窗口都可以检索该服务 \n                     他们，否则一个空列表。 Sparsearray的关键是显示ID。"," context to use for launching a new\n                authenticator-defined sub-Activity to adjust authenticator settings;\n                used only to call startActivity(); if null, the settings dialog will\n                not be launched directly, but the necessary ":"用于推出新的上下文 \n                 身份验证者定义的子活性，以调整身份验证器设置； \n                 仅用于调用startActivity（）; 如果null，则设置对话框将 \n                 不直接启动，而是必要的","The new intent that was started for the activity.":"这项活动开始的新意图。","The Cursor that was being managed.":"正在管理的光标。",") this\n                       account must have, null for none":"） 这个 \n                        帐户必须有，无效","The identifier of the task to be moved, as found in\n            ":"如在"," if the authenticator experienced an I/O problem updating\n                    settings, usually because of network trouble\n                    </ul>":"如果身份验证者经历了I/O问题更新 \n                     设置，通常是由于网络麻烦 \n                     </ul>","True if the activity is in multi-window mode.":"如果活动处于多窗口模式，则为true。","The amount of the delay, in milliseconds":"延迟的数量，以毫秒为单位","The ViewGroup in which the View is being made visible.":"可见视图的视图组。"," will be\n                returned to the caller instead":"将会 \n                 返回呼叫者","a String of token which can be used to check the status of locally\n                       stored credentials and if update of credentials is suggested":"一串令牌，可用于检查本地的状态 \n                        存储的凭证和如果建议更新","boolean Return false to allow normal menu processing to\n                    proceed, true to consume it here.":"布尔返回false以允许普通菜单处理 \n                     继续，在此处尽量消费。","The total time elapsed since the animator started, in milliseconds.":"自动画师开始以毫秒为单位以来的总时间。","A themed Context for creating views":"创建视图的主题背景","the action to run on the UI thread":"在UI线程上运行的动作","True if window content can be retrieved.":"如果可以检索窗口内容，则为正确。","Task identifier, an opaque integer.":"任务标识符，不透明的整数。","The request needs authorization.":"请求需要授权。","Authenticator-specific options for the request, may be\n                       null or empty":"请求的身份验证者特定选项可能是 \n                        空或空"," which resolves to a Bundle\n                which is empty if properties were edited successfully, or\n                if no activity was specified, contains only ":"解决的捆绑 \n                 如果成功编辑了属性，则是空的，或者 \n                 如果未指定活动，则仅包含","The View being made visible.":"可见的视图。","Additional operational flags.":"其他操作标志。","the number of milliseconds to delay running the animation":"延迟运行动画的毫秒数","The account for which visibility data should be returned":"应返回可见性数据的帐户","True if the activity is in picture-in-picture mode.":"如果活动处于图像模式，则为true。","The options menu as last shown or first initialized by\n                        onCreateOptionsMenu().":"最后显示的选项菜单或首先由 \n                         OnCreateOptionsMenu（）。","a Bundle result or null if the result is to be returned via the response. The result\n                    will contain either:\n                    <ul>\n                    <li>":"如果要通过响应返回结果，则捆绑结果或null。 结果 \n                     将包含： \n                     <ul> \n                     <li>","The time elapsed since the previous frame, in milliseconds.\n":"自上一个帧以来的时间以毫秒为单位。","True if an action bar menu is now visible, false if no action bar\n                  menus are visible.\n":"如果现在可以看到动作栏菜单，则为true，如果没有动作栏，则为false \n                   菜单可见。","The challenge.":"挑战。","The query to trigger.  If empty, the request will be ignored.":"查询要触发。 如果为空，则该请求将被忽略。"," context to use for launching a new\n                       authenticator-defined sub-Activity to prompt the user to\n                       create an account; used only to call startActivity(); if null,\n                       the prompt will not be launched directly, but the necessary\n                       ":"用于推出新的上下文 \n                        身份验证者定义的亚活动，以提示用户 \n                        创建一个帐户; 仅用于调用startActivity（）; 如果无效， \n                        提示不会直接启动，而是必要的","Map from package names to visibility for given account":"从包装名称到给定帐户的可见度的地图","The previous visibility value of the child View, either\n            ":"以前的儿童视图的可见性值","The animation whose end will cause the animation supplied to the\n ":"动画将导致动画提供给","The capability bit mask.":"功能位掩码。"," if the activity is launched from a bubble.":"如果活动是从泡沫发射的。","\n                needed to launch the authenticator's settings dialog.\n                If an error occurred, ":"需要启动“身份验证者的设置”对话框。 \n                 如果发生错误，",", true if update of account's\n                    credentials is suggested, false otherwise\n                    <li>":"，如果帐户更新 \n                     建议证书，否则错误 \n                     <li>","A value of type V, converted from <code>value</code>.":"V型的值，从<code> value </code>转换。","Position of the item clicked.":"单击的项目位置。"," method to play.\n":"玩法。"," to use proxy authentication.":"使用代理身份验证。","The capability.":"功能。","The callback instance to unregister":"回调实例未注册","The panel that is being displayed.":"正在显示的面板。","The LayoutTransition sending out the event.":"LayoutTransition发送活动。","\n                throws:\n            <ul>\n            <li> ":"扔： \n             <ul> \n             <li>"," will be returned to the caller instead":"将退还给呼叫者","The account to query for a password. Must not be ":"该帐户要查询密码。 必须不","whether the current voice interaction service supports local voice interaction":"当前的语音交互服务是否支持本地语音互动","Elapsed/interpolated fraction of the animation.":"动画的经过/插值。","ID of the item clicked.":"单击的项目的ID。","the type of auth token to retrieve after\n                       authenticating with the account, may be null":"验证令牌的类型要在 \n                        用帐户进行认证，可能为null","The auth module.":"验证模块。"," which resolves to a Bundle with\n                    these fields if activity was specified and user was authenticated\n                    with an account:\n                    <ul>\n                    <li>":"与 \n                     这些字段如果指定了活动并对用户进行身份验证 \n                     带有帐户： \n                     <ul> \n                     <li>","SearchEvent The SearchEvent that triggered the ":"SearchEvent触发的SearchEvent ","True if this is the root activity, else false.":"如果这是根活动，则为否。","The ViewGroup on which the transition is playing.":"过渡正在播放的视图组。","If onCreatePanelView() returned null, this is the Menu\n            being displayed in the panel.\n":"如果onCreatePanelView（）返回null，则是菜单 \n             在面板中显示。","The number of milliseconds that should elapse before the\n animation starts.\n":"在 \n  动画开始。"," if the operation was canceled for\n                 any reason, including the user canceling the settings dialog\n            <li> ":"如果操作被取消 \n                  任何原因，包括取消设置对话框的用户 \n             <li>","Additional options for the operation, either null or\n            as per ":"操作的其他选项，null或\n            按 ","The description.":"的描述。","The view that should stop showing a context menu.":"应停止显示上下文菜单的视图。"," - encrypted Bundle for\n                    adding the the to the device later.\n                    <li>":" - 加密捆绑包 \n                     稍后将其添加到设备中。 \n                     <li>","animatedValue The value most recently calculated by this <code>ValueAnimator</code> for\n            the single property being animated. If there are several properties being animated\n            (specified by several PropertyValuesHolder objects in the constructor), this function\n            returns the animated value for the first of those objects.":"AnimatedValue该值最近由此<code> valueAnimator </code>计算 \n             单个属性是动画的。 如果有几个属性被动画 \n             （由构造函数中的几个属性值持有人指定），此功能 \n             返回第一个对象的动画值。","The account's password, null if none or if the account doesn't exist":"帐户的密码，如果没有或帐户不存在，则为null","The tab that was reselected.":"被重新选择的选项卡。","Toolbar to set as the Activity's action bar, or ":"工具栏将其设置为活动的动作栏，或","The ID for the action you previously reported via\n                ":"您先前通过的操作的ID","the object previously returned by ":"以前返回的对象","The feedback type.":"反馈类型。"," if the authenticator experienced an I/O problem\n                 updating settings, usually because of network trouble\n            </ul>":"如果身份验证者遇到了I/O问题 \n                  更新设置，通常是由于网络麻烦 \n             </ul>","a String array of authenticator-specific features\n                       that the account authenticated with must support, may be null":"特定于身份验证者特定功能的字符串阵列 \n                        具有必须支持的帐户验证的帐户可能为null","The animation that will play when the animation supplied to the\n ":"当动画提供给该动画时将播放的动画","The type of the authentication.":"身份验证的类型。","The View object being affected by the transition animation.":"视图对象受到过渡动画的影响。","Returns a list of ProcessErrorStateInfo records, or null if there are no\n            current error conditions (it will not return an empty list).  This list ordering is not\n            specified.":"返回ProcessErrorStateInfo记录的列表，如果没有，则返回null\n            当前错误条件（它不会返回空列表）。  此列表排序不是\n            指定。","boolean Whether animators are currently enabled. The default value is\n            <code>true</code>.":"布尔值当前是否启用了动画师。 默认值是 \n             <code> true </code>。"," for queuing fragment operations to execute\n        once this method returns. This FragmentTransaction does not support\n        being added to the back stack.\n":"用于排队片段操作以执行 \n         一旦此方法返回。 这种片段发射不支持 \n         被添加到后堆中。"," or\n                       ":"或者"," to clear it":"清除它","The account to query for a previous name.":"该帐户要查询先前的名称。","The type of the audio stream whose volume should be\n                       changed by the hardware volume controls.":"音频的音频流的类型 \n                        通过硬件卷控件更改。"," - optional, token to check\n                    status of the account\n                    </ul>\n                    If no activity was specified, the returned Bundle contains only\n                    ":" -可选，令牌检查\n                    帐户状况\n                    </ul>\n                    如果未指定任何活动，则返回的包仅包含\n                    ","The time, in milliseconds, to which the animation is advanced or rewound.":"动画是在毫秒中以毫秒为单位的时间。","The can pre authenticate.":"可以预先验证。"," for adding\n                    the account to device later, and if account is authenticated,\n                    optional ":"用于添加 \n                     稍后将帐户到设备，如果帐户已进行身份验证， \n                     可选的","The local class name.":"本地班级名称。","The type of transition that is ending,\n ":"结束的过渡类型，","The flag.":"旗帜。","Any additional arguments provided by the caller that are\n                specific to the given action.":"呼叫者提供的任何其他参数 \n                 特定于给定的动作。"," method ends.\n":" 方法结束。\n"," needed to launch the\n                    actual account creation process. If authenticator doesn't support\n                    this method, the returned Bundle contains only\n                    ":"需要启动 \n                     实际的帐户创建过程。 如果身份验证者不支持 \n                     此方法，返回的捆绑包仅包含","Returns a list of RunningAppProcessInfo records, or null if there are no\n            running processes (it will not return an empty list).  This list ordering is not\n            specified.":"返回RunningAppProcessInfo记录的列表，如果没有则返回null\n            正在运行的进程（它不会返回空列表）。  此列表排序不是\n            指定。","The tab that was selected":"选择的标签","Resource ID to be inflated.":"资源ID被夸大。","The suggested audio stream type whose volume should be changed by\n                    the hardware volume controls.":"建议的音频流类型，其音量应由\n                    硬件音量控制。","The callback to provide the result back to the caller.\n                You can call this on any thread. The result bundle is action specific.":"回调将结果返回给呼叫者。 \n                 您可以在任何线程上调用此。 结果捆绑包是特定于动作的。","The current position in time of the animation.":"动画时间的当前位置。","The account's previous name, null if the account has never been\n                    renamed.":"该帐户以前的名称，如果该帐户从未为null\n                    重命名。","Challenge.":"挑战。"," for checking the\n                    status of the account, or\n                    <li>":"用于检查 \n                     帐户状态，或 \n                     <li>","The URI of the content provider to query.":"内容提供商查询的URI。"," method starts.\n":"方法开始。","The timeout in milliseconds.":"超时以毫秒为单位。"," context to use for launching a new\n                       authenticator-defined sub-Activity to prompt the user to\n                       create an account or reauthenticate existing account; used\n                       only to call startActivity(); if null, the prompt will not\n                       be launched directly, but the necessary ":" 用于启动新的上下文\n                       身份验证器定义的子活动，以提示用户\n                       创建帐户或重新验证现有帐户；使用\n                       仅调用startActivity();如果为null，则提示不会\n                       直接发射，但必要的 ","The desired default key mode constant.":"所需的默认密钥模式常数。","the requested time between frames, in milliseconds":"框架之间要求的时间，以毫秒为单位"," if the activity received this callback regardless of if it acts on it\n            or not. If ":"如果活动收到此回调，无论它是否作用于此 \n             或不。 如果",",\n ":",\n ","The state data. To be advised, <b>DO NOT</b> include sensitive information/data\n            (PII, SPII, or other sensitive user data) here. Maximum length is 128 bytes.":"的状态数据。 请注意，<b>不要</b>包含敏感信息/数据\n            （PII、SPII或其他敏感用户数据）在这里。 最大长度为128字节。"," for queuing fragment operations to execute\n        during a tab switch. The previous tab's unselect and this tab's select will be\n        executed in a single transaction. This FragmentTransaction does not support\n        being added to the back stack.\n":" 用于对要执行的片段操作进行排队\n        在选项卡切换期间。 上一个选项卡的取消选择，这个选项卡的选择将是\n        在单个事务中执行。 此FragmentTransaction不支持\n        被添加到后堆栈中。\n","The account to query for user data":"向查询用户数据查询的帐户","The fraction from the starting to the ending values":"从启动到结尾值的分数","Window The current window, or null if the activity is not\n                    visual.":"窗口当前窗口，如果活动不是，则为null\n                    视觉。"," with encrypted\n                    ":" 用加密\n                    ","the account whose credentials are to be updated, will\n                       never be null":"要更新其凭据的帐户将\n                       永远不要为null","List of columns to return.":"要返回的列列表。"," if the property is set to true.":" 如果属性设置为true。"," will\n                       be returned to the caller instead":" 威尔\n                       被返回给调用者","Request.":"请求。","animatedValue The value most recently calculated for the named property\n            by this <code>ValueAnimator</code>.":"animatedValue最近为命名属性计算的值\n            通过这个<code>ValueAnimator</code>。","Used to manipulate shared element transitions on the launched Activity.":"用于操作已启动活动上的共享元素转换。",", or\n ":"，或\n ",", the framework will assume the app hasn't been updated to leverage\n            this callback and will in turn send a legacy callback of ":"，框架将假设应用程序尚未更新以利用\n            这个回调，并将反过来发送一个遗留的回调 ","tid of the VR thread":"VR线程的tid","The user data, null if the account, key doesn't exist, or the user is locked":"用户数据，如果帐户、密钥不存在或用户被锁定，则为null","The tab that was unselected":"未选择的选项卡","A 32-bit int value representing colors in the\n            separate bytes of the parameter":"一个32位的int值，表示颜色在\n            参数的单独字节","\n          A ":"\n          A ","the type of auth token to retrieve after updating\n                       the credentials, may be null":"更新后要检索的auth令牌的类型\n                       凭据可能为null"," for the\n            app to enter picture-in-picture mode.":"为了 \n             应用程序输入图片中的模式。","SQL WHERE clause.":"SQL WHERE子句。","The localized description.":"的本地化描述。"," needed to add account later. If an error\n                    occurred, ":" 稍后需要添加帐户。 如果出现错误\n                    发生了, ","Credentials.":"全权证书。","PropertyValuesHolder[] An array of PropertyValuesHolder objects which hold the\n            values, per property, that define the animation.":"PropertyValuesHolder[]一个PropertyValuesHolder对象的数组，其中包含\n            定义动画的每个属性的值。","Used to manipulate shared element transitions on the launching Activity.":"用于操作启动活动上的共享元素转换。","Callback to invoke when the request completes, null for\n                       no callback":"请求完成时调用的回调，null为\n                       没有回调","The type of transition that is beginning,\n ":"正在开始的过渡类型,\n ","The size in bytes to set the limit at.":"以字节为单位的大小来设置限制。","The localized summary if available, and ":"本地摘要（如果有），以及"," to test":" 测试"," for queuing fragment operations to execute\n        during a tab switch. This tab's unselect and the newly selected tab's select\n        will be executed in a single transaction. This FragmentTransaction does not\n        support being added to the back stack.\n":" 用于对要执行的片段操作进行排队\n        在选项卡切换期间。 此选项卡的未选择和新选择的选项卡的选择\n        将在单个事务中执行。 此FragmentTransaction不\n        支持被添加到后栈。\n","A value that is calculated to be the linearly interpolated\n            result, derived by separating the start and end values into separate\n            color channels and interpolating each one separately, recombining the\n            resulting values in the same way.":"计算为线性插值的值\n            结果，通过将开始值和结束值分离为单独的\n            颜色通道和插值每个单独，重新组合\n            以相同的方式产生值。"," for\n                    updating the locally stored credentials later, and if account is\n                    re-authenticated, optional ":" 为\n                    稍后更新本地存储的凭据，如果帐户是\n                    重新认证，可选 ","the new Picture-in-Picture state.":"新的画中画状态。"," to show the ":"显示","The arguments to selection, if any ?s are pesent":"选择的论据，如果有的话？s是pesent","The account to update credentials for":"更新凭据的帐户"," instance which contains the value of the response header to authorize the connection":" 包含用于授权连接的响应头的值的实例"," specifying whether the activity\n          can be reparented.\n        ":" 指定活动是否\n          可以得到补偿。\n        ","The Object to convert.":"要转换的对象。","Description of this tab's content":"此标签内容的描述","A ValueAnimator object that is set up to animate between the given values.":"ValueAnimator对象，设置为在给定值之间进行动画处理。"," identifying the callback thread, null for\n                       the main thread":" 标识回调线程，null为\n                       主线程","The object whose property is to be animated.":"属性为动画的对象。","Bounds used to launch the activity.":"用于启动活动的边界。"," if a summary\n            has not been provided.":" 如果摘要\n            尚未提供。","\n                    and ":"\n                    和 ","The data most recently supplied in ":"最近提供的数据 "," on top of the lock\n                                         screen when this activity has another activity behind it with\n                                         the showWhenLock attribute set; ":" 在锁的顶部\n                                         当此活动背后有另一个活动时，屏幕\n                                         showWhenLock属性集; ","An array of the account features to check":"要检查的帐户功能的数组","SQL ORDER BY clause.":"SQL ORDER BY子句。","The credentials entered must allow an auth token of\n                       this type to be created (but no actual auth token is\n                       returned); may be null":"输入的凭据必须允许\n                       要创建的此类型（但没有实际的auth令牌是\n                       返回）;可能为null","To be added.":"待添加。"," specifying whether the system will\n          retain task state.\n        ":" 指定系统是否将\n          保留任务状态。\n        ","A value of type T, converted from <code>value</code>.":"类型为T的值，从<code>值</code>转换而来。","A TypeEvaluator that will be called on each animation frame to\n            provide the ncessry interpolation between the Object values to derive the animated\n            value.":"一个TypeEvaluator，它将在每个动画帧上调用到\n            提供对象值之间的ncessry插值以导出动画\n            价值。","A resource ID referring to the description text":"引用描述文本的资源ID"," which resolves to a Bundle with\n                    these fields if an activity was supplied and an account was added\n                    to device or local credentials were updated::\n                    <ul>\n                    <li>":" 它解决了一个与\n                    如果提供了活动并添加了帐户，则这些字段\n                    更新了设备或本地凭据::\n                    <ul>\n                    <李>","The id of the display where activity should be launched,\n                    ":"应启动activity的显示的id,\n                    ","the account whose credentials are to be updated, will never be null":"要更新其凭据的帐户永远不会为空","The settings activity name.":"设置活动名称。","The property being animated.":"正在动画的属性。","a unique, stable id that identifies this ":"一个唯一的，稳定的id，用于标识此 ","The Cursor that was returned by query().":"Query()返回的游标。"," which resolves to a Boolean, true if the account\n                    exists and has all of the specified features.":" 它解析为布尔值，如果帐户为true\n                    存在并具有所有指定的特征。","Authenticator-specific options for the request; may be\n                       null or empty":"请求的特定于身份验证器的选项；可以是\n                       空或空"," JNI value corresponding to this type.":" 该类型对应的JNI值。","The data caming from the PersistableBundle first\n            saved in ":"首先从PersistableBundle获取数据\n            保存在 "," specifying whether all activities\n          will be removed on relaunch.\n        ":" 指定是否所有活动\n          将在重新启动时删除。\n        ","The inverse of this converter, where the from and to classes are reversed.":"此转换器的逆，其中from和to类反转。","Custom view to be used as a tab.":"自定义视图用作选项卡。"," if not set.":" 如果没有设置。","A set of PropertyValuesHolder objects whose values will be animated\n            between over time.":"一组PropertyValuesHolder对象，其值将被设置为动画\n            之间随着时间的推移。","A set of values that the animation will animate between over time.":"动画将在一段时间内动画化的一组值。","the type of auth token to retrieve after updating the credentials,\n            may be null":"更新凭据后要检索的身份验证令牌的类型,\n            可能为null"," - the name of the account created\n                    <li>":" -创建的帐户的名称\n                    <李>","The Parcel in which the object should be written.":"应写入对象的包裹。","The controller for the session which should receive\n                       media keys and volume changes.":"应接收的会话的控制器\n                       媒体键和音量变化。"," instance. LocusId\n                 is an opaque ID that links this Activity's state to different Android concepts:\n                 ":" 实例。 [医]基因座\n                 是一个不透明的ID，它将此活动的状态链接到不同的Android概念:\n                 "," which provides the declaring type.":" 它提供了声明类型。","The dialog.":"的对话。","The account type of the auth token to invalidate, must not be null":"要使auth令牌无效的帐户类型不得为null"," context to use for launching a new\n                       authenticator-defined sub-Activity to prompt the user to enter\n                       a password; used only to call startActivity(); if null, the\n                       prompt will not be launched directly, but the necessary\n                       ":" 用于启动新的上下文\n                       验证者定义的子活动，以提示用户输入\n                       密码；仅用于调用startActivity()；如果为null，则\n                       提示不会直接启动，但必要的\n                       ","A layout resource to inflate and use as a custom tab view":"要膨胀并用作自定义选项卡视图的布局资源"," containing the\n          configuration changes that the activity will handle itself.\n        ":" 载有\n          活动将自己处理的配置更改。\n        ","The array to modify and return from <code>evaluate</code>.":"要修改并从<code>evaluate</code>返回的数组。","the listener to be removed from the current set of update listeners\n            for this animation.":"要从当前一组更新侦听器中删除的侦听器\n            对于这个动画。"," if the activity is to be launched into LockTask mode.":" 如果要将活动启动到LockTask模式。","An ObjectAnimator object that is set up to animate between the given values.":"ObjectAnimator对象，设置为在给定值之间进行动画处理。"," of\n            the account whose credentials were updated, or\n            <li> ":" 的\n            凭据已更新的帐户，或\n            <李> "," - the type of the account\n                    <li>":" -账户类型\n                    <李>","The controller which should receive events.":"应接收事件的控制器。",". LocusID is null by default or if you explicitly reset it.":". 默认情况下，LocusID为null，或者如果您显式重置它。","Additional flags about how the object should be written.\n May be 0 or ":"有关对象应如何写入的其他标志。\n 可以是0或 "," if the accessibility button in the system's navigation area is\n            available to the calling service, ":" 如果系统导航区域中的辅助功能按钮是\n            可用于呼叫服务, ","A TaskStackBuilder that has been populated with Intents by\n                           onCreateNavigateUpTaskStack.":"一个TaskStackBuilder，由\n                           onCreateNavigateUpTaskStack."," which resolves to a Bundle with\n                    these fields if an activity was supplied and user was\n                    successfully re-authenticated to the account:\n                    <ul>\n                    <li>":" 它解决了一个与\n                    如果提供了活动并且用户是\n                    成功重新验证帐户:\n                    <ul>\n                    <李>"," specifying whether or not the\n          activity can be instantiated by the system.\n        ":" 指定是否\n          活动可以由系统实例化。\n        ","The start value.":"的起始值。","the number of times the animation should be repeated":"动画应该重复的次数","The View that the new activity is animating from.  This\n            defines the coordinate space for <var>startX</var> and <var>startY</var>.":"新活动正在从中生成动画的视图。  这\n            定义<var>startX</var>和<var>startY</var>的坐标空间。","The drawable to use as an icon":"作为图标使用的drawable","The auth token to invalidate, may be null":"要使其无效的auth令牌可能为null","The object whose property is to be animated. This object should\n            have a public method on it called <code>setName()</code>, where <code>name</code> is\n            the value of the <code>propertyName</code> parameter.":"属性为动画的对象。 这个对象应该\n            有一个名为<code>setName()</code>的公共方法，其中<code>name</code>是\n            <code>propertyName</code>参数的值。","this is returned as the result of the AbstractAccountAuthenticator request":"这是作为AbstractAccountAuthenticator请求的结果返回的"," - optional, token to check\n                    status of the account\n                    </ul>\n                    If no activity was specified and additional information is needed\n                    from user, the returned Bundle may only contain\n                    ":" -可选，令牌检查\n                    帐户状况\n                    </ul>\n                    如果未指定活动且需要其他信息\n                    从user，返回的Bundle可能只包含\n                    ","extras set or updated as part of this locus context. This may help provide\n                 additional metadata such as URLs, conversation participants specific to this\n                 ":"作为此基因座上下文的一部分设置或更新的附加项。 这可能有助于提供\n                 其他元数据，如Url，特定于此的对话参与者\n                 "," if the sensor's gesture detection is available. ":" 如果传感器的手势检测可用。 ","If false then this only works if the activity is the root\n                           of a task; if true it will work for any activity in\n                           a task.":"如果为false，则只有在活动为根时才有效\n                           一个任务；如果为真，它将适用于\n                           个任务。"," otherwise":" 否则的话"," - encrypted Bundle for\n                    updating the local credentials on device later.\n                    <li>":" -加密包\n                    稍后更新设备上的本地凭据。\n                    <李>","The View that was returned by onCreatePanelView().":"OnCreatePanelView()返回的视图。"," specifying whether or not the\n          activity should be excluded from the lsit of recently launched\n          activities.\n        ":" 指定是否\n          应将活动排除在最近启动的lsit之外\n          活动。\n        ","The end value.":"的结束值。","the number of times the animation should repeat, or ":"动画应重复的次数，或 ","The x starting location of the new activity, relative to <var>source</var>.":"新活动的x起始位置，相对于<var>source</var>。","Resource ID referring to the drawable to use as an icon":"资源ID引用要用作图标的drawable","The name of the property being animated.":"动画属性的名称。"," to be checked whether ":" 要检查是否 ","The type of account to add; must not be null":"要添加的帐户类型；不能为null"," needed to launch the\n                    actual account creation process. If an error occurred,\n                    ":" 需要启动\n                    实际帐户创建过程. 如果发生错误,\n                    ","'s context. Bundle can be null if additional metadata is not needed.\n                 Bundle should always be null for null locusId.":"的上下文。 如果不需要其他元数据，Bundle可以为null。\n                 Bundle对于null locusId应始终为null。"," if it is\n            not currently detecting gestures (for example, if it is enrolling a finger).":" 如果是\n            当前未检测手势（例如，如果它正在注册手指）。","If the task was moved (or it was already at the\n                    back) true is returned, else false.":"如果任务被移动（或者它已经在\n                    返回）返回true，否则返回false。","the callback to add, must be non-null":"要添加的回调必须是非null","If onCreatePanelView() returned null, this is the Menu\n             being displayed in the panel.":"如果onCreatePanelView()返回null，这是菜单\n             正在面板中显示。"," - optional, token to check\n                    status of the account\n                    </ul>\n                    If no activity was specified, the returned Bundle contains\n                    ":" -可选，令牌检查\n                    帐户状况\n                    </ul>\n                    如果未指定活动，则返回的Bundle包含\n                    ","A <code>float[]</code> where each element is an interpolation between\n                    the same index in startValue and endValue.":"一个<code>float[]</code>，其中每个元素都是一个插值。\n                    startValue和endValue中的相同索引。","either one of ":"任何一个 ","The y starting location of the activity, relative to <var>source</var>.":"活动的y起始位置，相对于<var>source</var>。"," specifying whether or not the\n          activity can be launched by components of other applications.\n        ":" 指定是否\n          活动可以由其他应用程序的组件启动。\n        ","Listener to handle tab selection events":"处理选项卡选择事件的侦听器","The object whose properties are to be animated.":"属性要动画化的对象。"," should be called":" 应该叫","The type of auth token (see ":"Auth令牌的类型（请参阅 ","the new parameters for the picture-in-picture.":"画中画的新参数。","The listener to be added.":"要添加的侦听器。"," throws:\n                    <ul>\n                    <li>":" 投掷:\n                    <ul>\n                    <李>","An intent representing the target destination for up navigation":"表示向上导航的目标目的地的意图","the callback to remove, must be non-null":"要删除的回调必须是非null","The assist content to return.":"的辅助内容返回。"," needed to launch the\n                    password prompt. If an error occurred,\n                    ":" 需要启动\n                    密码提示。 如果发生错误,\n                    ","The start value; should be of type <code>float</code> or\n                              <code>Float</code>":"起始值;应该是<code>float</code>或\n                              <代码>浮动</代码>","The fraction to which the animation is advanced or rewound. Values\n            outside the range of 0 to the maximum fraction for the animator will be clamped to\n            the correct range.":"动画被推进或重绕到的部分. 价值\n            在0到动画师的最大分数范围之外，动画师将被夹到\n            正确的范围。","The initial width of the new activity.":"新活动的初始宽度。","Object to store":"要存储的对象"," specifying whether or not the\n          activity should be shut\n          down whenever the user again launches its task.\n        ":" 指定是否\n          活动应关闭\n          每当用户再次启动其任务时，向下。\n        ","The property for the x coordinate being animated.":"正在动画的x坐标的属性。","a String of token to check account staus":"一串用于检查帐户staus的令牌","The progress for the progress bar. Valid ranges are from\n                       0 to 10000 (both inclusive). If 10000 is given, the progress\n                       bar will be completely filled and will fade out.":"进度条的进度。 有效范围是从\n                       0至10000（含）。 如果给出10000，则进度\n                       酒吧将完全填满，并会淡出。"," if no authenticator was\n                    registered for this account type or the authenticator failed to\n                    respond\n                    <li>":" 如果没有认证者\n                    注册此帐户类型或身份验证器失败\n                    回应\n                    <李>",")\n                this account will need to be able to generate, null for none":")\n                此帐户将需要能够生成，null为none","true if up navigation successfully reached the activity indicated by upIntent and\n                    upIntent was delivered to it. false if an instance of the indicated activity could\n                    not be found and this activity was simply finished normally.":"如果up导航成功达到upIntent和\n                    upIntent交付给它。 如果指定活动的实例可以，则为false\n                    找不到，这项活动只是正常完成。","The handler to use for the callback. If ":"用于回调的处理程序。 如果 ","The request code passed in ":"传入的请求代码 "," if the authenticator failed to\n                    respond\n                    <li>":" 如果身份验证器未能\n                    回应\n                    <李>","the display id.":"的显示id。","The end value; should be of type <code>float</code> or <code>Float</code>":"结束值;应该是<code>float</code>或<code>Float</code>类型","The initial height of the new activity.":"新活动的初始高度。","The text to display":"要显示的文本","The length of the animation, in milliseconds. This value cannot\n be negative.":"动画的长度，以毫秒为单位。 此值不能\n 消极。"," containing an icon representing the\n          activity.\n        ":" 包含表示\n          活动。\n        ","The property for the y coordinate being animated.":"正在动画的y坐标的属性。"," which resolves to a Boolean, true if the credentials\n                    of the account should be updated.":" 它解析为布尔值，如果凭据为true\n                    该帐户应更新。"," if the operation was\n                    canceled for any reason, including the user canceling the\n                    creation process or adding accounts (of this type) has been\n                    disabled by policy\n                    <li>":" 如果手术是\n                    因任何原因取消，包括用户取消\n                    创建过程或添加帐户（这种类型）已\n                    按政策禁用\n                    <李>","Whether the horizontal progress bar should be indeterminate.":"水平进度条是否应该是不确定的。","The features (see ":"的功能（见 ","The action mode that just finished.":"刚刚结束的动作模式。",", callbacks will happen\n            on the service's main thread.":"，回调会发生\n            在服务的主线程上。"," if the operation was\n                    canceled for any reason, including the user canceling the\n                    password prompt\n                    <li>":" 如果手术是\n                    因任何原因取消，包括用户取消\n                    密码提示\n                    <李>","The requested permissions. Never null.":"请求的权限。 永远不会为空。","the performed gesture id.":"所执行的手势id。","A linear interpolation between the start and end values, given the\n                    <code>fraction</code> parameter.":"开始值和结束值之间的线性插值，给定\n                    <code>fraction</code>参数。","A resource ID referring to the text that should be displayed":"引用应显示的文本的资源ID"," containing a user-readable label for the activity.\n        ":" 包含活动的用户可读标签。\n        ","the evaluator to be used this animation":"要使用此动画的赋值器","Returns a new ActivityOptions object that you can use to\n            supply these options as the options Bundle when starting an activity.":"返回可用于以下操作的新ActivityOptions对象\n            在启动活动时提供这些选项作为选项包。","The <code>Path</code> to animate values along.":"沿着<code>路径</code>动画值。","if specified, indicates that the ":"如果指定，则指示 "," if the authenticator experienced an I/O\n                    problem creating a new account, usually because of network\n                    trouble\n                    </ul>":" 如果身份验证器经历了I/O\n                    创建新帐户的问题，通常是因为网络\n                    麻烦\n                    </ul>","Whether to show the progress bars in the title.":"是否显示标题中的进度条。",") this\n                account must have, null for none":"）这个\n                帐户必须有，空为无","The new action mode.":"的新动作模式。","The callback to remove. Removing a callback that was never added has no\n            effect.":"要删除的回调。 删除从未添加的回调没有\n            效果。"," if the authenticator experienced an I/O\n                    problem verifying the password, usually because of network\n                    trouble\n                    </ul>":" 如果身份验证器经历了I/O\n                    验证密码的问题，通常是因为网络\n                    麻烦\n                    </ul>","containing a Java Native Interface (JNI) object reference.":"包含Java本机接口(JNI)对象引用。","The grant results for the corresponding permissions\n                which is either ":"相应权限的授予结果\n                这是要么 ","An <code>int[]</code> where each element is an interpolation between\n                    the same index in startValue and endValue.":"一个<code>int[]</code>，其中每个元素都是一个插值。\n                    startValue和endValue中的相同索引。"," specifying how the\n          activity should be launched.\n        ":" 指定如何\n          应启动活动。\n        ","The Activity's ActionBar, or null if it does not have one.":"活动的ActionBar，如果没有，则为null。","the interpolator to be used by this animation. A value of <code>null</code>\n            will result in linear interpolation.":"此动画要使用的插值器。 <Code>null</code>的值\n            会导致线性插值。","Who is defining this.  This is the application that the\n            animation resources will be loaded from.":"谁在定义这个。  这是应用程序\n            动画资源将从加载。"," is the currently\n            selected one, according to the caller's definition of selected.":" 是目前\n            选择一个,根据呼叫者的定义选择."," to use when necessary":" 必要时使用","An ObjectAnimator object that is set up to animate along <code>path</code>.":"一个ObjectAnimator对象，设置为沿着<code>路径</code>进行动画处理。","The result code to propagate back to the originating\n                              activity, often RESULT_CANCELED or RESULT_OK":"要传播回源的结果代码\n                              活动，通常是RESULT_CANCELED或RESULT_OK","The integer result code returned by the child activity\n                              through its setResult().":"子活动返回的整数结果代码\n                              通过它的setResult()。","The logical display id.":"的逻辑显示id。","Authenticator-specific options for the request,\n                may be null or empty":"请求的特定于身份验证器的选项,\n                可能为null或空","The credentials entered must allow an auth token\n                of this type to be created (but no actual auth token is returned);\n                may be null":"输入的凭据必须允许auth令牌\n                要创建的此类型（但没有返回实际的auth令牌）;\n                可能为null","indicating how to handle ":"指示如何处理 ","\n                or ":"\n                或 ","The start value; should be of type <code>int</code> or\n                              <code>Integer</code>":"起始值;应该是类型<code>int</code>或\n                              <code>整数</code>","The desired content to display.":"要显示的所需内容。"," specifying whether or not the\n          activity should be the main launcher for the application.\n        ":" 指定是否\n          activity应该是应用程序的主要启动器。\n        ","The set of values, per property, being animated between.":"每个属性之间动画的值集。","an optional ":"一个可选 ","The Activity whose window contains the shared elements.":"窗口包含共享元素的活动。",", one for each account. Empty (never null) if no accounts\n                    have been added.":"，每个帐户一个。 如果没有帐户，则为空（从不为空）\n                    已添加。","The object whose properties are to be animated. This object should\n                          have public methods on it called <code>setNameX()</code> and\n                          <code>setNameY</code>, where <code>nameX</code> and <code>nameY</code>\n                          are the value of the <code>xPropertyName</code> and <code>yPropertyName</code>\n                          parameters, respectively.":"属性要动画化的对象。 这个对象应该\n                          在上面有一个名为<code>setNameX()</code>的公共方法和\n                          <code>setNameY</code>，其中<code>nameX</code>和<code>nameY</code>\n                          是<code>xPropertyName</code>和<code>yPropertyName</code>的值\n                          参数，分别。","the index of the stroke":"中风的指数","An Intent, which can return result data to the caller\n                          (various data can be attached to Intent \"extras\").":"一个Intent，它可以将结果数据返回给调用者\n                          （各种数据可以附加到意图\"额外\"）。","The data to propagate back to the originating activity.":"要传播回原始活动的数据。","Authenticator-specific options for the request;\n                may be null or empty":"请求的特定于身份验证器的选项;\n                可能为null或空","the accessibility button controller for this ":"此的辅助功能按钮控制器 ",". Never null.":". 永远不会为空。","The end value; should be of type <code>int</code> or <code>Integer</code>":"结束值;应该是类型<code>int</code>或<code>Integer</code>","Layout parameters for the view.":"视图的布局参数。"," \n          whether an instance of the activity can be launched into the process\n          of the component that started it.\n        ":" \n          活动的实例是否可以启动到进程中\n          启动它的组件。\n        "," of accounts that are allowed to be\n            shown. If not specified then this field will not limit the displayed accounts.":" 允许使用的帐户\n            示。 如果未指定，则此字段不会限制显示的帐户。","the annotation type of this annotation":"此注记的注记类型"," context to use for launching a new\n                authenticator-defined sub-Activity to prompt the user to create an\n                account; used only to call startActivity(); if null, the prompt\n                will not be launched directly, but the necessary ":" 用于启动新的上下文\n                验证者定义的子活动，以提示用户创建一个\n                account;仅用于调用startActivity();如果为null，则提示\n                不会直接推出，而是必要的 ","The View to transition to the started Activity.":"过渡到已启动活动的视图。","Package name":"包装名称","The integer request code originally supplied to\n                               startActivityForResult(), allowing you to identify who this\n                               result came from.":"最初提供给的整数请求代码\n                               startActivityForResult()，允许您识别这是谁\n                               结果来自。","The name of the property for the x coordinate being animated.":"要动画的x坐标的属性名称。","The secondary progress for the progress bar. Valid ranges are from\n                       0 to 10000 (both inclusive).":"进度条的辅助进度。 有效范围是从\n                       0至10000（含）。"," which resolves to a Bundle\n                with these fields if an activity was supplied and the account\n                credentials were successfully updated:\n            <ul>\n            <li> ":" 它解析为一个包\n                如果提供了活动和帐户，则使用这些字段\n                凭据已成功更新:\n            <ul>\n            <李> ","A description of the stroke.":"笔划的描述。","The gesture to dispatch":"派遣的姿态","the data most recently supplied in ":"最近提供的数据 ","A value between 0 and 1.0 indicating our current point\n                   in the animation where 0 represents the start and 1.0 represents\n                   the end":"一个0到1.0之间的值，表示我们的当前点\n                   在动画中，0表示开始，1.0表示\n                   结局","The ComponentName of the activity that will receive your\n                    reply, or null if none.":"将接收您的活动的组件名\n                    回复，如果没有，则为null。","The new listener to add":"要添加的新侦听器","The shared element name as used in the target Activity. This\n                                     must not be null.":"目标活动中使用的共享元素名称。 这\n                                     不能为null。","\n                will be returned to the caller instead":"\n                将改为返回给调用方"," containing the name of the class\n          that implemenets the activity.\n        ":" 包含类的名称\n          这实现了活动。\n        "," type":" 类型","The new device configuration.":"新的设备配置。","The name of the property for the y coordinate being animated.":"要动画化的y坐标的属性名称。"," on top of the lock screen;\n                                              ":" 在锁定屏幕的顶部;\n                                              "," - the name of the account\n            <li> ":" -帐户名称\n            <李> ","an optional string array of account types. These are used\n            both to filter the shown accounts and to filter the list of account types that are shown\n            when adding an account. If not specified then this field will not limit the displayed\n            account types when adding an account.":"帐户类型的可选字符串数组。 这些被使用\n            既可以过滤显示的帐户，也可以过滤显示的帐户类型列表\n            添加帐户时。 如果未指定，则此字段不会限制显示的\n            添加帐户时的帐户类型。","\n                or null.":"\n                或null。","The object to call back when the status of the gesture is known. If\n            ":"已知手势状态时要回调的对象。 如果\n            ","The interpolation value. This value can be more than 1.0 for\n                    interpolators which overshoot their targets, or less than 0 for\n                    interpolators that undershoot their targets.":"的内插值。 此值可以超过1.0\n                    超过其目标的插值器，或小于0\n                    使目标下冲的插值器。","The maximum duration in milliseconds.":"以毫秒为单位的最大持续时间。","The package of the activity that will receive your\n                    reply, or null if none.":"将收到您的\n                    回复，如果没有，则为null。","Tab to add":"要添加的选项卡","Returns a new ActivityOptions object that you can use to\n                    supply these options as the options Bundle when starting an activity.":"返回可用于以下操作的新ActivityOptions对象\n                    在启动活动时提供这些选项作为选项包。"," specifying \n          whether or not the activity should be removed from the activity\n          stack and finished when the user navigates away.\n        ":" 指定 \n          是否应从活动中删除活动\n          当用户导航离开时堆叠并完成。\n        ","Map with visibility for all accounts of given type\n            See ":"地图与给定类型的所有帐户的可见性\n            见 ","The context menu item that was selected.":"选择的上下文菜单项。","Callback to invoke when the request completes,\n                null for no callback":"请求完成时调用的回调,\n                无回调的null","The object whose properties are to be animated. This object should\n                          have public methods on it called <code>setNameX()</code> and\n                          <code>setNameY</code>, where <code>nameX</code> and <code>nameY</code>\n                          are the value of <code>xPropertyName</code> and <code>yPropertyName</code>\n                          parameters, respectively.":"属性要动画化的对象。 这个对象应该\n                          在上面有一个名为<code>setNameX()</code>的公共方法和\n                          <code>setNameY</code>，其中<code>nameX</code>和<code>nameY</code>\n                          是<code>xPropertyName</code>和<code>yPropertyName</code>的值\n                          参数，分别。","The TaskDescription properties that describe the task with this activity":"描述具有此活动的任务的TaskDescription属性","if non-null this string is used as the description in the\n            accounts chooser screen rather than the default":"如果非null，则此字符串用作\n            帐户选择屏幕而不是默认屏幕","any Object holding the desired state to propagate to the\n                    next activity instance":"保持所需状态的任何对象传播到\n                    下一个活动实例"," - the type of the account\n            </ul>\n            \n            If no activity was specified, the returned Bundle contains\n            ":" -账户类型\n            </ul>\n            \n            如果未指定活动，则返回的Bundle包含\n            ",", no status is reported.":"，没有状态报告。","The maximum number of strokes.":"最大笔划数。","True if the added tab should become the selected tab.":"如果添加的选项卡应成为所选选项卡，则为True。","time associated with this keyframe, as a fraction of the overall animation\n            duration. This should be a value between 0 and 1.":"与此关键帧相关联的时间，作为整体动画的一小部分\n            持续时间。 这应该是介于0和1之间的值。","Returns a bit field of the configuration parameters that are\n            changing, as defined by the ":"返回配置参数的位字段\n            变化，由 ","The View that this thumbnail is animating from.  This\n            defines the coordinate space for <var>startX</var> and <var>startY</var>.":"此缩略图正在从中生成动画的视图。  这\n            定义<var>startX</var>和<var>startY</var>的坐标空间。"," for possible values":" 对于可能的值"," containing \n          the name of a permission that clients must have to launch the\n          activity.\n        ":" 包含 \n          客户端必须启动的权限的名称\n          活动。\n        "," identifying the callback thread,\n                null for the main thread":" 标识回调线程,\n                主线程的null","boolean Return false to allow normal context menu processing to\n                    proceed, true to consume it here.":"布尔返回false以允许正常的上下文菜单处理\n                    继续，真的在这里消耗它。"," convert from opaque to translucent.\n                               ":" 从不透明转换为半透明。\n                               ","this string is passed as the ":"此字符串作为 ","Bundle in which to place your saved state.":"捆绑在其中放置您保存的状态。","The object whose property is to be animated. This object may\n            have a public method on it called <code>setName()</code>, where <code>name</code> is\n            the value of the <code>propertyName</code> parameter. <code>propertyName</code> may also\n            be the case-sensitive complete name of the public setter method.":"属性为动画的对象。 此对象可\n            有一个名为<code>setName()</code>的公共方法，其中<code>name</code>是\n            <code>propertyName</code>参数的值。 <code>propertyName</code>也可以\n            是公共setter方法的区分大小写的完整名称。","The handler on which to call back the ":"在其上调用的处理程序 "," needed to launch the\n            password prompt. If an error occurred,\n            ":" 需要启动\n            密码提示。 如果发生错误,\n            ","the number of strokes in this gesture":"这个手势的笔划数","The new position of the tab":"选项卡的新位置","The time associated with this keyframe, as a fraction of the overall animation\n            duration. This should be a value between 0 and 1.":"与此关键帧相关联的时间，作为整体动画的一小部分\n            持续时间。 这应该是介于0和1之间的值。","\n            class.":"\n            类。","The bitmap that will be shown as the initial thumbnail\n            of the animation.":"将显示为初始缩略图的位图\n            的动画。","The type of accounts to return, null to retrieve all accounts":"返回的帐户类型，null检索所有帐户"," containing \n          the name of the process in which the activity should run.\n        ":" 包含 \n          活动应在其中运行的进程的名称。\n        "," which resolves to a Bundle with\n                these fields if activity was specified and an account was created:\n            <ul>\n            <li> ":" 它解决了一个与\n                如果指定了活动并创建了帐户，则这些字段:\n            <ul>\n            <李> "," convert from translucent to opaque.":" 从半透明转换为不透明。","\n            authTokenType parameter":"\n            authTokenType参数","The name of the property being animated or the name of the setter method.":"要动画的属性的名称或setter方法的名称。","The context menu that is being closed.":"正在关闭的上下文菜单。","State which will be saved across reboots.":"状态将在重新启动时保存。"," object. If\n            ":" 对象。 如果\n            "," if the thread executing this\n            task should be interrupted; otherwise, in-progress tasks are allowed\n            to complete":" 如果执行此的线程\n            应中断任务；否则，允许进行中的任务\n            完成","to send the result back to the AccountManager, will never be null":"要将结果发送回AccountManager，将永远不会为null","Elevation value in pixels":"以像素为单位的高程值","boolean Whether this object has a value assigned.":"布尔值此对象是否已分配值。","Returns the complete component name for this activity":"返回此活动的完整组件名称","The x starting location of the bitmap, relative to <var>source</var>.":"位图的x起始位置，相对于<var>source</var>。",", one per matching account. Empty (never null) if no\n                    accounts of the specified type have been added.":"，每个匹配帐户一个。 空（从不为空）如果没有\n                    已添加指定类型的帐户。"," containing \n          the orientation of the activity's display on the device.\n        ":" 包含 \n          活动在设备上显示的方向。\n        "," - the name of the account created\n            <li> ":" -创建的帐户的名称\n            <李> ","this string array is passed as the ":"此字符串数组作为 ","Converts T objects into float parameters for the multi-value setter.":"将T对象转换为多值setter的float参数。","The result of setting translucency. Return ":"设置半透明性的结果。 回来吧 ","If the activity is being re-initialized after\n                previously being shut down then this Bundle contains the data it most\n                recently supplied in ":"如果活动正在重新初始化后\n                以前被关闭，那么这个包包含了它最重要的数据\n                最近在 "," that signaled this search.":" 这表明了这次搜索。",", the object is called back on the service's main thread.":"，该对象在服务的主线程上被回调。"," if the task could not be cancelled,\n            typically because it has already completed normally;\n            ":" 如果任务无法取消,\n            通常是因为它已经正常完成;\n            ","the type of account to add, will never be null":"要添加的帐户类型永远不会为null","The optional interpolator for this Keyframe.":"此关键帧的可选内插器。","Index value in the range 0-get":"索引值在0-get范围内"," if search launched, and ":"如果启动搜索，并且","Current Scene being shown or null":"当前场景显示或为空","The y starting location of the bitmap, relative to <var>source</var>.":"位图的y起始位置，相对于<var>source</var>。","the type of auth token to retrieve after adding the account, may be null":"添加帐户后要检索的auth令牌的类型可能为null","The type of accounts to return, must not be null":"要返回的帐户类型不能为null"," specifying \n          whether or not the activity can be killed and successfully restarted\n          without having saved its state.\n        ":" 指定 \n          活动是否可以被杀死并成功重新启动\n          没有保存它的状态。\n        "," - the type of the account\n            </ul>\n            \n            If no activity was specified, the returned Bundle contains only\n            ":" -账户类型\n            </ul>\n            \n            如果未指定任何活动，则返回的包仅包含\n            ","A TypeEvaluator that will be called on each animation frame to\n            provide the necessary interpolation between the Object values to derive the animated\n            value.":"一个TypeEvaluator，它将在每个动画帧上调用到\n            在对象值之间提供必要的插值以导出动画\n            价值。"," if set successfully,\n                    ":" 如果设置成功,\n                    ","\n            requiredFeatures parameter":"\n            requiredFeatures参数",".  <b>":".  <b>","An array of the account features to require, may be null or empty *":"需要需要的帐户功能的数组，可能为空或空 *","the maximum time to wait":"等待的最长时间"," if the gesture is dispatched, ":" 如果手势被调度, ","The time, expressed as a value between 0 and 1, representing the fraction\n            of time elapsed of the overall animation duration.":"时间，表示为0到1之间的值，表示分数\n            整个动画持续时间的时间流逝。","The action bar's offset toward its fully hidden state in pixels.":"操作栏向其完全隐藏状态的偏移（以像素为单位）。"," is passed as the ":"通过","The TransitionManager to use for scene changes.":"用于场景更改的TransitionManager。"," if the activity does\n            not respond to search.  The default implementation always returns ":" 如果活动有\n            不响应搜索。  默认实现总是返回 ","A broadcast receiver that willl receive the report.":"将接收所述报告的广播接收机。","a String array of authenticator-specific features that the added\n            account must support, may be null":"添加的特定于身份验证器的特性的字符串数组\n            帐户必须支持，可能为空","Callback to invoke when the request completes, null for no callback":"请求完成后调用回调，无回调为null"," containing \n          the task that the activity has an affinity for.\n        ":" 包含 \n          活动具有亲和力的任务。\n        "," needed to launch the\n            actual account creation process.  If an error occurred,\n            ":" 需要启动\n            实际帐户创建过程.  如果发生错误,\n            ","Converts T objects into int parameters for the multi-value setter.":"将T对象转换为多值setter的int参数。"," to turn on the screen; ":" 打开屏幕; ","</b>":"</b>","The action bar's offset toward its fully hidden state in pixels":"动作栏的偏移偏向其以像素为单位的完全隐藏状态","launch bounds or ":"启动边界或","the time unit of the timeout argument. This must not be null.":"超时参数的时间单位。 这不一定是null。"," if not.":" 如果没有。","a Bundle of authenticator-specific options. It always contains\n            ":"一组认证者特定的选项。 它总是包含","The value that the object will animate to as the animation time approaches\n            the time in this keyframe, and the value animated from as the time passes the time in\n            this keyframe.":"随着动画时间的临近，对象将动画化到的值\n            此关键帧中的时间，以及随着时间的推移而产生的动画值\n            这个关键帧。"," options\n            parameter":" 选项\n            参数","This window's content TransitionManager or null if none is set.":"此窗口的内容TransitionManager或null，如果没有设置。",", except\n            when in ":"，除了\n            当在 ","true to enable hiding on content scroll.":"忠实于启用内容滚动。"," identifying the callback thread, null for the main thread":" 标识回调线程，主线程为null"," containing \n          a reference to a style resource defining an overall theme for the\n          activity.\n        ":" 包含 \n          对样式资源的引用，为\n          活动。\n        "," throws:\n            <ul>\n            <li> ":" 投掷:\n            <ul>\n            <李> "," to enable this mode.":" 以启用此模式。","if the activity is being re-initialized after\n                previously being shut down then this Bundle contains the data it most\n                recently supplied in ":"如果活动正在重新初始化后\n                以前被关闭，那么这个包包含了它最重要的数据\n                最近在 ","true if hide-on-content-scroll is enabled":"是的，如果启用了隐藏式的croll"," that can be used to launch the ChooseAccount activity flow.":"可以用来启动ChooseAccount活动流。"," which resolves to an array of ":"它解决了一系列","The property being animated. Should not be null.":"正在动画的属性。 不应为null。","the actual result":"实际结果"," for fullscreen":" 全屏版","The focus to find. One of ":"找到的重点。 其中一个 "," specifying\n          how the main window of the activity interacts with the window\n          containing hte on-screen soft keyboard.\n        ":"指定 \n           活动的主窗口如何与窗口相互作用 \n           包含HTE屏幕上软键盘。","A listener to remove that was previously added":"删除以前添加的听众","\n            fields which will let authenticator know the identity of the caller.":"\n            字段将让身份验证者知道调用者的身份.","The type of the value stored in the Keyframe.":"存储在关键帧中的值的类型。","Private request code for the sender that will be\n            associated with the result data when it is returned.  The sender can not\n            modify this value, allowing you to identify incoming results.":"发送方的私人请求代码\n            返回时与结果数据相关联。  发件人不能\n            修改此值，允许您识别传入结果。",", one\n                    per account of the specified type which matches the requested features.":"， 一 \n                     根据指定类型的帐户与请求的功能匹配。"," mode where it returns false.":" 返回false的模式。"," if no authenticator was registered for\n                 this account type or the authenticator failed to respond\n            <li> ":" 如果没有认证人注册\n                 此帐户类型或身份验证器未能响应\n            <李> ","the name of the component to use as a\n                   ":"要用作组件的名称\n                   ","boolean that is ignored.":"被忽略的布尔值。",".\n                <b>":".\n                <b>","Converts a PointF to the type associated with the setter. May be\n                             null if conversion is unnecessary.":"将PointF转换为与setter关联的类型。 可能是\n                             如果转换是不必要的，则为null。"," if it's the topmost resumed activity in the system,\n                                        ":"如果它是系统中最高的活动，","the current accounts":"往来帐目","The ViewGroup to which the View is being added.":"添加视图的视图组。","Default data to supply in the result, which may be modified\n            by the sender.":"在结果中提供的默认数据，可以修改 \n             由发件人。"," or\n                    ":" 或\n                    ","The id of the display where the activity should be launched.":"应启动活动的显示器的id。","The activity that is adding the entry.   This is used to help determine\n            the context that the new recents entry will be in.":"添加条目的活动。   这是用来帮助确定\n            新的recents条目将所在的上下文。","The View being added to the ViewGroup.":"视图添加到ViewGroup中。","The tab to remove":"要删除的选项卡","a Bundle result or null if the result is to be returned via the response. The result\n            will contain either:\n            <ul>\n            <li> ":"如果要通过响应返回结果，则为Bundle结果或null。 结果如何？\n            将包含任一:\n            <ul>\n            <李> ","The package name of the app for which the accounts are to be returned":"要为其返回帐户的应用程序的包名称","Converts the animated object to the Property type.":"将动画对象转换为属性类型。","the listener to be added to the current set of listeners for this animation.":"为此动画添加到当前听众集中的侦听器。"," if the operation was canceled for\n                 any reason, including the user canceling the creation process or adding accounts\n                 (of this type) has been disabled by policy\n            <li> ":" 如果操作被取消\n                 任何原因，包括用户取消创建过程或添加帐户\n                 （此类型）已被策略禁用\n            <李> "," while VR mode is enabled.":" 启用VR模式时。","if the activity is being re-initialized after\n                previously being shut down or powered off then this Bundle contains the data it most\n                recently supplied to outPersistentState in ":"如果活动正在重新初始化后\n                以前被关闭或关闭电源，那么这个包包含了它最重要的数据\n                最近提供给outPersistentState in ","boolean ":"布尔值 ",", or\n            <li> ":"。 \n             <li>"," otherwise. A call with this as ":" 否则。 这是一个电话 ","Position of the tab to remove":"选项卡的位置以删除","the listener to be added to the current set of pause listeners\n            for this animation.":"侦听器要添加到当前的暂停侦听器中 \n             为此动画。","May be ":"可能是 ","The Intent that describes the recents entry.  This is the same Intent that\n            you would have used to launch the activity for it.  In generally you will want to set\n            both ":"描述回收条目的意图。 这是同样的意图 \n             您将用来启动它的活动。 通常，您将要设置 \n             两个都","The node info of the focused view or null.":"聚焦视图的节点信息或null。","OnAlarmListener instance that is the target of a currently-set alarm.":"OnAlarmListener实例是当前设置的警报的目标。",", one per matching account. Empty (never null) if no\n                    accounts of the specified type can be accessed by the package.":"，每个匹配帐户一个。 空（从不为空）如果没有\n                    包可以访问指定类型的帐户。"," of\n            the account that was added, or\n            <li> ":"的 \n             添加的帐户，或 \n             <li>"," to control which unspecified parts\n            of the intent that can be supplied when the actual send happens.":"控制哪些未指定零件 \n             实际发送时可以提供的意图。","The context menu that is being built":"正在构建的上下文菜单","The object whose property is to be animated. Depending on how the\n            PropertyValuesObjects were constructed, the target object should either have the ":"属性为动画的对象。 取决于如何\n            构造了PropertyValuesObjects，目标对象应该具有 "," if the authentication of the account has been successfully\n                    acknowledged. Otherwise ":"如果该帐户的身份验证已成功 \n                     承认。 否则","The listener that will be called when layout bounds change.":"布局边界更改时将调用的侦听器。"," if the authenticator experienced an I/O problem\n                 creating a new account, usually because of network trouble\n            </ul>":" 如果身份验证器遇到I/O问题\n                 创建一个新帐户，通常是因为网络故障\n            </ul>","The timing interpolator for this animation.":"该动画的定时插值器。",",\n            or any of the flags as supported by\n            ":",\n            或任何由\n            ","The controller for fingerprint gestures, or ":"指纹手势的控制器或","A permission your app wants to request.":"您的应用程序想要请求的权限。"," will\n                                        always be followed by another one with ":" 威尔\n                                        总是跟着另一个 ","; the latter is required since this recents\n            entry will exist without an activity, so it doesn't make sense to not retain it when\n            its activity disappears.  The given Intent here also must have an explicit ComponentName\n            set on it.":";后者是必需的，因为最近\n            条目将在没有活动的情况下存在，所以在没有活动的情况下不保留它是没有意义的\n            其活性消失。  这里给定的意图也必须有一个明确的ComponentName\n            开始吧。","Returns an existing or new PendingIntent matching the given\n            parameters.  May return null only if\n            ":"返回匹配给定的现有或新的悬而未决的人 \n             参数。 只有在","The password to associate with the account, null for none":"与帐户关联的密码，无效",", which determines\n            the animation whose animator is being returned.":"，决定 \n             动画师正在返回的动画。","IntentSender which matches a previously added\n            IntentSender. This parameter must not be ":"匹配先前添加的IntentSender\n            意图者。 此参数不得为 "," to get visibility":"获得可见性"," objects used to construct the PropertyValuesHolder objects or (if the\n            PropertyValuesHOlder objects were created with property names) the target object should have\n            public methods on it called <code>setName()</code>, where <code>name</code> is the name of\n            the property passed in as the <code>propertyName</code> parameter for each of the\n            PropertyValuesHolder objects.":"用于构建属性值持有人对象或 \n             使用属性名称创建了属性值持有人对象）目标对象应具有 \n             它上的公共方法称为<code> setName（）</code>，其中<code> name </code>是 \n             该属性以<code> propertyName </code>参数传递给了每个属性 \n             属性值持有人对象。"," to\n            indicate an error\n            </ul>":" 到\n            指示错误\n            </ul>","True if the animator is currently paused, false otherwise.":"是的，如果动画师当前暂停，否则为false。","The view for which the context menu is being built":"正在为其构建上下文菜单的视图","The account for which an auth token is to be fetched. Cannot be ":"要为其获取auth令牌的帐户。 不能是 ",".  If the bitmap is not that exact size, it will be\n            recreated in your process, probably in a way you don't like, before the recents entry\n            is added.":"。 如果位图不是那么确切的大小，那将是 \n             在您的过程中重新创建，可能是您不喜欢的方式，然后再进入。 \n             被添加。","the account to clone, will never be null":"克隆的帐户将永远不会无效"," if gestures are unavailable.":" 如果手势不可用。"," has been\n            supplied.":"一直是 \n             提供。","Whether the Animator has been started and not yet ended.":"动画师是否已经开始并且尚未结束。","Optional additional description information.":"可选的附加说明信息。","Extra information about the item for which the\n            context menu should be shown. This information will vary\n            depending on the class of v.\n":"有关该项目的额外信息 \n             上下文菜单应显示。 此信息将有所不同 \n             取决于v的类。","Animator The animation being used for the given transition type.":"Animator用于给定过渡类型的动画。","Whether you should show permission rationale UI.":"是否应该在UI上显示权限。","String values to use for the account's userdata, null for\n                       none":"用于帐户的userdata的字符串值，为null\n                       无","Returns true if the assistant was successfully invoked, else false.  For example\n            false will be returned if the caller is not the current top activity.":"如果成功调用助手，则返回true，否则返回false。  例如\n            如果调用者不是当前的顶级活动，则返回false。","The cached auth token for this account and type, or null if\n                no auth token is cached, the account does not exist, or the user is locked":"此帐户和类型的缓存auth令牌，如果\n                没有缓存auth令牌，帐户不存在，或者用户被锁定","A set of PropertyValuesHolder objects whose values will be animated between\n            over time.":"一组PropertyValuesHolder对象，其值将在\n            随着时间的推移。"," if the caller can schedule exact alarms, ":"如果呼叫者可以安排确切的警报，","Returns the task id of the newly added app task, or -1 if the add failed.  The\n            most likely cause of failure is that there is no more room for more tasks for your app.":"返回新添加的应用程序任务的任务ID，如果添加失败，则返回-1。 这 \n             失败的原因很可能是您的应用程序不再有更多的任务空间。","The logic display id, use ":"逻辑显示ID，使用","The type of auth token to fetch. Cannot be ":"要获取的身份验证令牌的类型。 不能是 ","The name of the property being animated. Should not be null.":"动画属性的名称。 不应为null。","A description of what the user is doing.  It should be short and\n                    sweet (only a few words).":"对用户正在做的事情的描述。 应该很短， \n                     甜（只有几句话）。","Action to perform when the alarm goes off;\n        typically comes from ":"警报响起时要执行的操作； \n         通常来自","type of alarm.":"警报类型。","true if navigating up should recreate a new task stack, false if the same task\n                    should be used for the destination":"thy如果导航应重新创建新的任务堆栈，则为false，如果同一任务 \n                     应该用于目的地","True if the account was successfully added, false if the account\n                    already exists, the account is null, the user is locked, or another error occurs.":"如果成功添加了帐户，则为true，如果帐户为false \n                     已经存在，帐户为null，用户已锁定或发生另一个错误。","Arguments to pass through to the dialog.  These will be saved\n            and restored for you.  Note that if the dialog is already created,\n            ":"争论传递到对话框。 这些将被保存 \n             并为您恢复。 请注意，如果对话框已经创建，","ArrayList<AnimatorListener> The set of listeners.":"ArrayList<AnimatorListener>一组监听器。","Thumbnail to use for the recents entry.  Should be the size given by\n            ":"缩略图用于最近条目。  应该是由给出的尺寸\n            "," to remove":" 要删除"," for default\n                             display.":"默认 \n                              展示。"," object describing the next upcoming alarm\n              clock event that will occur.  If there are no alarm clock events currently\n              scheduled, this method will return ":" 描述下一个即将到来的警报的对象\n              会发生的时钟事件。  如果当前没有闹钟事件\n              预定，此方法将返回 ","The description of that what happened":"对发生的事情的描述","Whether future ObjectAnimators with the same target and properties\n            as this ObjectAnimator will cause this ObjectAnimator to be canceled.":"未来的对象是否具有相同的目标和属性\n            因为这个ObjectAnimator会导致这个ObjectAnimator被取消。","time in milliseconds that the alarm should go\n            off, using the appropriate clock (depending on the alarm type).":"警报发出的时间（以毫秒为单位）\n            关闭，使用适当的时钟（取决于报警类型）。","time in milliseconds that the alarm should go\n                   off, using the appropriate clock (depending on the alarm type).":"警报发出的时间（以毫秒为单位）\n                   关闭，使用适当的时钟（取决于报警类型）。","String values to use for the account's userdata, null for none":"用于帐户userdata的字符串值，null表示none"," will not be called with the new\n            arguments but ":" 不会被称为新的\n            争论，但 ","the magnification controller":"放大控制器","Action to perform when the alarm goes off;\n            typically comes from ":"警报响起时要执行的操作； \n             通常来自","Action to perform when the alarm goes off;\n                   typically comes from ":"警报响起时要执行的操作； \n                    通常来自"," which resolves to a Boolean,\n                true if the account has been successfully removed":" 它解析为布尔值,\n                如果帐户已成功删除，则为true","A PointF to be modified and returned by evaluate.":"要修改并通过评估返回的PointF。","the soft keyboard controller":"软键盘控制器","time in milliseconds that the alarm should first\n            go off, using the appropriate clock (depending on the alarm type).  This\n            is inexact: the alarm will not fire before this time, but there may be a\n            delay of almost an entire alarm interval before the first invocation of\n            the alarm.":"警报应首先发出的时间（以毫秒为单位）\n            熄灭，使用适当的时钟（取决于报警类型）。  这\n            是不精确的：警报在此时间之前不会开火，但可能会有一个\n            在第一次调用之前几乎整个警报间隔的延迟\n            警报。","interval in milliseconds between subsequent repeats\n            of the alarm.  Prior to API 19, if this is one of INTERVAL_FIFTEEN_MINUTES,\n            INTERVAL_HALF_HOUR, INTERVAL_HOUR, INTERVAL_HALF_DAY, or INTERVAL_DAY\n            then the alarm will be phase-aligned with other alarms to reduce the\n            number of wakeups.  Otherwise, the alarm will be set as though the\n            application had called ":"随后重复之间的毫秒间隔 \n             警报。 在API 19之前，如果这是Intervel_fifteen_minutes之一，则 \n             interval_half_hour，interval_hour，interval_half_day或interval_day \n             然后，警报将与其他警报进行相位，以减少 \n             唤醒数。 否则，警报将被设置为 \n             申请已打电话",".  As of API 19, all repeating\n            alarms will be inexact and subject to batching with other alarms regardless\n            of their stated repeat interval.":".  截至API19，所有重复\n            警报将是不精确的，并且会与其他警报进行批处理\n            它们所述的重复间隔。","time in milliseconds that the alarm should first\n            go off, using the appropriate clock (depending on the alarm type).":"警报应首先发出的时间（以毫秒为单位）\n            熄灭，使用适当的时钟（取决于报警类型）。","interval in milliseconds between subsequent repeats\n            of the alarm.":"后续重复之间的间隔（以毫秒为单位）\n            警报。","time in milliseconds since the Epoch":"自时代以来的时间","one of the Olson ids from the list returned by\n                ":"返回的列表中的一个Olson id\n                "}