{"The identifier field for the event. This return value should be used to set a public static read-only field that will store the identifier for the representation of the routed event on the owning type. This field is typically defined with public access, because user code must reference the field in order to attach any instance handlers for the routed event when using the ":"事件的标识符字段。 该返回值应用于设置公共静态读取字段，该字段将存储标识符以在拥有类型上的路由事件表示。 该字段通常是通过公共访问定义的，因为用户代码必须在使用该字段时引用该字段，以便在使用该字段时将任何实例处理程序连接到路由事件时"," if the range value is read-only; otherwise ":"如果范围值仅读取； 否则"," if the requested ambient property is available; otherwise, ":"如果请求的环境财产可用； 否则，"," that contains the initial directory. The default is ":"其中包含初始目录。 默认值为"," object that contains the currently selected dates. The default is an empty collection.":"包含当前选择日期的对象。 默认值是一个空的集合。"," utility method.":"实用方法。","The requested resource object. If the requested resource is not found, a null reference is returned.":"请求的资源对象。 如果找不到请求的资源，则返回零引用。","The maximum range value supported by the control.":"控件支持的最大范围值。"," that contains the Win32 common file dialog flags that are used by file dialogs for initialization.":"其中包含文件对话框使用的Win32通用文件对话框标志。","A value that indicates the current selection mode. The default is ":"指示当前选择模式的值。 默认值为 "," object for the current ":"当前的对象","A string representation for this object, which is identical to the value returned by ":"该对象的字符串表示形式，该表示与返回的值相同","The minimum range value supported by the control.":"控件支持的最小范围值。"," that only contains the file name for the selected file. The default is ":"仅包含所选文件的文件名。 默认值为"," that is designated as the main application window.":"这被指定为主应用程序窗口。"," whose dates this object represents.":"该对象代表谁的日期。","The handler type of the routed event.":"路由事件的处理程序类型。","The date to search for.":"搜索日期。","The value of the control.":"控件的值。"," that contains the application-scope properties.":"其中包含应用程序范围属性。",", which is also the value when either no file is selected or a directory is selected.":"，这也是选择未选择文件或选择目录的值。","The name of the routed event.":"路由事件的名称。"," that contains one safe file name for each selected file. The default is an array with a single item whose value is ":"其中包含每个选定文件的一个安全文件名。 默认值是一个带有一个项目的数组，其值为","A string that contains \"RepeatButton\".":"一个包含“重复屁股”的字符串。","The owner type of the routed event.":"路由事件的所有者类型。"," if the collection contains the specified date; otherwise, ":" 如果集合包含指定的日期；否则, "," that is the text that appears in the title bar of a file dialog. The default is ":"那就是文件对话框标题栏中出现的文本。 默认值为"," that provides the pack uniform resource identifiers (URIs) for resources in a WPF application.":"这为WPF应用程序中的资源提供了包装统一资源标识符（URI）。","A string that contains \"RichTextBox\".":"一个包含“ RichTextbox”的字符串。","One of the enumeration values. The default is the enumeration default, ":"枚举值之一。 默认值是枚举默认值，"," if warnings will be shown when an invalid file name is provided; otherwise, ":"如果提供无效的文件名时，将显示警告； 否则，"," object that contains zero or more application-scope resources.":"包含零或更多应用程序范围资源的对象。"," reference. If ":"参考。 如果","The start of the date range.":"日期范围的开始。"," enumeration value. The default value is ":"枚举价值。 默认值是","The routed event identifier for this instance of the ":"此实例的路由事件标识符","The end of the date range.":"日期范围的结束。",", this method returns a new ":"，此方法返回新的","The GUID of a known folder.":"已知文件夹的GUID。","An alternate source that will be reported when the event is handled. This pre-populates the ":"处理事件时将报告的替代来源。 这预先填充"," that refers to the UI that automatically opens when an application starts.":" 这是指在应用程序启动时自动打开的UI。","A string that contains the word \"ScrollBar\".":"一个包含“ scrollbar”一词的字符串。"," if all dates in the range are contained in the collection; otherwise, ":"如果该范围内的所有日期都包含在集合中； 否则，","The path for the folder.":"文件夹的路径。","The generic handler / delegate implementation to be invoked.":"要调用的通用处理程序 /委托实现。"," that contains references to all window objects in the current ":"其中包含对当前所有窗口对象的引用","The range of dates to search for.":"搜索日期的范围。","The path for a custom place.":"定制地点的路径。"," that has values of ":"有值的值","The target on which the provided handler should be invoked.":"应调用提供的处理程序的目标。"," if the attached property is browsable for all child elements in the logical tree of the parent element that owns the attached property. ":"如果附带的属性可用于拥有附件属性的父元素逻辑树中的所有子元素。","; the only clickable points in a ":"; 在","The new value that ":"新价值"," if any dates in the range are contained in the collection; otherwise, ":"如果该范围内的任何日期包含在集合中； 否则，","The Contacts folder for the current user.":"当前用户的联系人文件夹。","The date to be newly displayed.":"新显示的日期。"," if the attached property is only browsable for immediate child elements of a parent element that owns the attached property. The default is ":"如果附件仅适用于拥有附件属性的父元素的直接子元素。 默认值为"," are the child elements.":"是孩子元素。"," is being set to.":"正在设置。","The Internet cookies folder for the current user.":"当前用户的Internet Cookie文件夹。","The element associated with this automation peer.":"与此自动化对等相关的元素。",", depending on the orientation of the ":"，取决于","The date that was previously displayed.":"以前显示的日期。","The folder for storing files on the desktop for the current user.":"用于当前用户在桌面上存储文件的文件夹。","If setting, set to ":"如果设置，请设置为","A string that contains \"Button\".":"一个包含“按钮”的字符串。","A string that contains \"ScrollViewer\".":"一个包含“ scrollviewer”的字符串。","The Documents folder for the current user.":"当前用户的文档文件夹。","The date to add.":"添加的日期。"," if the event is to be marked handled; otherwise ":"如果要标记该事件； 否则"," pointer, otherwise this method returns ":"指针，否则此方法返回","The  Favorites folder for the current user.":"当前用户的收藏夹文件夹。","The horizontal increment specific to the control.":"对控件的水平增量。","The start of the range to be represented.":"要代表的范围的开始。",". If reading this value, ":"。 如果阅读此值，","The end of the range to be represented.":"要表示的范围的末端。"," that is associated with this peer.":" 即与此对等体相关联。","The folder for application-specific data that is used by the current, non-roaming user.":"当前非漫游用户使用的特定于应用程序数据的文件夹。","The vertical increment specific to the control.":"对控件的垂直增量。"," indicates that either a class handler, or some instance handler along the route, has already marked this event handled. ":"指示类处理程序或沿路线的某些实例处理程序已经标记了此事件的处理。","Percent scrolled horizontally.":"百分比滚动水平。","The Music folder for the current user.":"当前用户的音乐文件夹。","A string containing the accelerator key.":"包含加速器键的字符串。","The last date in the represented range.":"表示范围中的最后日期。",".indicates that no such handler has marked the event handled.  \n  \n The default value is ":"指示没有这样的处理程序标记了事件的处理。 \n  \n  默认值是","Percent scrolled vertically.":"垂直滚动的百分比滚动。","The first date in the represented range.":"代表范围内的第一个日期。","The original reporting source, before any possible ":"原始报告来源，任何可能","A string that contains the class name, minus the accelerator key.":"一个包含类名的字符串，减去加速器键。","The Pictures folder for the current user.":"当前用户的图片文件夹。","Value indicating whether control is can be scrolled in the horizontal direction.":"指示是否控制的值可以在水平方向上滚动。","An enumeration value that specifies the control pattern.":"指定控制模式的枚举值。","The Program Files folder.":"程序文件文件夹。","The previous mode.":"以前的模式。"," adjustment made by class handling, which may have been done to flatten composited element trees.":"通过类处理进行的调整，这可能是为了使复合元素树更扁平。","The horizontal scroll position as a percentage of the total content area within the control.":"水平滚动位置是控件内总内容区域的百分比。","The identifier for the event that has been invoked.":"已调用事件的标识符。","The folder for components that are shared across applications.":"跨应用程序共享组件的文件夹。","The new mode.":"新模式。"," pointer; otherwise, this method returns ":"指针; 否则，此方法返回"," if the specified object is equivalent to the current ":"如果指定的对象等于当前"," if successful, or an error value otherwise.":"如果成功，则否则是错误值。","The folder that contains the program groups for the current user.":"包含当前用户的程序组的文件夹。"," that represents the new mode.":"这代表了新模式。","The ordinal number of the row of interest.":"该行的序数。"," if the objects are equivalent; otherwise, ":"如果对象等效； 否则，"," if the control can scroll vertically; otherwise ":"如果控件可以垂直滚动； 否则","The folder for application-specific data for the current roaming user.":"当前漫游用户的应用程序数据夹。","The ordinal number of the column of interest.":"感兴趣列的序数。"," that represents the old mode.":"这代表旧模式。","The vertical scroll position as a percentage of the total content area within the control.":"垂直滚动位置是控件内总内容区域的百分比。"," if the objects are not equivalent; otherwise, ":" 如果对象不等效；否则, ","The UI Automation provider for the specified cell.":"指定单元格的UI自动化提供商。"," element should use to arrange its child elements.":"元素应用来安排其子元素。","The folder that contains the Send To menu items for the current user.":"包含为当前用户发送到菜单项的文件夹。",", this method returns a pointer to the current instance; otherwise ":"，此方法将指针返回到当前实例； 否则"," element and its descendants.":"元素及其后代。"," if the event handler is invoked when the routed event is marked handled; otherwise, ":"如果将路由事件标记为处理时，请调用事件处理程序； 否则，","The item in the container after which to begin the search.":"在容器中开始搜索的项目。","The folder that contains the Start menu items for the current user.":"包含当前用户的开始菜单项的文件夹。","The element where the size is being changed.":"大小更改的元素。"," coordinate of the specified element.":"指定元素的坐标。","The property that contains the value to retrieve.":"包含要检索的值的属性。","A collection of UI Automation providers. true if multiple selection is allowed; otherwise ":"UI自动化提供程序的集合。 如果允许多项选择，则为true；否则 ","The folder that corresponds to the Startup program group for the current user.":"与当前用户的启动程序组相对应的文件夹。","The available size of the element.":"元素的可用大小。","The previous size, before the change.":"更改之前的先前尺寸。","The value to retrieve.":"检索的值。","The item object that is associated with this ":"与此关联的项目对象","The System folder.":"系统文件夹。"," if the Width component of the size changed.":"如果大小的宽度组件更改。","A string that contains \"Separator\".":"一个包含“分离器”的字符串。"," that represents the area that is clipped if ":"这代表被剪辑的区域","The folder for document templates for the current user.":"当前用户的文档模板文件夹。","The first item that matches the search criterion; otherwise, ":"与搜索标准匹配的第一个项目； 否则，"," if the Height component of the size changed.":"如果大小的高度组件更改。","A string that contains \"Slider\".":"一个包含“滑块”的字符串。","An upper limit ":"上限"," if no items match.":"如果没有匹配的项目。"," that contains the selected file.":"其中包含所选文件。"," if there is a significant Height component change; otherwise, ":"如果高度组件发生重大变化； 否则，"," that should not be exceeded.":"不应该超过。"," are the child ":"是孩子","An array of multiple new ":"一系列多个新的","A collection of values that identifies the views available for a UI Automation element.":"一个值的集合，可以标识可用于UI自动化元素的视图。"," that represents the size that is required to arrange child content.":"这代表了安排儿童内容所需的大小。","The new size.":"新尺寸。","A list of child elements.":"儿童元素列表。","The view identifier.":"视图标识符。"," objects that contain the selected files.":"包含所选文件的对象。","The element to which the property value is written.":"属性值的元素编写。","A string that contains \"StatusBar\".":"一个包含“状态栏”的字符串。","The previous size.":"先前的大小。","A localized name for the view.":"视图的本地名称。"," if multiple selections are allowed; otherwise, ":"如果允许多个选择； 否则，","Sets the ":"设置","A string that contains \"StatusBarItem\".":"包含“ statusbaritem”的字符串。"," if the width changed; otherwise, ":"如果宽度更改； 否则，","A view identifier.":"视图标识符。"," that represents the original data value.":"这代表原始数据值。"," that is associated with the new ":"与新的相关"," if the checkbox is selected; otherwise, ":" 如果选中该复选框；否则, ","A collection of UI Automation providers.":"UI自动化提供商的集合。"," that this handler is being notified about.":"该处理程序正在通知。"," that represents the data value.":"这代表数据值。"," if the checkbox is displayed; otherwise, ":"如果显示复选框； 否则，","The total number of columns in a grid.":"网格中的列总数。","A string that contains \"TabControl\".":"包含\"TabControl\"的字符串。","The element whose parent changed causing the source to change.":"父母更改的元素导致源更改。"," if you want to prevent revirtualization of this item; otherwise ":"如果您想防止此项目的重新定性化； 否则"," if dialog should prompt prior to saving to a filename that did not previously exist; otherwise, ":"如果应在保存到以前不存在的文件名之前提示对话框； 否则，","A string that contains \"TabItem\".":"一个包含“ tabitem”的字符串。","The total number of rows in a grid.":"网格中的行总数。","The old parent of the element whose parent changed causing the source to change.":"元素的旧父，其父母的变化导致源更改。"," that represents the actual calculated width in device independent pixels. The default value is 0.0.":"这代表了独立像素的实际计算宽度。 默认值为0.0。","The value for the current view of the UI Automation element.":"UI自动化元素当前视图的值。","The string that contains the label. If set, this method returns the value of the ":"包含标签的字符串。 如果设置，此方法返回","The element that is reporting the change.":"报告更改的元素。"," if dialog should prompt prior to saving over a filename that previously existed; otherwise, ":"如果应在保存先前存在的文件名之前提示对话框； 否则，"," that represents the maximum width. The default value is ":"这代表最大宽度。 默认值是"," if multiple selection is allowed; otherwise, ":"如果允许多次选择； 否则，"," property; otherwise this method will return the value of the ":"财产; 否则，此方法将返回","The type name of the annotation.":"注解的类型名称。"," that represents the minimum width. The default value is 0.":"这代表最小宽度。 默认值为0。","The primary direction of traversal.":"遍历的主要方向。","The previous parent element source.":"前的父元素源。","A string that contains \"Table\".":"一个包含“表”的字符串。","The object where the event is raised, and the event handler is attached.":"升高事件并附加事件处理程序的对象。"," that represents the offset of the column. The default value is 0.0.":"这代表列的偏移。 默认值为0.0。","The GUID for the annotation.":"注释指导。","A string that contains \"CheckBox\".":"一个包含“复选框”的字符串。","A string that contains \"TableCell\".":"一个包含“ tablecell”的字符串。","A collection of child elements.":"儿童元素的集合。","The date and time the annotation was first created.":"注释的日期和时间是创建的。"," that provides the format context.":"提供格式上下文。"," that represents the width of the Column. The default value is 1.0.":"这代表列的宽度。 默认值为1.0。","A string that contains \"cell\".":"包含“单元格”的字符串。","A string that contains \"ComboBox\".":"一个包含“ Combobox”的字符串。"," if either is set; otherwise this method returns an empty string.":"如果要设置任何一个； 否则，此方法返回一个空字符串。"," that is being tested.":"正在测试。","The date and time the annotation was last modified.":"注释的日期和时间最后修改。"," to convert from.":" 从转换。",", this method returns a reference to the current instance of the ":"，此方法返回对当前实例的引用"," exists within the collection; otherwise ":"集合中存在； 否则",".  See Annotations Schema for schema details.":"。 有关模式详细信息，请参见注释模式。","A collection of child elements, or ":"子元素的集合，或者 "," can convert an object of type ":"可以转换类型的对象","; otherwise, this method calls the base implementation on ":"; 否则，此方法调用基本实现","Identifies the index position within ":"确定索引位置","A string that contains the word \"TextBlock\".":"一个包含“ TextBlock”一词的字符串。","The XML reader to use to deserialize the annotation.":"用于反序列化注释的XML读取器。"," can convert a ":" 可以转换 ","The string value of a control.":"控件的字符串值。"," objects are copied.":"对象被复制。","The XML writer to use to serialize the annotation.":"XML作者用于序列化注释。"," if the element is part of a template; otherwise ":"如果该元素是模板的一部分； 否则"," converted from ":"从"," for the current element.":"对于当前元素。"," whose index position is desired.":"需要其索引位置。","A string that contains \"TextBox\".":"一个包含“文本框”的字符串。","A collection of zero or more ":"零或更多的集合"," if the value is read-only; ":"如果值仅读取；","An object that represents the specified ":"表示指定的对象","The position within the collection where the item is inserted.":"集合中插入项目的位置。"," that contains the coordinates of the element, or ":"包含元素的坐标，或","The location of the text decoration.":"文本装饰的位置。"," if it can be modified.":"如果可以修改。"," was found in the collection and removed; otherwise, ":"在收藏中发现并删除； 否则，"," anchor elements.":"锚元素。"," if the element is not a ":"如果元素不是","The position within the collection at which the ":"集合中的位置","A string value of the control.":"控件的字符串值。"," used to draw the text decoration. If this value is ":"用于绘制文本装饰。 如果此值为","The XML qualified name for this kind of annotation.":"这种注释的XML合格名称。",") if the element is not a ":"）如果元素不是"," is removed.":"已移除。",", the text decoration color matches the text color to which it is applied, and the text decoration's thickness is set to the font's recommended thickness.":"，文本装饰的颜色与所施加的文本颜色相匹配，并且文本装饰的厚度设置为字体的建议厚度。","A string that contains \"ContextMenu\".":"包含\"ContextMenu\"的字符串。","A string that contains \"Thumb\".":"一个包含“拇指”的字符串。","A collection of zero or more author strings.":"零或更多作者字符串的集合。"," if multiple selection is allowed; otherwise ":"如果允许多次选择； 否则","The vertical displacement from the text decoration's location. A negative value moves the decoration lower, while a positive value moves the decoration higher.":"文本装饰位置的垂直位移。 负值将装饰移动下降，而正值将装饰移动更高。","The position within the collection at which the first ":"首先的集合中的位置","the toggle state of the control.":"控件的切换状态。"," cargo elements.":" 货物元素。","The units used to interpret the value of ":"用于解释价值的单位"," objects to remove from the collection.":"从集合中删除的对象。","The element that is associated with this automation peer.":"与此自动化对等相关的元素。","A string that contains the word \"ToolBar\".":"包含“工具栏”一词的字符串。","The date and the time the annotation was created.":"创建注释的日期和时间。","The units used to interpret the value of the ":"用于解释价值的单位","The total number of items in the collection. This property has no default value.":"集合中的项目总数。 该属性没有默认值。"," column that ":"列","The GUID of the annotation.":"注释的指导。","A string that contains \"ToolTip\".":"包含“工具提示”的字符串。","The vertical location at which the text decoration is drawn.":"绘制文本装饰的垂直位置。"," is in.":"在。"," if access to this collection is synchronized; otherwise, ":"如果对此集合的访问已同步； 否则，","The data item that is associated with the ":"与","The date and the time the annotation was last modified.":"注释的日期和时间进行了最后修改。","The current item in the collection.":"集合中的当前项目。"," elements, or ":"元素，或","An enumeration that specifies the control pattern.":"指定控制模式的枚举。",", the decoration color matches the text to which it is applied and the decoration's thickness is set to the font's recommended thickness.":"，装饰颜色与所施加的文本相匹配，并将装饰的厚度设置为字体的建议厚度。","The annotation raising the event.":"注释引发了活动。","The element used to display the specified item.":"用于显示指定项目的元素。","A string that contains \"TreeView\".":"一个包含“ TreeView”的字符串。"," is a supported value; otherwise, ":"是一个支持的价值； 否则，","The text decoration's offset from its ":"文本装饰的偏移与其","The author operation performed: ":"作者操作执行：","Specified item.":"指定项目。"," if selection is required; otherwise ":"如果需要选择； 否则","The value to set. The provider is responsible for converting the value to the appropriate data type.":"要设置的值。 提供商负责将值转换为适当的数据类型。"," that is the parent to this ":"那就是这个父母"," if the item is its own ":"如果物品是自己的","The author object being changed by the event.":"作者对象被事件更改。","The units in which the ":"所使用的单位 ","A string containing the value ":"一个包含值的字符串","A zero-based ordinal number that identifies the column containing the cell or item.":"基于零的序数，该数字标识包含单元格或项目的列。","The event data for the ":"事件数据的"," value is expressed. The default is ":"值表示。 默认值为","The number of columns spanned.":"跨度的列数。","The author change operation: ":"作者更改操作：","The state, expanded or collapsed, of the control.":"该控制的状态扩展或崩溃。","Provides data for ":"提供数据"," of the text decoration's ":"文字装饰","The annotation that raised the event.":"引发活动的注释。"," if an item is selected; otherwise, ":"如果选择了项目； 否则，","A UI Automation provider that implements the ":"UI自动化提供商实现","Element used to display the specified item.":"用于显示指定项目的元素。","The author object that is the target of the event.":"作者对象是事件的目标。","The UI automation provider.":"UI自动化提供商。"," and represents the cell or item container.":"并代表单元格或项目容器。"," is expressed. The default is ":"表示。 默认值为"," supports scrolling; otherwise, ":"支持滚动； 否则，","A zero-based ordinal number that identifies the row containing the cell or item.":"一个基于零的序数编号，标识包含单元格或项目的行。","A string that contains \"TreeViewItem\".":"包含“ TreeViewItem”的字符串。","The document to add the printed annotations to.":"将打印注释添加到的文档。","The collection to be removed":"要删除的集合","The number of rows spanned.":"跨越的行数。"," if the drop-down is open; otherwise, ":"如果下拉菜单打开； 否则，","; otherwise, it returns ":"; 否则，它返回","The annotation storage stream to retrieve the annotations from.":"注释存储流从中检索注释。","Out parameter containing the result. If no element was removed from the current collection, then ":"输出包含结果的参数。 如果没有从当前集合中删除任何元素，则"," if the element is selected; otherwise, ":"如果选择元素； 否则，"," can be edited; otherwise ":"可以编辑； 否则","The string that contains the name of the control.":"包含控件名称的字符串。","The text flow direction, ":"文本流动方向，"," is a new collection          identical to the original one.":"是一个与原始系列相同的新系列。","The provider that supports ":"支持的提供商","The store to retrieve the annotations from.":"从商店中检索注释。"," is highlighted; otherwise, ":"突出显示； 否则，","A string that contains \"Viewport3D\".":"一个包含“ viewport3d”的字符串。","The value of the control as a string.":"控件作为字符串的值。","The unique application-defined identifier passed in the call to start the asynchronous operation.":"在调用中传递的唯一应用程序定义的标识符以启动异步操作。"," if at least one item was removed from the current collection; otherwise, ":"如果至少从当前集合中删除了一项； 否则，"," that represents the screen coordinates of the ":"代表屏幕坐标","A double that represents the height that is retrieved or the height to set. The default value as defined to the property system is a calculated value based on taking a one-third fraction of the system max screen height parameters, but this default is potentially overridden by various control templates.":"代表检索高度或设置高度的双重。 定义为属性系统的默认值是基于采集系统最大屏幕高度参数的三分之一的计算值，但是各种控制模板可能会覆盖此默认值。","The column that is associated with the ":"与"," is always returned because the ":"总是返回的，因为","An application-defined object for identifying the asynchronous operation.":"应用定义的对象，用于识别异步操作。","A string that contains the word \"Window\".":"一个包含“窗口”一词的字符串。","The selected item.":"选定的项目。","The automation peer for the ":"自动化对等"," or  ":"或者",", if the specified ":"，如果指定","A composite string that specifies how to format the selected item in the selection box if it is displayed as a string.":"如果将选定项目格式化为字符串，则指定如何在选择框中格式化所选项目的复合字符串。"," cannot be converted to another type.":" 无法转换为其他类型。"," to retrieve.":"检索。","The type name of the ":"类型名称"," if the name is ":"如果名称为","An item template.":"项目模板。"," to be converted into the ":"被转换为","An application-defined object that is used to identify the asynchronous operation.":"应用定义的对象，用于识别异步操作。"," property that is associated with this ":"与此关联的属性","Input stream of source BAML.":"源库的输入流。"," represents the total number of pages; otherwise, ":"代表页面总数； 否则，","The new width of the column, in pixels.":"列的新宽度，以像素为单位。"," keeps the user's input; ":"保留用户的输入；"," is always returned because ":"总是返回，因为"," replaces the input with a matching item The registered default is ":"用匹配的项目代替注册默认值为"," if pagination is in process and ":"如果分页正在进行，并且","Reader settings.":"阅读器设置。"," if the element can be resized; otherwise ":"如果可以调整元素的大小； 否则"," cannot be converted to any other type.":"不能转换为任何其他类型。"," represents the number of pages currently formatted.":"表示当前格式的页面数量。","The data item in the ":"数据项",". For more information about what can influence the value, see Dependency Property Value Precedence.":"。 有关可能影响该值的更多信息，请参见依赖关系属性值优先级。","A value that represents a baseline ":"代表基线的值","String that declares a file path to the file that contains BAML to read.":"将文件路径声明到该文件的字符串，其中包含要读取的BAML。",", the total number of annotation pages; otherwise if ":"，注释页的总数； 否则"," collection that is associated with this ":"与此关联的收集"," to release the managed resources; otherwise, ":"释放托管资源； 否则，","A value that represents an overline ":"代表上线的价值"," to keep the drop-down control open when the user clicks on the text area to start editing; otherwise, ":" 以在用户点击文本区域开始编辑时保持下拉控件打开；否则, ",", the number of pages currently formatted (pagination in process).":"，当前格式化的页数（流程中的分页）。"," that holds the ":"那是","The string of the currently selected item. The default is an empty string (\"\").":"当前选择的项目的字符串。 默认值是一个空字符串（“”）。"," if a node is available; otherwise, ":"如果有节点可用； 否则，","A value that represents a strikethrough ":"代表罢工的价值","The suggested width and height for formatting pages.":"格式化页面的建议宽度和高度。","The provider for the ":"提供者","Old content.":"旧内容。"," if the reader position is at the end of the file; otherwise, ":"如果读者位置在文件的末尾； 否则，","A value that represents an underline ":"代表下划线的值","The source document that is being paginated.":"正在分页的源文档。","New content.":"新内容。"," control.":"控制。","The current member, or ":"当前成员，或","The annotation service from which to remove highlight annotations.":"删除突出显示注释的注释服务。"," to register the handler such that it is invoked even when  the routed event is marked handled in its event data; ":"注册处理程序以使其被调用，即使在事件数据中对路由事件进行了标记，也会被调用；","The state (expanded or collapsed) of the control.":"控制的状态（扩展或崩溃）。","Keyboard input event arguments.":"键盘输入事件参数。"," if the position is not on a member.":"如果该职位不在会员身上。","The annotation service to use to create the highlight annotation.":"用于创建突出显示注释的注释服务。"," property of the event data to create the handlers.":"事件数据的属性以创建处理程序。","The XAML namespace if available, otherwise ":"XAML名称空间（如果有），否则","The old value of ":"旧价值","A string that represents the value of the control.":"表示控件值的字符串。","The author of the annotation.":"注释的作者。","The final size that the parent computes for the child element, provided as a ":"父母为子元素计算的最终大小，以","An object that provides schema context information for the information set.":"为信息集提供架构上下文信息的对象。","The type of pattern implemented by the element to retrieve.":"元素实现的模式类型要检索。","The new value of ":"新价值的","The brush to use to draw the highlight over the selected content.":"用于在所选内容上绘制高光的刷子。"," if line information is available; otherwise, ":"如果有线路信息； 否则，","The final area within the parent that element should use to arrange itself and its child elements.":"元素应用来安排自身及其子元素的父母内部区域。","The highlight annotation; or ":"亮点注释； 或者"," property should be persisted; otherwise, ":"财产应持续存在； 否则，","The object that implements the pattern interface, or ":"实现模式接口的对象，或者 "," if the stylus was successfully captured; otherwise, ":"如果手写笔被成功捕获； 否则，","The line number to report.":"要报告的行号。",", if there is no selected content to highlight.":"，如果没有选择的内容可以突出显示。"," if the specified pattern interface is not implemented by this peer.":"如果指定的模式接口未由此对等实现。","The line position to report.":"报告的线位置。"," if keyboard focus and logical focus were set to this element; ":"如果将键盘焦点和逻辑焦点设置为此元素；","An object that contains the control's content. The default value is ":"包含控件内容的对象。 默认值为 ","The annotation service to use to create the ink sticky note annotation.":"用于创建墨水粘附注释的注释服务。","A UI Automation provider that represents the cell or item container.":"代表单元或项目容器的UI自动化提供商。"," if the position is not on an object.":"如果位置不在对象上。","A composite string that specifies how to format the ":"一个指定如何格式化的复合字符串"," if only logical focus was set to this element, or if the call to this method did not force the focus to change.":"如果仅将逻辑焦点设置为此元素，或者对此方法的调用没有强迫重点更改。","The value of the current node, or ":"当前节点的值，或","The ink sticky note annotation; or ":"墨水粘附注释； 或者","The provider that acts as the container for the calling object.":"充当调用对象容器的提供商。"," property if it is displayed as a string.":"属性如果显示为字符串。","The dependency property to check.":"要检查的依赖属性。","Because ":"因为"," if the position is not on a ":"如果该位置不在",", if there is no selected content to annotate.":"，如果没有选择的内容可以注释。","A data template. The default value is ":"数据模板。 默认值是"," node type.":"节点类型。","The available size provided by the element.":"元提供的可用尺寸。"," gives access to its content through ":"通过","The annotation service to use to create the text sticky note annotation.":"用于创建文本粘性注释的注释服务。","A data template selector. The default value is ":"数据模板选择器。 默认值是","A string that is parsed to determine three URIs: image source, source color context, and destination color context.":"解析以确定三个URI的字符串：图像源，源颜色上下文和目标颜色上下文。","The potential clipping geometry.":"潜在的剪辑几何形状。","The text sticky note annotation; or ":"文本粘附注释； 或者",", this method always returns ":"，此方法总是返回"," has content; otherwise ":"有内容； 否则","Describes the hit test to perform, including the initial hit point.":"描述要执行的热门测试，包括初始命中点。","An object that can provide services for the markup extension. This service is expected to provide results for ":"可以为标记扩展提供服务的对象。 预计该服务将为","A string that contains \"Document\".":"一个包含“文档”的字符串。","The annotation service from which to delete ink sticky note annotations.":"从中删除墨水粘附注释的注释服务。","An enumerator. The default value is ":"枚举者。 默认值是","Results of the test, including the evaluated geometry.":"测试的结果，包括评估的几何形状。","The annotation service from which to delete text sticky note annotations.":"从中删除文本粘性注释的注释服务。"," based on the values passed to the constructor.":"基于传递给构造函数的值。",", this method returns an ":"，此方法返回一个 ","The size that is required to arrange child content.":"安排儿童内容所需的大小。","Results of the test, including the evaluated point.":"测试的结果，包括评估点。","The annotation service to use for this operation.":"用于此操作的注释服务。","A string that contains the automation identifier.":"包含自动化标识符的字符串。","The type that defines the resource key.":"定义资源密钥的类型。"," object value.":"对象值。","The annotation to get anchoring information for.":"获得锚定信息的注释。","The offset coordinates within this element.":"偏移坐标在此元素中。","The collection of child elements of the ":"儿童元素的集合","A unique identifier to differentiate this ":"一个唯一的标识符来区分这个"," from others associated with the ":"来自与","The element child that is located at the given position.":"位于给定位置的元素孩子。","The data used to generate the child elements. The default is ":"用于生成子元素的数据。 默认值为","A string that contains \"DocumentViewer\".":"包含“ DocumentViewer”的字符串。"," object that provides anchoring information about the specified annotation, or ":"提供有关指定注释的锚定信息的对象，或","Object to compare with the current ":"对象与当前","The available space that a parent element can allocate a child element. A child element can request a larger space than what is available; the provided size might be accommodated if scrolling is possible in the content model for the current element.":"父元素可以分配子元素的可用空间。 子元素可以要求比可用的空间更大。 如果在当前元素的内容模型中进行滚动，则可以容纳提供的大小。","The base name to use during automatic aliasing. The default is \"Content\".":"在自动混叠过程中要使用的基本名称。 默认值为“内容”。"," if it cannot be resolved.":"如果无法解决。",", this method returns the ":"，此方法返回 "," property if it is displayed as a string. The default is ":"属性如果显示为字符串。 默认值为","The string representation.":"字符串表示。","The available size that the parent element can allocate for the child.":"父元素可以为孩子分配的可用大小。",". This method also sets ":"。 此方法还设置","The globally unique identifier (GUID) that identifies this resource.":"标识此资源的全球唯一标识符（GUID）。"," that defines the visualization of the content. The default is ":" 这定义了内容的可视化。 默认值为 ","The desired size of this element in layout.":"该元素在布局中的所需大小。","The retrieved assembly, as a reflection class.":"被检索的组件作为反射类。","A name to identify this resource from other ":"一个名称可以从其他地方识别此资源"," control associated with this ":"与此相关的控制"," object that supplies logic to return a ":"提供逻辑以返回的对象","The event data to the access key event. The event data reports which key was invoked, and indicate whether the ":"访问密钥事件的事件数据。 事件数据报告调用了哪个关键，并指示是否是","A unique identifier. Typically this is a string.":"唯一标识符。 通常这是一个字符串。","A string that contains \"Expander\".":"一个包含“扩展器”的字符串。"," to apply. The default is ":"申请。 默认值为"," defined in the same annotation.":" 同的注解中定义。"," object that controls the sending of these events also sent this access key invocation to other elements.":"控制这些事件发送的对象还将此访问密钥调用发送给其他元素。"," should use ":"应该使用","The binding that specifies the property of the condition.":"指定条件属性的绑定。","The XML reader to deserialize the ":"XML读取器应对",", otherwise this method calls the base implementation on ":"，否则此方法称基础实现","The value of the condition.":"条件的价值。","The child element that is being resized.":"正在调整大小的子元素。"," in its style; otherwise, ":"以其风格； 否则，","The XML writer to serialize the ":"XML作者序列化"," which returns ":"返回","The property of the condition.":"条件的属性。","The drawing instructions for a specific element. This context is provided to the layout system.":"特定元素的绘图说明。 此上下文提供给布局系统。"," object for this ":"为此","The collection of content locators contained in this resource.":"此资源中包含的内容定位器的集合。"," if the expander has automation keyboard focus; otherwise, ":"如果扩展器具有自动化键盘的焦点； 否则，","The packaged parameters (":"包装参数（"," of the object with the ":"带有对象的","The object that the context menu was previously attached to.":"上下文菜单先前已附加到的对象。","The collection of the ":"收集","The object where the markup extension sets the value.":"标记扩展设置值的对象。","A string that contains \"FixedPage\".":"一个包含“ filexpage”的字符串。","), which includes old and new sizes, and which dimension actually changes.":"），其中包括旧尺寸和新尺寸，哪个维度实际变化。","A callback that specifies the location of the ":"指定位置的回调"," objects that define the content of this resource.":"定义此资源内容的对象。","A string that contains \" FlowDocumentPageViewer\".":"包含“ FlowDocumentPageViewer”的字符串。","The previous parent. This may be provided as ":"以前的父母。 这可以作为"," if the context menu appears with a dropped shadow; otherwise, ":"如果上下文菜单显示带有掉落的阴影； 否则，","Data that is relevant for markup extension processing.":"与标记扩展处理相关的数据。","The GUID that identifies this resource.":"标识此资源的GUID。"," pointer. Otherwise, this method returns ":"指针。 否则，此方法返回"," did not have a parent element previously.":"以前没有父元素。","The object where the type converter sets the value.":"类型转换器设置值的对象。","The horizontal distance between the target origin and the popup alignment point. For information about the target origin and popup alignment point, see Popup Placement Behavior. The default is 0.":"目标原点和弹出对齐点之间的水平距离。 有关目标原点和弹出对齐点的信息，请参见弹出位置行为。 默认值为0。","The name assigned to this ":"分配给此的名称","The ID of a view.":"视图的ID。","The identifier of the routed event for which the handler is attached.":"附加处理程序的路由事件的标识符。","Data that is relevant for type converter processing.":"与类型转换器处理相关的数据。"," is visible; otherwise, ":"可见； 否则，"," to distinguish it from other ":"区分它与其他","The name of a control-specific view.":"特定于控制的视图的名称。"," that specifies the property of the condition. The default value is null.":"指定条件的属性。 默认值为null。","The point value, as relative to this element.":"相对于此元素，点值。","The area that defines the rectangle that is used to position the context menu. The default is ":"定义用于定位上下文菜单的矩形的区域。 默认值为"," in the annotation.":"在注释中。","The default property is ":"默认属性是","A string that contains \"FlowDocumentScrollViewer\".":"一个包含“ FlowDocumentsCrollviewer”的字符串。","The element to translate the given point into.":"将给定点转换为的元素。","The element relative to which the ":"与之相关的元素","The action of the event.":"事件的动作。",". If this property is ":"。 如果此属性是","An object that supports the control pattern if ":"一个支持控制模式的对象","A point value, now relative to the target element rather than this source element.":"一个点值，现在相对于目标元素而不是此源元素。"," is positioned when it opens. The default is ":"打开时位于定位。 默认值为"," resource of the event.":"事件的资源。",", then the property of the object being styled causes the associated setters to be applied.":"，然后样式的对象的属性会导致应用相关的设置器。","The bitmap effect to apply.":"要应用的位图效果。","A string that contains \"Frame\".":"一个包含“帧”的字符串。"," if the menu should stay open until the ":"如果菜单应保持打开状态，直到"," property cannot be null for a given ":"属性不能为给定的","The action of the annotation ":"注释的动作","The source for bitmap effects.":"位图效果的来源。","The string describing the functionality of the element.":"描述元素功能的字符串。"," property changes to ":"属性更改为","The geometry to be used for clipping area sizing. The default is a null ":"用于剪裁区域尺寸的几何形状。 默认值为空",".  \n  \n See also the Exceptions section. The default value is null.":"。 \n  \n  另请参见异常部分。 默认值为null。"," that raised the event.":" 这引发了事件。","The automation identifier for the element associated with the ":"与 ","The vertical distance between the target origin and the popup alignment point. For information about the target origin and popup alignment point, see Popup Placement Behavior. The default is 0.":"目标原点与弹出对齐点之间的垂直距离。 有关目标原点和弹出窗口对齐点的信息，请参阅弹出窗口放置行为。 默认值为0。"," if the content should be clipped; otherwise, ":" 如果内容应该被剪切;否则, "," if the trigger is read-only; otherwise, ":"如果扳机是只读的； 否则，","The annotation anchor or cargo resource that was ":"注释锚或货物资源","The horizontal position of the mouse.":"鼠标的水平位置。"," if there isn't an automation identifier.":" 如果没有自动化标识符。","The computed size, which becomes the desired size for the arrange pass.":"计算的尺寸，成为安排通行证的所需尺寸。","The computed size that is used to arrange the content.":"用于排列内容的计算大小。","The document reading control associated with the ":"文档阅读控制与与","The vertical position of the mouse.":"鼠标的垂直位置。"," has focus; otherwise, ":"有重点； 否则，","The help text, usually from the ":"帮助文本，通常来自","Object to query concerning the ":"目的是查询有关","The document viewing control associated with the ":"文档查看控制与与","The size of the content.":"内容的大小。"," if the size and position of layout are valid; otherwise, ":"如果布局的大小和位置有效； 否则，"," if there is no help text.":"如果没有帮助文本。","Value of the ":"值的值","The annotation store to use for reading, writing, and displaying annotations.":"用于阅读，写作和显示注释的注释商店。","The index of the visual child element to return.":"视觉子元素返回的索引。"," if this element could be returned as a hit test result from at least one point; otherwise, ":"如果可以将此元素作为命中测试结果返回至少一个点； 否则，","Object to query concerning whether it has a drop shadow.":"目的是查询有关它是否具有落下阴影的目的。","The text label of the element that is associated with this automation peer.":"与此自动化对等相关的元素的文本标签。"," however, this will be influenced by the actual state of input methods at runtime.":"但是，这将受运行时输入方法的实际状态影响。","The document reader control to return the ":"文档阅读器控制以返回","Returns an integer that represents the index of a visual child element.":"返回代表视觉子元素索引的整数。","A Boolean value, ":"布尔值，"," if manipulation events are enabled on this ":"如果在此启用了操作事件","A string that contains \"GridSplitter\".":"一个包含“ Gridsplitter”的字符串。","The maximum size limit for the control. The return value cannot exceed this size.":"控件的最大尺寸限制。 返回值不能超过此大小。"," instance for.":"实例。"," has a drop shadow; ":"有阴影；"," if the measure pass of layout returned a valid and current value; otherwise, ":"如果布局的度量通过返回有效的当前值； 否则，","The size of the control. Cannot exceed the maximum size limit for the control.":"控件的大小。 无法超过控件的最大尺寸限制。"," associated with the given document reader control; or ":"与给定的文档阅读器控件相关联； 或者"," pointer; otherwise this method returns ":"指针; 否则此方法返回"," if this element or a contained element has stylus capture; otherwise, ":"如果此元素或包含的元素具有摄影作用； 否则，","Object to set the property on.":"对象设置属性。","The character to return.":"返回的角色。","Boolean value to set, ":"布尔值设置，"," if the specified document reader has no ":"如果指定的文档阅读器没有","Absolute screen coordinates of the left side of the control.":"控件左侧的绝对屏幕坐标。"," if the stylus pointer is over the same element result as a hit test; otherwise, ":"如果Stylus指针与HIT测试相同的元素结果； 否则，"," that fills the content area. The default is ":"填充内容区域。 默认值为","The amount to adjust the baseline offset position.":"调整基线偏移位置的金额。","Absolute screen coordinates of the top of the control.":"控件顶部的绝对屏幕坐标。"," if stylus cursor is over the element or its child elements; otherwise, ":"如果手写笔光标超过元素或其子元素； 否则，","Object to set the value on.":"对象设置值。","The document viewer control to return the ":"文档查看器控件返回 ","The new width of the window, in pixels.":"窗口的新宽度，以像素为单位。"," if the element is visible; otherwise, ":"如果可见元素； 否则，","The font family to use. The default is the font that is determined by the ":"字体家庭要使用。 默认值是由","Object to set value on.":"对象设置值。"," associated with the given document viewer control; or ":"与给定的文档查看器控件相关联； 或者","The new height of the window, in pixels.":"窗户的新高度，像素。","The size of the control.":"控件的大小。"," metric.":"公制。"," if the specified viewer control has no ":"如果指定的查看器控件没有","The opacity factor. Default opacity is 1.0. Expected values are between 0.0 and 1.0.":"不透明因素。 默认不透明度为1.0。 预期值在0.0至1.0之间。","The font size to use. The default is the font size that is determined by the ":"要使用的字体尺寸。 默认值是由","The maximum size that the method can return.":"该方法可以返回的最大尺寸。","The number of degrees to rotate the control.":"度数来旋转控制。","The relative degree that the font is stretched. The default is ":"字体拉伸的相对程度。 默认值为","The document viewing control to return the ":"文档查看控件以返回","The brush to use for opacity masking.":"用于不透明度掩蔽的刷子。"," if the element can be moved; otherwise ":"如果元素可以移动； 否则","The size of the control, up to the maximum specified by ":"控件的大小，最多由 ","The unique identifier for this element.":"该元素的唯一标识符。"," associated with the given document viewing control; or ":"与给定的文档查看控件相关联； 或者","The font style to use; for example, normal, italic, or oblique. The default is determined by the ":"使用字体样式； 例如，正常，斜体或倾斜。 默认值由"," if the element can rotate; otherwise ":"如果元素可以旋转； 否则","The font weight to use. The default is determined by the ":"字体重量要使用。 默认值由","The old template.":"旧模板。","The rendered size for this element.":"该元素的渲染尺寸。"," if the specified document viewing control has no ":"如果指定的文档查看控件没有"," is using as a view mode.":"用作视图模式。"," that draws the text. The default is ":" 这绘制了文本。 默认值为 ","The new template.":"新模板。","Describes the specifics of the desired render transform. The default is ":"描述所需的渲染转换的细节。 默认值为","Item to create.":"要创建的项目。"," is enabled; otherwise, ":"已启用; 否则，","The value that declares the render transform. The default value is a ":"声明渲染转换的值。 默认值是","A double that specifies the height of each line box. This value must be equal to or greater than ":"一个指定每个行框高度的双重。 该值必须等于或大于","A string that represents the control.":"表示控件的字符串。","The item created.":"创建的项目。"," used by this ":"由此使用","The brush that is used to fill the background of the control. The default is ":"用于填充控件背景的刷子。 默认值为"," and equal to or less then ":"等于或更少"," with coordinates (0,0).":"与坐标（0,0）。","The brush that is used to fill the control's border; the default is ":"用于填充控件边框的刷子； 默认值为","A modifiable deep copy clone of this ":"这是一个可修改的深拷贝克隆","Collection of child objects you want to get.":"您想要获得的子对象的收集。"," (equivalent to an attribute value of ":"（等于属性值","A thickness value; the default is a thickness of 0 on all four sides.":"厚度值； 默认值是所有四个侧面的厚度为0。"," if the element should render in accordance to device pixels; otherwise, ":"如果元素应根据设备像素呈现； 否则，","Collection of child objects.":"收集子对象。",") causes the line height to be determined automatically from the current font characteristics. The default is ":"）导致从当前字体特性自动确定的线高。 默认值为","A font family. The default is the system dialog font.":"一个字体家庭。 默认值是系统对话框字体。",".  See Annotations Schema for schema details":"。 有关模式详细信息，请参见注释模式"," value that determines the behavior of the ":"决定行为的价值",", this method returns an object that implements the control pattern, otherwise this method returns ":"，此方法返回一个实现控制模式的对象，否则此方法返回",". The default as declared on ":". 上声明的默认值 ","The size of the text in the ":"文本大小","The XML reader to use to deserialize the ":"XML读取器用于挑选","Data associated with the event.":"与事件相关的数据。","The collection of stylus plug-ins, as a specialized collection.":"手写笔插件的集合作为专业系列。","An enumerator that iterates the logical child elements of this element.":"枚举该元素的逻辑子元素的枚举者。"," with the list of ":"列表",". The font size must be a positive number.":"。 字体大小必须是正数。","If this ":"如果这"," value. The default is ":"价值。 默认值为","A string that is the unique identifier for this element.":"是该元素的唯一标识符的字符串。","The text without the first underscore character. The default is an empty string.":"没有第一个下划线字符的文字。 默认值是一个空字符串。"," elements to compare with this ":"与此相比的元素","A value of the enumeration. The default value is ":"枚举的价值。 默认值是"," is associated with a ":"与","The brush that paints the foreground of the control. The default value is the system dialog font color.":"绘制控件前景的刷子。 默认值是系统对话框字体颜色。","The horizontal alignment of the text.":"文本的水平对齐。"," if the starting sequence of ":"如果起始序列"," if both logical and keyboard focus were set to this element; ":"如果将逻辑和键盘焦点都设置为此元素；"," element, this method returns ":"元素，此方法返回"," if the control has a ":"如果控件有一个"," elements in this ":"其中的元素"," applied to the text of an ":" 应用于一个文本 ","The name of the element.":"元素的名称。"," if only logical focus was set.":"如果仅设置逻辑焦点。"," matches those in the specified ":"匹配指定的","The trimming behavior to use. The default is ":"修剪行为要使用。 默认值为"," in its style and has a custom keyboard scrolling behavior; otherwise, ":"以其风格，具有自定义的键盘滚动行为； 否则，"," to prevent the property system from animating the property that this metadata is applied to. Such properties will raise run time exceptions if animations of them are attempted. The default is ":"为了防止属性系统对该元数据应用的属性进行动画。 如果尝试进行动画，此类属性将提高运行时间异常。 默认值为","The XML writer to use to serialize the ":"XML作者用于序列化",", this method returns the current ":"，此方法返回电流"," if the control is included in tab navigation; otherwise, ":"如果控件包含在选项卡导航中； 否则，","The wrapping behavior to use. The default is ":"包装行为要使用。 默认值为"," elements that make up this ":"构成这个的元素"," indicates that animations are disallowed; ":"表示动画是不允许的；","; otherwise, this method returns a list of child elements.":"; 否则，此方法返回儿童元素列表。","The amount of space between the content of a ":"内容之间的空间数量","The type name and namespace for the ":"类型名称和名称空间","Returns an integer that represents the number of child elements that are visible.":"返回一个代表可见子元素数量的整数。","A string that contains \"GridViewColumnHeader\".":"包含“ GridViewColumnHeader”的字符串。"," indicates that animations are allowed. The default is ":"表示允许动画。 默认值为","A string that contains \"GridViewHeaderRowPresenter\".":"一个包含“ GridViewHeaderrowPresenter”的字符串。","The item that will be added.":"将要添加的项目。",".  The default is a thickness of 0 on all four sides.":"。 默认值是所有四个侧面的厚度为0。","The part to compare for equality.":"比较平等的部分。"," (animations allowed).":"（允许动画）。","The size that this ":"这个大小","The data item that is associated with this ":"与此关联的数据项","A value that determines the order of logical navigation for a device. The default value is ":"确定设备逻辑导航顺序的值。 默认值是"," within both parts are identical; otherwise, ":"这两个部分都相同； 否则，","The brush used to fill the background of the ":"用来填充背景的刷子"," that is the parent of this ":"那就是父母"," object should use to arrange its child element.":"对象应使用其子元素。","The hash code for this part.":"这部分的哈希代码。","The template that defines the appearance of the ":"定义外观的模板","A string that contains \"ListViewItem\".":"一个包含“ ListViewItem”的字符串。","The brush used to draw the outer border of the ":"用于绘制外边界的刷子","The type this template is intended for.":"此模板的类型用于。","The actual size needed by the element.":"元素所需的实际尺寸。","The collection of the name/value pairs that define this ":"定义此的名称/值对的集合","A string that contains \"GroupBox\".":"一个包含“ GroupBox”的字符串。","The thickness used to draw the border of the ":"用于绘制边界的厚度","The element this template is applied to.":"该模板应用于该元素。","The index that specifies the child object to retrieve.":"指定子对象检索的索引。"," objects. The default value is ":"对象。 默认值是","A string that contains \"GroupItem\".":"包含“ groupItem”的字符串。","The type name and namespace of the part.":"零件的类型名称和名称空间。","The visual child object at the specified index.":"指定索引处的视觉子对象。"," is checked; ":"被检查；","The culture to use in this rule.":"在此规则中使用的文化。"," contains an ":"包含一个","The anchor that is resolved.":"解决的锚。"," if the current cell or row enters edit mode; otherwise, ":"如果当前的单元格或行进入编辑模式； 否则，","An upper limit value that the return value should not exceed.":"返回值不应超过的上限值。"," is not checked; otherwise, ":"未检查； 否则，",".  Otherwise, this method calls the base implementation on ":"。 否则，此方法调用基本实现","The annotation object.":"注释对象。","The desired size of this ":"所需的大小"," has round corners; otherwise ":"有圆角； 否则","If called from an event handler, the event arguments. May be ":"如果从事件处理程序中调用，则事件参数。 或许","The position of this ":"这个位置","The object that represents the location on the tree where the ":"表示树上位置的对象"," appears as if the mouse is over it; otherwise ":"看起来鼠标已经越过了。 否则"," if the current cell or row exits edit mode, or if no cells or rows are in edit mode; otherwise, ":"如果当前的单元格或行退出模式，或者没有单元格或行处于编辑模式； 否则，","Arguments of the event.":"事件的参数。"," is resolved. The type is specified by the type of the annotated object. Sticky notes and highlights in flow or fixed documents always resolve to a ":"已解决。 该类型由注释对象的类型指定。 流量或固定文档中的粘性音符和亮点始终解析为"," within a set.":"在集合中。"," appears pressed; otherwise ":"似乎按压； 否则","One of the enumeration values that specifies whether to cancel row or cell edits.":"指定是取消行还是单元格式的枚举值之一。","A string to add to the object.":"添加到对象的字符串。","The annotation to add to the store.":"添加到商店的注释。","The size of the set that contains this ":"包含此的集合的大小"," if the current cell or row exits edit mode; otherwise, ":"如果当前的单元格或行退出模式； 否则，","The brush.":"刷子。"," that this ":"那","The data item that the row contains.":"行包含的数据项。","The GUID ":"GUID","A string that contains \"Hyperlink\".":"包含“超链接”的字符串。"," has the appearance of the default button; otherwise ":"具有默认按钮的外观； 否则"," object is reserving space for. The default is ":" 对象正在为其预留空间。 默认值为 ","A string that contains \"Image\".":"包含“图像”的字符串。"," property of the annotation to be deleted.":" 要删除的注释的属性。","The data item in the row for which ":"该行中的数据项","The single child object of this ":"这个单身对象","A value in the enumeration.":"枚举中的价值。","A string that contains \"InkCanvas\".":"一个包含“墨水”的字符串。"," is cleared.":"被清除。","The annotation that was deleted; otherwise, ":"删除的注释； 否则，","An enumerator for the logical child elements of this ":"逻辑子元素的枚举者"," if the header clickable; otherwise, ":"如果标题可单击； 否则，"," if an annotation with the specified ":"如果指定的注释","The zero-based index of the column to retrieve.":"列的基于零的索引要检索。","A string that contains \"InkPresenter\".":"包含“ InkPresenter”的字符串。",". The registered default is ":"。 注册默认值为","Either 0 or 1. The default is 0.":"要么是0，要么是1。 默认值为0。","A string that contains the UI Automation identifier.":"包含UI自动化标识符的字符串。"," was not found in the store.":"在商店里找不到。","One of the enumeration values that specifies whether to commit row or cell edits.":"指定是提交行还是单元格编辑的枚举值之一。","The point that represents the clickable space that is on the specified ":"表示指定的可点击空间的点","The integer to use to find an object in the ":"用于在",". For more information about what can influence the value, see ":"。 有关影响价值的内容的更多信息，请参阅","The status. Examples include \"Busy\" or \"Online\".":"状态。 示例包括“忙”或“在线”。"," property of the annotation to be returned.":"注释的财产要退还。","The type of the binding target property.":"绑定目标属性的类型。"," to exit edit mode; otherwise, ":"退出编辑模式； 否则，"," if the header appears as if the mouse pointer is moved over it; otherwise, ":"如果标题显示好像鼠标指针被移动到它上面； 否则，","The item type. An example includes \"Mail Message\" or \"Contact\".":"项目类型。 一个示例包括“邮件”或“联系”。","The annotation with the given ":"给定的注释","The properties of the object to be in the columns.":"对象的属性位于列中。"," if the header appears pressed; otherwise, ":"如果标题显示为按下； 否则，","The text label.":"文本标签。",", if an annotation with the specified ":"，如果指定的注释","The converter parameter to use.":"要使用的转换器参数。","The collection of columns for the properties of the object.":"对象的属性的列的集合。"," if the header appears selected; otherwise, ":"如果显示标头； 否则，","The list of all annotations currently contained in the store.":"商店中当前包含的所有注释的列表。","The culture to use in the converter.":"在转换器中使用的文化。","The direction of the specified ":"指定的方向","One of the enumeration values that indicates which direction the header renders. The registered default is ":"指示标头渲染的方向的枚举值之一。 注册默认值为","The row that is the container.":"是容器的行。","The object that is in the position of ":"位于位置的对象",". Optionally, the method returns ":"。 可选，方法返回","The starting ":"起点","The visibility for the row that contains the ":"包含的行的可见性","The brush that draws the separation between headers. The registered default is ":"绘制标头之间分离的刷子。 注册默认值为"," is not laid out in a particular direction.":"不在特定方向上布局。"," modulo the number of items in ":"Modulo中的项目数"," sequence to return matching annotations for.":"返回匹配注释的序列。","The item to test.":"要测试的项目。","The object to find in the ":"在"," if it has been set, or its position relative to the parent ":"如果已设置或相对于父母的位置","One of the enumeration values that indicates whether the ":"指示是否指的枚举值之一","The list of annotations that have ":"具有注释的清单"," if the item is a ":"如果该项目是"," is visible. The registered default is ":"可见。 注册默认值为"," if it has been set, or the size of the parent ":"如果已设置或父母的大小"," if it is in ":" 如果是在 ","The maximum size that the ":"最大尺寸"," with locators that start and match the given ":"启动和匹配给定的定位器","One of the enumeration values that indicates which direction the column is sorted. The registered default is ":"指示列的哪个方向排序的枚举值之一。 注册默认值为",", or -1 if o does not exist in ":"，或-1如果o不存在"," has keyboard input focus; otherwise, ":"具有键盘输入焦点； 否则，"," if no matching annotations were found.":"如果找不到匹配的注释。","Represents possible color variants for the Microsoft themes.":"代表Microsoft主题的可能颜色变体。"," can occupy.":"可以占领。"," if the UI Automation peer can receive and send events; otherwise, ":"如果UI自动化同行可以接收并发送事件； 否则，","A list of objects that the ":"一个对象列表","The thickness of the border.":"边界的厚度。","The desired size of the ":"所需的大小"," if data in annotation buffers is to be written immediately to the physical data store for each operation; otherwise, ":" 如果注释缓冲区中的数据要立即写入每个操作的物理数据存储中；否则, "," returns when an integer is passed to the ":"当整数传递给"," is not on the screen; otherwise, ":"不在屏幕上； 否则，","The item whose context menu was opened.":"打开上下文菜单的项目。","The Boolean value to convert. This value can be a standard Boolean value or a nullable Boolean value.":"布尔值转换。 该值可以是标准的布尔值或可确定的布尔值。"," if data in the annotation buffers is to be written when the application explicitly calls ":"如果应用程序明确调用时，请在注释缓冲区中编写数据"," appears as if it has keyboard focus; otherwise ":"看起来好像具有键盘焦点； 否则"," contains protected content; otherwise, ":"包含受保护的内容； 否则，"," this element uses to arrange its child element.":"该元素用于安排其子元素。","The automation peer for this ":"此的自动化同行"," has been called; otherwise, ":"被称为; 否则，"," used for the ":" 用于 "," is required to be completed; otherwise, ":"必须完成； 否则，","The old source.":"旧来源。","The dependency object to which the ":"依赖关系对象"," that represents the arranged size of this ":"这代表了这个排列的大小","The object to use as a synchronization lock for ":"用作同步锁的对象","The new source.":"新来源。"," element and its child element.":"元素及其子元素。"," critical sections.":"关键部分。"," renders with a white outer border; otherwise ":"用白色的外边界渲染； 否则","The data item.":"的数据项。","The Information about the event.":"有关事件的信息。","An upper ":"鞋面","The annotation added or removed.":"添加或删除注释。"," value that describes the amount of space between a ":"描述一个空间数量的价值"," limit that cannot be exceeded.":"无法超过的限制。","The item to get an ":"要获得的项目","The mouse data.":"的鼠标数据。","An action ":"一种行为"," and its child element.":" 及其子元素。","The data item to bring into view.":"数据项可以看到。"," objects for child items that are not virtualized; ":"未虚拟化的子项目的对象；"," that represents the upper size limit of the element.":" 表示元素的大小上限。","The color.":"颜色。"," value that identifies the operation performed.":"标识执行操作的值。"," objects all child items.":"反对所有儿童物品。","The column to bring into view.":"要带入视图的列。"," that defines the object to be drawn.":"这定义要绘制的对象。"," that changed in the store.":"在商店中发生了变化。","The radii of a rectangle's corners.":"矩形角的半径。"," that is used by this ":"这是这样使用的","The object in the row for which ":"行中的对象"," that draws the background. This property has no default value.":"吸引背景。 该属性没有默认值。"," of the event.":"活动。","ForegroundBrush, IsIndeterminate, Indicator Width, Indicator Height, Track Width  \n  \n The ":"前灌木，索引，指示宽度，指示器高度，轨道宽度 \n  \n  这"," to set for the row that contains the item.":"为包含该项目的行设置。"," that draws the outer border color. This property has no default value.":"吸引外边界的颜色。 该属性没有默认值。","A value in the ":"一个价值",", the Boolean indicating whether the ":"，布尔值指示是否","The I/O stream for reading and writing user annotations.":"用于阅读和编写用户注释的I/O流。"," that paints the background of every nth row where n is defined by the ":"绘制每排的背景，其中n由n定义"," that describes the width of the boundaries of the ":"描述了边界的宽度","The automation peers for the list items.":"列表项目的自动化对等。"," property. The registered default is ":"财产。 注册默认值为","A dictionary with a list of known compatible namespaces.":"具有已知兼容名称空间列表的字典。"," of the indicator, and the ":"指示器和"," that describes the degree to which corners are rounded. This property has no default value.":"这描述了角落四舍五入的程度。 该属性没有默认值。","The automation peers for all items in the control. If the view contains interactive or informational elements in addition to the list items, automation peers for these elements must be added to the list.":"控件中所有项目的自动化对等。 如果该视图除了列表项目外还包含交互式或信息元素，则必须将这些元素的自动化对等式添加到列表中。"," defining the width of the ":"定义宽度","The globally unique identifier (GUID) ":"全球唯一标识符（GUID）"," if row details cannot scroll; otherwise, ":"如果行细节无法滚动； 否则，","Return the object that implements the control pattern. If this method returns null, the return value from ":"返回实现控制模式的对象。 如果此方法返回null，则从"," that describes the amount of space between a ":"描述了"," if columns are created automatically; otherwise, ":"如果列自动创建； 否则，","The brush used to fill the background of the element.":"用于填充元素背景的画笔。","The list of all annotations that are currently in the store.":"当前商店中所有注释的列表。","A string that contains \"Label\".":"一个包含“标签”的字符串。"," if the user can add new rows; otherwise, ":"如果用户可以添加新行； 否则，"," and its single child element. This property has no default value.":"及其单个子元素。 该属性没有默认值。","The brush used to draw the outer border of the element.":"用来绘制元件的外边框的刷子。","The starting URI sequence to return the list of namespaces for.":"启动URI序列返回命名空间列表。"," used to draw the border of the element.":"用于绘制元素的边界。","A string that contains \"ListBox\".":"一个包含“ ListBox”的字符串。","A list of compatible namespaces that match ":"匹配兼容名称空间的列表","An array of three numbers that represent the ":"三个数字的数组表示"," if the user can delete rows; otherwise, ":"如果用户可以删除行； 否则，"," if the user can reorder columns; otherwise, ":"如果用户可以重新排序列； 否则，","The width of the border.":"边界的宽度。","A string that contains \"ListBoxItem\".":"一个包含“ ListBoxItem”的字符串。"," control parameters.":"控制参数。"," if there are no compatible namespaces found.":"如果找不到兼容的名称空间。"," if the user can adjust the column width; otherwise, ":"如果用户可以调整列宽度； 否则，","The brush used to draw the border.":"用来绘制边框的刷子。",", this method returns the current instance of this ":"，此方法返回当前实例","The width of the visible line to the left of the ":"可见线的宽度左侧","The list of the namespaces that were ignored when the XML stream was loaded.":"加载XML流时忽略的名称空间列表。"," instance that is associated with this ":"与此关联的实例","Window handle for the Win32 dialog.":"Win32对话框的窗口句柄。"," that draws the border around a ":"吸引边界周围"," if the user can change the height of the rows; otherwise, ":"如果用户可以更改行的高度； 否则，","The list of namespaces that are predefined by the Microsoft Annotations Framework.":"由Microsoft注释框架预定的名称空间列表。","Windows message to be processed by the Win32 dialog.":"Windows消息将通过Win32对话框处理。","A string that contains \"ListView\".":"一个包含“ ListView”的字符串。"," if the user can sort the columns; otherwise, ":"如果用户可以对列进行排序； 否则，"," control that includes a gap for the ":"控制包括差距","Parameters for dialog actions.":"对话操作的参数。","The hash code of the text anchor instance.":"文本锚点实例的哈希码。"," for the view that this ":"对于这个观点","The horizontal offset for the cells panel. The registered default is 0.0. For more information about what can influence the value, see ":"细胞面板的水平偏移。 注册默认值为0.0。 有关影响价值的内容的更多信息，请参阅"," for this control.":" 于该控制。","The style applied to the cells in the ":"应用于单元格的样式","Handle to the window that owns the dialog box.":"处理拥有对话框的窗口。","The end position of the text anchor.":"文本锚点的结束位置。"," is a Cancel button; otherwise, ":"是一个取消按钮； 否则，"," is using. Default ":" 正在使用。 违约情况 ","The beginning position of the text anchor.":"文本锚的开始位置。","One of the enumeration values that indicates how content is copied to the clipboard. The registered default is ":"指示内容如何复制到剪贴板的枚举值之一。 注册默认值为","If the user clicks the OK button of the dialog that is displayed (e.g. ":"如果用户单击显示的对话框的确定按钮（例如"," is the default button; otherwise, ":"是默认按钮； 否则，"," implementation uses the ":"实施使用","The name of the resource to find.":"要查找的资源名称。","), ":"），"," if the button is activated when the user presses ENTER; otherwise, ":"如果用户按ENTER激活该按钮； 否则，","The height of the column headers row, in device-independent units (1/96th inch per unit). The registered default is ":"柱标头行的高度，独立于设备的单元（单位1/96英寸）。 注册默认值为","The interface instance that is associated with this ":"与此关联的接口实例","The requested resource object. If the requested resource is not found, a ":"请求的资源对象。 如果找不到请求的资源，则","The style applied to all column headers in the ":"该样式应用于所有列标题","A text representation of the selected date, or an empty string if ":"所选日期的文本表示形式，或一个空字符串","The relative ":"亲戚","Handle to the window that owns the dialog.":"处理拥有对话框的窗口。","A string that contains \"MediaElement\".":"包含“媒体”的字符串。","A collection of dates that cannot be selected. The default value is an empty collection.":"无法选择的日期集合。 默认值是一个空集合。"," that maps to a loose resource.":"将其映射到一个松散的资源。","The collection of columns in the ":"列的集合"," that is attached or associated with a dialog.":" 它与对话框附加或关联。","The current style of the ":"当前风格","A string that contains \"Menu\".":"一个包含“菜单”的字符串。"," that contains a content data file that is located at the specified ":"其中包含一个位于指定的内容数据文件","Message to be processed by the Win32 dialog.":"消息将通过Win32对话框处理。","The width and sizing mode of the columns and headers, in device-independent units (1/96th inch per unit). The registered default is ":"列和标头的宽度和大小模式，独立于设备的单位（每单位1/96英寸）。 注册默认值为","The date to display. The default is ":"显示日期。 默认值为","A string that contains \"MenuItem\".":"包含“ menuitem”的字符串。",". If a loose resource is not found, null is returned.":"。 如果找不到松散的资源，则返回空。","Information about the cell that has focus.":"有关重点的细胞的信息。"," to indicate success; otherwise, a non-zero value is returned to indicate failure.":"表明成功； 否则，将返回非零值以表示故障。","The last date that is available in the calendar.":"日历中可用的最后日期。","The toggle state of the control.":"控件的切换状态。"," that specifies the location for which a cookie was created.":" 它指定创建cookie的位置。","The column that contains the current cell. The registered default is ":"包含当前单元格的列。 注册默认值为"," if the user clicks the OK button of the dialog that is displayed (for example, ":"如果用户单击显示的对话框的确定按钮（例如，","A string that contains \"NavigationWindow\".":"一个包含“ navigationWindow”的字符串。","The first date that is available in the calendar. The default is ":"日历中可用的第一个日期。 默认值为","The data item bound to the row that contains the current cell. The registered default is ":"数据项绑定到包含当前单元格的行。 注册默认值为"," representation of ":"表示"," value, if the cookie exists; otherwise, a ":" 值，如果cookie存在；否则，a ","A value that indicates what length of time the ":"一个值表示时间长度的值","A string that contains \"PasswordBox\".":"一个包含“密码框”的字符串。"," that maps to a loose resource at the site of origin.":"这将原始地点的宽松资源映射到。"," command that indicates the intention to delete the current row.":"指示删除当前行的意图的命令。"," that contains the full pathname for any files selected from either ":"其中包含从任何一个选择的任何文件的完整路径名"," should display.":"应该显示。","The value of a control.":"控件的值。"," that contains a resource stream for a site-of-origin data file that is located at the specified ":"其中包含一个位于指定的Origin数据文件的资源流","The style applied to a column header when dragging. The registered default is ":"拖动时，该样式应用于列标题。 注册默认值为"," if extensions are added; otherwise, ":"如果添加扩展； 否则，","A string that contains \"ProgressBar\".":"一个包含“ progressbar”的字符串。",". If the loose resource is not found, ":"。 如果找不到松散的资源，"," that represents the beginning of the week. The default is the ":"这代表了本周的开始。 默认值是","The style applied to a column header. The registered default is ":"该样式应用于列标题。 注册默认值为"," if warnings are displayed; otherwise, ":"如果显示警告； 否则，",", this method returns the current instance of the ":"，此方法返回的当前实例 "," that is determined by the current culture.":"这取决于当前文化。"," that maps to an embedded resource.":"将其映射到嵌入式资源。"," if column virtualization is enabled; otherwise, ":"如果启用了虚拟化列； 否则，",". The default in this base class is ":"。 该基类的默认值为"," if the value is read-only; otherwise ":"如果值仅读取； 否则"," if the current date is highlighted; otherwise, ":"如果当前日期突出显示； 否则，"," that contains a resource stream for resource data file that is located at the specified ":"其中包含用于资源数据文件的资源流，该文件位于指定的","The large-change value.":"大变化值。","The list of custom places.":"自定义位置列表。","An object of the same type as the root element of the XAML file.":"与XAML文件的根元素相同类型的对象。"," if row virtualization is enabled; otherwise, ":"如果启用了行虚拟化； 否则，","The small-change value.":"小变化值。","The date currently selected. The default is ":"当前选择的日期。 默认值为","The default extension string. The default is ":"默认扩展字符串。 默认值为"," that maps to a relative XAML file.":"该映射到相对XAML文件。","The key that references the default brush for a focused cell.":"引用聚焦单元格的默认画笔的键。","The control type for the ":"控制类型","An instance of the root element specified by the XAML file loaded.":"加载XAML文件指定的根元素的实例。"," to return the location referenced; ":"返回引用的位置；","The number of non-scrolling columns. The registered default is 0. For more information about what can influence the value, see ":"非滚动列的数量。 注册默认值为0。有关影响该值的更多信息，请参见","A string that contains \"RadioButton\".":"一个包含“ Radiobutton”的字符串。"," if the element is selected; otherwise ":"如果选择元素； 否则"," to return the shortcut location. The default is ":"返回快捷位置。 默认值为"," application exit code that is returned to the operating system when the application shuts down. By default, the exit code value is 0.":" 应用程序关闭时返回给操作系统的应用程序退出代码。 默认情况下，退出代码值为0。","The selection container.":"选择容器。"," that opens automatically when an application starts.":"当应用程序启动时，这会自动打开。"," that is the full path of the file selected in the file dialog. The default is ":"这就是文件对话框中选择的文件的完整路径。 默认值为"," that specifies the location for which the cookie should be created.":"这指定了应该创建cookie的位置。"," that contains one file name for each selected file. The default is an array with a single item whose value is ":"其中包含每个选定文件的一个文件名。 默认值是一个带有一个项目的数组，其值为"," that contains the cookie data.":"其中包含cookie数据。"," that contains the filter. The default is ":" 包含过滤器。 默认值为 ","An integer exit code for an application. The default exit code is 0.":"应用程序的整数退出代码。 默认退出代码为0。",", which means that no filter is applied and all file types are displayed.":"，这意味着没有应用过滤器，并且显示所有文件类型。"," that is the index of the selected filter. The default is 1.":"那是所选过滤器的索引。 默认值为1。","The name of the requested ambient property.":"请求的环境属性的名称。"}