{" to which this node belongs.":"该节点所属的。","The string of white space characters.":"白空间字符的字符串。"," is successful moving to the child node; otherwise, ":"成功地搬到孩子节点； 否则，","The text contained in the element that was read. An empty string if the element is empty.":"读取的元素中包含的文本。 如果元素为空，则为一个空字符串。"," is bk for the element <bk:book>. If there is no prefix, this property returns String.Empty.":"是元素<bk：book>的bk。 如果没有前缀，则此属性返回string.empty。","The parent of this node.  \n  \n For ":"该节点的父母。 \n  \n  为了","The stream to which the ":"流到","The name to check.":"要检查的名称。"," of the child node to move to.":"儿童节点搬到。",". If there is no preceding node, ":"。 如果没有前一个节点，"," nodes, this property is always ":"节点，这个属性始终是"," is writing or ":"是写作或"," that generated the event.":"这产生了事件。","The local name to check.":"要检查的本地名称。"," is successful moving to the first sibling node of the current node; ":"成功地移至当前节点的第一个兄弟姐妹节点；","The qualified name; see the ":"合格的名称； 看到"," was constructed using a ":"是使用一个","The public identifier; see the ":"公共标识符； 看到","The namespace URI to check.":"要检查的名称空间URI。","The old parent ":"老父母"," if there is no first sibling, or if the ":"如果没有第一个兄弟姐妹，或者","The system identifier; see the ":"系统标识符； 看到"," that does not inherit from the ":"那不是从"," is currently positioned on an attribute node. If the ":"当前位于属性节点上。 如果是","The DTD internal subset; see the ":"DTD内部子集； 看到","All the XML content, including markup, in the current node. If the current node has no children, an empty string is returned.  \n  \n If the current node is neither an element nor attribute, an empty string is returned.":"当前节点中的所有XML内容，包括标记。 如果当前节点没有子节点，则返回空字符串。  \n  \n 如果当前节点既不是元素也不是属性，则返回空字符串。"," is already positioned on the first sibling, ":"已经放在第一个兄弟姐妹上了","The old value of the ":"的旧值 "," (no special formatting).":" （没有特殊格式）。","The parent document.":"父文档。","All the XML content, including markup, in the current node. If the current node has no children, an empty string is returned.":"当前节点中的所有XML内容，包括标记。 如果当前节点没有孩子，则返回一个空字符串。"," will return ":"将返回","Number of ":"数量","The new value of the ":"新价值"," and will not move its position.  \n  \n If ":"并且不会移动其位置。 \n  \n  如果","If the reader is positioned on an element or an attribute node, this method returns all the XML content, including markup, of the current node and all its children; otherwise, it returns an empty string.":"如果读者位于元素或属性节点上，则此方法将返回当前节点及其所有子女的所有XML内容，包括标记； 否则，它将返回一个空字符串。"," to clone only the node itself. For document type nodes, the cloned node always includes the subtree, regardless of the parameter setting.":" 仅克隆节点本身。 对于文档类型节点，克隆的节点始终包括子树，而不考虑参数设置。"," for each level. The default is 2.":"对于每个级别。 默认值为2。"," nodes. The returned ":"节点。 返回","One of the enumeration values that describes the node change event. The ":"描述节点更改事件的枚举值之一。 该 ","The character to use for indenting. The default is space.":"用于缩进的角色。 默认值是空间。"," is read-only.":"是只读的。","The contents of the element or an empty string.":"元素或空字符串的内容。"," because there is no first sibling, or if ":" 因为没有第一个兄弟姐妹，或者如果 ","The DTD internal subset on the DOCTYPE. If there is no DTD internal subset, String.Empty is returned.":"DTD内部子集中的Doctype。 如果没有DTD内部子集，则返回string.empty。"," value does not differentiate between when the event occurred (before or after). You can create separate event handlers to handle both instances.":"值不会区分事件发生的时间（之前或之后）。 您可以创建单独的事件处理程序来处理这两个实例。","A new XML reader instance set to ":"一个新的XML读取器实例设置为"," to support namespaces; otherwise, ":"支持名称空间； 否则，"," is currently positioned on an attribute, the position of the ":"目前位于属性上",".  \n  \n The default is ":"。 \n  \n  默认值为",". Calling the ":"。 打电话"," if the node is read-only; otherwise, ":"如果节点是只读的； 否则，"," after the operation completes. This property returns ":"操作完成后。 此属性返回"," is successful moving to the first attribute of the current node; otherwise, ":" 是否成功移动到当前节点的第一个属性；否则, ","The character to use to quote attribute values. This must be a single quote (&#39;) or a double quote (&#34;). The default is a double quote.":"用于引用属性值的字符。 这必须是单个报价（＆＃39;）或双引号（＆＃34;）。 默认值是双引号。"," if the node is being removed. For attribute nodes, this property returns the ":"如果节点被删除。 对于属性节点，此属性返回",".  \n  \n Because DocumentType nodes are read-only, this property always returns ":"。 \n  \n  因为DocumentType节点仅读取，所以此属性总是返回"," method positions the new reader on the node that was current before the call to the ":"方法将新读取器定位在呼叫之前的当前节点上"," in the current scope.":"在当前范围中。","The new value of the node. This property returns ":"节点的新值。 此属性返回","For DocumentType nodes, this property returns the name of the document type.":"对于DocumentType节点，此属性返回文档类型的名称。"," is successful moving to the first child node of the current node; otherwise, ":"成功地移至当前节点的第一个子节点； 否则，","The qualified name of the element you wish to move to.":"您希望移至的元素的合格名称。"," representing the current ":"代表电流","For DocumentType nodes, this value is XmlNodeType.DocumentType.":"对于DocumentType节点，此值是xmlnodetype.documentType。"," if the node is neither an attribute nor a text node, or if the node is being removed.  \n  \n If called in a ":"如果节点既不是属性也不是文本节点，也不是节点。 \n  \n  如果叫"," if a matching descendant element is found; otherwise ":"如果找到匹配的后代元素； 否则","The public identifier on the DOCTYPE. If there is no public identifier, ":"Doctype上的公共标识符。 如果没有公共标识符，"," is successful moving to the first namespace node; otherwise, ":"成功地移至第一个名称空间节点； 否则，"," event, ":"事件，"," scope.  \n  \n ":"范围。"," value describing the namespace scope.":"描述名称空间范围的值。"," returns the value of the node if the change is successful. If called in a ":"如果更改成功，将返回节点的值。 如果叫","The system identifier on the DOCTYPE. If there is no system identifier, ":"Doctype上的系统标识符。 如果没有系统标识符，",". If a matching child element is not found, the ":"。 如果找不到匹配的子元素，","The type of object to return. The current implementation only returns ":"返回的对象类型。 当前实现只返回 "," is positioned on the end tag (":"位于末端标签上（"," returns the current value of the node.":"返回节点的当前值。"," moved successfully; otherwise, ":"成功地移动； 否则，","The namespace prefix; see the ":"名称空间前缀； 看到","The absolute URI, or ":"绝对URI或"," that is being added, removed or changed; this property never returns ":"正在添加，删除或更改； 此属性永远不会返回"," object positioned on the element boundary which the current ":"位于电流的元素边界上","The local name; see the ":"本地名称； 看到","The cache policy for the underlying web request.":"基础Web请求的缓存策略。",") of the element.  \n  \n If the ":")的元件。  \n  \n 如果 ","The namespace URI; see the ":"名称空间URI； 看到"," will not move past while searching for the following element.":"在搜索以下元素时不会移动。"," before the operation began. This property returns ":"在操作开始之前。 此属性返回"," of the XML fragment. This determines what the fragment can contain (see table below).":"XML片段。 这确定了片段可以包含的内容（请参见下表）。"," is not positioned on an element when ":"当"," to clone only the node itself (and its attributes if the node is an ":"仅克隆节点本身（如果节点为一个"," if the node did not have a parent. For attribute nodes, this property returns the ":"如果节点没有父母。 对于属性节点，此属性返回"," of the element. The ":"元素。 这"," was called, this method returns ":"被称为，此方法返回","The original value of the node. This property returns ":"节点的原始值。 此属性返回"," in which the XML fragment is to be parsed. This includes the ":"其中XML片段将被解析。 这包括","The name of the attribute to retrieve. This is a qualified name. It is matched against the ":"要检索的属性的名称。 这是一个限定名称。 它与 "," cannot be ":" 不能是 "," to use, encoding, namespace scope, current ":"使用，编码，名称空间范围，当前"," if the node is neither an attribute nor a text node, or if the node is being inserted.  \n  \n If called in a ":"如果节点既不是属性也不是文本节点，也不是插入节点。 \n  \n  如果叫"," and the position of the ":"以及"," property of the matching node.":"匹配节点的属性。"," value of the node to which you want to move.":"您要移动的节点的值。"," is not changed.":"没有改变。"," returns the current value of the node that will be replaced if the change is successful. If called in a ":"返回如果更改成功，将替换的节点的当前值。 如果叫"," of the XML fragment. This also determines what the fragment string can contain (see table below).":"XML片段。 这也确定片段字符串可以包含的内容（请参见下表）。"," is successful moving; otherwise, ":"成功搬家； 否则，","The value of the specified attribute. An empty string is returned if a matching attribute is not found or if the attribute does not have a specified or default value.":"指定属性的值。 如果找不到匹配属性或属性没有指定或默认值，则返回一个空字符串。"," returns the value of node prior to the change.":"在更改之前返回节点的值。"," to use, encoding, namespace scope, current xml:lang, and xml:space scope.":"使用，编码，名称空间范围，当前XML：lang和XML：空间范围。","The local name of the element you wish to move to.":"您希望移至的元素的本地名称。"," to read from while validating. The current implementation supports only ":"在验证时阅读。 当前的实施仅支持",", the position of the navigator is unchanged.":"，导航仪的位置不变。","The namespace URI of the element you wish to move to.":"您希望移至的元素的名称空间URI。","The local name of the attribute to retrieve.":"要检索的属性的本地名称。"," containing the event data.":" 包含所述事件数据。","The prefix whose namespace Uniform Resource Identifier (URI) you want to resolve. To match the default namespace, pass an empty string.":"您要解决的名称空间统一资源标识符（URI）的前缀。 要匹配默认名称空间，请传递一个空字符串。","The namespace prefix of the namespace node.":"名称空间节点的名称空间前缀。","The namespace URI of the attribute to retrieve.":"要检索的属性的名称空间URI。"," if a matching element is found; otherwise ":" 如果找到匹配的元素；否则 ",", the position of the reader does not change.":"，读者的位置不会改变。","An enumerator used to iterate through the collection of nodes.":"枚举者曾经通过节点的集合进行迭代。"," is in an end of file state.":"处于文件状态。"," is successful moving to the specified namespace; ":"成功移至指定的名称空间；"," if a matching attribute was not found.":" 如果未找到匹配的属性。","The contents of the element or text node. This can be an empty string if the reader is positioned on something other than an element or text node, or if there is no more text content to return in the current context.":"元素或文本节点的内容。 如果将读者放在元素或文本节点以外的其他内容上，或者如果没有更多的文本内容可以在当前上下文中返回，则可以是一个空字符串。","The qualified name of the sibling element you wish to move to.":"您希望搬到的兄弟姐妹元素的合格名称。","The zero-based index into the list of nodes.":"基于零的索引进入节点列表。"," if a matching namespace node was not found, or if the ":"如果找不到匹配的名称空间节点，或者","The name tag to match. This is a qualified name. It is matched against the ":"匹配的名称标签。 这是一个合格的名字。 它与"," if a matching sibling element is found; otherwise ":"如果找到匹配的同级元素； 否则","The common language runtime type for the specified XML Schema type.":"指定的XML模式类型的通用语言运行时类型。"," with the specified index in the collection. If ":"包含集合中的指定索引。 如果"," is not positioned on an element node. If ":"不在元素节点上。 如果"," property of the matching node. The asterisk (*) is a special value that matches all tags.":"匹配节点的属性。 星号（*）是与所有标签匹配的特殊值。",". If a matching sibling element is not found, the ":"。 如果找不到匹配的兄弟姐妹，"," is greater than or equal to the number of nodes in the list, this returns ":"大于或等于列表中的节点数量，这是返回的"," object that identifies the scope of the reader.":"标识读者范围的对象。",") of the parent element.":"）父元素。"," is successful moving to the next sibling node; otherwise, ":"成功地转到下一个兄弟节点； 否则，"," containing a list of all matching nodes. The list is empty if there are no matching nodes.":"包含所有匹配节点的列表。 如果没有匹配的节点，则列表为空。","The number of nodes in the ":"节点数量","The local name of the sibling element you wish to move to.":"您希望搬到的兄弟姐妹元素的本地名称。","The local name to match. The asterisk (*) is a special value that matches all tags.":"匹配的本地名称。 星号（*）是与所有标签匹配的特殊值。"," object that identifies the namespaces in scope.":"标识范围中名称空间的对象。"," if there are no more siblings or if the ":"如果没有更多的兄弟姐妹或"," with the specified index in the collection. If index is greater than or equal to the number of nodes in the list, this returns ":"包含集合中的指定索引。 如果索引大于或等于列表中的节点数量，则返回"," is currently positioned on an attribute node. If ":"当前位于属性节点上。 如果"," you want to read.":"您想阅读。","The namespace URI to match.":"名称空间URI要匹配。","A string value that contains the namespace Uri that is associated with the prefix.":"包含与前缀关联的名称空间URI的字符串值。","The namespace URI of the sibling element you wish to move to.":"要移动到的同级元素的命名空间URI。"," if a matching sibling element is found; otherwise, ":"如果找到匹配的同级元素； 否则，","The local name of the next sibling node to move to.":"要移动到的下一个同级节点的本地名称。","The index of the attribute. The index is zero-based. (The first attribute has index 0.)":"属性的索引。 该索引基于零。 （第一个属性具有索引0。）","The name of the attribute to find. This is a qualified name. It is matched against the ":"要查找的属性名称。 这是一个合格的名字。 它与","The namespace that is associated with the prefix.":"与前缀关联的名称空间。","The value of the specified attribute.":"指定属性的值。","The array of characters that serves as the buffer to which the text contents are written. This value cannot be ":"字符数组用作文本内容的缓冲区。 这个值不能是","A string value that contains the namespace prefix that is associated with the ":"字符串值包含与之关联的名称空间前缀"," if the current node has the specified attribute; otherwise, ":"如果当前节点具有指定的属性； 否则，","The value of the specified attribute. If the attribute is not found, ":"指定属性的值。 如果找不到属性，","The namespace URI of the next sibling node to move to.":"下一个兄弟节点的名称空间URI移至。","The offset within the buffer where the ":"缓冲区内的偏移"," class returns ":"课程返回"," is successful moving to the next sibling node; ":"成功地转到下一个兄弟节点；","The local name of the attribute to find.":"要查找的属性的本地名称。","The prefix whose namespace URI you want to resolve. To match the default namespace, pass an empty string. This string does not have to be atomized.":"您要解决的名称空间URI的前缀。 要匹配默认名称空间，请传递一个空字符串。 该字符串不必被雾化。"," if there are no more siblings, or if the ":"如果没有更多的兄弟姐妹，或者"," can start to copy the results.":"可以开始复制结果。","The namespace URI to which the prefix maps or ":"前缀映射或","The encoding value. If no encoding attribute exists, and there is not byte-order mark, this defaults to UTF-8.":"编码值。 如果不存在编码属性，并且没有字节订单标记，则将其默认为UTF-8。","The namespace URI of the attribute to find.":"要查找的属性的名称空间URI。","The maximum number of characters to copy into the buffer. The actual number of characters copied is returned from this method.":"要复制到缓冲区的最大字符数。 从此方法返回复制的字符数。"," of the sibling node to move to.":"兄弟节点移至。","The name of the attribute to remove. This is a qualified name. It is matched against the ":"要删除的属性名称。 这是一个合格的名字。 它与"," is specified, it defaults to EntityHandling.ExpandEntities.":"已指定，默认为EntityHandling.ExpAndities。"," if no matching prefix is found.":"如果找不到匹配的前缀。"," is successful moving to the next attribute; ":"成功地转到下一个属性；","The number of characters read into the buffer. The value zero is returned when there is no more text content.":"字符的数量读取到缓冲区中。 当不再有文本内容时返回值零。","The local name of the attribute to remove.":"要删除的属性的本地名称。","The current line number. The starting value for this property is 1.":"当前行号。 该属性的起始值为1。"," if the attribute is found; otherwise, ":"如果找到属性； 否则，","The number of attributes on the current node.":"当前节点上的属性数。"," if there are no more attributes. If ":"如果没有更多的属性。 如果",", the reader's position does not change.":"，读者的位置不会改变。","The current line position. The starting value for this property is 1.":"当前的线位置。 该属性的起始值为1。"," implements the ":"实现","The namespace URI of the attribute to remove.":"要删除的属性的命名空间URI。"," is successful moving to the next namespace node; otherwise, ":"成功地移至下一个名称空间节点； 否则，","The attribute node removed or ":"删除属性节点或"," that enables you to get the atomized version of a string within the node.":"这使您可以在节点内获取字符串的雾化版本。"," if the reader is positioned on an attribute (the reader moves to the element that owns the attribute); ":"如果读者位于属性上（读者移至拥有属性的元素）；"," method; otherwise ":"方法; 否则"," is successful moving to the parent node of the current node; otherwise, ":"成功地移至当前节点的父节点； 否则，"," specified in the constructor.":"在构造函数中指定。"," if there is no node at the given index.":"如果给定索引没有节点。",", the node has a value of ":"，节点的值为"," is successful moving to the previous sibling node; otherwise, ":"成功地移至先前的兄弟节点； 否则，"," if the reader is not positioned on an attribute (the position of the reader does not change).":"如果读者未在属性上放置（读者的位置不会改变）。"," to use for validation.":"用于验证。",") that ends with ":"）以"," if an attribute exists (the reader moves to the first attribute); otherwise, ":"如果存在属性（读取器移至第一个属性）； 否则，"," if there is no previous sibling node or if the ":"如果没有以前的兄弟节点或","The removed ":"被移除的 "," depending whether the node value is a built in XML Schema definition language (XSD) type or a user defined simpleType or complexType; ":"取决于节点值是内置的XML模式定义语言（XSD）类型还是用户定义的SimpleType或ComplextyType；",", and so on), this property returns ":"，等等），此属性返回"," object used to create a new child node at the beginning of the list of child nodes of the current node.":"对象用于在当前节点的子节点列表的开头创建一个新的子节点。"," (the position of the reader does not change).":" （阅读器的位置不改变）。"," if the current node has no schema type.":"如果当前节点没有架构类型。","One of the enumeration values that specify the type of the current node.":"指定当前节点的类型的枚举值之一。"," does not have a matching attribute node.":" 不具有匹配的属性节点。"," object that contains the current node and its child nodes.":"包含当前节点及其子节点的对象。","The quotation mark character (\" or ') used to enclose the value of an attribute node.":"引号标记字符（“或'）用于封闭属性节点的值。"," node to remove. If the removed attribute has a default value, it is immediately replaced.":"节点要删除。 如果删除的属性具有默认值，则立即更换。"," values. If this property is not set, it defaults to ValidationType.Auto.":"值。 如果未设置此属性，则默认为validationType.auto。"," if there is a next attribute; ":"如果有下一个属性；"," positioned on the last sibling node in the range to replace.":"位于范围内的最后一个兄弟姐妹节点上。"," is not an attribute node of the ":"不是"," if there are no more attributes.":"如果没有更多的属性。",", external resources are not resolved.  \n  \n In version 1.1 of the .NET Framework, the caller must be fully trusted to specify an ":"，外部资源无法解决。 \n  \n  在.NET框架的1.1版中，必须完全信任呼叫者以指定","One of the enumeration values that specifies the state of the reader.":"指定读者状态的枚举值之一。"," object used to specify the replacement range.":"用于指定替换范围的对象。","The name of the attribute to create or alter. This is a qualified name. If the name contains a colon it is parsed into prefix and local name components.":"创建或更改的属性名称。 这是一个合格的名字。 如果该名称包含一个结肠，则将其解析为前缀和本地名称组件。"," if the next node was read successfully; ":"如果下一个节点被成功读取；"," to clone only the node itself. For white space nodes, the cloned node always includes the data value, regardless of the parameter setting.":"仅克隆节点本身。 对于白空间节点，无论参数设置如何，克隆的节点始终包含数据值。"," object containing the schema information for the current node. Schema information can be set on elements, attributes, or on text nodes with a non-null ":" 包含当前节点的架构信息的对象。 架构信息可以在元素、属性或非空文本节点上设置 ","The XML data string for the new node.":"新节点的XML数据字符串。"," if there are no more nodes to read.":"如果没有更多的节点可阅读。","The value to set for the attribute.":"为属性设置的值。"," nodes, the value is ":"节点，值是"," if there are nodes to return.  \n  \n ":"如果有节点要返回。"," (typed values).  \n  \n If the current node is not one of the above node types, or if the ":"（键入值）。 \n  \n  如果当前节点不是上述节点类型之一，或者"," object positioned on the XML data for the new node.":"对象位于新节点的XML数据上。"," node to add to the attribute collection for this element.":" 要添加到此元素的属性集合的节点。"," instance does not report schema information, this property returns ":"实例不报告模式信息，此属性返回","The stream to which you want to write. The ":"您要编写的流。 这"," if the reader is not positioned on an attribute node when the initial call is made or if all the attribute values have been read.  \n  \n An empty attribute, such as, ":"如果读取器在进行初始调用时或读取所有属性值时未将读取器放在属性节点上。 \n  \n  一个空属性，例如","If the attribute replaces an existing attribute with the same name, the old ":"如果属性用同名替换现有属性，则"," object positioned on the new node.":"位于新节点上的对象。",".  \n  \n If this property is called from an ":"。 \n  \n  如果此属性是从"," writes XML 1.0 text syntax and appends it to the specified stream.":"将XML 1.0文本语法写入并将其附加到指定的流。"," with a single node with a value of String.Empty.":" 具有值为String的单个节点。空的。"," representing an XPath expression.":"代表XPath表达式。"," object used to configure the new ":"用于配置新的对象"," object, this property always returns ":"对象，此属性总是返回"," is returned; otherwise, ":"退回； 否则，","The buffer into which to copy the resulting text. This value cannot be ":"用于复制结果文本的缓冲区。 这个值不能是"," pointing to the selected node set.":"指向选定的节点集。"," instance. If this is ":"实例。 如果是",". These ":"。 这些",", a ":"， 一个"," that points to the selected node set.":"这指向选定的节点集。"," containing the list of attributes for this node.":"包含此节点的属性列表。","The offset into the buffer where to start copying the result.":"偏移到缓冲区开始复制结果。"," implementations do not expose schema information through the ":"实施不会通过"," object containing the compiled XPath query.":"包含编译XPath查询的对象。","The maximum number of bytes to copy into the buffer. The actual number of bytes copied is returned from this method.":"复制到缓冲区的最大字节数。 从此方法返回了复制的字节数。"," if the current node has attributes; otherwise, ":"如果当前节点具有属性； 否则，"," with default settings is used.  \n  \n If the ":"使用默认设置。 \n  \n  如果是"," object used to create this reader instance. If this reader was not created using the ":"用于创建此阅读器实例的对象。 如果未使用该读者创建此读者","The local name of the ancestor nodes.":"祖先节点的本地名称。","The number of bytes written to the buffer.":"写入缓冲区的字节数。","The concatenated values of the node and all its children.":"节点及其所有子女的串联值。"," method, this property returns ":"方法，此属性返回"," is being used with the ":"正在与","The namespace URI of the ancestor nodes.":"祖先节点的名称空间URI。","The contents of the element or text-like node (This can include CDATA, Text nodes, and so on). This can be an empty string if the reader is positioned on something other than an element or text node, or if there is no more text content to return in the current context.  \n  \n ":"元素或文本式节点的内容（这可以包括CDATA，文本节点等）。 如果将读者放在元素或文本节点以外的其他内容上，或者如果没有更多的文本内容可以在当前上下文中返回，则可以是一个空字符串。"," if the element is to be serialized in the short tag format \"<item/>\"; ":"如果要以简短的标签格式序列化“ <item/>”；"," of the node. The following table lists node types that have a value to return. All other node types return ":"节点。 下表列出了具有值得返回的值的节点类型。 所有其他节点类型返回"," method, you should use the ":"方法，您应该使用"," for the long format \"<item></item>\".  \n  \n When setting this property, if set to ":"对于长格式“ <项目> </item>”。 \n  \n  设置此属性时，如果设置为","To include the context node in the selection, ":"为了在选择中包括上下文节点，","The CLR type that corresponds to the typed value of the node. The default is ":"与节点的键入值相对应的CLR类型。 默认值为"," The text node can be either an element or an attribute text node.":"文本节点可以是元素或属性文本节点。"," property to obtain an ":"财产以获得"," object that contains the namespaces that are in scope.":"包含范围中的名称空间的对象。"," if asynchronous methods can be used; otherwise, ":"如果可以使用异步方法； 否则，"," object with the correct settings. This ensures that the created ":"具有正确设置的对象。 这确保了创造的"," that contains the selected nodes. The returned nodes are in reverse document order.":"其中包含选定的节点。 返回的节点处于反向文档顺序。",", the children of the element are removed and the element is serialized in the short tag format. If set to ":"，删除元素的孩子，并以短标签格式序列化。 如果设置为"," that contains the namespace prefix.":"其中包含名称空间前缀。"," of the ancestor nodes.":"祖先节点。"," to do character checking; otherwise ":"进行角色检查； 否则",", the value of the property is changed (regardless of whether or not the element has content); if the element is empty, it is serialized in the long format.  \n  \n This property is a Microsoft extension to the Document Object Model (DOM).":"，属性的价值会更改（无论该元素是否具有内容）； 如果元素为空，则以长格式序列化。 \n  \n  此属性是文档对象模型（DOM）的Microsoft扩展。"," object has the correct output settings.":"对象具有正确的输出设置。"," that contains the namespace name.":"其中包含名称名称。","The local name of the child nodes.":"儿童节点的本地名称。","The name of the current node with the prefix removed. For example, ":"删除带有前缀的当前节点的名称。 例如，"," to which you want to write. The ":"您要写的。 这"," to close the underlying stream or ":"关闭基础流或"," object that identifies the namespace.":"标识名称空间的对象。","The namespace URI of the child nodes.":"儿童节点的名称空间URI。"," when the reader is closed; otherwise ":"当读者关闭时； 否则"," is book for the element <bk:book>.":"是元素<bk：book>的书。"," object that contains the namespace prefix.":"包含名称空间前缀的对象。"," writes XML 1.0 text syntax and appends it to the specified ":"写XML 1.0文本语法并将其附加到指定的"," that contains the selected nodes.":"其中包含选定的节点。","The qualified name of the node. For ":"节点的合格名称。 为了","One of the enumeration values that specifies the level of conformance that the XML reader will enforce. The default is ":"指定XML读取器将执行的符合级别的枚举值之一。 默认值为","The number of attributes on the current node. This number includes default attributes.":"当前节点上的属性数。 此数字包括默认属性。","The file to which you want to write. The ":"您要编写的文件。 这"," of the child nodes.":"儿童节点。"," nodes, this is the tag name of the element.":"节点，这是元素的标签名称。","The base URI of the current node.":"当前节点的基础URI。","One of the enumeration values that determines the processing of DTDs. The default is ":"决定DTD处理的枚举值之一。 默认值为"," creates a file at the specified path and writes to it in XML 1.0 text syntax. The ":"在指定的路径上创建文件，然后在XML 1.0文本语法中写入文件。 这","The local name of the descendant nodes.":"后代节点的本地名称。"," to ignore comments; otherwise ":"忽略评论； 否则"," if the binary content read methods are implemented; otherwise ":"如果实现了二进制内容读取方法； 否则","The namespace URI of this node. If there is no namespace URI, this property returns String.Empty.":"该节点的名称空间URI。 如果没有名称空间URI，此属性将返回String.empty。"," must be a file system path.":"必须是文件系统路径。","The namespace URI of the descendant nodes.":"后代节点的名称空间URI。"," immediately following this element.":"立即遵循此元素。"," to ignore processing instructions; otherwise ":"忽略处理说明； 否则"," to which to write to. Content written by the ":"要写信给。 内容由"," class always returns ":"课程总是返回"," to ignore white space; otherwise ":"忽略空白； 否则"," nodes, this value is XmlNodeType.Element.":"节点，此值是xmlNodeType.element。"," to include the context node in the selection; otherwise, ":" 以将所述上下文节点包括在所述选择中；否则, "," to which this element belongs.":"此元素所属的。"," is appended to the ":"附加到"," if the reader can parse and resolve entities; otherwise, ":"如果读者可以解析并解决实体； 否则，"," of the descendant nodes.":"后代节点。","The line number offset. The default is 0.":"线号偏移。 默认值为0。"," always returns ":"总是返回"," object containing the post schema validation infoset of this node.":"包含该节点的验证后验证信息的对象。"," object that you want to use as the underlying writer.":"您要用作基础作者的对象。"," object that contains the first matching node for the XPath query specified; otherwise, ":"包含指定XPath查询的第一个匹配节点的对象； 否则，"," from which the method is called.":"从中调用该方法。","The line position offset. The default is 0.":"线位置偏移。 默认值为0。","The depth of the current node in the XML document.":"XML文档中当前节点的深度。"," object that is wrapped around the specified ":"包裹在指定的对象"," nodes, String.Empty is returned.":"节点，string.empty返回。"," if there are no query results.":"如果没有查询结果。"," object used to resolve namespace prefixes in the XPath query.":"用于解析 XPath 查询中的命名空间前缀的对象。","The maximum allowable number of characters from expanded entities. The default is 0.":"扩展实体的最大允许数量字符数。 默认值为0。"," if the reader is positioned at the end of the stream; otherwise, ":"如果读者位于流的末端； 否则，",".  \n  \n Because ":"。 \n  \n  因为"," object that contains the first matching node for the XPath query specified; otherwise ":"包含指定XPath查询的第一个匹配节点的对象； 否则","The matching prefix or ":"匹配的前缀或"," if the node on which the reader is currently positioned can have a ":"如果读者当前定位的节点可以有一个","The maximum allowable number of characters in an XML document. The default is 0.":"XML文档中最大允许数量的字符。 默认值为0。"," from which to copy the attributes.":"从中复制属性。"," nodes are read-only, this property always returns ":"节点是只读的，此属性总是返回","The new typed value of the node.":"节点的新键入值。","The new value of the node.":"节点的新值。"," if the current node is an attribute whose value was generated from the default value defined in the DTD or schema; ":"如果当前节点是从DTD或架构中定义的默认值生成的值的属性；"," that stores all the atomized strings used by all ":"存储所有人使用的所有原子串","The namespace URI to associate with the attribute.":"与属性相关联的名称空间URI。"," nodes, this property returns the name of the entity.":"节点，此属性返回实体的名称。"," if the attribute value was explicitly set.":"如果属性值已明确设置。"," that contains the text value of the current node.":"其中包含当前节点的文本值。","The namespace prefix of the attribute.":"属性的名称空间前缀。","The name of the entity.":"实体的名称。"," instances created using this ":"使用此实例创建的实例"," object.  \n  \n The default is ":"目的。 \n  \n  默认值为"," if the current node is an element (":"如果当前节点是一个元素（"," to return the current node's value as.":"要返回当前节点的值。"," nodes, the value is XmlNodeType.Entity.":"节点，该值是xmlnodeType.entity。","The text to place inside the CDATA block.":"放置在CDATA块内的文本。",". The created ":"。 创建",") and it ends with ":"），以","The value of the current node as the ":"当前节点的值作为","The Unicode character for which to generate a character entity.":"生成字符实体的Unicode字符。"," instance will use a new empty ":"实例将使用新的空","The name of the NDATA attribute. If there is no NDATA, ":"NDATA属性的名称。 如果没有NDATA, ","The value of the element.":"元素的值。"," for the element ":"对于元素"," if this value is ":"如果此值为"," requested.":"要求。","The public identifier on the entity. If there is no public identifier, ":"实体的公共标识符。 如果没有公共标识符，","The namespace URI to associate with the element.":"命名空间URI与该元素相关联。",".  \n  \n For node types that do not have a name (like ":"。 \n  \n  对于没有名称的节点类型（例如"," to prohibit DTD processing; otherwise ":"禁止DTD处理； 否则"," object to stream to.":"对象流到。","The system identifier on the entity. If there is no system identifier, ":"实体上的系统标识符。 如果没有系统标识符，","The name to write.":"要写的名字。"," to use when performing schema validation. The default is an empty ":"执行模式验证时使用。 默认值为空",", and so on), this property returns String.Empty.":"，依此类推），此属性返回String。空的。","The location from which the node was loaded, or ":"加载节点的位置，或","The name of the entity reference; see the ":"实体参考的名称； 看到"," to copy from.":" 复制。","A bitwise combination of enumeration values that specify validation options. ":"指定验证选项的枚举值的比重组合。"," if there is no value.":"如果没有价值。","The qualified name of the current node. For example, ":"当前节点的合格名称。 例如，"," to clone only the node itself. For ":"仅克隆节点本身。 为了"," to copy the default attributes; otherwise, ":"复制默认属性； 否则，"," can edit the underlying XML data; otherwise, ":"可以编辑基础XML数据； 否则，"," nodes, this method always returns an entity reference node with no children. The replacement text is set when the node is inserted into a parent.":"节点，此方法始终返回没有孩子的实体参考节点。 当节点插入父时，将设置替换文本。"," are enabled by default. ":"默认情况下启用。",".  \n  \n The name returned is dependent on the ":"。 \n  \n  返回的名称取决于"," if the current node has attributes; returns ":"如果当前节点具有属性； 返回"," if the node is read-only; otherwise ":"如果节点是只读的； 否则"," are disabled by default.":"默认情况下被禁用。"," of the node. The following node types return the listed values. All other node types return an empty string.  \n  \n ":"节点。 以下节点类型返回列出的值。 所有其他节点类型返回一个空字符串。"," if the current node has no attributes, or if the ":"如果当前节点没有属性，或者","The text to include in the processing instruction.":"要包括在处理指令中的文本。","The namespace URI for the name.":"名称的名称空间URI。"," nodes, this property returns the name of the entity referenced.":" 节点，此属性返回引用的实体的名称。","The namespace URI of the current node; otherwise an empty string.":"当前节点的名称空间URI； 否则一个空字符串。"," values that indicates whether XmlReader will perform validation or type assignment when reading. The default is ":"表示XMLReader在阅读时是否会执行验证或类型分配的值。 默认值为"," if the current node has any child nodes; otherwise, ":"如果当前节点有任何子节点； 否则，","The name of the entity referenced.":"引用实体的名称。"," used to access external documents. If set to ":"用于访问外部文档。 如果设置为"," that contains the markup of the child nodes of the current node.":"其中包含当前节点的子节点的标记。"," nodes, the value is XmlNodeType.EntityReference.":"节点，该值是xmlnodeType.entityReference。","The namespace URI for the attribute.":"属性的名称空间URI。"," enabling you to get the atomized version of a string within the node.":"使您能够在节点内获取字符串的雾化版本。"," is thrown when the ":"当","The value of the node. For ":"节点的值。 为了"," if the current node is an empty element; otherwise, ":"如果当前节点是一个空元素； 否则，"," tries to access an external resource. The default is a new ":"试图访问外部资源。 默认值是新的","The namespace URI to associate with the element. If this namespace is already in scope and has an associated prefix, the writer automatically writes that prefix also.":"命名空间URI与该元素相关联。 如果此名称空间已经存在范围并且具有关联的前缀，则作者也会自动写入前缀。"," values representing the type of the current node.":"表示当前节点的类型的值。"," that contains the local name of the current node, or ":"包含当前节点的本地名称，或"," nodes, this property returns ":"节点，此属性返回"," with no credentials.  Starting with the .NET Framework 4.5.2, this setting has a default value of ":"没有凭证。 从.NET Framework 4.5.2开始，此设置的默认值为","The namespace prefix associated with the current node.":"与当前节点关联的名称空间前缀。","The low surrogate. This must be a value between 0xDC00 and 0xDFFF.":"低代理。 这必须是介于0xDC00和0xDFFF之间的值。","Currently not used.":"目前未使用。"," object containing the schema information for the current node.":"包含当前节点的模式信息的对象。"," object containing all the properties of an ":"包含所有属性的对象"," if the current node does not have a name (for example, text or comment nodes).":"如果当前节点没有名称（例如，文本或注释节点）。","The high surrogate. This must be a value between 0xD800 and 0xDBFF.":"高级代理。 这必须是0xD800和0xDBFF之间的值。"," of the node. The following table lists node types that have a value to return. All other node types return String.Empty.  \n  \n ":"节点。 下表列出了具有值得返回的值的节点类型。 所有其他节点类型返回字符串。"," object containing the context information.":"包含上下文信息的对象。","The type of object to return. The current version only returns System.IO.Stream objects.":"要返回的对象的类型。 当前版本仅返回system.io.stream对象。"," that contains the qualified ":"包含合格的"," scope.":"范围。","The description of the error condition.":"错误条件的描述。","A stream object or ":"流对象或"," of the current node, or ":"当前节点的","The object value to write.  \n  \n Note With the release of the .NET Framework 3.5, this method accepts ":"要编写的对象值。 \n  \n  注意，随着.NET Framework 3.5的发布，此方法接受"," scope exists, this property defaults to ":"存在范围，此属性默认为"," if a type other than stream is specified.":"如果指定了以外的其他类型。"," that threw the ":"那扔了"," that contains the namespace URI of the current node, or ":"包含当前节点的名称空间URI，或",", if any. This value can be ":"，如果有的话。 这个值可以是"," as a parameter.":" 作为参数。","The type of object to return. The current version only returns ":"要返回的对象的类型。 当前版本仅返回","The text content of a node.":"节点的文本内容。","The exception that is the cause of the current exception. This value can be ":"例外是当前异常的原因。 这个值可以是"," if the current node has no namespace URI.":"如果当前节点没有名称空间URI。","The single-precision floating-point number to write.":"要编写的单精度浮点数。","The absolute URI or ":"绝对URI或","The URI.":"URI。"," object used to create this writer instance. If this writer was not created using the ":"用于创建此作者实例的对象。 如果未使用该作者创建该作者"," object enabling you to get the atomized version of a ":"对象使您能够获取A的雾化版本","The XML declaration (for example, ":"XML声明（例如, ","The source URI for the XML data. If there is no source URI, this property returns ":"XML数据的源URI。 如果没有源URI，则此属性返回 "," to do character checking; otherwise, ":"进行角色检查； 否则，","The type to return.":"返回的类型。"," within the XML document.":"在XML文档中。","The package name of the feature to test. This name is not case-sensitive.":"要测试的功能的包装名称。 此名称不适合大小写。"," ).":"）。"," to also close the underlying stream or ":"也关闭基础流或","The credentials to be used to authenticate web requests. If this property is not set, the value defaults to ":"用于身份验证Web请求的凭据。 如果未设置此属性，则值默认为"," used for equality comparison of ":"用于平等比较","This is the version number of the package name to test. If the version is not specified (":"这是要测试的软件包名称的版本编号。 如果未指定版本（"," copy of the node from which the method is called.":"从中调用该方法的节点的副本。","; that is, the ":"; 那就是"," values representing the current node.":"代表当前节点的值。","One of the enumeration values that specifies the level of conformance (document, fragment, or automatic detection). The default is ":"指定一致性级别（文档、片段或自动检测）的枚举值之一。 默认值为 ","), supporting any version of the feature causes the method to return ":"），支持该功能的任何版本都会导致该方法返回"," nodes, this property returns the name of the notation.":"节点，此属性返回符号的名称。"," has no user credentials.":"没有用户凭据。"," does not escape URI attributes; otherwise, ":"不会逃脱URI属性； 否则，"," if the feature is implemented in the specified version; otherwise, ":"如果该功能在指定版本中实现； 否则，"," nodes, the value is XmlNodeType.Notation.":"节点，该值是XMLNODETYPE.NOTATION。"," that contains the markup representing the opening and closing tags of the current node and its child nodes.":" 它包含表示当前节点及其子节点的开始和结束标记的标记。","The XML resolver that is wrapped by the ":"由 ","The text encoding to use. The default is ":"文本编码要使用。 默认值为",".  \n  \n The following table shows the combinations that cause ":"。 \n  \n  下表显示了引起的组合","The public identifier on the notation. If there is no public identifier, ":"符号公共标识符。 如果没有公共标识符，"," that contains the namespace prefix associated with the current node.":"其中包含与当前节点关联的名称空间前缀。","The URL used to create the ":"用于创建的URL","The system identifier on the notation. If there is no system identifier, ":"符号上的系统标识符。 如果没有系统标识符，"," immediately following this node or ":"立即遵循此节点或"," to write individual elements on new lines and indent; otherwise, ":" 在新行和缩进上写入单个元素；否则, "," object that contains the schema information for the current node.":" 包含当前节点的架构信息的对象。"," that will be applied to the underlying ":"这将应用于基础"," if one does not exist.":"如果不存在。"," to use to atomize strings. If this is ":"用来雾化字符串。 如果是","The current node as a boxed object of the most appropriate .NET type.":"当前节点是最合适的.NET类型的盒装对象。","The character string to use when indenting. This can be set to any string value. However, to ensure valid XML, you should specify only valid white space characters, such as space characters, tabs, carriage returns, or line feeds. The default is two spaces.":"缩进时要使用的字符串。 可以将其设置为任何字符串值。 但是，为了确保有效的XML，您应该仅指定有效的白空间字符，例如空间字符，选项卡，马车返回或线馈送。 默认值是两个空格。","The preceding ":"前面"," calls ":"呼叫","The default is ":"默认值为"," enumeration used to specify whether to remove duplicate namespace declarations in the ":"枚举用于指定是否删除重复的名称空间声明",", the name table used to construct the ":"，用于构造的名称表","The qualified name of the node to retrieve. It is matched against the ":"检索节点的合格名称。 它与"," on the created ":"在创建","The current node's value as a ":"当前节点的值为"," with the specified name or ":"带有指定的名称或"," is used instead. For more information about atomized strings, see ":"相反。 有关雾化字符串的更多信息，请参阅"," before calling ":"打电话之前","The character string to use for line breaks. This can be set to any string value. However, to ensure valid XML, you should specify only valid white space characters, such as space characters, tabs, carriage returns, or line feeds. The default is ":"用于线路断路的字符串。 可以将其设置为任何字符串值。 但是，为了确保有效的XML，您应该仅指定有效的白空间字符，例如空间字符，选项卡，马车返回或线馈送。 默认值为","The current node's value as an ":"当前节点的值为"," if a matching node is not found.":"如果找不到匹配节点。"," to use for looking up namespace information, or ":"用于查找名称空间信息，或"," (carriage return, new line).":"（马车返回，新线路）。","The local name of the node to retrieve.":"检索节点的本地名称。","The .NET ":"互联网"," on the underlying ":" 在底层 ","The name of the document type declaration.":"文档类型声明的名称。","The namespace Uniform Resource Identifier (URI) of the node to retrieve.":"要检索的节点的名称空间统一资源标识符（URI）。","The URI that is returned from ":"从"," to write attributes on individual lines; otherwise, ":" 在个别行上写入属性；否则, "," of the current node. The default value is ":"当前节点。 默认值是"," with the matching local name and namespace URI or ":"使用匹配的本地名称和名称空间URI或","The public identifier.":"公共标识符。","The stream returned by calling ":"通过打电话返回的流"," that contains the value of the ":"其中包含"," to omit the XML declaration; otherwise, ":"省略XML声明； 否则，"," if a matching node was not found.":"如果找不到匹配节点。",". If a type other than ":"。 如果除了其他类型","The system identifier.":"系统标识符。"," scope, or ":"范围，或",", an XML declaration is written.":"，写了XML声明。","The index position of the node to retrieve from the ":"节点的索引位置要从","The internal DTD subset. The DTD subset is used for entity resolution, not for document validation.":"内部DTD子集。 DTD子集用于实体分辨率，而不是文档验证。"," is specified, the method returns ":"指定，方法返回",". The index is zero-based; therefore, the index of the first node is 0 and the index of the last node is ":"。 该索引基于零； 因此，第一个节点的索引为0，最后一个节点的索引为"," if all unclosed element tags will be closed out; otherwise, ":"如果所有未封闭的元素标签都将关闭； 否则，"," if the current node has no ":"如果当前节点没有"," if the relative URI cannot be resolved (returned by calling ":"如果无法解析相对URI（通过致电返回"," at the specified index. If ":"在指定的索引上。 如果","An object representing the sort key. This can be the ":"代表排序键的对象。 这可以是","The base URI for the XML fragment (the location from which the fragment was loaded).":"XML片段的基础URI（从加载片段的位置）。","The credentials to be used to authenticate web requests. The ":"用于身份验证Web请求的凭据。 这"," scope value to return.":"返回的范围值。"," value indicating the ":"表示"," is less than 0 or greater than or equal to the ":"小于0或大于或等于或等于"," value of the node or an ":"节点的值或"," sets the given credentials on the underlying ":"在基础上设置给定的凭据"," object with a compiled XPath expression.":"具有编译XPath表达式的对象。","The internal DTD subset. The DTD is used for entity resolution, not for document validation.":"内部DTD子集。 DTD用于实体分辨率，而不是文档验证。"," object; default is ":"目的; 默认为",". If this property is not set, the value defaults to ":"。 如果未设置此属性，则值默认为"," property, ":"财产，"," object clone of this ":"对象克隆"," object that provides the specific data type comparisons for comparing two objects for equivalence.":"提供特定数据类型比较以比较两个对象的对象。","The white space characters of the node.":"节点的白空间字符。","The qualified name of the node to remove. The name is matched against the ":"删除节点的合格名称。 该名称与"," object indicating the encoding setting.":"指示编码设置的对象。"," value indicating the sort order.":"表示排序顺序的值。"," to clone only the node itself. For significant white space nodes, the cloned node always includes the data value, regardless of the parameter setting.":"仅克隆节点本身。 对于重要的白空间节点，无论参数设置如何，克隆的节点始终包含数据值。"," object to iterate through the selected node set.":"反对通过选定的节点集进行迭代。"," removed from this ":"从中删除"," is used instead. For more information on atomized strings, see ":"相反。 有关雾化字符串的更多信息，请参阅"," value indicating how to sort uppercase and lowercase letters.":"值表示如何对大写和小写字母进行排序。"," nodes, this value is XmlNodeType.SignificantWhitespace.":"节点，此值是xmlnodeType。","The base URI to use to resolve the DTD file.":"用于解析DTD文件的基本URI。","The local name of the node to remove.":"删除节点的本地名称。"," object moved to the next node; ":"对象移动到下一个节点；"," parent node of the current node.":"当前节点的父节点。"," object indicating the encoding type.":"指示编码类型的对象。","The language to use for comparison. Uses the ":"用于比较的语言。 使用","The namespace URI of the node to remove.":"节点的命名空间URI删除。"," if there are no more selected nodes.":"如果不再有选定的节点。","The white space characters found in the node.":"节点中发现的白空间字符。","The index of the last node in the selected set of nodes, or 0 if there are no selected nodes.":"所选节点集中最后一个节点的索引，如果没有选定的节点，则为0。"," class that can be passed to the ":"可以传递给"," removed or ":"删除或","The internal DTD subset. For example, this property returns everything between the square brackets ":"内部DTD子集。 例如，此属性返回方括号之间的所有内容","The content of the node; see the ":"节点的内容； 看到"," object positioned on the context node from which the node set was selected. The ":"位于选择节点集的上下文节点上的对象。 这"," scope. If there is no ":"范围。 如果没有"," to store in the ":"存放在","The offset at which to split the node.":"分裂节点的偏移。"," method for the language types, for example, \"us-en\" for U.S. English. If an empty string is specified, the system environment is used to determine the ":"语言类型的方法，例如美国英语的“ US-EN”。 如果指定了空字符串，则使用系统环境来确定"," method must be called to move the ":"必须调用方法以移动"," in scope, ":"在适用范围，"," value indicating the sort order for the data type.":"值表示数据类型的排序顺序。","The new node.":"新节点。",". If a node with that name is already present in the map, it is replaced by the new one.":"。 如果图中已经存在带有该名称的节点，则将其替换为新名称。"," to the first node in the selected set.":"到选定集中的第一个节点。","The target of the processing instruction; see the ":"处理指令的目标； 看到","For text nodes, this property returns ":"对于文本节点，此属性返回"," replaces an existing node with the same name, the old node is returned; otherwise, ":"用相同名称替换现有节点，返回旧节点； 否则，","An XPath expression.":"XPATH表达。","The index of the current position.":"当前位置的索引。","The content of the instruction; see the ":"说明的内容； 看到","The number of nodes.":"节点的数量。"," interface for namespace resolution.":"命名空间分辨率的接口。","For text nodes, this value is XmlNodeType.Text.":"对于文本节点，此值是xmlnodetype.text。","The XSLT context for the function call.":"函数调用的XSLT上下文。","The content of the processing instruction, excluding the target.":"处理指令的内容，不包括目标。"," interface to use for namespace resolution.":"用于命名空间分辨率的接口。","The content of the text node.":"文本节点的内容。","For processing instruction nodes, this property returns the target of the processing instruction.":"对于处理指令节点，此属性返回处理指令的目标。","The arguments of the function call. Each argument is an element in the array.":"函数调用的参数。 每个参数都是数组中的元素。","The prefix to associate with the namespace being added. Use String.Empty to add a default namespace.  \n  \n Note If the ":"与要添加的命名空间相关联的前缀。 使用字符串。空以添加默认命名空间。  \n  \n 请注意，如果 "," object to use for namespace resolution.":"用于命名空间分辨率的对象。","The stream containing the XML data to read.":"包含要读取的XML数据的流。"," nodes, this value is XmlNodeType.ProcessingInstruction.":"节点，此值是xmlnodetype.processinginstruction。"," will be used for resolving namespaces in an XML Path Language (XPath) expression, a prefix must be specified. If an XPath expression does not include a prefix, it is assumed that the namespace Uniform Resource Identifier (URI) is the empty namespace. For more information about XPath expressions and the ":"将用于在XML路径语言（XPath）表达式中解析名称空间，必须指定前缀。 如果XPath表达式不包括前缀，则假定名称空间统一资源标识符（URI）是空名称空间。 有关XPath表达和的更多信息","The context node for the function call.":"函数调用的上下文节点。","The stream containing the XML fragment to parse.":"包含XML片段的流到解析。"," value representing the result type of the XPath expression.":" 表示XPath表达式的结果类型的值。","The target of the processing instruction.":"处理指令的目标。"," representing the return value of the function.":"表示函数的返回值。",", refer to the ":"，请参阅"," of the XML fragment. This also determines what the fragment can contain. (See table below.)":"XML片段。 这也决定了片段可以包含的内容。 （见下表。）","The type to return the item value as.":"返回项目值的类型。","The namespace to add.":"要添加的名称空间。"," representing the types for the function's argument list.":"表示函数参数列表的类型。","The entire content of the processing instruction, excluding the target.":"处理指令的全部内容，不包括目标。"," in which the ":" 其中 ","The value of the item as the type requested.":"请求的类型的项的值。","The maximum number of arguments for the function.":"该功能的最大参数数量。"," is to be parsed. This includes the ":"要解析。 这包括"," containing the prefixes stored by the ":"包含由","The local name to use as the name of the ":"当地名称用作名称的名称","The type to return the item's value as.":"返回项目值的类型。","The minimum number of arguments for the function.":"该功能的最小参数数量。","An enumeration value that specifies the type of namespace nodes to return.":"枚举值指定要返回的名称空间节点的类型。"," containing the XML data to read.":"包含要读取的XML数据。"," representing the XPath type returned by the function.":"表示由函数返回的XPATH类型。","The namespace for the ":"命名空间"," if the item represents an XPath node; ":"如果该项目代表XPath节点；","A collection of namespace and prefix pairs currently in scope.":"目前处于范围中的名称空间和前缀对的集合。"," representing the execution context of the variable.":"表示变量的执行上下文。","The URL for the file containing the XML data. The ":"包含XML数据的文件的URL。 这"," if the two are the same instance object; otherwise, ":"如果两个是同一实例对象； 否则，"," if the item represents an atomic value.":"如果项目代表原子值。","The prefix of the namespace you want to find.":"您想找到的名称空间的前缀。","A hash code for this object.":"该对象的哈希代码。"," is set to this value.":"设置为此值。"," representing the value of the variable. Possible return types include number, string, Boolean, document fragment, or node set.":"表示变量的值。 可能的返回类型包括数字，字符串，布尔值，文档片段或节点集。","The current item as a boxed object of the most appropriate .NET Framework type.":"当前项目是最合适的.NET框架类型的盒装对象。"," value of the item.":"物品的价值。"," if the two objects have the same name and namespace values; otherwise, ":"如果两个对象具有相同的名称和名称空间值； 否则，","The URL to use for resolving external resources. The ":"用于解决外部资源的URL。 这"," if the variable is a local variable in the current context; otherwise, ":"如果变量是当前上下文中的局部变量； 否则，"," if there is a namespace defined; otherwise, ":"如果定义了名称空间； 否则，"," is set to this value. If ":"设置为此值。 如果","The prefix whose namespace URI you want to resolve. To match the default namespace, pass String.Empty.":"您要解决的名称空间URI的前缀。 要匹配默认名称空间，请通过String.Empty。"," if the name and namespace values for the two objects differ; otherwise, ":"如果两个对象的名称和名称空间值不同； 否则，","The item's value as a ":"该项目的价值作为"," if the variable is an XSLT parameter; otherwise, ":"如果变量是XSLT参数； 否则，","The namespace URI for ":"名称空间URI","The URL for the file containing the XML data to read.":"包含要读取的XML数据的文件的URL。"," representing the XPath type of the variable.":"表示变量的XPATH类型。"," in the format of ":"以"," if there is no mapped namespace. The returned string is atomized.  \n  \n For more information on atomized strings, see the ":"如果没有映射的名称空间。 返回的字符串被原子化。 \n  \n  有关雾化字符串的更多信息，请参阅","The item's value as an ":"该项目的价值作为","The string containing the XML fragment to parse.":"包含XML片段进行解析的字符串。",". If the object does not have a namespace defined, this method returns just the local name.":"。 如果对象没有定义名称空间，则此方法仅返回本地名称。"," to generate debug information; otherwise ":"生成调试信息； 否则","The .NET Framework type of the item. The default value is ":"项目的.NET框架类型。 默认值是","The namespace to resolve for the prefix.":"要解决前缀的名称空间。"," of the XML fragment. This also determines what the fragment string can contain. (See table below.)":"XML片段。 这也确定片段字符串可以包含的内容。 （见下表。）","The namespace of the object.":"对象的名称空间。",". Setting this to ":"。 设置为","The matching prefix. If there is no mapped prefix, the method returns String.Empty. If a null value is supplied, then ":"匹配前缀。 如果没有映射的前缀，则该方法返回string.empty。 如果提供了零值，则"," for the item.":" 为物品。"," object that contains all the current in-scope namespaces. If the reader is not positioned on an element, an empty dictionary (no namespaces) is returned.":"包含所有当前范围内命名空间的对象。 如果读者未放在元素上，则返回一个空词典（没有名称空间）。"," if name and namespace are empty strings; otherwise, ":"如果名称和名称空间为空字符串； 否则，"," if there are namespace scopes left on the stack; ":"如果堆栈上剩下的名称空间范围；"," enables you to debug the style sheet with the Microsoft Visual Studio Debugger.":"使您可以使用Microsoft Visual Studio调试器调试样式表。"," object used to create new child nodes at the end of the list of child nodes of the current node.":"对象用于在当前节点的子节点列表的末尾创建新的子节点。"," containing the remainder of the buffered XML.":"包含缓冲XML的其余部分。"," object representing the compiler-generated ":"代表编译器生成的对象"," if there are no more namespaces to pop.":"如果没有更多的名称空间可以弹出。","A string representation of the qualified name or String.Empty if a name is not defined for the object.":"限定名称或字符串的字符串表示形式。如果没有为对象定义名称，则为空。"," method of the compiled style sheet.":"编译样式表的方法。"," if the class can return line information; otherwise, ":"如果课程可以返回线路信息； 否则，","The XML data string for the new child node.":"新子节点的XML数据字符串。","The prefix for the namespace.":"名称空间的前缀。","The array of characters that serves as the buffer to which the text contents are written.":"字符数组用作文本内容的缓冲区。","A string representation of the namespace or String.Empty if a namespace is not defined for the object.":"命名空间或字符串的字符串表示。"," object positioned on the XML data for the new child node.":"对象位于新子节点的XML数据上。","A byte array of serialized data structures in the ":"序列化数据结构的字节数组 ","The stream that contains the XML data.  \n  \n The ":"包含XML数据的流。 \n  \n  这","The namespace to remove for the given prefix. The namespace removed is from the current namespace scope. Namespaces outside the current scope are ignored.":"要删除给定前缀的名称空间。 删除的名称空间来自当前名称空间范围。 当前范围之外的名称空间被忽略。","The zero-based index into the array specifying where the method can begin to write to the buffer.":"基于零的索引到数组中，指定该方法可以在何处写入缓冲区。","The namespace URI for the default namespace, or an empty string if there is no default namespace.":"如果没有默认名称空间，则为默认名称空间的名称空间URI或一个空字符串。"," object positioned on the node to add as the new child node.":"对象位于节点上以添加为新子节点。"," field of the compiled style sheet as generated by the ":"编译样式表的字段由"," scans the first bytes of the stream looking for a byte order mark or other sign of encoding. When encoding is determined, the encoding is used to continue reading the stream, and processing continues parsing the input as a stream of (Unicode) characters.":"扫描流的第一个字节，以寻找字节订单标记或其他编码符号。 确定编码时，编码用于继续读取流，并且处理继续将输入解析为（Unicode）字符的流。"," used by this object.":"该对象使用。","The number of bytes to write into the buffer.":"写入缓冲区的字节数。","The namespace prefix of the new child element node (if any).":"新子元素节点的名称空间前缀（如果有）。","An object that is used to read the XML data in the stream.":"用于读取流中XML数据的对象。","The byte array that serves as the buffer to which the decoded binary bytes are written.":"用作编写解码二进制字节的缓冲区的字节数组。","The settings for the new ":"新的设置","The local name of the new child element node (if any).":"新子元素节点的本地名称（如果有）。"," instance. This value can be ":"实例。 这个值可以是","The character array containing the name to add.":"包含要添加的名称的字符数组。","The number of bytes written to your buffer.":"写入缓冲区的字节数。","The base URI for the entity or document being read. This value can be ":"实体或文档正在阅读的基本URI。 这个值可以是","The namespace URI of the new child element node (if any). ":"新子元素节点的命名空间URI（如果有）。 "," where the method can begin writing text contents.":"该方法可以开始写文本内容。","Zero-based index into the array specifying the first character of the name.":"基于零的索引到数组中指定名称的第一个字符。","The value of the new child element node. If ":"新子元素节点的值。 如果",".  \n  \n Security Note The base URI is used to resolve the relative URI of the XML document. Do not use a base URI from an untrusted source.":"。 \n  \n  安全注意基本URI用于解析XML文档的相对URI。 请勿使用不受信任的来源使用基本URI。","The new atomized string or the existing one if it already exists. If length is zero, String.Empty is returned.":"新的雾化字符串或现有的字符串已经存在。 如果长度为零，则返回string.empty。"," are passed, an empty element is created.":"通过，创建一个空元素。","The number of characters to write into ":"要写入的字符数","The context information required to parse the XML fragment. The context information can include the ":"解析XML片段所需的上下文信息。 上下文信息可以包括","The name to add.":"要添加的名称。","The number of characters read. This can be ":"字符读数。 这可以","The new atomized string or the existing one if it already exists.":"新的雾化字符串或现有的字符串已经存在。"," containing the schemas used to validate the XML data contained in the ":" 包含用于验证包含在 ","The character array containing the name to look up.":"字符阵列包含要查找的名称。"," to use, encoding, namespace scope, the current ":" 要使用，编码，命名空间范围，当前 "," if the reader is not positioned on an element or if there is no more text content to return in the current context.":"如果读者没有放在元素上，或者没有更多的文本内容可以在当前上下文中返回。","The contents of the element or text node. This can be an empty string if the reader is positioned on something other than an element or text node, or if there is no more text content to return in the current context.  \n  \n ":"元素或文本节点的内容。 如果将读者放在元素或文本节点以外的其他内容上，或者如果没有更多的文本内容可以在当前上下文中返回，则可以是一个空字符串。"," that receives information about schema validation warnings and errors.":"接收有关模式验证警告和错误的信息。","The name to look up.":"抬头的名字。"," scope, base URI, and document type definition.  \n  \n This value can be ":"范围，基础URI和文档类型定义。 \n  \n  这个值可以是","The encoding value. If no encoding attribute exists, and there is no byte-order mark, this defaults to UTF-8.":"编码值。 如果不存在编码属性，并且没有字节顺序标记，则该默认为UTF-8。"," if no schema validation errors occurred; otherwise, ":"如果未发生模式验证错误； 否则，","The text reader from which to read the XML data. A text reader returns a stream of Unicode characters, so the encoding specified in the XML declaration is not used by the XML reader to decode the data stream.":"可以从中读取XML数据的文本读取器。 文本读取器返回Unicode字符的流，因此XML读取器未使用XML声明中指定的编码来解码数据流。"," positioned at the same node as this ":"位于与此相同的节点","The node to add. All the contents of the node to be added are moved into the specified location.":"要添加的节点。 要添加的节点的所有内容都移至指定的位置。"," is specified, it defaults to ":" 被指定，它默认为 ","The node added.":"添加了节点。","The text reader from which to read the XML data. A text reader returns a stream of Unicode characters, so the encoding specified in the XML declaration isn't used by the XML reader to decode the data stream.":"可以从中读取XML数据的文本读取器。 文本读取器返回Unicode字符的流，因此XML读取器未使用XML声明中指定的编码来解码数据流。"," to compare against.":"比较。",". (":"。 （（"," value representing the comparative position of the two ":"代表两者比较位置的价值"," does not expand default attributes.)":"不扩展默认属性。）","The text reader from which to read the XML data. A text reader returns a stream of Unicode characters, so the encoding specified in the XML declaration isn't used by the ":"可以从中读取XML数据的文本读取器。 文本读取器返回Unicode字符的流，因此在XML声明中指定的编码不使用"," object used to navigate the node. The ":"用于导航节点的对象。 这","The current line position.":"当前的线位置。","A string representing an XPath expression.":"表示XPath表达式的字符串。"," to decode the data stream.":"解码数据流。"," to do namespace support; otherwise, ":"做名称空间支持； 否则，"," is positioned on the node from which the method was called. It is not positioned on the root of the document.":"位于调用该方法的节点上。 它没有放在文档的根部。"," object representing the XPath expression.":"代表XPath表达式的对象。"," to normalize; otherwise, ":"正常化； 否则，","The URI for the file that contains the XML data. The ":"包含XML数据的文件的URI。 这"," object that can be used to iterate through the child nodes in the current node.":"可以用来通过当前节点中的子节点迭代的对象。"," to disallow DTD processing; otherwise ":"禁止DTD处理； 否则","The namespace prefix of the new attribute node (if any).":"新属性节点的名称空间前缀（如果有）。"," class is used to convert the path to a canonical data representation.":"类用于将路径转换为规范数据表示。","The prefix whose namespace URI you want to find.":"您想找到的名称空间URI的前缀。"," (returns ":"（返回","The URI for the file containing the XML data. The ":"包含XML数据的文件的URI。 这","The local name of the new attribute node which cannot ":"新属性节点的本地名称无法","The namespace URI of the specified prefix.":"指定前缀的名称空间URI。"," object on the ":"对象"," nodes).":"节点）。","The namespace URI for the new attribute node (if any).":"新属性节点的名称空间URI（如果有）。"," to use. If set to ":"使用。 如果设置为","The namespace URI whose prefix you want to find.":"您想找到的名称空间URI。"," object is used to convert the path to a canonical data representation. If ":"对象用于将路径转换为规范数据表示。 如果","The value of the new attribute node. If ":"新属性节点的值。 如果","The prefix for the specified namespace URI.":"指定名称空间URI的前缀。",", external resources are not resolved.  \n  \n In version 1.1 of the .NET Framework, the caller must be fully trusted in order to specify an ":"，外部资源无法解决。 \n  \n  在.NET框架的版本1.1中，必须完全信任呼叫者以指定一个","The stream to which you want to write.":"您要编写的流。","The node to insert.":"插入的节点。",", a new ":"，一个新"," are passed, an empty attribute node is created.":"通过，创建一个空属性节点。","The reference node. ":"参考节点。","The encoding to generate. If encoding is ":"生成的编码。 如果编码是"," object used to create new attributes on the current element.":"用于在当前元素上创建新属性的对象。","The object that you want to use as the underlying XML reader.":"您要用作基础XML读取器的对象。"," it writes out the stream as UTF-8 and omits the encoding attribute from the ":"它以UTF-8的形式写下流，并省略了从"," is placed after ":"放置在之后"," instance.  \n  \n The conformance level of the ":"实例。 \n  \n  一致性水平"," to write to. It is assumed that the ":"写信。 假设"," object must either match the conformance level of the underlying reader, or it must be set to ":"对象必须匹配基础读取器的一致性级别，或者必须将其设置为"," copy of this ":" 本副本 ","The node being inserted.":"节点被插入。"," is already set to the correct encoding.":"已设置为正确的编码。","The node being removed.":"节点被删除。","An object that is wrapped around the specified ":"包裹在指定的对象"," positioned on the last sibling node in the range to delete.":"位于删除范围内的最后一个兄弟姐妹节点上。","The node removed.":"删除节点。","The filename to write to. If the file exists, it truncates it and overwrites it with the new content.":"要写的文件名。 如果文件存在，它将截断并用新内容覆盖它。","The value of the specified attribute. This method does not move the reader.":"指定属性的值。 此方法不会移动读者。","A string representing an XPath expression that can be evaluated.":"代表可以评估的XPath表达式的字符串。","The value of the specified attribute. If the attribute is not found or the value is ":"指定属性的值。 如果找不到属性或值为"," it writes the file out as UTF-8, and omits the encoding attribute from the ":"它以UTF-8的形式将文件写出，并从","The result of the expression (Boolean, number, string, or node set). This maps to ":"表达式的结果（布尔，数，字符串或节点集）。 这映射到"," is returned. This method does not move the reader.":"退回。 此方法不会移动读者。","Namespace URI whose prefix you want to find.":"命名空间URI您想找到其前缀。","The new node to put in the child list.":"要放入子列表的新节点。"," objects respectively.":"对象分别。","The matching prefix. Or ":"匹配前缀。 或者","The value of the current node.":"当前节点的值。"," if no matching namespace URI is found in the current scope.":"如果在当前范围中找不到匹配的名称空间URI。","The node being replaced in the list.":"节点被替换在列表中。"," object used to resolve namespace prefixes in the XPath expression.":"用于在XPath表达式中解析名称空间前缀的对象。","The name token to validate.":"名称令牌要验证。","The node replaced.":"替换节点。"," that can be evaluated.":"可以评估。","The position within the buffer indicating the start of the bytes to write.":"缓冲区内的位置表示要写的字节的开始。","The XPath expression.":"XPath表达式。"," if it is a valid name token; otherwise ":"如果是有效的名称令牌； 否则"," that points to the selected node set that the evaluation is to be performed on.":"这指出了选定的节点集，即将进行评估。","Text to place inside the CDATA block.":"文本要放置在CDATA块内。"," containing a collection of nodes matching the XPath query.":"包含匹配XPath查询的节点集合。","The local name of the attribute. ":"属性的本地名称。"," finds a start tag or empty element tag; ":"找到一个开始标签或空元素标签；","Unicode character for which to generate a character entity.":"为生成字符实体的Unicode字符。","The XPath expression. See XPath Examples.":"XPath表达式。 请参阅XPATH示例。"," is case-sensitive.":"对病例敏感。"," if a node type other than ":"如果除了节点类型"," that contains the value of the specified attribute; ":"包含指定属性的值；","Character array containing the text to write.":"字符阵列包含文本编写。"," to use for resolving namespaces for prefixes in the XPath expression.":"用于在XPath表达式中解决前缀的命名空间。"," that matches the XPath query or ":"与xpath查询匹配或"," if a matching attribute is not found, or if the ":"如果找不到匹配属性，或者","The string matched against the ":"弦与","The position in the buffer indicating the start of the text to write.":"缓冲区中的位置表示要编写文本的开始。"," is not positioned on an element node.":"不在元素节点上。"," property of the element found.":"找到元素的属性。"," if no matching node is found.":"如果找不到匹配节点。","Text to place inside the comment.":"文字要放置在评论中。","The version number of the package name to test. If the version is not specified (null), supporting any version of the feature causes the method to return true.":"要测试的软件包名称的版本号。 如果未指定版本（NULL），则支持该功能的任何版本会导致该方法返回true。"," if the resulting node is an element and the ":"如果结果节点是一个元素，并且","The local name of the namespace node.":"名称空间节点的本地名称。","The name of the DOCTYPE. This must be non-empty.":"Doctype的名称。 这必须是非空的。",". The following table describes the combinations that return ":"。 下表描述了返回的组合"," that contains the value of the namespace node; ":"包含名称空间节点的值；"," property matches the specified string. ":"属性与指定的字符串匹配。","If non-null it also writes PUBLIC \"pubid\" \"sysid\" where ":"如果非无效"," was found or if the element ":"被发现或元素","An enumerator for the collection.":"该集合的枚举者。"," if a matching namespace node is not found, or if the ":"如果找不到匹配的名称空间节点，或者"," are replaced with the value of the given arguments.":"被给定参数的价值替换。"," property does not match the specified string.":"属性不匹配指定的字符串。","A copy of the node from which it is called.":"该节点的副本。"," value specifying the namespaces to return.":"指定要返回的名称空间的值。"," is null and ":"是无效的","The string to match against the ":"符合与"," if the resulting node is an element. ":"如果结果节点是元素。"," collection of namespace names keyed by prefix.":"命名空间名称的集合由前缀键入。"," is non-null it writes SYSTEM \"sysid\" where ":"它是非无效的，它写入系统“ sysid”"," containing the attributes of the node.  \n  \n If the node is of type XmlNodeType.Element, the attributes of the node are returned. Otherwise, this property returns ":"包含节点的属性。 \n  \n  如果节点是类型XMLNODETYPE.Element的类型，则返回节点的属性。 否则，此属性返回"," was found or if the ":"被发现或是否"," object used to create a new sibling node after the currently selected node.":"当前选择的节点之后，用于创建新的兄弟节点的对象。","The location from which the node was loaded or String.Empty if the node has no base URI.":"节点已加载或字符串的位置。"," is replaced with the value of this argument.":"被该论点的价值取代。"," properties of the element do not match the specified strings.":"元素的属性不匹配指定的字符串。","An object that contains all the child nodes of the node.  \n  \n If there are no child nodes, this property returns an empty ":"包含节点的所有子节点的对象。 \n  \n  如果没有子节点，此属性将返回一个空的","The XML data string for the new sibling node.":"新兄弟节点的XML数据字符串。","The prefix whose namespace URI you want to resolve. To match the default namespace, pass an empty string.":"您要解决的名称空间URI的前缀。 要匹配默认名称空间，请传递一个空字符串。","The first child of the node. If there is no such node, ":"节点的第一个孩子。 如果没有这样的节点，","If non-null it writes [subset] where subset is replaced with the value of this argument.":"如果非核武器，则写入[子集]，其中子集被该参数的值替换。"," of the current node found by the method or ":"该方法找到的当前节点的"," object positioned on the XML data for the new sibling node.":"对象位于新兄弟节点的XML数据上。","Name of the entity reference.":"实体参考的名称。"," if the node has child nodes; otherwise, ":"如果节点有子节点； 否则，","Name to write.":"要写的名称。"," if the reader has reached the end of the input stream.":"如果读者到达输入流的末尾。"," object positioned on the node to add as the new sibling node.":"对象位于节点上以添加为新的兄弟节点。","The concatenated values of the node and all its child nodes.":"节点的串联值及其所有子节点。"," if the next node was read successfully; otherwise, ":"如果下一个节点被成功读取； 否则，","Name of the processing instruction.":"处理指令的名称。"," object used to create a new sibling node before the currently selected node.":"对象用于在当前选择的节点之前创建一个新的兄弟节点。","The markup of the child nodes of this node, not including default attributes.":"该节点的子节点的标记，不包括默认属性。","Text to include in the processing instruction.":"文本要包括在处理指令中。"," with a single node with a value of ":"具有一个值的单个节点","The namespace prefix of the new child element (if any).":"新子元素的名称空间前缀（如果有）。","The qualified name of the element to retrieve.":"要检索的元素的合格名称。","The local name to write.":"要写的本地名称。","The type of the value to be returned.  \n  \n Note With the release of the .NET Framework 3.5, the value of the ":"要返回的值的类型。 \n  \n  注意.NET Framework 3.5的释放，该值的值"," that matches the specified name. It returns a null reference (":"与指定名称匹配。 它返回一个null引用（","The local name of the new child element (if any).":"新子元素的本地名称（如果有）。","The namespace URI to associate with the name.":"名称空间URI与名称相关联。"," in Visual Basic) if there is no match.":"在Visual Basic中）如果没有匹配。"," parameter can now be the ":"参数现在可以是","The position within the buffer indicating the start of the text to write.":"缓冲区内的位置表示要写的文本的开始。",".  \n  \n This value can be ":"。 \n  \n  这个值可以是","The namespace URI of the new child element (if any). ":"新子元素的名称空间URI（如果有）。"," with the matching ":"与匹配","The type of the value to be returned.":"要返回的值的类型。",". It returns a null reference (":"。 它返回一个null引用（","String containing the text to write.":"字符串包含要写的文本。","The value of the new child element. If ":"新子元素的价值。 如果"," object that is used to resolve any namespace prefixes related to type conversion.":"用于解析与类型转换有关的任何名称空间前缀的对象。","The last child of the node. If there is no such node, ":"节点的最后一个孩子。 如果没有这样的节点，"," prefix of the attribute.":"属性的前缀。"," to compare to this ":"与此相比","The text content as a ":"文本内容作为","The name of the node with the prefix removed. For example, ":"删除带有前缀的节点的名称。 例如，","The text content at the current position as a ":"当前位置的文本内容作为"," of the attribute.":"属性。"," is book for the element <bk:book>.  \n  \n The name returned is dependent on the ":"是元素<bk：book>的书。 \n  \n  返回的名称取决于"," is a descendant of the current ":"是当前的后代"," objects have the same position; otherwise, ":"物体具有相同的位置； 否则，"," of the node:  \n  \n ":"节点：","The text content as a double-precision floating-point number.":"文本内容是双精度浮点数。",", it writes \"standalone=yes\"; if ":"，它写下“独立=是”； 如果","The prefix whose namespace URI you want to resolve. To match the default namespace, pass ":"您要解决的名称空间URI的前缀。 要匹配默认名称空间，请通过","The qualified name of the node. The name returned is dependent on the ":"节点的合格名称。 返回的名称取决于","The text content at the current position as a single-precision floating point number.":"当前位置的文本内容是单精度的浮点数。",". If there is no next node, ":"。 如果没有下一个节点，",", it writes \"standalone=no\".":"，它写下“独立=否”。"," that contains the namespace URI assigned to the namespace prefix specified; ":"其中包含分配给指定名称空间前缀的名称空间URI；","The text content as a 32-bit signed integer.":"文本内容是32位签名的整数。","The markup containing this node and all its child nodes, not including default attributes.":"包含此节点及其所有子节点的标记，不包括默认属性。"," if no namespace URI is assigned to the prefix specified. The ":"如果未将命名空间URI分配给指定的前缀。 这","The namespace prefix of the element.":"元素的名称空间前缀。","The text content as a 64-bit signed integer.":"文本内容是64位签名的整数。"," to which this node belongs.  \n  \n If the node is an ":"该节点所属的。 \n  \n  如果节点是"," returned is atomized.":"返回的原子化。","The text content as the most appropriate common language runtime (CLR) object.":"文本内容是最合适的通用语言运行时（CLR）对象。","The namespace URI to associate with the element. If this namespace is already in scope and has an associated prefix then the writer automatically writes that prefix also.":"命名空间URI与该元素相关联。 如果此名称空间已经存在范围并且具有关联的前缀，则作者也会自动写入前缀。"," (NodeType equals XmlNodeType.Document), this property returns ":"（NodeType等于xmlnodetype.document），此属性返回","The namespace URI to resolve for the prefix.":"命名空间URI解决前缀。","The element content converted to the requested typed object.":"元素内容转换为请求的键入对象。","Text to write.":"文字要写。"," property.  \n  \n ":"财产。"," that contains the namespace prefix assigned to the namespace URI specified; otherwise, ":"其中包含分配给指定名称空间URI的名称空间前缀； 否则，","The namespace prefix of this node. For example, ":"该节点的名称空间前缀。 例如，","The element content as a ":"元素内容作为一个","The low surrogate. This must be a value between ":"低替代物。 这必须是"," positioned on the node that you want to move to.":"位于您要移至的节点上。","The element contents as a ":"元素内容作为","The high surrogate. This must be a value between ":"高级代理。 这必须是"," if no prefix is assigned to the namespace URI specified. The ":"如果未将前缀分配给指定的命名空间URI。 这"," field of the compiled style sheet.":"编译样式表的字段。"," containing the style sheet.":"包含样式表。"," if the current node matches the specified XPath expression; otherwise, ":"如果当前节点匹配指定的XPATH表达式； 否则，","The element content as a double-precision floating-point number.":"元素内容作为双精度浮点数。"," is successful moving to the same position as the specified ":"成功地移至与指定的位置相同的位置","The URI of the style sheet.":"样式表的URI。"," object containing the compiled XPath expression.":"包含编译XPath表达式的对象。","The element content as a single-precision floating point number.":"元素内容是单精度的浮点数。"," used to resolve any style sheets referenced in XSLT ":"用于解决XSLT中引用的任何样式表"," to apply to the style sheet. If this is ":"适用于样式表。 如果是",", the position of the ":"，"," if the current node matches the ":"如果当前节点与",", external resources are not resolved.":"，外部资源无法解决。"," is unchanged.":"不变。"," setting is applied.":"设置已应用。","The element content as a 32-bit signed integer.":"元素内容作为32位签名的整数。"," to which you want to output.":"您要输出。"," interface. In the Microsoft .NET Framework, this can be either an ":"界面。 在Microsoft .NET框架中，这可以是"," used to resolve the style sheet URI and any style sheets referenced in XSLT ":"用于解决XSLT中引用的任何样式表和任何样式表","The namespace URI of the attribute; ":"属性的名称空间URI；","The element content as a 64-bit signed integer.":"元素内容为64位签名的整数。"," containing the input document.":"包含输入文档。"," (typically an ":"（通常是","The name of the class that contains the compiled style sheet.  \n  \n This is usually the name of the style sheet. Unless otherwise specified, the xsltc.exe tool uses the name of the style sheet for the class and assembly names.":"包含编译样式表的类的名称。 \n  \n  这通常是样式表的名称。 除非另有说明，否则XSLTC.EXE工具使用类和汇编名称的样式表的名称。"," used to resolve the XSLT ":"用于解析XSLT"," for an empty namespace.":"对于空名称空间。","A boxed common language runtime (CLR) object of the most appropriate type. The ":"最合适类型的盒装公共语言运行时（CLR）对象。 这"," function. If this is ":"功能。 如果是"," is successful moving to the attribute; otherwise, ":"成功地转移到属性； 否则，","), or an ":"），或","The namespace URI of the object.":"对象的名称空间URI。"," function is not resolved.":"功能无法解决。"," property determines the appropriate CLR type. If the content is typed as a list type, this method returns an array of boxed objects of the appropriate type.":"属性确定适当的CLR类型。 如果内容是作为列表类型键入的，则此方法将返回适当类型的盒装对象数组。","The URI of the input document.":"输入文档的URI。","The namespace URI object or ":"名称空间URI对象或","The local name of the child node to move to.":"儿童节点的本地名称搬到。","An integer value describing the relative order of the two base URIs: -1 if ":"描述两个基本uris的相对顺序的整数值：-1如果"," containing the data to be transformed.":"包含要转换的数据。","The URI of the output file.":"输出文件的URI。","The namespace URI of the child node to move to.":"孩子节点的名称空间URI移至。"," if one was not found.":"如果找不到。","The document to transform that is specified by the ":"要转换的文档由"," occurs before ":"发生之前"," to which you want to output.  \n  \n If the style sheet contains an ":"您要输出。 \n  \n  如果样式表包含","The name of the parameter. ":"参数的名称。","; 0 if the two base URIs are identical; and 1 if ":"; 0如果两个基础乌里斯相同； 1如果","Argument list as ":"参数列表为"," does not check to ensure the name passed is a valid local name; however, the name cannot be ":"不要检查以确保传递的名称是有效的本地名称； 但是，名称不能是"," element, you should create the ":"元素，您应该创建"," occurs after ":"在此之后发生"," by using the ":"通过使用"," using the ":"使用","The namespace URI associated with the parameter.":"与参数关联的名称空间URI。","The white space node that is to be preserved or stripped in the current context.":"在当前上下文中要保留或剥离的白空间节点。","The parameter object or ":"参数对象或"," if the white space is to be preserved; ":"如果要保留空白；"," object that is returned from the ":"从"," object returned from the ":"对象从","The namespace URI associated with the object to remove.":"与要删除对象关联的名称空间URI。"," object that contains the output information derived from the ":"包含从"," if the white space is to be stripped.":"如果要剥离空白。"," property. This ensures that the ":"财产。 这确保了","The object with the namespace URI or ":"具有名称空间URI或"," element of the style sheet. This value can be ":"样式表的元素。 这个值可以是","The prefix of the function as it appears in the XPath expression.":"该函数的前缀如XPath表达式中出现。"," has the correct output settings.":"具有正确的输出设置。","The name of the parameter to remove. ":"要删除的参数的名称。","The namespace URI to associate with the object. To use the default namespace, specify an empty string.":"与对象相关联的名称空间URI。 要使用默认名称空间，请指定一个空字符串。"," containing the namespace-qualified arguments used as input to the transform. This value can be ":"包含用作转换输入的名称空间合格参数。 这个值可以是","The namespace URI of the parameter to remove.":"要删除的参数的名称空间URI。","The name of the function.":"功能的名称。","The name to associate with the parameter.":"与参数关联的名称。","The stream to which you want to output.":"您要输出的流。","The location path of the style sheet.":"样式表的位置路径。","The namespace URI to associate with the parameter. To use the default namespace, specify an empty string.":"命名空间URI与参数相关。 要使用默认名称空间，请指定一个空字符串。","The line number indicating where the error occurred in the style sheet.":"线号指示误差在样式表中发生的位置。","The parameter value or object to add to the list.":"要添加到列表的参数值或对象。","The line position indicating where the error occurred in the style sheet.":"线位置指示误差在样式表中发生的位置。","The base URI of the first document to compare.":"第一个文档的基本URI。","The base URI of the second document to compare.":"第二个文档的基本URI进行比较。"}