{"The source object of the event.":"事件的源对象。"," object representing the path level of the current application.":"代表当前应用程序的路径级别的对象。"," object containing the value of a ":"包含一个值的对象"," if the attribute is in this collection; otherwise, ":"如果属性在此集合中； 否则，"," object is read only; otherwise, ":"仅读取对象； 否则，","A configuration event argument.":"配置事件参数。","The enumeration type to convert.":"要转换的枚举类型。","The name of the unrecognized element.":"未识别元素的名称。"," objects that receives the elements of this collection.":"接收此集合元素的对象。","The parent of this object.":"该对象的父母。"," object used during conversion.":"转换过程中使用的对象。","An input stream that reads XML from the configuration file.":"从配置文件读取XML的输入流。"," where this method starts copying this collection.":"此方法开始复制此集合。","The context of this object.":"此对象的上下文。"," if the control should automatically persist its state; otherwise, ":"如果控制应自动持续其状态； 否则，"," object to convert.":"要转换的对象。"," object that contains the LDAP display names of the attributes in this collection.":"包含此集合中属性的LDAP显示名称的对象。"," if the unrecognized element was deserialized successfully; otherwise, ":"如果未识别的元素被成功地被取消序列化； 否则，"," containing the settings key for the current instance of the control.":"包含控件的当前实例的设置密钥。"," type that represents the ":"代表"," object in the configuration.":"配置中的对象。","A Boolean that indicates if International Resource Identifier (IRI) processing is enabled.":"一个布尔值，指示是否启用了国际资源标识符（IRI）处理。"," representing the collection parent element, if any; otherwise, ":"表示收集父元素，如果有的话； 否则，","The LDAP display name of the attribute to get.":"要获取的属性的LDAP显示名称。","The created object handler.":"创建的对象处理程序。","The value to convert to.":"要转换的值。"," that requires serialization.":"这需要序列化。"," object that represents the specified attribute.":"表示指定属性的对象。"," enumeration value defining the category of the application settings property.":"定义应用程序设置属性类别的枚举价值。","Output stream that writes XML to the configuration file.":"将XML写入配置文件的输出流。","If found, the ":"如果发现，"," object to search for in this collection.":"目的是在此集合中搜索。"," describing the current application usage.":" 描述当前应用程序的使用情况。"," to serialize the collection key; otherwise, ":"序列化集合密钥； 否则，","An integer that specifies the minimum length of the string value.":"一个说明字符串值的最小长度的整数。"," whose value is to be returned.":"其价值将被返回。"," was written to the configuration file successfully.":"成功地写入了配置文件。"," object is in this collection; otherwise, ":"对象在此集合中； 否则，"," that can persist the specified settings property; otherwise, ":"可以坚持指定的设置属性； 否则，","An integer that specifies the maximum length of the string value.":"一个指定字符串值的最大长度的整数。","A string specifying the key.":"指定密钥的字符串。","Array to which to copy this ":"来复制的数组"," containing the value of the specified property setting as it was last set in the previous version of the application; or ":"在应用程序的上一个版本中，包含指定属性设置的值； 或者","The zero-based index of the first matching object. Returns -1 if no member of this collection is identical to the ":"第一个匹配对象的基于零的索引。 返回-1，如果该集合的成员与","A string that represents invalid characters.":"表示无效字符的字符串。"," if the setting cannot be found.":"如果找不到设置。","A string specifying the value.":"指定值的字符串。"," object that is copied to this object.":"复制到此对象的对象。"," object at the current level containing a merged view of the properties.":"当前级别的对象包含属性的合并视图。","The string that contains the set of characters that are not allowed for the property.":"包含属性不允许的字符集的字符串。"," containing the settings property group whose values are to be retrieved.":"包含要检索值的设置属性组。"," to which the key should be returned.":"钥匙应返回到其中。"," object of the current element, or ":"当前元素的对象，或"," members that specifies the first hour that the source will be available for replication.":"指定源可以复制的第一个小时的成员。","An object that acts as the key for the specified ":"充当指定关键的对象","An integer that indicates the maximum allowed length for the string to assign to the property.":"一个整数，指示字符串分配给属性的最大长度。","The created section handler object.":"创建的部分处理程序对象。"," members that specifies the first 15-minute interval that the source will be available for replication.":"指定源可以复制的第一个15分钟间隔的成员。","One of the enumeration value that determines which property values to include.":"确定要包括的属性值的枚举值之一。","A string specifying the ":"指定的字符串","The object representing the configuration.":"代表配置的对象。","An integer that indicates the allowed minimum length for the string to assign to the property.":"一个整数，指示字符串分配给属性的允许的最小长度。"," members that specifies the final hour that the source will be available for replication.":"指定源可以复制的最后一个小时的成员。"," of this collection.":"这个系列。"," that contains the current configuration setting for IDN processing.":"其中包含用于IDN处理的当前配置设置。","A current ":"一种趋势"," contained in the collection.":"包含在集合中。"," members that specifies the final 15-minute interval that the source will be available for replication.":"指定最终15分钟间隔的成员，该源将可用于复制。"," settings in a ":"设置","A configuration element, or ":"配置元素，或","The configuration settings in a corresponding parent configuration section.":"相应的父型配置部分中的配置设置。"," members that specifies the day of the week that the source will be available for replication.":"指定一周中的成员可以进行复制。","The name of the collection; otherwise, an empty string. The default is an empty string.":"集合的名称；否则为空字符串。 默认值为空字符串。","A three-dimensional array of ":"三维阵列","The base class to validate against.":"验证的基类。"," if the key does not exist in the collection.":"如果键在集合中不存在。","The virtual path for which the configuration section handler computes configuration values. Normally this parameter is reserved and is ":"配置部分处理程序计算配置值的虚拟路径。 通常此参数是保留的，是"," if the collection has been cleared; otherwise, ":"如果收集已清除； 否则，"," elements in which the element is ":"该元素为元素"," that contains the configuration information to be handled. Provides direct access to the XML contents of the configuration section.":"其中包含要处理的配置信息。 提供对配置部分的XML内容的直接访问。","A collection of configuration properties.":"配置属性的集合。"," if an attempt to add a duplicate ":"如果尝试添加重复"," parameter matches a type that can be validated; otherwise, ":"参数匹配可以验证的类型； 否则，","The created configuration handler object.":"创建的配置处理程序对象。"," if the source is available for replication during that specific 15-minute interval. The element is ":"如果在该特定的15分钟间隔期间可用于复制源。 元素是"," that describes where the application settings property is used.":"描述了应用程序设置属性的位置。"," to this ":"对此","The base class type.":"基类类型。"," parameter is the ":"参数是"," if the source is not available for replication.  \n  \n The array is in the form RawSchedule[<day-of-week>, <hour>, <15-minute interval>]. All of these values are zero-based and the week begins at 00:00 on Sunday morning, Coordinated Universal Time.  \n  \n The following are the valid values for the day-of-week.  \n  \n ":"如果源无法复制。 \n  \n  阵列以Rawschedule的形式[<Day of-day of-hour>，<小时>，<15分钟间隔>]。 所有这些价值都是零基于零的，一周从周日早上00:00开始，协调了通用时间。 \n  \n  以下是一天的有效值。"," will cause an exception to be thrown; otherwise, ":"会导致例外。 否则，","The base type of the object being validated.":"对象的基本类型要验证。"," representing the application setting if found; otherwise, ":"如果发现表示应用程序设置； 否则，"," \"infinite\"; otherwise, the ":" \"无限\"；否则， ","The object that holds the information to deserialize.":"保存信息的对象。","  \n\n The hour is zero-based and specified in 24-hour format. For example, 2 P.M. would be specified as 14. Valid values are 0-23.  \n  \n The 15-minute interval specifies the 15-minute block within the hour that the source is available for replication. The following table identifies the possible values for the 15-minute interval.  \n  \n ":"小时为零，并以24小时格式指定。 例如，下午2点 将指定为14。有效值为0-23。 \n  \n  15分钟的间隔指定源可复制的小时内的15分钟块。 下表确定了15分钟间隔的可能值。","A message that describes why this ":"一条描述为什么这一点的消息"," parameter in seconds.":"参数以秒为单位。"," containing the values for the specified settings property group.":"包含指定设置属性组的值。"," objects for the classes that were retrieved.":"检索的类的对象。"," parameter integer value.":"参数整数值。","The friendly name of the provider.":"提供商的友好名称。"," object that specifies the minimum time allowed to pass validation.":"指定允许通过验证的最短时间的对象。"," exception was thrown.":"抛出了例外。"," \"infinite\" if the ":"“无限”如果"," members that identifies which type of classes to retrieve.":"确定要检索哪种类型类的成员。","A collection of the name/value pairs representing the provider-specific attributes specified in the configuration for this provider.":"代表该提供商配置中指定的提供商特定属性的名称/值对的集合。","The exception that caused this ":"引起这一点的例外"," object that specifies the maximum time allowed to pass validation.":"指定允许通过验证的最大时间的对象。"," infinite; otherwise, the ":"无穷; 否则，"," objects for the properties that were retrieved.":"检索属性的对象。"," exception to be thrown.":"抛出的例外。"," value that specifies a number of seconds.":"指定秒数的值。"," representing the group of property settings to set.":" 表示要设置的属性设置组。"," members that identifies which type of properties to retrieve.":"确定要检索的属性类型的成员。","The allowed maximum ":"允许的最大值","The inner exception that caused this ":"引起这一点的内心例外"," parameter in minutes.":" 参数以分钟为单位。","A string that contains the application's display name.":"包含应用程序显示名称的字符串。","The LDAP display name of the class to find.":"要查找的类的LDAP显示名称。","The path to the configuration file that caused this ":"导致此的配置文件的路径","The allowed minimum ":"允许的最小值"," used during object conversion.":"在对象转换期间使用。"," value that specifies the minimum length of the ":" 指定最小长度的值 "," object that represents the class with the specified name.":"用指定名称表示类的对象。","The line number within the configuration file at which this ":"配置文件中的行号"," \"infinite\", if the ":"“无限”，如果","The minimum allowed ":"最低允许 "," value that specifies the maximum length of the ":"指定最大长度的值"," object that specifies the minimum value.":"指定最小值的对象。","The common name of the defunct class to find.":"要查找的已停产类的通用名称。","The path to the configuration file from which the internal ":"内部配置文件的路径","The configuration setting for International Domain Name (IDN) processing in the ":"国际域名（IDN）处理的配置设置"," value that specifies a specific value that must be matched.":"指定必须匹配的特定值的值。"," object was loaded when this configuration exception was thrown.":"当抛出此配置异常时，加载对象。"," object that specifies the maximum value.":"指定最大值的对象。"," object that represents the class with the specified common name.":"用指定通用名称代表类的对象。","The configuration setting for International Resource Identifiers (IRI) parsing in the ":"国际资源标识符（IRI）解析的配置设置","A long integer that indicates the allowed maximum value.":"一个长整数，指示允许的最大值。","The path of the configuration file the internal ":"配置文件的路径内部"," to specify that the validation range is exclusive. Inclusive means the value to be validated must be within the specified range; exclusive means that it must be below the minimum or above the maximum.":"指定验证范围是独有的。 包容性意味着要验证的值必须在指定范围内； 独家表示必须低于最小值或高于最大值。","The configuration settings for scheme parsing in the ":"方案解析的配置设置","The configuration context object.":"配置上下文对象。","The common name of the defunct property to find.":"要查找的已解决属性的通用名称。"," object was accessing when the exception occurred.":"发生异常时，对象正在访问。","The section XML node.":"XML节点节。"," object that specifies the minimum length of the integer value.":"指定整数值的最小长度的对象。"," class":"班级"," object that represents the property.":"代表属性的对象。","The line number within the configuration file that contains the ":"配置文件中包含的行号","The callback method.":"回调方法。"," value containing the name of the key attribute.":"包含关键属性名称的值。"," object that specifies the maximum length of the integer value.":"指定整数值的最大长度的对象。","The LDAP display name of the property to find.":"要查找的属性的LDAP显示名称。"," object being parsed when this configuration exception was thrown.":"当抛出此配置异常时，对象正在解析。"," value containing the name of the value attribute.":"包含值属性名称的值。"," object that represents the property with the specified name.":"用指定名称表示属性的对象。","An object representing the converted value.":"代表转换值的对象。"," value that specifies whether the validation range is exclusive.":"指定验证范围是独家的值。","The line number within the configuration file that the ":"配置文件中的行号"," object that specifies a value that must be matched.":"指定必须匹配的值的对象。"," parameter matches a ":" 参数匹配a "," object that represents the schema for the domain that the local computer is a member of.":"代表本地计算机为域名的域模式的对象。","The object that holds the information to be serialized.":"持有要序列化信息的对象。","An object containing the default value of the configuration attribute.":"包含配置属性默认值的对象。","The bitmap suffix.":"的位图后缀。"," parameter matches an ":"参数匹配an"," object that contains the target and credentials to use to retrieve the object. The target of the context must be a forest, directory server, or configuration set.":"包含用于检索对象的目标和凭证的对象。 上下文的目标必须是森林，目录服务器或配置集。","A description of why this ":"描述了为什么","The name of the counter, which must be unique within its category.":"计数器的名称，其类别中必须是唯一的。"," if the value must be excluded; otherwise, ":"如果必须排除该值； 否则，"," object that represents the schema for the specified context.":"代表指定上下文的架构的对象。","The description of the configuration attribute.":"配置属性的描述。","An integer that indicates the allowed maximum value.":"表示允许最大值的整数。","The text that describes the counter's behavior.":"描述计数器行为的文字。"," was thrown.":"被扔了。"," if the configuration attribute is a key; otherwise, ":" 如果配置属性是键；否则, "," object that represents the server that is the schema master.":"代表架构主服务器的对象。"," object is locked; otherwise, ":"对象已锁定； 否则，","An integer that indicates the allowed minimum value.":"表示允许最小值的整数。"," that identifies the counter's behavior.":"这确定了计数器的行为。"," object that contains errors that identify the reasons this ":"包含错误的对象，以识别此原因"," object that specifies the context for this ":"为此指定上下文的对象"," to be thrown.":"被扔。","A name for the counter, which is unique in its category.":"柜台的名称，其类别是唯一的。"," validator instance.":"验证器实例。"," object has been modified; otherwise, ":"对象已修改； 否则，"," that represents the LDAP display name for this ":"代表此的LDAP显示名称","An extended description of why this ":"关于为什么这个原因的扩展描述"," object is required; otherwise, ":"需要对象； 否则，"," that defines the behavior of the performance counter.":"这定义了性能计数器的行为。","A string representing the path to a configuration file.":"表示配置文件路径的字符串。","A message describing why this ":"一条消息描述了为什么"," that specifies the LDAP display name of the schema class for the search.":"这指定了用于搜索的模式类的LDAP显示名称。"," that holds ":"那就是","A line number of the configuration file.":"配置文件的行号。","A string representing a location subpath.":"代表位置子路径的字符串。"," object for the schema class that was found. Returns ":"发现的模式类的对象。 返回"," to be thrown, if any.":"如果有的话，被扔了。"," object to append to the existing collection.":"对象以附加到现有集合。","The source file of the ":"源文件的源文件"," representing a new configuration context.":"表示新的配置上下文。"," if the class was not found.":"如果找不到班级。","The index of the new ":"新索引","An object containing the value for the ":"一个包含值的对象"," that caused this ":"那引起了这一点"," representing a deprecated configuration context.":"表示不弃用的配置上下文。"," object, which is used to iterate through this ":"对象，用于迭代通过此迭代"," instances to append to the existing collection.":"实例附加到现有集合。"," collection of the properties of the ":"收集的属性"," representing the node file name.":"表示节点文件名。","An encrypted section of a configuration file.":"配置文件的加密部分。"," object to find in the collection.":"在集合中找到的对象。","The name of the configuration attribute contained in the ":"配置属性的名称",", including ancestor properties.":"，包括祖先的特性。"," representing the node line number.":"表示节点线号。","An object containing the providers that encrypt and decrypt protected configuration data.":"一个包含加密和解密受保护配置数据的提供商的对象。","The name of the default protected-configuration provider.":"默认保护配置提供商的名称。","The zero-based index of the location at which the ":"位置的基于零的索引"," object that represents the directory entry for the schema class.":"代表模式类目录条目的对象。","The name of the machine configuration file.":"机器配置文件的名称。"," collection of installed ":"安装的集合","An object that provides programatic access to the ":"提供程序访问的对象 "," is to be inserted.":"要插入。"," that represents the LDAP display name of the ":"代表LDAP的显示名称","The machine configuration file name.":"机器配置文件名。"," configuration section.":"配置部分。"," object containing decrypted data.":"包含解密数据的对象。","The object that will be validated.":"将要验证的对象。"," objects that represent the auxiliary classes of the current schema class object.":"代表当前模式类对象的辅助类的对象。","A Configuration object.":"配置对象。","A string representing a decrypted configuration section.":"表示解密配置部分的字符串。"," object containing encrypted data.":"包含加密数据的对象。","An index into the ":"索引"," that represents the CN of the current class object.":" 表示当前类对象的CN。"," object performing I/O tasks on a configuration file.":"对象在配置文件上执行I/O任务。","The relative path to the resource whose configuration settings are represented by this ":"配置设置由此表示的资源的相对路径"," object with the specified name, or ":"具有指定名称的对象，或","The collection index, which is used to access individual elements of the collection.":"集合索引，用于访问集合的各个元素。"," object that represents the default security descriptor for the current schema class object.":"代表当前架构类对象的默认安全描述符的对象。"," if there is no object with that name.":"如果没有该名称的对象。","A section of the configuration that is not encrypted.":"未加密的配置部分。","The name of the configuration object.":"配置对象的名称。","The name of the default ":"默认的名称","The numeric value associated with the performance counter sample.":"与性能计数器样本关联的数字值。"," that contains a description of the current class object.":"其中包含当前类对象的描述。","The name of the configuration object to verify.":"要验证的配置对象的名称。","An object containing the providers that encrypt and decrypt protected configuration data":"一个包含加密和解密受保护配置数据的提供商的对象","An optional, base raw value for the counter, to use only if the sample is based on multiple counters.":"仅当样本基于多个计数器时，才能使用计数器的可选基本原始值。"," collection property.":"收集属性。"," value that indicates if the current schema class object is defunct. ":"指示当前架构类对象是否已停用的值。"," contains the specified configuration object; otherwise, ":"包含指定的配置对象； 否则，","A string representing an encrypted section of the configuration object.":"代表配置对象的加密部分的字符串。","The frequency with which the counter is read.":"读取计数器的频率。"," collection of all the ":"收集所有"," if the object is defunct; otherwise, ":"如果对象已删除； 否则，","A string representing a configuration path.":"表示配置路径的字符串。"," if the specified configuration object in the ":"如果在","The frequency with which the system reads from the counter.":"系统从柜台读取的频率。"," objects in all participating configuration files.":"所有参与配置文件中的对象。"," objects that represent the properties that the ":"表示属性的对象","A string representing the configuration type.":"表示配置类型的字符串。","The raw time stamp.":"原始时间戳记。"," that represents the properties of the providers for the protected configuration data.":"这代表了受保护配置数据提供商的属性。","A comma-delimited string.":"逗号分隔的字符串。"," object must contain.":"对象必须包含。"," if an exception should be thrown if an error is encountered; ":"如果遇到错误，应抛出异常；"," objects that represent the properties of the providers for the protected configuration data.":"代表受保护配置数据提供商属性的对象。","The raw, high-fidelity time stamp.":"原始的，高保真的时间戳。","A string that contains the ldapDisplayName of the ":"一个包含ldapdisplayname的字符串","A comma-delimited string that lists the lock configuration objects in the collection.":"一个逗号限制的字符串，列出了集合中的锁定配置对象。"," if an exception should not be thrown if an error is encountered.":"如果遇到错误，则不应抛出异常。","A brief, friendly description suitable for display in administrative tools or other UIs.":"简短，友好的描述，适合在管理工具或其他UI中显示。"," object that indicates the type of the counter for which this sample is a snapshot.":"表示该样品是快照的计数器类型的对象。"," that represents the OID of the ":"这代表了","The number of locked configuration objects contained in the collection.":"集合中包含的锁定配置对象的数量。"," representing the type of the configuration.":"表示配置的类型。","The friendly name used to refer to the provider during configuration.":"友好名称用于在配置期间参考提供商。"," collection has parent elements; otherwise, ":"收集有家长元素； 否则，","The time at which the sample was taken.":"采集样品的时间。"," objects that this class can contain.":"该类可以包含的对象。","A string representing the type name of the configuration object.":"表示配置对象的类型名称的字符串。","The provider to be added.":"提供商要添加。"," collection has been modified; otherwise, ":"收集已修改； 否则，"," structure to use as a base point for calculating performance data.":"用于计算性能数据的基本点的结构。"," objects that can contain this class.":"可以包含此类的对象。"," if the host has finished initialization; otherwise, ":"如果主机已经完成初始化； 否则，"," collection is synchronized; otherwise, ":"收集是同步的； 否则，","The calculated performance value.":"计算的性能值。","The array to copy the elements of the collection to.":"将集合元素复制到的数组。"," object that contains the schemaIDGUID for the ":"包含示意图的对象","A string representing the name of a ":"一个代表名称的字符串","An object used to synchronize access to this ":"用于同步访问此的对象","The index of the collection item at which to start the copying process.":"启动复制过程的收集项目的索引。"," object..":"目的.."," structure to use as an ending point for calculating performance data.":" 结构以用作计算性能数据的终点。","A string representing the configuration source.":"表示配置源的字符串。","The configuration section path and name. Node names are separated by forward slashes, for example \"system.net/mailSettings/smtp\".":"配置部分路径和名称。 节点名称通过前向斜杠分开，例如“ system.net/mailsettings/smtp”。"," object that contains the schema class from which the current schema class is derived. ":"包含来自当前架构类的模式类的对象。"," structure to be compared with this instance.":"与此实例进行比较的结构。"," to iterate through the collection.":"通过收藏进行迭代。"," if the section does not exist.":"如果本节不存在。"," object performing I/O tasks on a configuration source.":"对象在配置源上执行I/O任务。"," if no schema class was specified during the creation of the current class.":"如果在创建当前类期间未指定架构类。","The name of the provider to be removed.":"要删除的提供商的名称。"," structure to be compared with the current structure.":"结构要与当前结构进行比较。","One of the enumeration values that specifies the user level for which you are opening the configuration.":"指定您打开配置的用户级别的枚举值之一。"," object representing the version of a ":"代表版本的对象","The index of the array at which to start copying provider instances from the collection.":"开始从集合中复制提供商实例的数组索引。"," value that contains the type of the current ":"包含电流类型的值"," structure and is identical to the current instance; otherwise, ":"结构，与当前实例相同； 否则，","A parameter object containing the values used for initializing the configuration host.":"一个包含用于初始化配置主机的值的参数对象。","The number of providers in the collection.":"集合中的提供商数量。","The configuration file for the current application.":"当前应用程序的配置文件。"," object to append to this collection.":"目的是附加到此集合中的对象。","A hash code for the current counter sample.":"当前计数器样本的哈希代码。","The path of the executable (exe) file.":"可执行文件（EXE）文件的路径。","The key by which the provider is identified.":"确定提供商的关键。"," structure to be compared to the structure specified by the ":"将要比较的结构与","A string representing a location subpath (passed by reference).":"表示位置子路径的字符串（通过参考传递）。"," object that is appended to this collection.":"附加到此集合的对象。","The specified configuration file.":"指定的配置文件。","The location configuration path.":"位置配置路径。","The base raw value, which is used only if the sample is based on multiple counters.":"基本原始值，仅当样本基于多个计数器时才使用该值。","The provider with the specified name.":"带有指定名称的提供商。","The machine configuration file.":"机器配置文件。"," array that contains the objects to append to this collection.":"包含要附加到此集合的对象的数组。","The configuration root element.":"配置根元素。","The name of the provider to configure settings for.":"提供商的名称要配置设置。","A parameter object representing the parameters used to initialize the host.":"代表用于初始化主机的参数的参数对象。","The numeric value that is associated with the performance counter sample.":"与性能计数器示例关联的数值。","The configuration file to use instead of the application default configuration file.":"用于使用的配置文件代替应用程序默认配置文件。"," object that contains the objects to append to this collection.":"包含要附加到此集合的对象的对象。","The type of the provider to configure settings for.":"为了配置设置的提供商的类型。","The system time stamp.":"系统时间戳。"," if the configuration is above the application configuration in the configuration hierarchy; otherwise, ":"如果配置在配置层次结构中的应用程序配置之上； 否则，","The configuration object.":"配置对象。"," of parameters for the provider.":"提供商的参数。","The zero-based index in this collection where the object is inserted.":"插入对象的此集合中的从零开始的索引。","The system time stamp, represented within 0.1 millisecond.":"系统时间戳记在0.1毫秒内表示。"," if a configuration record is required for the host configuration initialization; otherwise, ":"如果主机配置初始化需要配置记录； 否则，","The fully qualified namespace and class name for the type of provider configured by this ":"完全合格的名称空间和类型的提供商的类型","The configuration file to use instead of the default application configuration file.":"用于使用的配置文件代替默认应用程序配置文件。"," object to insert into this collection.":"对象插入此集合中。"," that indicates the most recent sample the system has taken.":"这表明该系统采集的最新样本。"," to preload all section groups and sections; otherwise, ":"预订所有部分组和部分； 否则，"," if the grant or restriction of definitions in the host configuration was successful; otherwise, ":"如果主机配置中的定义的赠款或限制成功； 否则，","A string reference to the ":"一个字符串引用 ","The zero-based index at which the element was inserted.":"插入元素的基于零的索引。","The configuration section name or the configuration path and section name of the section to refresh.":"“配置”部分名称或“配置路径”和“刷新”部分的名称。"," object contained in the collection.":"集合中包含的对象。","A floating-point representation of the performance counter's calculated value.":"性能计数器计算出的值的浮点表示。"," if the path used by a ":" 如果一个使用的路径 ","The zero-based index at which the element was removed.":"删除元素的基于零的索引。"," that indicates a previous sample the system has taken.":"这表明该系统已采取了先前的样本。","A string that specifies a regular expression.":"指定正则表达式的字符串。"," object for the current application's default configuration.":"当前应用程序的默认配置的对象。"," object to read a configuration file is a valid path; otherwise, ":" 读取配置文件的对象是有效路径；否则, ","The element that was removed from this collection.":"从此集合中删除的元素。","The name of the configuration entity.":"配置实体的名称。"," parameter matches a string; otherwise, ":"参数匹配字符串； 否则，","The call index.":"呼叫索引。","The type of the configuration entity.":"配置实体的类型。","The zero-based index at which the set operation occurred.":"设置操作发生的基于零的索引。"," if the configuration section requires a fully trusted code access security level and does not allow the ":"如果配置部分需要完全信任的代码访问安全级别，并且不允许","The string to use for regular expression validation.":"用于正则表达验证的字符串。","A pointer to a Unicode string list with the requested object identifiers.":"带有请求的对象标识符的Unicode字符串列表的指针。","The default value of the configuration entity.":"配置实体的默认值。","The element that was replaced by ":"被取代的元素","The string containing the regular expression used to filter the string assigned to the decorated configuration-element property.":"包含用于过滤的正则表达式的字符串，用于过滤分配给装饰的配置元素属性的字符串。"," attribute to disable implicit link demands; otherwise, ":"归因于禁用隐式链接需求； 否则，","The element that replaced ":"替换的元素","The type of the converter to apply.":"要应用的转换器的类型。","A pointer to the data buffer.":"指向数据缓冲区的指针。","The size of the key to add.":"要添加的密钥的大小。"," if the initialization of a configuration object is considered delayed; otherwise, ":"如果将配置对象的初始化视为延迟； 否则，","The validator to use.":"验证器要使用。","A pointer to a number of bytes.":"指向许多字节的指针。","The element to validate in this collection.":"在此集合中验证的元素。"," to indicate that the key is exportable; otherwise, ":"表明钥匙是可导出的； 否则，"," if the configuration object supports a location tag; otherwise, ":"如果配置对象支持位置标签； 否则，"," to the first byte after the data, -1 for an error, or -2 if a larger buffer is required. This parameter is passed uninitialized.":"到数据之后的第一个字节，-1表示错误，如果需要较大的缓冲区，则为-2。 该参数通过非初始化。"," to decrypt.":"解密。"," object to remove from this collection.":"从此集合中删除的对象。","The description of the configuration entity.":"配置实体的描述。"," if the configuration path is to a configuration node whose contents should be treated as a root; otherwise, ":"如果配置路径是到配置节点，其内容应被视为根； 否则，","The decrypted XML node.":"解密的XML节点。"," that specifies the LDAP display name of the schema property to search for.":"这指定了要搜索的模式属性的LDAP显示名称。","The name of an instance associated with the performance counter.":"与性能计数器关联的实例的名称。"," used to convert this ":"用于转换这个"," if the configuration path is trusted; otherwise, ":"如果配置路径被信任； 否则，"," into an XML representation for writing to the configuration file.":"进入XML表示形式，以写入配置文件。"," taken from the instance specified by the ":"取自由"," object for the schema property that is found. ":"发现的模式属性的对象。"," to encrypt.":"加密。","The object specified by ":"由","The raw value read by the performance counter sample associated with the ":"通过与"," object that represents the directory entry for the schema property.":"表示模式属性的目录条目的对象。"," that can be cast to the type specified by the ":" 可以强制转换为由 "," to assert permissions; otherwise, ":"主张许可； 否则，","The file name and path to export the key to.":"将密钥导出的文件名和路径。"," value that describes the property.":"描述属性的值。"," that gets or sets the CN of the ":"得到或设置了","The name of the counter, which often describes the quantity that is being counted.":"计数器的名称，通常描述要计算的数量。"," object from which file attributes are to be copied as a template.":"将文件属性复制为模板的对象。"," to indicate that private parameters are exported; otherwise, ":"指出私人参数已导出； 否则，"," if the property requires assembly name transformation; otherwise, ":"如果属性需要汇编名称转换； 否则，","The name of the instance to find in this collection.":"在此集合中找到的实例名称。"," that gets or sets a description of the current ":"获取或设置了当前的描述","The file name and path to import the key from.":"从中导入密钥的文件名和路径。"," if the property is the default collection of an element; otherwise, ":"如果属性是元素的默认集合； 否则，","The write context of the ":"的写入上下文 "," if the instance exists in the collection; otherwise, ":"如果实例存在于集合中； 否则，"," value that indicates whether  the current schema property object is defunct. ":"指示当前架构属性对象是否已删除的值。"," object is the key for the containing element; otherwise, ":"对象是包含元素的关键； 否则，"," object (passed by reference).":"对象（通过引用传递）。","The name of the CryptoAPI cryptographic service provider.":"加密加密服务提供商的名称。","The zero-based index value at which to add the new instances.":"添加新实例的基于零的索引值。"," value that indicates whether the schema property is in the ANR set. ":"表示模式属性是否在ANR集合中的值。"," object that contains the public key used by the provider.":"包含提供商使用的公钥的对象。"," is required; otherwise, ":"是必须的; 否则，","The performance counter name.":"性能计数器名称。"," object performing I/O tasks on the configuration file (passed by reference).":"对象在配置文件上执行I/O任务（通过参考传递）。"," if it is in the ANR set; otherwise, ":"如果在ANR集合中； 否则，"," if the property requires type-name transformation; otherwise, ":"如果属性需要类型名称转换； 否则，","The object specified by the ":"由"," if the provider uses FIPS; otherwise, ":"如果提供商使用FIPS； 否则，","The name of the performance counter category instance, or an empty string (\"\") if the category contains a single instance.":"如果类别包含一个实例，则性能计数类别实例的名称或一个空字符串（“”）。"," value that indicates whether  the current schema property is indexed in the Active Directory Domain Services store. ":"表示当前架构属性是否在Active Directory域服务存储中索引的值。"," if the parent configuration section should be queried; otherwise, ":"如果应查询父构型部分； 否则，"," if the entire configuration file could be read by the ":"如果整个配置文件可以通过"," item, by which the ":"项目，通过"," object is using the machine key container; otherwise, ":"对象使用机器密钥容器； 否则，"," if the property is indexed; otherwise, ":"如果索引属性； 否则，"," representing the type of this ":"代表此类型"," object is indexed.":"对象已索引。"," value that indicates whether the schema property is indexed in all containers.":"表示模式属性是否在所有容器中索引的值。"," object is using Optimal Asymmetric Encryption Padding (OAEP) key exchange data; otherwise, ":"对象使用最佳的不对称加密填充（OAEP）密钥交换数据； 否则，"," object designated by ":"对象指定"," validator, which is used to validate this ":"验证器，用于验证此"," that represents a set of object-specific registry keys.":"这代表了一组特定于对象的注册表键。"," value that indicates whether the schema property is contained in the global catalog. ":"表示模式属性是否包含在全局目录中的值。","The value of GenericUriParserOptions entry.":"GenericUriParserOptions条目的值。","Name of the ":"的名字"," that represents the counter's raw data values.":"这代表计数器的原始数据值。","A string representing the name of a section group in the configuration file.":"一个代表配置文件中部分组名称的字符串。"," if it is contained in the global catalog; otherwise, ":"如果它包含在全球目录中； 否则，","The protocol used by this schema setting.":"该模式设置使用的协议。","The name of the performance counter.":"性能计数器的名称。"," value that indicates whether the schema property is contained in the tombstone object. ":"表示模式属性是否包含在墓碑对象中的值。"," object defined.":" 对象定义。","A string representing the name of a section in the configuration file.":"表示配置文件中节的名称的字符串。","The default collection type of ":"默认集合类型的类型"," if it is contained in the tombstone object; otherwise, ":"如果它包含在墓碑对象中； 否则，"," if an instance data collection containing the specified counter exists in the collection; otherwise, ":"如果集合中存在包含指定计数器的实例数据集合； 否则，"," if a section of the configuration file designated by the ":"如果配置文件的一部分由","The object representing the default value of the decorated configuration-element property.":"代表装饰配置元件属性的默认值的对象。"," value that indicates whether the schema property is single valued. ":"表示模式属性是否为单个值的值。"," if the associated section should be written in the configuration file; otherwise, ":"如果相关部分应写在配置文件中； 否则，"," instances (identified by the counters they contain) to add to the collection.":"实例（由他们包含的计数器确定）以添加到集合中。"," if the property represents the default collection of an element; otherwise, ":"如果属性表示元素的默认集合； 否则，"," if it is single-valued; otherwise, ":"如果是单值； 否则，"," parameters can be read by a ":"参数可以通过","The configuration section that contains the ":"包含的配置部分"," that represents the counter's instances and their associated data values.":"这代表计数器的实例及其相关的数据值。"," if the property is a key property for an element of the collection; otherwise, ":"如果该属性是集合元素的关键属性； 否则，"," object to receive the returned data representing the changes in the configuration file.":"对象接收代表配置文件中更改的返回数据。","The XML representation for this configuration section.":"此配置部分的XML表示。"," value that indicates whether the schema property has a tuple index. ":" 指示模式属性是否具有元组索引的值。 "," if the property is required; otherwise, ":"如果需要该财产； 否则，"," to access the counter in read-only mode (although the counter itself could be read/write); ":"要以仅阅读模式访问计数器（尽管可以读/写入计数器本身）；","The name of the protection provider to use.":"使用保护提供商的名称要使用。"," if there is a tuple index for the property; otherwise, ":"如果该物业有元组索引； 否则，"," to access the counter in read/write mode.":"在读/写模式下访问计数器。","The name of the decorated configuration-element property.":"修饰的configuration-element属性的名称。"," object that is linked to the current ":"链接到当前的对象","The XML to use.":"使用的XML。"," instance containing changed configuration settings.":" 包含更改的配置设置的实例。"," enumeration values associated with the property.":"与属性关联的枚举值。"," object":"目的","The name of the performance counter category instance, or an empty string (\"\"), if the category contains a single instance.":"如果类别包含一个实例，则性能计数类别实例的名称或一个空字符串（“”）。"," value that represents the linkID value when the schema property is linked.":"代表链接属性链接时的链接值的值。","A value that indicates where in the configuration file hierarchy the associated ":"一个值指示在配置文件层次结构中的何处关联的值","An identifier for the ":"标识符"," to access a counter in read-only mode; ":"以仅阅读模式访问计数器；"," if writing to the configuration file completed successfully; otherwise, ":"如果写入配置文件成功完成； 否则，"," object can be declared.":"可以声明对象。"," value that contains the ldapDisplayName of the ":"包含ldapdisplayname的值","Array to which to copy.":"要复制的数组。"," to access a counter in read/write mode.":"在读/写模式下访问计数器。"," object performing I/O tasks on the configuration file.":"对象在配置文件上执行I/O任务。"," value that contains the OID of the current ":"包含电流的OID的值"," object can be declared for .exe files.":"可以为.exe文件声明对象。","The computer on which the performance counter and its associated category exist.":"存在性能计数器及其相关类别的计算机。"," that represents the minimum value or length of the ":"代表最小值或长度","Index at which to begin copying.":"开始复制的索引。"," to indicate that writing was completed successfully; otherwise, ":"表明写作成功完成； 否则，","The decremented counter value.":"降低的反价值。"," attribute is allowed; otherwise, ":"允许属性； 否则，"," object as it applies to the collection":"适用于集合的对象"," value that indicates the maximum value or length of the ":"表示最大值或长度的值"," if the current instance has a local configuration; otherwise, ":"如果当前实例具有本地配置； 否则，","The incremented counter value.":"增量计数器值。"," if the section can be overridden; otherwise, ":"如果可以覆盖该部分； 否则，"," that represents the schemaIDGuid for the ":"代表了示意图","The array to which to copy.":"要复制的数组。"," if the current instance has a roaming configuration; otherwise, ":"如果当前实例具有漫游配置； 否则，","The name of the include file in which the associated ":"关联的包含文件的名称","The value to increment by. (A negative value decrements the counter.)":"要增加的值。 （负值降低了计数器。）"," object that defines the property type of the ":"定义属性类型的对象"," is defined, if such a file exists; otherwise, an empty string (\"\").":"定义，如果存在此类文件； 否则，一个空字符串（“”）。"," if the delegated host's sections belong to ":"如果委派主持人的部分属于","The new counter value.":"新的计数器值。","The index location at which to begin copying.":"开始复制的索引位置。","The element in this collection to validate.":"要验证此集合中的元素。"," object will be saved even if it has not been modified; otherwise, ":"即使没有修改对象，也会保存对象； 否则，"," and the configuration file for the application is downloaded via HTTP using ":"并使用HTTP下载应用程序的配置文件","The number of properties in the collection.":"集合中的属性数量。"," if the settings specified in this ":"如果在此指定的设置"," that represents the next raw value that the system obtains for this counter.":"这代表了系统为此计数器获得的下一个原始值。","The name of the server that caused the error.":"导致错误的服务器的名称。"," if the configuration is remote; otherwise, ":"如果配置是遥远的； 否则，"," object are inherited by child applications; otherwise, ":"对象是由儿童应用程序继承的； 否则，","The next calculated value that the system obtains for this counter.":"系统为此计数器获得的下一个计算值。"," that contains the name of the server that caused this error.":"其中包含导致此错误的服务器的名称。","The object to synchronize access to the collection.":"同步访问集合的对象。"," object must be declared in the configuration file; otherwise, ":"对象必须在配置文件中声明； 否则，","A description of the item or quantity that this performance counter measures.":"该绩效计算的项目或数量的描述。"," if the host supports change notifications; otherwise, ":"如果主机支持更改通知； 否则，"," object for creating this site.":"创建此站点的对象。"," object, which reads from the configuration file.":"对象，从配置文件读取。"," if the host supports location tags; otherwise, ":"如果主机支持位置标签； 否则，","The name of the counter, which generally describes the quantity being counted. This name is displayed in the list of counters of the Performance Counter Manager MMC snap in's Add Counters dialog box.":"计数器的名称，通常描述要计数的数量。 此名称显示在Performance Counter Manager MMC Snap In的添加计数器对话框的计数器列表中。","The name for the new site.":"新网站的名称。"," is declared in the configuration file; otherwise, ":"在配置文件中声明； 否则，"," if the host configuration has path support; otherwise, ":"如果主机配置具有路径支持； 否则，","The object representing the section.":"表示该部分的对象。"," that describes both how the counter interacts with a monitoring application and the nature of the values it contains (for example, calculated or uncalculated).":"这既描述了计数器如何与监视应用程序进行交互，又描述了其包含的值的性质（例如，计算或未计算）。"," if the section is locked; otherwise, ":"如果该部分被锁定； 否则，"," if the host configuration supports refresh; otherwise, ":"如果主机配置支持刷新； 否则，"," object that is valid for this site.":"对本网站有效的对象。"," instance to use as the parent when performing the un-merge.":"执行UN-MERGE时用作父母的实例。","The name of the performance counter category instance, or an empty string (\"\"), if the counter is a single-instance counter.":"如果计数器是单一的计数器，则性能计数器类别实例的名称或一个空字符串（“”）。","A string specifying a filename.":"指定文件名的字符串。"," is protected; otherwise, ":"受到保护； 否则，"," instance to use when writing to a string.":"写入字符串时要使用的实例。","The name of the site to find.":"要查找的网站名称。","The server on which the performance counter and its associated category reside.":"性能计数器及其相关类别的服务器居住。","An integer specifying a line number.":"一个指定行号的整数。","An XML string containing an unmerged view of the ":"XML字符串，该字符串包含未合并的视图","The complete name of the configuration section.":"配置部分的完整名称。"," object for the requested site.":" 请求的站点的对象。","The type of configuration host.":"配置主机的类型。","The raw value of the counter.":"计数器的原始值。","The protected configuration provider for this ":"受保护的配置提供商"," instance is in read-only mode (even if the counter itself is a custom .NET Framework counter); ":"实例处于仅读取模式（即使计数器本身是自定义.NET框架计数器）；"," object that is a candidate for serialization.":"是序列化候选的对象。"," object that contains the caller's current site.":"包含呼叫者当前网站的对象。","An array of configuration host parameters.":"配置主机参数数组。"," object as it occurs in XML.":"XML中发生的对象。"," if it is in read/write mode. The default is the value set by the constructor.":"如果处于读/写模式。 默认值是由构造函数设置的值。"," attribute is set to ":"属性设置为"," object for this site.":"此网站的对象。"," object that is used by the .NET Framework to initialize application configuration properties.":".NET框架用于初始化应用程序配置属性的对象。","The target version of the .NET Framework.":".NET框架的目标版本。"," that represents the name of the site.":"这代表了网站的名称。"," if a change in an external configuration include file requires an application restart; otherwise, ":"如果外部配置的更改包括文件需要重新启动应用程序； 否则，","The name of the performance counter category, or performance object, with which to associate this ":"性能计数器类别或性能对象的名称与此关联","The parent element of the property.":"属性的父元素。","A string value representing a configuration file name.":"代表配置文件名的字符串值。","The name of the associated ":"关联的名称","The computer on which the performance counter category and its associated counters exist.":"存在性能计数类别及其相关计数器的计算机。"," collection that contains a read-only collection of sites that are connected through a common site link with this site.":"包含仅读取的站点集合的集合，这些站点通过与此站点的通用站点链接连接。","A string representing the local configuration directory.":"代表本地配置目录的字符串。"," if the current section should be serialized; otherwise, ":"如果当前部分应序列化； 否则，","The name of the class that is associated with this ":"与此关联的类的名称","The name of the performance counter to look for.":"要查找的性能计数器的名称。"," collection that contains a read-only collection of directory servers in this site.":"该集合包含此站点中目录服务器的仅读取集合。","The name of the section to be added.":"要添加的部分的名称。","A string value representing the local configuration path of the application.":"代表应用程序本地配置路径的字符串值。"," object containing all domains in the site.":"对象包含站点中的所有域。"," if the counter is registered to the category that is specified by the ":"如果计数器已注册到由"," section.":"部分。","A read/write ":"读/写","The section to be added.":"要添加的部分。","A string value representing the product name of the application.":"代表应用程序产品名称的字符串值。"," containing the name of the application setting.":"包含应用程序设置的名称。","The name of the performance counter category, or performance object, with which the specified performance counter is associated.":"与指定性能计数器相关的性能计数器类别或性能对象的名称。"," object to be returned.":"要返回的对象。","A string value representing the product version of the application.":"代表应用程序产品版本的字符串值。"," object that represents the directory server that serves as the inter-site topology generator.":"代表用作现场拓扑生成器的目录服务器的对象。",", if the counter is registered to the specified category on the local computer; otherwise, ":"，如果计数器已注册到本地计算机上的指定类别； 否则，"," containing a category description of the setting. Often this parameter is set to the application settings group name.":"包含设置的类别描述。 通常，此参数设置为应用程序设置组名称。"," that represents the default setting for the replication schedule for the site.":"这代表了网站复制时间表的默认设置。","A string value representing the roaming configuration directory of the application.":"代表应用程序的漫游配置目录的字符串值。"," that can be used to iterate through this ":"可以用来迭代这个","The name of the computer on which the performance counter category and its associated counters exist.":"存在性能计数器类别及其相关计数器的计算机名称。","A string value that gets or sets the location of the site.":"获取或设置站点位置的字符串值。","A string value representing the roaming user's configuration path.":"代表漫游用户的配置路径的字符串值。"," containing the application settings key.":"包含应用程序设置密钥。","A string value that contains the name of the site.":"包含站点名称的字符串值。"," object whose key is to be returned.":"钥匙要返回的对象。","A string value representing the path of the Machine.config file.":"字符串值表示机器的路径。config文件。",", if the counter is registered to the specified category on the specified computer; otherwise, ":"，如果计数器已注册到指定计算机上的指定类别； 否则，"," that contains the new value to be assigned to the application settings property.":"其中包含要分配给应用程序设置属性的新值。"," value that gets or sets the site options.":"获取或设置网站选项的值。","The name of the custom performance counter category to create and register with the system.":"自定义性能计数器类别的名称以创建和注册系统。"," if the configuration system is in the process of being initialized; otherwise, ":"如果配置系统正在初始化； 否则，","The applicable ":"适用"," object that contains the directory servers that are designated as preferred bridgehead servers for the RPC transport.":"包含指定为RPC传输的首选桥头服务器的目录服务器的对象。"," containing a category description of the setting. Typically, this parameter is set to the application settings group name.":"包含设置的类别描述。 通常，此参数设置为应用程序设置组名称。","A description of the custom category.":"自定义类别的描述。"," if the configuration system supports user configuration settings; otherwise, ":"如果配置系统支持用户配置设置； 否则，","The name of the section to be removed.":"要删除的部分的名称。"," object that contains a collection of directory servers that are designated as preferred bridgehead servers for the SMTP transport.":"包含指定为SMTP传输的首选桥头服务器的目录服务器集合的对象。","The source of the event, typically an application settings wrapper class derived from the ":"事件的来源，通常是从"," that specifies the counters to create as part of the new category.":"这指定了作为新类别的一部分创建的计数器。","A string specifying the name of the file used to store user configuration.":"一个字符串，指定用于存储用户配置的文件的名称。","The index of the section to be removed.":"要删除的部分的索引。"," containing the data for the event.":"包含事件的数据。"," that contains a read-only collection of directory servers in the site.":"其中包含网站中目录服务器的仅读取集合。"," that is associated with the new custom category, or performance object.":"与新的自定义类别或性能对象相关联。","An integer that represents the number of sections in the collection.":"一个代表集合中部分数量的整数。","A string representing the path to the application configuration file.":"一个代表应用程序配置文件路径的字符串。"," object. This object is an enumeration used as the serialization scheme to store configuration settings.":"目的。 该对象是用于存储配置设置的序列化方案的枚举。"," object that contains a read-only collection of site links that this site is in.":"包含此站点所在的网站链接的仅读取集合的对象。","A string representing the path to the known local user configuration file.":"代表已知本地用户配置文件的路径的字符串。"," values specifying whether the category is ":"指定类别是否为"," object that contains the keys of all sections in this collection.":"包含此集合中所有部分的键的对象。"," object that contains a writable collection of subnets in the site.":"对象包含网站中的子网集合。"," instance is equal to the specified object; otherwise, ":"实例等于指定的对象； 否则，","A string representing the path to the known roaming user configuration file.":"代表已知漫游用户配置文件的路径的字符串。"," object must be written to the file; otherwise, ":"对象必须写入文件； 否则，","The name of a new counter to create as part of the new category.":"作为新类别的一部分创建的新计数器的名称。","The zero-based index in the collection where the object is inserted.":"插入对象的集合中的基于零的索引。"," object containing the value of the ":"包含值的对象"," if a string representing a configuration path is the same as a path to the application configuration file; ":"如果代表配置路径的字符串与应用程序配置文件的路径相同；","The zero-based index where the element was inserted.":"插入元素的基于零的索引。","A description of the counter that is associated with the new custom category.":"与新自定义类别相关联的计数器的描述。"," if the current section group should be serialized; otherwise, ":"如果当前部分组应序列化； 否则，","A string value representing the ":"一个代表的字符串值"," if a string representing a configuration path is not the same as a path to the application configuration file.":"如果代表配置路径的字符串与应用程序配置文件的路径不同。","The zero-based index where the element was removed.":"删除元素的基于零的索引。"," if a string representing a configuration path is the same as a path to a known local user configuration file; otherwise, ":"如果代表配置路径的字符串与已知本地用户配置文件的路径相同； 否则，"," object of the collection.":"集合的对象。"," that is associated with the new system category, or performance object.":"与新系统类别或性能对象相关联。"," declaration is required; otherwise, ":"需要声明； 否则，","The element that was removed from the collection.":"从集合中删除的元素。","The name of a new counter, of type ":"类型的新计数器的名称","A collection of key/value pairs that are related to configuration settings.":"与配置设置相关的密钥/值对集合。","A string representing the path to an application configuration file.":"代表应用程序配置文件的路径的字符串。",", to create as part of the new category.":"，作为新类别的一部分创建。","The zero-based index where the object was set.":"设置对象的基于零的索引。","The name property of this ":"这个名称属性","The settings context related to the settings properties.":"与设置属性有关的设置上下文。"," if a string representing a configuration path is the same as a path to a known roaming user configuration file; otherwise, ":"如果代表配置路径的字符串与已知漫游用户配置文件的路径相同； 否则，"," object for creating this site link.":"创建此站点链接的对象。","The settings properties that will be accessible from the ":"可以从","The name of the custom performance counter category to delete.":"自定义性能计数器类别的名称要删除。","The section group name of this ":"该部分组名称"," object to be created.":"要创建的对象。","The name for the site link.":"网站链接的名称。","The initialized providers that should be used when loading and saving property values.":"加载和保存属性值时应使用的初始化提供商。","The name of the performance counter category to look for.":"要查找的性能计数器类别的名称。"," object that contains all the ":"包含所有的对象","A parameter array of ":"一个参数阵列","The class used to support user property settings.":"用于支持用户属性设置的类。"," object that specifies the transport type.":"指定传输类型的对象。"," objects that are children of this ":"这个孩子的物体"," if the category is registered; otherwise, ":"如果该类别已注册； 否则，"," class that is synchronized.":"同步的类。"," that contains the parameters to be applied to the created ":"其中包含要应用于创建的参数"," object that specifies the replication schedule for this site link.":"指定此站点链接的复制时间表的对象。"," objects within this ":"其中的对象"," associated with the settings instance.":"与设置实例关联。","The name of the computer to examine for the category.":"要检查类别的计算机名称。"," object that is valid for this site link.":"对此站点链接有效的对象。","A string representing the path to the configuration file.":"表示配置文件路径的字符串。"," object to be added.":"要添加的对象。","The name of the site link to find.":"要查找的站点链接的名称。","If found, the value of the named settings property.":"如果发现，则指定设置属性的值。"," object for the requested site link.":"请求的站点链接的对象。","The array to copy the object to.":"将对象复制到的数组。","A normalized subpath string.":"归一化的子路字符串。"," objects indicating the categories that are registered on the local computer.":"对象表示在本地计算机上注册的类别。"," collection containing all the ":"包含所有的集合"," object for this site link.":"此站点链接的对象。","The computer to look on.":"要看的计算机。","The index of the section group whose key is to be returned.":"将返回其钥匙的部分组的索引。"," objects representing the actual data values for the properties managed by the ":"代表由该属性管理的实际数据值的对象","A string representing the path of the application configuration file.":"表示应用程序配置文件路径的字符串。","A string that contains the name of the site link.":"包含站点链接名称的字符串。"," objects indicating the categories that are registered on the specified computer.":"指示在指定计算机上注册的类别的对象。"," used as descriptive text.":"用作描述性文本。","The name of the section group to be removed.":"要删除的部分组的名称。","A string representing a subpath location of the configuration element.":"代表配置元素的子路位置的字符串。","A cost that is associated with this site link. The default value is 100.":"与此站点链接相关的成本。 默认值为100。"," objects indicating the counters that are associated with this single-instance performance counter category.":"指示与此单位性能计数类别相关的计数器的对象。","The performance object instance for which to retrieve the list of associated counters.":"用于检索关联计数器列表的性能对象实例。","The index of the section group to be removed.":"要删除的部分组的索引。"," containing the descriptive text for the associated configuration property.":"包含关联配置属性的描述性文本。","A context object for a ":"一个上下文对象"," if data compression mode is enabled; ":"如果启用了数据压缩模式；"," objects indicating the counters that are associated with the specified object instance of this performance counter category.":"指示与此性能计数器类别的指定对象实例关联的计数器的对象。","An integer that represents the number of section groups in the collection.":"代表集合中的部分组数的整数。"," if data compression is disabled.":"如果禁用数据压缩。"," object of an application configuration.":"应用程序配置的对象。"," containing the descriptive text for the application settings group.":"包含应用程序设置组的描述性文本。","An array of strings representing the performance object instance names that are associated with this category or, if the category contains only one performance object instance, a single-entry array that contains an empty string (\"\").":"代表与此类别关联的性能对象实例名称的字符串数组，或者，如果类别仅包含一个性能对象实例，则是一个包含一个空字符串（“”）的单输入数组。","A string representing a path to an application configuration file.":"代表应用程序配置文件路径的字符串。","Gets or sets the ":"获取或设置"," object at the specified index.  \n  \n In C#, this property is the indexer for the ":"在指定索引处的对象。 \n  \n  在C＃中，此属性是"," containing the name of the application settings property group.":"包含应用程序设置属性组的名称。","The performance object instance in this performance counter category to search for.":"此性能计数器类别中的性能对象实例要搜索。"," object with the specified name.  \n  \n In C#, this property is the indexer for the ":"具有指定名称的对象。 \n  \n  在C＃中，此属性是"," object for the current site link object. Setting this property changes the replication schedule for the site link.":"当前站点链接对象的对象。 设置此属性更改网站链接的复制时间表。","A deprecated context object of the application configuration.":"应用程序配置的弃用上下文对象。"," object from which settings are loaded.":"加载设置的对象。"," if the category contains the specified performance object instance; otherwise, ":"如果类别包含指定的性能对象实例； 否则，","The name of the site link.":"网站链接的名称。","A settings provider.":"设置提供商。","An encrypted XML string representing a configuration section.":"代表配置部分的加密XML字符串。"," object that contains the names of all section groups in this collection.":"包含此集合中所有部分组的名称的对象。","The performance object instance to search for.":"要搜索的性能对象实例。"," if notifications are enabled; ":"如果启用了通知；","The source of the event, typically the settings class.":"事件的来源，通常是设置类。","A decrypted configuration section as a string.":"解密的配置部分作为字符串。","The performance counter category to search.":"搜索的性能计数类别。","A configuration name and path, such as \"system.net/settings\".":"配置名称和路径，例如“ system.net/settings”。"," value that enumerates the services being requested.":"列举所请求的服务的价值。"," if notifications are disabled.":"如果禁用了通知。","A string representing the name of the ":"一个代表名称的字符串"," object for the passed configuration section name and path.  \n  \n ":"传递的配置部分名称和路径的对象。","The name of the computer on which to look for the category instance pair.":"查找类别实例对的计算机名称。","A value that results from using the logical ":"使用逻辑而产生的值"," if reciprocal replication is enabled; ":"如果启用了相互复制；","A read-only collection of the application settings from the configuration file.":"来自配置文件的应用程序设置的仅读取集合。"," that contains the counter and performance object instance data for the category.":"其中包含类别的计数器和性能对象实例数据。","An XML string representing a configuration section to encrypt.":"一个代表加密配置部分的XML字符串。"," if reciprocal replication is disabled.":"如果禁用了相互复制。"," operator to combine all the ":"操作员结合所有","An encrypted configuration section represented as a string.":"一个加密配置部分表示为字符串。","A description of the performance object that this category measures.":"该类别测量的性能对象的描述。","The validator type to use when creating an instance of ":"创建一个实例时要使用的验证器类型"," enumeration values corresponding to the requested services.":"枚举值与请求的服务相对应。","The replication interval between sites.":"站点之间的复制间隔。"," parameter value matches the expected ":"参数值匹配预期","The subpath location of the configuration file.":"配置文件的子路位置。","A pointer to a Unicode string list with the requested Object identifiers.":"带有请求的对象标识符的Unicode字符串列表的指针。","Specifies a copy of an existing ":"指定现有的副本"," collection of sites that this site link contains. Sites can be added and deleted from this collection.":"该站点链接包含的站点的集合。 可以从此集合中添加和删除站点。","The object value.":"对象值。","A string representing the complete path to an application configuration file.":"代表应用程序配置文件的完整路径的字符串。"," with a value of -1.":"值为-1。","Specifies the name of an existing ":"指定现有的名称"," value indicating the transport type of this site link.":"值表示此站点链接的传输类型。","The prefix definition.":"前缀定义。","The type name":"类型名称"," object to use for persistence.":"用于持久性的对象。","The amount by which to increment the counter value. The increment value can be positive or negative.":"增加计数器值的金额。 增量值可能为正值或负数。"," to throw an exception if an error occurs; otherwise, ":"如果发生错误，请引发异常； 否则，","The name that is used locally.":"本地使用的名称。"," that specifies the name for this ":"指定了这个名称","The raw counter data.":"原始计数器数据。"," value specifying whether the ":" 值指定是否 "," object representing the type of the configuration object.":"代表配置对象类型的对象。","The URL that is assigned to the namespace.":"分配给名称空间的URL。","The counter data.":"计数器数据。"," value that specifies the transport type to be used.":"指定要使用的传输类型的值。"," object is read-only.":"对象仅读取。","The data to use.":"要使用的数据。","Guid that uniquely identifies the provider of the counter data. Use the Guid specified in the manifest.":"唯一标识计数器数据提供商的GUID。 使用清单中指定的GUID。","A string representing the type name from a ":"一个代表来自一个类型名称的字符串"," if the object was not found.":"如果找不到对象。"," object. This object is an enumeration used to set the serialization scheme for storing application settings.":"目的。 该对象是用于设置用于存储应用程序设置的序列化方案的枚举。","The comment data.":"评论数据。"," value that specifies the transport type of the object to search for.":"指定要搜索的对象的传输类型的值。","Guid that uniquely identifies the counter set for a provider. Use the Guid specified in the manifest.":"唯一标识提供商的计数器设置的GUID。 使用清单中指定的GUID。"," object representing the type of the configuration.":"代表配置类型的对象。","A Boolean value specifying whether an error will be thrown when the property is unsuccessfully deserialized.":"布尔值指定当属性未能成功审理时是否会抛出错误。","The name used locally.":"该名称在本地使用。"," object that represents the directory entry for the site link bridge object.":"代表站点链接桥对象的目录条目的对象。"," object to associate with the configuration.":"对象与配置相关联。","Identifies the type of the counter set, for example, whether the counter set is a single or multiple instance counter set.":"例如，标识计数器集的类型，例如，计数器集是否为单个实例计数器集。","The namespace for the URL.":"URL的名称空间。","A Boolean value specifying whether an error will be thrown when the property is unsuccessfully serialized.":"布尔值指定属性未能成功序列化时是否会抛出错误。"," that represents the name of the current ":"代表当前的名称"," to indicate the configuration host is has completed building associated permissions; otherwise, ":"指示配置主机已完成建筑物相关的权限； 否则，","Identifies the counter. Use the same value that you used in the manifest to define the counter.":"标识柜台。 使用与清单中使用的相同值来定义计数器。","The text to use.":"要使用的文字。","An object containing the default value of the ":"一个包含默认值的对象","A string representing the configuration file name associated with the ":"代表配置文件名的字符串与"," that represents the name of the current site link bridge object.":"这表示当前站点链接桥对象的名称。","The source for the reader.":"读者的来源。","The type for the ":"类型","Identifies the counter type. The counter type determines how the counter data is calculated, averaged, and displayed.":"标识计数类型。 计数类型确定如何计算，平均和显示计数器数据。"," objects that are associated with the current site link bridge object.":"与当前站点链接桥对象关联的对象。"," if the error will be thrown when the property is unsuccessfully deserialized; otherwise, ":"如果当属性未能成功审理时，将抛出错误； 否则，"," I/O tasks on the configuration file.":"配置文件上的I/O任务。","Name of the counter. You can use this name to index the counter in the counter set instance. (See ":"柜台的名称。 您可以使用此名称在计数器集实例中索引计数器。 （看","The configuration file name.":"配置文件名。"," value that represents the transport type that is used by the current site link bridge object.":"代表当前站点链接桥对象使用的传输类型的值。","A string representing a path to a remote configuration file.":"表示远程配置文件路径的字符串。"," if the error will be thrown when the property is unsuccessfully serialized; otherwise, ":"如果当属性序列化失败时将丢弃错误； 否则，","Name of the instance. The name must be unique.":"实例的名称。 该名称必须是唯一的。","The line number for the current node.":"当前节点的行号。"," object is in this collection; otherwise ":"对象在此集合中； 否则"," object associated with configuration file.":"与配置文件关联的对象。","The name of the connection string.":"连接字符串的名称。"," object as it applies to the collection.":"适用于集合的对象。","An instance of the counter set which will contain the counter data.":"计数器集的实例，该实例将包含计数器数据。"," array that receives the elements of this collection.":"接收此集合元素的数组。","The configuration root object.":"配置根对象。"," object that contains contextual information about the source or destination of the serialized stream.":"包含有关序列化流源或目的地的上下文信息的对象。","The name of the provider to use with the connection string.":"与连接字符串一起使用的提供商的名称。"," if this was called from the Dispose method, ":"如果从处置方法中调用这一点，"," that specifies the name of the subnet.":"指定子网的名称。","A string containing an exception message.":"包含异常消息的字符串。","The parameter object containing the values used for initializing the configuration host.":"包含用于初始化配置主机的值的参数对象。","The string value assigned to the ":"分配给的字符串值"," if called from the finalizer.":"如果是从最终器中调用的。"," that specifies the name of the site that contains the subnet.":"这指定了包含子网的站点的名称。"," if the value of a ":"如果值","A string representing the location of a configuration path.":"表示配置路径位置的字符串。","The collection index of the specified ":"指定的集合索引","A collection of the counter data contained in the counter set instance.":"计数器集实例中包含的计数器数据的集合。"," object has been deserialized; otherwise, ":"对象已被选为; 否则，"," object that is valid for this subnet.":"对此子网有效的对象。"," the configuration file is located at a higher level in the configuration hierarchy than the application configuration; otherwise, ":"配置文件位于配置层次结构中的级别比应用程序配置更高。 否则，"," object with the specified name; otherwise, ":"具有指定名称的对象； 否则，","Identifier of the counter. This is the identifier you used when you added the counter to the counter set.":"柜台的标识符。 这是将计数器添加到计数器集中时使用的标识符。"," object has changed; otherwise, ":"对象已更改； 否则，","The name of the subnet to find.":"要查找子网的名称。"," if child record is required for a child configuration path; otherwise, ":"如果需要儿童配置路径的子记录； 否则，"," collection of ":"收集","Name of the counter. This is the name that you used when you added the counter to the counter set.":"柜台的名称。 这是您将计数器添加到计数器集中时使用的名称。"," for the requested subnet.":"对于请求的子网。"," if a different ":"如果有所不同"," object that describes the ":"描述的对象","The name of the configuration section.":"配置部分的名称。"," if the managed resources should be released; ":"如果应发布托管资源；","An object containing the specified section within the configuration.":"一个包含配置中指定部分的对象。"," object. When this value is set, the ":"目的。 设置此值时，"," that represents the name of the subnet.":"这代表子网的名称。"," definition is allowable for an application configuration object; otherwise, ":"应用程序配置对象允许定义； 否则，"," if only the unmanaged resources should be released.":"如果只能发布非管理资源。","An object specifying the environment where the configuration property is being evaluated.":"指定正在评估配置属性的环境的对象。",".  \n  \n When a value is first accessed from the ":"。 \n  \n  当首先从","The location description of the ":"位置描述"," from which file attributes are to be copied as a template.":"从哪些文件属性复制为模板。"," if the configuration property is being evaluated at the machine configuration level; otherwise, ":"如果在机器配置级别评估配置属性； 否则，"," object that specifies the context for the search.":"指定搜索上下文的对象。","A string representing the identifying name of a configuration file section group.":"表示配置文件部分的标识名称的字符串。"," property, and if the value was initially stored into the ":"属性，以及该值最初存储在"," that represents the default value for the property.":"这代表属性的默认值。","The name of the subnet.":"子网的名称。"," object that specifies a transport type to find in the search.":"指定要在搜索中找到的传输类型的对象。"," object as a serialized representation using the ":"对象作为序列化表示"," for all types being validated.":"对于所有类型的验证。","A string representing the identifying name of a configuration file section.":"表示配置文件部分的标识名称的字符串。"," object for the site that the ":"网站的对象"," property, the ":"财产，"," object for the item found. An ":"找到的物品的对象。 一个","Parent object.":"父对象。"," object is a member of.":"对象是。"," property will trigger deserialization of the underlying value.  As a side effect, the ":"属性将触发基础价值的避难所化。 作为副作用，"," if a section of the configuration file designated by ":"如果配置文件的一部分由"," exception is thrown if an object was not found.":"如果找不到对象，则会抛出异常。","Configuration context object.":"配置上下文对象。"," that is appended to this collection.":"该集合附加了。"," property will be set to ":"财产将设置为"," object that represents the directory entry for the ":"代表目录条目的对象"," could be read by a ":"可以通过"," object that contains the target and credentials to use for the search. The target of this context must be an AD LDS configuration set.":"包含用于搜索的目标和凭据的对象。 此上下文的目标必须是AD LDS配置集。",".  \n  \n If this chain of events occurs in ASP.NET, and if an error occurs during the deserialization process, the error is logged using the health-monitoring feature of ASP.NET. By default, this means that deserialization errors will show up in the Application Event Log when running under ASP.NET. If this process occurs outside of ASP.NET, and if an error occurs during deserialization, the error is suppressed, and the remainder of the logic during deserialization occurs. If there is no serialized value to deserialize when the deserialization is attempted, then ":"。 \n  \n  如果此事件发生在ASP.NET中，并且在避难过程中发生错误，则使用ASP.NET的健康监测功能记录了错误。 默认情况下，这意味着在ASP.NET下运行时，应在应用程序事件日志中出现避免错误。 如果此过程发生在ASP.NET之外，并且如果在避难化期间发生错误，则该误差被抑制，并且在避难所中的其余逻辑发生。 如果在尝试进行避免时没有序列化值，则","Section XML node.":"XML节点节。"," containing changed configuration settings.":"包含更改的配置设置。"," transport type of the ":" 运输类型的 "," that contains the name of the partition to search for AD LDS instances.":"其中包含搜索AD LDS实例的分区名称。"," object will instead attempt to return a default value if one was configured as defined on the associated ":"如果对象在关联上定义的配置，则对象将尝试返回默认值","A configuration object.":"配置对象。"," if the write to the configuration file was completed successfully; otherwise, ":"如果写入配置文件已成功完成； 否则，"," value that indicates whether to bridge all site links. ":"表示是否桥接所有站点链接的值。"," that contains the AD LDS instances that are found by the search.":"其中包含搜索发现的AD LDS实例。"," instance. In this case, if the ":"实例。 在这种情况下，如果是"," to indicate the write was completed successfully; otherwise, ":"表明写作成功完成； 否则，","A string value containing the name of the key attribute.":"包含密钥属性名称的字符串值。"," that contains the name of the partition to search for an AD LDS instance.":"其中包含搜索AD LDS实例的分区名称。"," property was set to either ":"属性设置为任一"," if all site links are bridged; otherwise, ":"如果所有站点链接都桥接； 否则，"," if the configuration supports change notification; otherwise, ":"如果配置支持更改通知； 否则，","A string value containing the name of the value attribute.":"一个包含值属性名称的字符串值。"," object that represents the AD LDS instance that is found by the search.":"代表搜索发现的AD LDS实例的对象。",", or to the string \"[null]\", then the ":"，或到字符串“ [null]”，然后"," value that indicates whether to ignore the replication schedule. ":"表示是否忽略复制时间表的值。"," if the configuration supports location tags; otherwise, ":"如果配置支持位置标签； 否则，"," object to decrypt.":"目的解密。"," object will initialize the ":"对象将初始化"," object that contains the target and credentials to use to retrieve the object. The target of the context must be an AD LDS instance.":"包含用于检索对象的目标和凭证的对象。 上下文的目标必须是AD LDS实例。"," if the replication schedule is ignored; otherwise, ":"如果复制时间表被忽略； 否则，"," if the configuration supports path tags; otherwise, ":"如果配置支持路径标签； 否则，","A decrypted ":"解密"," object that refers to the AD LDS instance that is found.":"引用发现的AD LDS实例的对象。"," if the configuration supports configuration refresh; otherwise, ":"如果配置支持配置刷新； 否则，"," property to either ":"属性"," object that contains ":"包含的对象"," object to encrypt.":"对象加密。"," object that contains the replication neighbors for this AD LDS instance.":"包含此AD LDS实例的复制邻居的对象。"," for reference types, or to the default value for the associated value type.  On the other hand, if ":"对于参考类型或关联值类型的默认值。 另一方面，如果"," objects that represent site link bridges.":"表示站点链接桥的对象。","A string representing a key to a configuration section.":"表示配置节的键的字符串。","An encrypted ":"加密"," object that contains the replication connection failures that are recorded by this AD LDS instance.":"包含此AD LDS实例记录的复制连接故障的对象。"," instance representing the section of the last-known-good configuration specified by ":"实例表示由"," property holds a valid object reference or string value (other than \"[null]\"), then the ":"属性保存有效的对象引用或字符串值（“ [null]”除外），然后"," objects that represent site links.":"表示站点链接的对象。","The provider name to use for the object.":"用于对象的提供商名称。"," that contains the distinguished name of the partition for which to retrieve the replication cursor information.":"其中包含用于检索复制光标信息的分区的杰出名称。"," instance representing a section of a configuration file.":"代表配置文件的一部分的实例。"," values that represents the transport type for this object.":"代表此对象的传输类型的值。"," property is returned instead.  \n  \n If there is no serialized value to deserialize when the deserialization is attempted, and no default value was specified, then an empty string will be returned for string types. For all other types, a default instance will be returned by calling ":"属性被返回。 \n  \n  如果在尝试进行避免时没有序列化值，并且未指定默认值，则将返回一个空字符串以进行字符串类型。 对于所有其他类型，将通过调用默认实例返回"," collection of values to use when initializing the object.":"初始化对象时要使用的值。"," object that contains the replication cursor information.":"包含复制光标信息的对象。"," object for the exception.":"异常的对象。"," - for reference types this means an attempt will be made to create an object instance using the parameterless constructor.  If this attempt fails, then ":" - 对于参考类型，这意味着将尝试使用无参数构造函数创建对象实例。 如果此尝试失败，那么","A string representing a key to a configuration section that is to be refreshed.":"代表要刷新的配置部分的键的字符串。"," is using machine-specific protection; ":"正在使用机器特定的保护；"," that contains the path to the Active Directory Domain Services object for which to retrieve the replication metadata.":"其中包含通往Active Directory域服务对象的路径，用于检索复制元数据。"," object that contains underlying exception information.":"包含基本异常信息的对象。","The serialized value of a ":"一个序列化值"," if it is using user-account-specific protection.":"如果使用用户账户特定的保护。","A string representing a configuration file path.":"表示配置文件路径的字符串。"," for the exception.":"例外。"," that contains the distinguished name of the partition for which to retrieve the replication neighbors.":"其中包含为检索复制邻居的划分的杰出名称。","The collection containing the errors for the associated element and subelements":"包含关联元素和子元素的错误的集合"," if an error occurred during initialization of a configuration object; otherwise, ":"如果在配置对象的初始化期间发生错误； 否则，"," object is the default value; otherwise, ":"对象是默认值； 否则，"," object that contains the current and pending replications operations.":"包含当前和未决复制操作的对象。"," if the associated ":"如果关联"," object that describes the type of the requested object.":"描述请求对象的类型的对象。","The array to copy the collection to.":"将集合复制到的阵列。"," members that specifies which role the AD LDS instance should take ownership of.":"指定AD LDS实例应占有哪个角色的成员。"," object representing a configuration specified by ":"代表配置的对象"," that contains the name of the requested object.":"其中包含请求对象的名称。"," object is a ":"对象是一个"," that contains the distinguished name of the partition of the domain controller to synchronize.":"其中包含域控制器分区的特殊名称以同步。"," that contains contextual information about the source or destination of the serialized stream.":" 包含有关序列化流的源或目标的上下文信息。"," object that holds serialized object data about the exception that is being thrown.":"持有有关正在抛出的异常的序列化对象数据的对象。"," object cannot be modified; otherwise, ":"对象无法修改； 否则，","A string representing a section of a configuration file.":"表示配置文件部分的字符串。"," describing the current application use.":"描述当前的应用程序使用。","A combination of one of more of the ":"更多的组合"," representing the data in a section of a configuration file.":"在配置文件的部分中表示数据。"," object is in the configuration file; otherwise, ":"对象在配置文件中； 否则，","A string that contains the name of the requested object.":"包含请求对象名称的字符串。"," members.":"成员。","The path of configuration file.":"配置文件的路径。"," that contains the application's shortened name, which does not contain a full path or extension, for example, ":" 它包含应用程序的缩短名称，不包含完整路径或扩展名，例如, "," that contains the distinguished name of the partition to synchronize.":"其中包含同步分区的杰出名称。","The line number in the configuration file where the associated ":"配置文件中的行号其中"," object that represents the type of the requested object.":"代表请求对象的类型的对象。","A string representing the file path of the nearest configuration ancestor that has configuration data.":"代表具有配置数据的最近配置祖先的文件路径的字符串。"," containing the name of the settings provider.":"包含设置提供商的名称。"," that contains the name of the server with which to synchronize.":"其中包含服务器的名称与之同步。"," object is defined.":"对象已定义。","An error code that identifies the error.":"错误代码标识错误。","The path of the configuration file.":"配置文件的路径。"," containing the settings provider type.":"包含设置提供商类型。"," members that specifies which role should be transferred to this AD LDS instance.":"指定应将角色转移到此AD LDS实例的成员。"," collection of the properties in the associated ":"关联中的属性收集"," object that holds serialized object data about the exception being thrown.":"保存有关抛出异常的序列化对象数据的对象。"," containing the friendly name of the settings provider.":"包含设置提供商的友好名称。"," object representing a unique configuration record for a given configuration path.":"代表给定配置路径的唯一配置记录的对象。"," value that identifies the error.":"标识错误的值。","The source file where the associated ":"关联的源文件"," that contains the distinguished name of the default partition that this AD LDS instance serves.  If the default partition is not set, this will return ":"其中包含此AD LDS实例使用的默认分区的杰出名称。 如果未设置默认分区，则将返回"," whose name matches that specified by the name parameter; otherwise, ":"其名称与名称参数指定的匹配； 否则，"," if design time; ":" 如果设计时间; "," value that determines if the managed resources should be released. ":"确定是否应发布托管资源的值。"," that contains the computer host name.":"其中包含计算机主机名。"," object originated.":" 物起源。"," enumerated value that specifies the serialization scheme.":"指定序列化方案的枚举值。"," if run time.":"如果运行时间。"," if the managed resources are released; ":"如果释放托管资源；","The type of the associated ":"相关的类型"," if the configuration is a design-time configuration; ":"如果配置是设计时间配置；"," if only the unmanaged resources are released.":"如果仅发布非管理资源。"," if the configuration is not a design-time configuration.":"如果配置不是设计时间配置。","The object used to validate the associated ":"用于验证关联的对象 ","The name of the machine configuration file that includes the complete physical path (for example, ":"包括完整物理路径的机器配置文件的名称（例如"," object that represents the directory partition.":" 表示目录分区的对象。"," if the initialization process of the configuration system is complete; otherwise, ":"如果配置系统的初始化过程已完成； 否则，","Returns a string representation of the current directory partition.":"返回当前目录分区的字符串表示。","A string value containing the current path.":"包含当前路径的字符串值。","The configuration key value.":"配置键值。"," that contains the partition name.":"其中包含分区名称。"," if the user configuration is supported; otherwise, ":"如果支持用户配置； 否则，","The LDAP display name of the attribute to search for.":"要搜索的属性的LDAP显示名称。","A configuration path.":"配置路径。","A string value specifying the configuration path.":"指定配置路径的字符串值。"}