{"A second object, to be compared to the object identified by the ":"第二个对象，将其比较与识别的对象"," if the two objects do not specify the same key BLOB format; otherwise, ":"如果两个对象未指定相同的键BLOB格式； 否则，","An object that specifies a key BLOB format.":"指定键BLOB格式的对象。"," if the two objects specify the same key BLOB format; otherwise, ":"如果两个对象指定相同的键BLOB格式； 否则，","The hash value of the embedded key BLOB format.":"嵌入式键BLOB格式的哈希值。","The embedded key BLOB format name.":"嵌入式键Blob格式名称。","An object describing a private key BLOB.":"描述私钥斑点的对象。","An object that specifies an ECC public key BLOB.":"指定ECC公共密钥斑点的对象。","An object that specifies an ECC private key BLOB.":"指定ECC私钥BLOB的对象。","An object describing a public key BLOB.":"描述公钥斑点的对象。","An object that specifies a generic public key BLOB.":"指定通用公钥斑点的对象。","An object that specifies an opaque transport key BLOB.":"指定不透明传输键斑点的对象。","An object that specifies a key export policy. The default value is ":"指定密钥导出策略的对象。 默认值是","An object that specifies a generic private key BLOB.":"指定通用私钥斑点的对象。","An object that specifies a PKCS #8 private key BLOB.":"指定PKCS#8私钥BLOB的对象。",", which indicates that the key storage provider's default key creation options are set.":"，这表明设置了密钥存储提供商的默认密钥创建选项。"," object during key creation.":"关键创建期间的对象。",", which indicates that the key storage provider's default export policy is set.":"，表示设置了密钥存储提供程序的默认导出策略。",", which indicates that the key storage provider's default key usage is set.":"，这表明设置了密钥存储提供商的默认密钥用法。","An object that specifies the KSP that a new key will be created in.":"指定KSP的对象将创建一个新密钥。","A bitwise combination of one or more enumeration values that specify key usage. The default value is ":"指定关键用法的一个或多个枚举值的比重组合。 默认值是","An object that specifies options for creating keys. The default value is ":"指定创建密钥的选项的对象。 默认值是","The HWND of the parent window that is used for CNG dialog boxes.":"用于CNG对话框的父窗口的HWND。","A collection object that contains any additional parameters that you must set on a ":"包含您必须在一个上设置的任何其他参数的收集对象","An object that contains details about the user interface shown by Cryptography Next Generation (CNG) classes when a key is created or accessed. A ":"当创建或访问密钥时，包含有关密码下一代（CNG）类显示的用户界面的详细信息的对象。 一个","The property value to initialize.":"初始化的属性值。"," value indicates that the key storage provider's default user interface policy is set.":"值表示设置了密钥存储提供商的默认用户界面策略。","An object that specifies a property of a Cryptography Next Generation (CNG) key or provider.":"指定密码下一代（CNG）密钥或提供商的属性的对象。"," object that specifies the same property as the current object; otherwise, ":"指定与当前对象相同属性的对象； 否则，","The hash value of the current ":"电流的哈希值","A bitwise combination of the enumeration values that specify how the property is stored.":"指定属性如何存储的枚举值的位组合。","The property name to initialize.":"要初始化的属性名称。","An array that represents the value stored in the property.":"代表存储在属性中的值的数组。"," if the two objects specify the same property; otherwise, ":"如果两个对象指定相同的属性； 否则，"," parameter represents the same property as the current object; otherwise, ":"参数表示与当前对象相同的属性； 否则，"," if the two objects do not specify the same property; otherwise, ":"如果两个对象未指定相同的属性； 否则，","The hash value of the embedded KSP name.":"嵌入式KSP名称的哈希值。","An object that specifies the options that are set in the current ":"指定当前设置的选项的对象"," that specifies the same key storage provider(KSP) as the current object; otherwise, ":"该指定与当前对象相同的密钥存储提供商（KSP）； 否则，"," if the two objects represent the same KSP; otherwise, ":"如果两个对象表示相同的ksp； 否则，","The property name that is set in the current ":"当前设置的属性名称","The name of the key storage provider (KSP) to initialize.":"关键存储提供商（KSP）的名称要初始化。","An object that specifies a KSP.":"指定KSP的对象。"," if the two objects do not represent the same KSP; otherwise, ":"如果两个对象不代表相同的ksp； 否则，"," parameter specifies the same key storage provider (KSP) as the current object; otherwise, ":"参数指定与当前对象相同的密钥存储提供商（KSP）； 否则，","The embedded KSP name.":"嵌入的KSP名称。","The title for the dialog box that provides the UI prompt. Specify a null string to use the default title.":"提供UI提示符的对话框的标题。 指定一个空字符串以使用默认标题。","An object that describes the level of UI protection to apply to the key.":"描述应用程序保护级别的对象适用于密钥。","A bitwise combination of the enumeration values that specify the protection level.":"指定保护级别的枚举值的位组合。","The DSA algorithm parameters.":"的DSA算法参数。","The description of how the key will be used.":"如何使用密钥的描述。","An object that specifies the Microsoft Platform Crypto Storage Provider.":"指定Microsoft Platform加密存储提供商的对象。","The title of the dialog box that appears when the key is accessed.":"访问键时出现的对话框的标题。","A friendly name for the key to be used in the UI prompt. Specify a null string to use the default name.":"在UI提示中使用的键的友好名称。 指定一个空字符串以使用默认名称。","An object that specifies the Microsoft Smart Card Key Storage Provider.":"指定Microsoft智能卡密钥存储提供商的对象。","The DSA parameters.":"DSA参数。","The description text for the dialog box that appears when the key is accessed.":"访问键时出现的对话框的描述文本。","The size of the key to generate in bits.":"钥匙生成位的大小。","The full-text description of the key. Specify a null string to use the default description.":"密钥的全文描述。 指定一个空字符串以使用默认描述。","An object that specifies the Microsoft Software Key Storage Provider.":"指定Microsoft软件密钥存储提供商的对象。","The digital signature to be verified.":"要验证的数字签名。","The key to use for DSA operations.":"用于DSA操作的关键。","The friendly name that is used to describe the key in the dialog box that appears when the key is accessed.":"用于描述访问键时出现的对话框中的键的友好名称。","The key used by the ":"密钥","A description of how the key will be used. Specify a null string to use the default description.":"描述如何使用密钥。 指定一个空字符串以使用默认描述。","The size of the key. Valid key sizes are 256, 384, and 521 bits.":"钥匙的大小。 有效的钥匙尺寸为256、384和521位。","The key and named curve parameters used by the ":"键和命名曲线参数"," matches the signature computed using the specified hash; otherwise, ":"匹配使用指定哈希计算的签名； 否则，"," object to perform cryptographic operations.":"对象执行加密操作。","A byte array that contains the key material. This information is generated from the secret agreement that is calculated from the current object's private key and the specified public key.":"包含密钥材料的字节数组。 此信息是从从当前对象的私钥和指定的公钥计算的秘密协议生成的。","The key that will be used as input to the cryptographic operations performed by the current object.":"将用作当前对象执行的加密操作输入的键。","An array that contains the key sizes supported by the algorithm.":"包含算法支持的密钥大小的数组。","The XML-based key information to be deserialized.":"基于XML的关键信息应进行序列化。","An object that specifies the hash algorithm.":"指定哈希算法的对象。","The curve used to generate the public/private key pair.":"用于生成公共/私钥对的曲线。","The public key from the other party in the key exchange.":"另一方在密钥交换中的公共密钥。","The string \"DSA\".":"字符串“ DSA”。","One of the enumeration values that specifies the format of the XML string. The only currently accepted format is ":"指定XML字符串格式的枚举值之一。 当前唯一接受的格式是","The Hash-based Message Authentication Code (HMAC) key to use when deriving key material.":"基于哈希的消息身份验证代码（HMAC）在派生关键材料时要使用的密钥。","A handle to the secret agreement. This information is calculated from the current object's private key and the specified public key.":"秘密协议的处理。 此信息是根据当前对象的私钥和指定的公钥计算得出的。","An object that contains the public part of the Elliptic Curve Diffie-Hellman (ECDH) key from the other party in the key exchange.":"一个包含椭圆形曲线差异 - 黑尔曼（ECDH）键的公共部分的对象与密钥交换中的另一方。","The key pair used by this object to perform cryptographic operations.":"该对象使用的密钥对执行加密操作。","A string object that contains the key information, serialized to an XML string, according to the requested format.":"根据请求的格式包含包含关键信息的字符串对象。","The key and explicit curve parameters used by the ":"密钥和显式曲线参数","The label value.":"标签值。","The size, in bits, of the key modulus used by the asymmetric algorithm.":"不对称算法使用的关键模量的大小。","The seed value.":"种子价值。","An XML string that contains an Elliptic Curve Diffie-Hellman (ECDH) key.":"一个包含椭圆曲线Diffie-Hellman（ECDH）键的XML字符串。","The public key that is associated with this instance of the ":"与此实例相关联的公共密钥","The message data to be signed.":"要签署的消息数据。"," public key.":"公钥。"," if the secret agreement is used as an HMAC key to derive key material; otherwise, ":"如果将秘密协议用作得出密钥材料的HMAC密钥； 否则，","An object that contains the ECDH public key that is specified by the given XML.":"包含由给定XML指定的ECDH公钥的对象。","The value that is appended to the secret agreement.":"秘密协议附加的价值。","A digital signature for the specified data.":"指定数据的数字签名。","The format that the key BLOB is expressed in.":"键斑点表示的格式。","An object that contains the key represented by the ":"包含由密钥表示的对象","A byte array that contains an Elliptic Curve Diffie-Hellman (ECDH) public key.":"一个字节阵列，其中包含椭圆曲线Diffie-Hellman（ECDH）公钥。","The value that is appended to the beginning of the secret agreement during key derivation.":"在密钥推导过程中附加到秘密协议开始的价值。","The location in the string at which to start signing.":"字符串中开始签名的位置。","An XML string that contains the serialized ":"一个包含序列化的XML字符串","The key and explicit curve parameters used by the ECC object.":"ECC对象使用的密钥和显式曲线参数。","An object that contains the ECDH public key that is serialized in the byte array.":"包含在字节数组中序列化的ECDH公钥的对象。"," that will be signed.":"那将被签署。","The key and named curve parameters used by the ECC object.":"ECC对象使用的键和命名曲线参数。","The length of the string, in characters, following ":"字符串的长度，字符，以下","The data stream that was signed.":"签名的数据流。","A digital signature for the specified length of data.":"指定数据长度的数字签名。","The hash to verify.":"哈希验证。","The key container name.":"关键容器名称。","The initialization vector.":"初始化向量。","The data stream to be signed.":"要签名的数据流。","An object that specifies the key.":"指定密钥的对象。","The signature of the data.":"数据的签名。","The symmetric key that is used for encryption and decryption.":"用于加密和解密的对称键。","A digital signature for the specified data stream.":"指定数据流的数字签名。"," values that describes whether an asymmetric key was created as a signature key or an exchange key.":"描述非对称密钥是作为签名密钥还是交换键创建的值。","An array that contains the key sizes supported by the ":"一个包含由密钥尺寸的数组"," if the signature verifies for the hash; otherwise, ":"如果签名验证哈希； 否则，","The size, in bits, of the key.":"钥匙的大小。"," property setter.":"属性设置器。"," if the key is from the machine key set; otherwise, ":" 如果密钥来自机器密钥集；否则, ","A symmetric 3DES decryptor object.":"对称3DES解密对象。","A string object that contains the key information, serialized to an XML string according to the requested format.":"包含密钥信息的string对象，根据请求的格式序列化为XML字符串。","An array that contains the block sizes supported by the algorithm.":"包含算法支持的块大小的数组。","The key to use for RSA operations.":"用于RSA操作的关键。"," object that provides information about the key.":"提供有关密钥的信息的对象。","The secret key to use for the 3DES algorithm. The key size must be 192 bits.":"3DE算法使用的秘密键。 关键大小必须为192位。"," if the key pair is protected; otherwise, ":"如果密钥对受到保护； 否则，","The data that was signed.":"签署的数据。","The key used by the RSA object.":"RSA对象使用的密钥。","The initialization vector to use for the 3DES algorithm.":"用于3DE算法的初始化向量。","The provider name.":"提供商名称。"," if the key is accessible; otherwise, ":"如果钥匙可访问； 否则，","The location in the data at which the signed data begins.":"签名数据开始的数据中的位置。","The RSA parameters.":"RSA参数。","The provider type. The default is 1.":"提供商类型。 默认值为1。"," if the key can be exported; otherwise, ":"如果钥匙可以出口； 否则，","A symmetric 3DES encryptor object.":"对称3DES Encryptor对象。","The length of the data, in characters, following ":"数据的长度，字符，以下","The hash algorithm name.":"哈希算法名称。"," if the key container was randomly generated; otherwise, ":"如果密钥容器是随机生成的； 否则，","The unique key container name.":"唯一的密钥容器名称。"," if the key is a hardware key; otherwise, ":"如果密钥是硬件键； 否则，","The size of the key for the asymmetric algorithm in bits.":"位置不对称算法的密钥大小。","The block size, in bits.":"块大小，以位为单位。"," if the key is removable; otherwise, ":"如果钥匙可移动； 否则，","A provider type code that specifies the kind of provider to create.":"提供者类型代码，该代码指定要创建的提供商。","The offset into the array from which to begin using data.":"从从中开始使用数据的数组中的偏移。","The size of the key for the cryptographic algorithm in bits.":"密钥算法的密钥大小。"," object contains only a public key; otherwise, ":"对象仅包含一个公钥； 否则，","A provider name.":"提供商名称。","The password for which to derive the key.":"得出密钥的密码。","The parameters for the CSP.":"CSP的参数。","The name of the hash algorithm used to create the hash value of the data.":"哈希算法的名称用于创建数据的哈希值。","The provider type code that specifies the kind of provider to create.":"提供者类型代码指定要创建的提供商的类型。","The CSP parameters for the operation.":"操作的CSP参数。","The name of the signature algorithm.":"签名算法的名称。"," to include the private key; otherwise, ":"包括私钥； 否则，"," signature for the specified hash value.":"指定哈希值的签名。","A container name.":"容器名称。","A byte array containing the key information associated with a ":"一个字节阵列，其中包含与","The name of the hash algorithm for the operation.":"该操作的哈希算法的名称。"," if the key should be persisted in the computer key store; otherwise, ":"如果密钥应持续在计算机密钥存储中； 否则，"," if the signature verifies as valid; otherwise, ":"如果签名验证为有效； 否则，","An enumeration value, or a bitwise combination of enumeration values.":"枚举价值或枚举值的比重组合。","A byte array that represents a DSA key blob.":"一个代表DSA键blob的字节数组。","The effective key size, in bits, used by the ":"有效的密钥大小，以位为单位，由 "," object that describes additional information about a cryptographic key pair.":"描述有关加密密钥对的其他信息的对象。","A byte array that contains the key information associated with an ":"一个字节数组，其中包含与一个关键信息相关的关键信息","A password associated with a smart card key.":"与智能卡键关联的密码。","The size of the key used by the asymmetric algorithm.":"不对称算法使用的密钥大小。"," signature for the specified data.":"指定数据的签名。"," if the key should be created with an 11-byte-long, zero-value salt; otherwise, ":"如果应使用11字节长的零值盐创建钥匙； 否则，","A byte array that represents an asymmetric key blob.":"代表不对称键斑点的字节阵列。","A byte array. This value is ignored.":"字节阵列。 此值被忽略。","The input data to sign.":"输入数据要签名。","A handle to the parent window for a smart card password dialog box.":"智能卡密码对话框的父窗口的句柄。","Only key sizes that match an entry in this array are supported by the asymmetric algorithm.":"只有与此数组中的条目匹配的键尺寸由不对称算法支持。","The password to derive the key for.":"派生密钥的密码。","The decrypted data, which is the original plain text before encryption.":"解密的数据，这是加密之前的原始纯文本。","The array to fill with a cryptographically strong sequence of random values.":"填充有密码强的随机值序列的阵列。","The parameters to pass to the cryptographic service provider (CSP).":"传递给加密服务提供商（CSP）的参数。","The cryptographic service provider (CSP) parameters for the operation.":"该操作的加密服务提供商（CSP）参数。"," if the key should be persisted in the CSP; otherwise, ":" 如果密钥应该保留在CSP中;否则, ","The data to be encrypted.":"要加密的数据。","The string input. This parameter is ignored.":"字符串输入。 此参数被忽略。","The array to fill with a cryptographically strong sequence of random nonzero values.":"填充随机非零值的密码强的序列。","The iteration count to use to derive the key.":"用于得出密钥的迭代计数。","The name of the key exchange algorithm if it exists; otherwise, ":"如果存在密钥交换算法的名称； 否则，"," encryption using OAEP padding (only available on a computer running Windows XP or later); otherwise, ":"使用OAEP填充（仅在运行Windows XP或更高版本的计算机上可用）进行加密； 否则，"," information.":"信息。","The size of the key to use in bits.":"块中使用的钥匙大小。","The location where the copy operation starts.":"复制操作开始的位置。","The size of the key in bits.":"钥匙的大小。","A byte array containing the key information associated with an ":"一个字节阵列，其中包含与"," object to base the new object on.":"对象将新对象基础。"," object that can be used to navigate the collection.":"可用于导航集合的对象。","The parameters to be passed to the cryptographic service provider (CSP).":"要传递给加密服务提供程序(CSP)的参数。","An array that contains the key sizes supported by the asymmetric algorithm.":"包含不对称算法支持的键大小的阵列。"," if the return string should contain carriage returns; otherwise, ":"如果返回字符串应包含托架返回； 否则，","A byte array that represents an RSA key blob.":"一个代表RSA键BLOB的字节数组。","The data to be decrypted.":"要解密的数据。","A formatted string that represents the Abstract Syntax Notation One (ASN.1)-encoded data.":"代表抽象语法符号的格式字符串一个（ASN.1）编码的数据。","The location in the collection.":"集合中的位置。","The initialization vector to use for the symmetric algorithm.  \n  \n ":"用于对称算法的初始化矢量。","The hash algorithm name used to create the hash value of the data.":"哈希算法名称用于创建数据的哈希值。"," to perform direct ":"直接执行","An object used to synchronize access to the ":"用于同步访问访问的对象","A byte array that represents the Abstract Syntax Notation One (ASN.1)-encoded data.":"代表抽象语法符号的字节数组一个（ASN.1）编码的数据。","The hash algorithm identifier (OID) used to create the hash value of the data.":"哈希算法标识符（OID）用于创建数据的哈希值。","A byte array that contains Abstract Syntax Notation One (ASN.1)-encoded data.":"包含抽象语法符号的字节数组一个（ASN.1）编码的数据。"," decryption using OAEP padding; otherwise, ":"使用OAEP填充解密； 否则，","The index of the added ":"添加的索引",", if the enumerator was successfully advanced to the next element; ":"，如果枚举数成功推进到下一个元素; ","The hash algorithm name used to create the hash value.":"哈希算法名称用于创建哈希值。","The Abstract Syntax Notation One (ASN.1)-encoded data.":"抽象语法符号一个（ASN.1）编码的数据。","The array that the ":"阵列",", if the enumerator has passed the end of the collection.":"，如果枚举者通过了集合的末尾。"," to use PKCS#1 v1.5 padding.":" 使用PKCS#1v1.5填充。","The number of bytes in the input byte array to use as data.":"输入字节数组中的字节数用于数据。","The input to compute from base 64.":"从base64到计算机的输入。","The object identifier for this data.":"此数据的对象标识符。"," object is to be copied into.":"物体将被复制到。","The output to which to write the result.":"写入结果的输出。"," objects in a collection.":"集合中的对象。","The label to encode.":"要编码的标签。","The offset into the output byte array from which to begin writing data.":"输出字节数组的偏移开始编写数据。","The offset into the input byte array from which to begin using data.":"开始使用数据的输入字节数组的偏移量。","A string that represents ":"表示的字符串 ","The location of the ":"位置","The data to encode.":"要编码的数据。","The number of bytes written.":"字节编写的数量。","The handle value to represent.":"句柄值表示。","A string that represents a ":"一个代表一个的字符串","The stream on which to perform the cryptographic transformation.":"执行加密转换的流。","A character array of the encoded PEM.":"编码PEM的字符阵列。","The input to convert from base 64.":"从基本64转换的输入。","Another instance of this type which has an independent lifetime but tracks the same resource.":"这种类型的另一个实例具有独立的生命周期，但跟踪相同的资源。","The cryptographic transformation that is to be performed on the stream.":"在流上执行的加密转换。"," property or a ":" 物业或 ","The input to compute to base 64.":"计算为基础64的输入。","A value representing the version number as reported by the loaded version of OpenSSL.":"代表已加载版本OpenSSL报告的版本号的值。","The computed conversion.":"计算的转换。","The mode of the stream.":"流的模式。","The input to convert to base 64.":"转换为基础64的输入。"," instance, unless the default settings have been changed with the <cryptoClass> element.":"实例，除非使用<cryptoclass>元素更改默认设置。"," to not close the underlying stream when the ":"当不关闭下面的流","The text containing the PEM-encoded data.":"包含PEM编码数据的文本。","The computed base 64 conversion.":"计算的基础64转换。","The size of the input data blocks in bytes.":"以字节为单位的输入数据块的大小。","The asymmetric algorithm implementation to use. The following table shows the valid values for the ":"要使用的非对称算法实现。 下表显示了"," if multiple blocks can be transformed; otherwise, ":"如果可以转换多个块； 否则，","A value that specifies the location, label, and data location of the encoded data.":"指定编码数据的位置，标签和数据位置的值。"," parameter and the algorithms they map to.\n\n ":"参数及其映射到的算法。","The size of the output data blocks in bytes.":"字节中输出数据块的大小。","The size, in bytes, of the buffer to use for reading from the underlying stream. This value must be greater than zero. The default size is 81920 bytes.":"用于从基础流读取的缓冲区的大小（以字节为单位）。 此值必须大于零。 默认大小为81920字节。","An array of bytes. A maximum of ":"一系列字节。 最多","The length of the label, in characters.":"标签的长度，字符。","The object identifier information to use to create the new object identifier.":"用于创建新对象标识符的对象标识符信息。","A new instance of the specified asymmetric algorithm implementation.":"指定的不对称算法实现的新实例。","The size of the key to generate, when a key is needed.":"当需要键时，要生成的键的大小。","The OpenSSL ":"openssl"," bytes are read from the current stream and stored in ":"字节从当前流读取并存储在","An object identifier.":"对象标识符。","The length of the data, in bytes.":"数据的长度，字节。","A byte array containing the PKCS#8 EncryptedPrivateKeyInfo representation of this key.":"包含此密钥的PKCS#8EncryptedPrivateKeyInfo表示形式的字节数组。","The number of characters in the encoded PEM.":"编码PEM中的字符数。"," value to use as the key.":"用作密钥的价值。","The total number of bytes read into the buffer. This can be less than the number of bytes requested if that many bytes are not currently available, or zero if the end of the stream has been reached.":"字节的总数读取到缓冲区中。 如果当前不可用的字节不可用，则可能小于所请求的字节数，或者如果达到流的末尾，则零。","The group to search in.":"要搜索的组。","When this method returns, contains a value that specifies the location, label, and data location of the encoded data; or, if no PEM-encoded data is found, a value that specifies those locations as empty.\n\n          This parameter is treated as uninitialized.":"当此方法返回时，包含一个指定编码数据的位置，标签和数据位置的值； 或者，如果找不到PEM编码的数据，则将这些位置指定为空的值。 \n\n           该参数被视为非初始化。","A byte array containing the PKCS#8 PrivateKeyInfo representation of this key.":"包含此密钥的PKCS＃8 PrivateKeyInfo表示的字节阵列。","An object that represents the specified OID.":"表示指定OID的对象。","The key parameters to import.":"要导入的关键参数。","A task that represents the asynchronous read operation. The value of the task object's ":"表示异步读取操作的任务。 任务对象的值 "," if PEM-encoded data was found; otherwise ":"如果发现PEM编码的数据； 否则"," value to use as the key, represented as a ":"用作密钥的价值，表示为","A byte array containing the X.509 SubjectPublicKeyInfo representation of the public-key portion of this key.":"包含该密钥的公钥部分的X.509主题PublicKeyInfo表示的字节阵列。"," parameter contains the total number of bytes read into the buffer. The result can be less than the number of bytes requested if the number of bytes currently available is less than the requested number, or it can be 0 (zero) if the end of the stream has been reached.":"参数包含读取到缓冲区的字节总数。 如果当前可用的字节数少于请求的数字，则结果可能小于请求的字节数，如果达到了流的末尾，则可能为0（零）。","The OID value.":"的OID值。","The label to write.":"要写的标签。","The text of the PEM key to import.":"PPEM键的文本要导入。"," object indicating the reference point used to obtain the new position.":"指示用于获得新位置的参考点的对象。"," representation of the cryptographic key.":"加密密钥的表示。","This method is not supported.":"不支持此方法。","A new instance of an ":"一个新实例","The data to write.":"要编写的数据。","The first buffer to compare.":"第一个比较的缓冲区。","The DSA parameters for the current cryptographic key.":"当前加密密钥的DSA参数。"," from which to begin writing bytes to the stream.":"从中开始写字节到流。","The array to copy the ":"复制的阵列","The SHA-256 hash of the shared secret.":"共享秘密的SHA-256哈希。","The buffer to receive the PEM-encoded text.":"接收PEM编码文本的缓冲区。","The second buffer to compare.":"比较的第二个缓冲区。"," object into.":"对象进入。"," if the current stream is readable; otherwise, ":" 如果当前流是可读的；否则, ","When this method returns, this parameter contains the number of characters written to ":"当此方法返回时，此参数包含写入的字符数","The parameters for the key.":"密钥的参数。"," have the same values for ":"具有相同的值","This property is not supported.":"不支持此属性。"," if the current stream is writable; otherwise, ":"如果当前的流是可写的； 否则，"," is large enough to contain the PEM-encoded text, otherwise ":"足够大，可以包含PEM编码的文本，否则"," is equal to that of the current instance. The comparison is ordinal and case-sensitive.":"等于当前实例。 比较是有序的，对病例敏感。"," and the same contents; otherwise, ":"和相同的内容； 否则，"," if the final block has been flushed; otherwise, ":"如果最后一个块被冲洗； 否则，","The input to compute the hash code for.":"计算哈希代码的输入。","The OID of the hash algorithm.":"哈希算法的OID。","The maximum key size.":"最大密钥大小。","A new SHA-1 instance, unless the default settings have been changed by using the <cryptoClass> element.":"除非使用<cryptoclass>元素更改默认设置，否则新的SHA-1实例。","The buffer to fill with zeros.":"用零填充的缓冲区。","The computed hash code.":"计算的哈希代码。","The hash algorithm name identified by the OID.":"OID标识的哈希算法名称。","The HMAC implementation to use. The following table shows the valid values for the ":"HMAC实现要使用。 下表显示了","The padding mode used to pad the plaintext to the algorithm's block size.":"填充模式用于将明文粘贴到算法的块大小上。","The minimum key size.":"最小钥匙尺寸。","A task that represents the asynchronous compute hash operation and wraps the computed hash code.":"代表异步计算哈希操作并包装计算的哈希代码的任务。","The hash code for the current instance, or 0 if no ":"当前实例的哈希代码，或0如果没有","A new instance of the specified HMAC implementation.":"指定的HMAC实现的新实例。","The length, in bytes, of the ciphertext with padding.":"用填充物的密文的长度，字节。","The algorithm to use when encrypting data.":"加密数据时要使用的算法。","The input to compute the HMAC code for.":"计算HMAC代码的输入。"," instance, unless the default settings have been changed using the .":"实例，除非使用该设置更改默认设置。","The padding mode used to pad the plaintext to the feedback size.":"填充模式用于将明文贴到反馈大小上。"," value was supplied to the ":"价值已提供给","The name of a hash algorithm to use with the Key Derivation Function (KDF) to turn a password into an encryption key.":"用于与密钥推导功能（KDF）一起使用的哈希算法的名称，以将密码转换为加密密钥。","The block size to use in the hash value.":"在哈希值中使用的块大小。","The hash algorithm implementation to use. The following table shows the valid values for the ":"哈希算法实现。 下表显示了","When this method returns, contains the total number of bytes written to ":"当此方法返回时，包含写入的字节总数"," have the same ":"有同样的东西","A new instance of the specified hash algorithm, or ":"指定的哈希算法的新实例，或","The name of the hash algorithm.":"哈希算法的名称。","The iteration count to provide to the Key Derivation Function (KDF) to turn a password into an encryption key.":"迭代计数以提供给密钥推导功能（KDF）以将密码转换为加密密钥。"," was large enough to receive the decrypted data; otherwise, ":"足够大，可以接收解密的数据； 否则，",", the hash algorithm. When this method returns ":"，哈希算法。 当此方法返回时","The input for which to compute the transform.":"计算转换的输入。"," is not a valid hash algorithm.":" 不是有效的哈希算法。"," was large enough to receive the encrypted data; otherwise, ":"足够大，可以接收加密数据； 否则，","The name of the hash algorithm to use with the Key Derivation Function (KDF) to turn a password into an encryption key.":"用于与密钥推导功能（KDF）一起使用的哈希算法的名称将密码转换为加密密钥。",", contains ":"，包含","A copy of the part of the input array used to compute the hash code.":"用于计算哈希代码的输入阵列部分的副本。","The length, in bits, to check for a valid key size.":"长度，位，检查有效的键大小。"," if the OID was successfully mapped to a hash algorithm; otherwise ":"如果OID成功映射到哈希算法； 否则","The output to which to write the transform.":"向其写入变换的输出。","A default cryptographic object used to perform the symmetric algorithm.":"用于执行对称算法的默认加密对象。","An array that is a copy of the part of the input that is hashed.":"一个数组，是哈希输入部分的副本。","The name of the specific implementation of the ":"特定实现的名称"," if the specified key size is valid for the current algorithm; otherwise, ":"如果指定的密钥大小对当前算法有效； 否则，","A hash algorithm name that represents \"MD5\".":"表示“ MD5”的哈希算法名称。","The current value of the computed hash code.":"计算的哈希代码的当前值。","The computed transform.":"计算的变换。","A cryptographic object used to perform the symmetric algorithm.":"用于执行对称算法的加密对象。","The size, in bits, of the secret key used by the symmetric algorithm.":"对称算法使用的秘密密钥的大小。","The string representation of the algorithm name, or ":"算法名称的字符串表示，或","The size, in bits, of the computed hash code.":"计算的哈希代码的大小。","The padding mode used to produce the ciphertext and remove during decryption.":"填充模式用于产生密文并在解密过程中删除。"," if the current transform can be reused; otherwise, ":"如果当前的转换可以重复使用； 否则，"," if no hash algorithm is available.":"如果没有哈希算法。","The parsed representation of the subject name for the certificate or certificate request.":"证书或证书请求的主题名称的解析表示。","The decrypted plaintext data.":"解密的明文数据。","The input block size.":"输入块大小。"," instance, unless the default settings have been changed.":"实例，除非更改默认设置。","An ECDSA key whose public key material will be included in the certificate or certificate request. If the ":"ECDSA键，其公共密钥材料将包含在证书或证书请求中。 如果是","A hash algorithm name that represents \"SHA1\".":"表示“ sha1”的哈希算法名称。","The keyed hash algorithm implementation to use. The following table shows the valid values for the ":"键入的哈希算法实现。 下表显示了","The buffer to receive the plaintext data.":"接收明文数据的缓冲区。","The output block size.":"输出块大小。","A hash algorithm name that represents \"SHA256\".":"表示“ SHA256”的哈希算法名称。"," method is called, this key is used as a private key.":"方法称为方法，该密钥被用作私钥。","The custom hash algorithm name.":"自定义哈希算法名称。","The feedback size, specified in bits.":"反馈尺寸，以位指定。","The hash algorithm to use when signing the certificate or certificate request.":"签署证书或证书请求时要使用的哈希算法。","A new instance of the specified keyed hash algorithm.":"指定的键合哈希算法的新实例。","A hash algorithm name that represents \"SHA384\".":"表示“ SHA384”的哈希算法名称。"," property is equal to that of the current instance. The comparison is ordinal and case-sensitive.":"属性等于当前实例的属性。 比较是有序的，对病例敏感。","The encrypted ciphertext data.":"加密的密文数据。","A RSA key whose public key material will be included in the certificate or certificate request. If the ":"RSA键，其公共密钥材料将包含在证书或证书请求中。 如果是","The minimum valid key size.":"最小有效的密钥大小。","A hash algorithm name that represents \"SHA512\".":"表示“ SHA512”的哈希算法名称。","The string representation of the subject name for the certificate or certificate request.":"证书或证书请求的主题名称的字符串表示。","The buffer to receive the ciphertext data.":"接收密文数据的缓冲区。"," for the issuer.":"对于发行人。","The maximum valid key size.":"最大有效密钥大小。","The RSA signature padding to apply if self-signing or being signed with an ":"如果自我签名或与"," object with the specified values. The returned object will assert ":"具有指定值的对象。 返回的对象将断言","The plaintext length, in bytes.":"明文长度，字节。"," object representing the issuing certificate authority.":"代表发行证书机构的对象。","The encoded representation of the public key to include in the certificate or certificate request.":"公共密钥的编码表示形式，将包括在证书或证书请求中。","The interval between valid key sizes.":"有效钥匙尺寸之间的间隔。","The oldest date and time when this certificate is considered valid. Typically ":"该证书被视为有效的最古老的日期和时间。 通常","A DER-encoded certificate signing request.":"DER编码的证书签名请求。","The private ECDSA key.":"私人ECDSA密钥。"," object representing the public key.":"代表公钥的对象。","The encoded distinguished name.":"编码的杰出名称。","A new ECDSA certificate with the ":"带有新的ECDSA证书",", plus or minus a few seconds.":"，加上或减几秒钟。","The signature generator with which to sign the request.":"签名生成器可以签署请求。","An object identifier (OID) object of the public key.":"公共密钥的对象标识符（OID）对象。",". The input ECDSA certificate object isn't modified.":"。 输入ECDSA证书对象未修改。","The X.509 Certificate Extensions collection to include in the certificate or certificate request.":"X.509证书扩展集收集将包括在证书或证书请求中。","The date and time when this certificate is no longer considered valid.":"该证书不再有效的日期和时间。"," object that represents the distinguished name.":"代表杰出名称的对象。","The RSA certificate.":"RSA证书。"," if the certificate does not have an ECDsa private key.":"如果证书没有ECDSA私钥。","The representation of the public key for the certificate or certificate request.":"证书或证书请求的公共密钥表示。","A string that represents the distinguished name.":"代表杰出名称的字符串。","The serial number to use for the new certificate. This value should be unique per issuer. The value is interpreted as an unsigned integer of arbitrary size in big-endian byte ordering. RFC 3280 recommends confining it to 20 bytes or less.":"用于新证书的序列号。 此值应该是每个发行人唯一的。 该值被解释为大型字节顺序中任意大小的无符号整数。 RFC 3280建议将其限制在20个字节或更少的情况下。","The private RSA key.":"私人RSA键。","The X.500 Distinguished Name to use as the Subject in a created certificate or certificate request.":"X.500在创建证书或证书请求中用作主题的X.500名称。"," if the certificate does not have an ECDsa public key.":"如果证书没有ECDSA公钥。"," object with the specified values. The returned object won't assert ":"具有指定值的对象。 返回的对象不会断言","A bitwise combination of the enumeration values that specify the characteristics of the distinguished name.":"指定杰出名称特征的枚举值的比重组合。","The DSA certificate.":"DSA证书。","A new RSA certificate with the ":"带有新的RSA证书","An asymmetric algorithm to obtain the SubjectPublicKeyInfo from.":"一种不对称算法，可从中获取主题。","The decoded distinguished name.":"解码的杰出名称。","The distinguished name of the issuer.":"发行人的杰出名称。","An object identifier (OID) object that represents the public key.":"代表公钥的对象标识符（OID）对象。",". The input RSA certificate object isn't modified.":"。 输入RSA证书对象未修改。","The private DSA key.":"的私有DSA密钥。","A formatted string that represents the X500 distinguished name.":"代表X500杰出名称的格式字符串。","The issuing certificate authority.":"发行证书机构。","A new DSA certificate with the ":"带有新的DSA证书","An ASN.1-encoded representation of the public key parameters.":"公共密钥参数的ASN.1编码表示。"," if the certificate does not have an RSA private key.":"如果证书没有RSA私钥。","The oldest date and time where this certificate is considered valid.\n              Typically ":"该证书被视为有效的最古老的日期和时间。 \n               通常","The comma-delimited distinguished name of the X509 certificate.":"X509证书的逗号划分的杰出名称。",". The input DSA certificate object isn't modified.":"。 输入DSA证书对象未修改。"," if the certificate does not have an RSA public key.":"如果证书没有RSA公钥。","An ASN.1-encoded representation of the public key value.":"公共密钥值的ASN.1编码表示。","The date and time where this certificate is no longer considered valid.":"该证书不再有效的日期和时间。"," if the certificate is a certificate authority (CA) certificate; otherwise, ":"如果证书是证书机构（CA）证书； 否则，","The certificate.":"证书。","The DNS name to be added.":"要添加的DNS名称。","A public key representing the SubjectPublicKeyInfo.":"表示SubjectPublicKeyInfo的公钥。"," if the certificate has a restriction on the number of path levels it allows; otherwise, ":"如果证书对允许的路径级别数量有限制； 否则，","The serial number to use for the new certificate. This value should be unique per issuer.\n              The value is interpreted as an unsigned (big) integer in big endian byte ordering.":"用于新证书的序列号。 此值应该是每个发行人唯一的。 \n               该值被解释为大端字节顺序中的一个未签名（大）整数。","The email address to be added.":"要添加的电子邮件地址。","The private key, or ":"私钥，或","The number of levels allowed in a certificate's path.":"证书路径中允许的级别数量。"," if the key is not an DSA key.":"如果密钥不是DSA键。","A certificate with the specified values. The returned object will not assert ":"具有指定值的证书。 返回的对象不会断言 "," if the extension is critical; otherwise, ":"如果扩展很关键； 否则，"," if the certificate does not have a DSA private key.":"如果证书没有DSA私钥。","The IP address to be added.":"要添加的IP地址。"," if the key is not an ECDiffieHellman key.":"如果钥匙不是ecdiffiehellman钥匙。"," instance representing the issuing Certificate Authority (CA).":"代表发行证书机构（CA）的实例。"," if the key is not an ECDsa key.":"如果密钥不是ECDSA密钥。","The URI to be added.":"要添加的URI。","The encoded data to use to create the extension.":"用于创建扩展名的编码数据。","The public key, or ":"公钥，或","An X509Certificate2 instance representing the issuing Certificate Authority (CA).":"一个代表发行证书机构（CA）的X509Certificate2实例。"," if the certificate is a certificate authority (CA) certificate, otherwise, ":"如果证书是证书机构（CA）证书，否则，"," if the key is not an RSA key.":"如果密钥不是RSA键。"," if the certificate does not have a DSA public key.":"如果证书没有DSA公钥。","The UPN to be added.":"要添加的UPN。","A byte array that contains data from an X.509 certificate.":"一个字节数组，其中包含来自X.509证书的数据。","The ASN.1-encoded representation of the public key value.":"公共密钥值的ASN.1编码表示。"," to mark the extension as ":"将扩展标记为","The ECDSA certificate.":"ECDSA证书。"," if the certificate has a restriction on the number of path levels it allows, otherwise, ":"如果证书对允许的路径级别数量有限制，否则，","The password required to access the X.509 certificate data.":"访问X.509证书数据所需的密码。","The ASN.1-encoded representation of the public key parameters.":"公共密钥参数的ASN.1编码表示。","The public key for the X.509 certificate as a hexadecimal string.":"X.509证书作为十六进制字符串的公共密钥。"," object that represents the encoded subject alternative name extension.":" 表示编码的主题替代名称扩展名的对象。","An integer indicating the number of levels allowed in a certificate's path.":"一个整数，指示证书路径中允许的级别数。","A bitwise combination of the enumeration values that control where and how to import the certificate.":"枚举值的位组合，该值控制在何处以及如何导入证书。"," if this certificate does not have an ECDiffieHellman private key.":" 如果此证书没有ECDiffieHellman私钥。","A byte array that contains distinguished name information.":"包含杰出名称信息的字节数组。","A byte array containing data from an X.509 certificate.":"一个字节阵列，其中包含来自X.509证书的数据。","A byte array containing the X.509 certificate data.":"包含X.509证书数据的字节数组。","A handle to an unmanaged ":"一个不受管理的手柄"," if this certificate does not have an ECDiffieHellman public key.":"如果该证书没有Ecdiffiehellman公钥。"," to allow only valid certificates to be returned from the search; otherwise, ":"仅允许从搜索中退还有效的证书； 否则，"," to use the current user context.":"使用当前的用户上下文。","The X.509 certificate data as a hexadecimal string.":"X.509证书数据作为十六进制字符串。"," value for the subject.":"对主题的价值。"," object that can iterate through the ":"可以迭代通过","The serial number of the X.509 certificate as an array of bytes in little-endian order.":"X.509证书的序列号作为小字节的数组按小订单。"," object that describes serialization information.":" 描述序列化信息的对象。"," handle to an X.509 chain.":"处理X.509链。"," to include the issuer name; otherwise, ":"包括发行人名称； 否则，","The serial number of the X.509 certificate as a little-endian hexadecimal string.":"X.509证书的序列号为小型十六进制字符串。"," structure that describes how serialization should be performed.":"描述应如何执行序列化的结构。","A byte array containing data from an ":"包含来自 "," if the X.509 certificate is valid; otherwise, ":"如果X.509证书有效； 否则，","The name of the certificate.":"证书的名称。","The name of a certificate file represented as a string.":"证书文件的名称表示为字符串。"," object associated with this X.509 chain.":"与此X.509链相关联的对象。"," class from which to initialize this class.":" 要从中初始化此类的类。","The password required to access the certificate information.":"访问证书信息所需的密码。"," to produce the verbose form of the string representation; otherwise, ":"产生字符串表示的详细形式； 否则，","The name of a certificate.":"证书的名称。","A bitwise combination of the enumeration values that control how and where the certificate is imported.":"控制证书如何和何处导入的枚举值的位组合。","The safe handle for this ":"这个的安全手柄 ","The name of a PKCS7 signed file.":"PKCS7签名文件的名称。","The algorithm to use for the thumbprint.":"用于指纹的算法。","The certificate information.":"证书信息。","The certificate data to read.":"要读取的证书数据。","The name of a certificate file.":"证书文件的名称。"," member of the unmanaged ":" 非托管成员 ","The buffer to receive the certificate thumbprint.":"缓冲区以接收证书指标。"," to display the public key, private key, extensions, and so forth; ":"显示公钥，私钥，扩展等；","The path of the PKCS7 signed file from which to create the X.509 certificate.":"PKCS7签名文件的路径可以从中创建X.509证书。","The name of the file containing the certificate information.":"包含证书信息的文件的名称。"," structure that represents an unmanaged ":"代表不受管理的结构"," structure in the Crypto API.":" 加密API中的结构。"," to display information that is similar to the ":"显示与","The newly created X.509 certificate.":"新创建的X.509证书。","The name of the certificate authority that issued the X.509v3 certificate.":"签发X.509V3证书的证书机构的名称。"," class, including thumbprint, serial number, subject and issuer names, and so on.":"类，包括拇指纹，序列号，主题和发行人名称等。","The text of the PEM-encoded X509 certificate collection.":"Pem编码的X509证书集合的文本。","An integer representing the index value.":"代表索引值的整数。","The path of the signed file from which to create the X.509 certificate.":"要从中创建X.509证书的签名文件的路径。","The path for the PEM-encoded X509 certificate collection.":"PEM编码的X509证书收集的路径。"," if the validation succeeds; ":"如果验证成功；","An array to copy the ":"一个复制的数组","The subject distinguished name from the certificate.":"该主题将名称与证书区分开。"," object to compare to the current object.":"对象与当前对象进行比较。"," at which to start copying.":"开始复制。"," object to be removed from the ":"从","A pointer to a certificate context in unmanaged code. The C structure is called ":"指向非托管代码中的证书上下文的指针。 C结构称为 "," if the validation fails.":"如果验证失败。","An integer representing the number of elements in the collection.":"代表集合中元素数量的整数。"," objects with which to initialize the new object.":"使用的对象初始化新对象。"," object is equal to the object specified by the ":"对象等于由","The certificate data to process.":"要处理的证书数据。"," if the certificate is archived, ":"如果证书已存档，","The password required to access the certificate data.":"访问证书数据所需的密码。"," with which to initialize the new object.":"用它来初始化新对象。","A pointer reference to the current object.":"指针引用当前对象。"," values that describes how to format the output data.":"描述如何格式化输出数据的值。","The serialization information required to deserialize the new ":"应对新的序列化信息"," if the certificate is not archived.":"如果证书未存档。"," to add to the current ":"添加到当前","An array of bytes that represents the current ":"代表当前的字节数组","A collection of certificates replacing the default certificate trust.":"替换默认证书信托的证书集合。","Contextual information about the source of the stream to be deserialized.":"关于要进行的流源的上下文信息。","The certificate's friendly name.":"证书的友好名称。","The index into the current ":"索引到电流","A byte array that represents the current ":"代表电流的字节数组"," if using the AIA extension is disabled; otherwise, ":"如果使用AIA扩展程序是禁用的； 否则，","The private ECDiffieHellman key.":"私人ecdiffiehellman钥匙。"," object contains a private key; otherwise, ":"对象包含一个私钥； 否则，"," at which the new ":"新的","A string representation of the value of the ":"字符串表示值","A new ECDiffieHellman certificate with the ":"带有新的Ecdiffiehellman证书","The hash value for the X.509 certificate.":"X.509证书的哈希值。"," was inserted.":"被插入。"," object that contains the name of the certificate issuer.":"包含证书发行人名称的对象。",".\n The default is ":".\n 默认值为 "," object that represents the expiration date for the certificate.":"表示证书的到期日期的对象。",".\n            The current certificate isn't modified.":"。 \n             当前证书未修改。","The name of the cryptographic hash algorithm to use.":"加密哈希算法的名称要使用。"," containing the objects to add to the current ":"包含要添加到当前的对象"," value determining the root trust.":"确定根部信任的价值。"," object that represents the effective date of the certificate.":"代表证书生效日期的对象。","The text of the PEM-encoded X509 certificate.":"PEM编码的X509证书的文本。","A byte array that contains the hash value for the X.509 certificate.":"一个字节数组，其中包含X.509证书的哈希值。"," containing the objects to add to the collection.":"包含要添加到集合的对象。"," object, which is either an RSA or DSA cryptographic service provider.":"对象，是RSA或DSA加密服务提供商。","The hexadecimal string representation of the X.509 certificate hash value.":"X.509证书哈希值的十六进制字符串表示。","The text of the password protected PEM-encoded private key.":"密码保护PEM编码的私钥的文本。","A localizable string.":"可本地化的字符串。"," to locate.":"定位。","The effective date for this X.509 certificate.":"此X.509证书的生效日期。","The password for the encrypted PEM.":"加密PEM的密码。"," is contained in this collection; otherwise, ":"该系列中包含； 否则，"," object indicating the applications that use the key.":"对象指示使用密钥的应用程序。","A new certificate with the private key.":"带有私钥的新证书。","The expiration date for this X.509 certificate.":"此X.509证书的到期日期。"," that is the destination of the values copied from ":"那是从","The encoded data to be used to create the extension.":"用于创建扩展名的编码数据。","The path for the PEM-encoded X509 certificate.":"PEM编码的X509证书的路径。"," if the extension is critical; otherwise ":"如果扩展很关键； 否则"," to begin copying.":"开始复制。","If specified, the path for the password protected PEM-encoded private key.\n            If unspecified, the ":"如果指定，则密码保护PEM编码的私钥的路径。 \n             如果未指定，","The format of this X.509 certificate.":"此X.509证书的格式。","The object identifier used to identify the extension.":"对象标识符用于识别扩展程序。"," file will be used to load the private key.":"文件将用于加载私钥。","The hash code for the X.509 certificate as an integer.":"作为整数的x.509证书的哈希码。","The encoded data used to create the extension.":"用于创建扩展名的编码数据。","A new X509 certificate.":"新的X509证书。","An enumerator of the subelements of ":"的子元素的枚举器 ","The name of the certification authority that issued the X.509 certificate.":"签发X.509证书的认证机构的名称。","The key algorithm information for this X.509 certificate as a string.":"此X.509证书作为字符串的密钥算法信息。","The text of the PEM-encoded private key.":"PEM编码的私钥的文本。","A string representing the object identifier.":"代表对象标识符的字符串。"," you can use to iterate through the collection.":"您可以使用该系列进行迭代。"," to be copied.":"被复制。","If specified, the path for the PEM-encoded private key.\n            If unspecified, the ":"如果指定，则是PEM编码的私钥的路径。 \n             如果未指定，","The key algorithm parameters for the X.509 certificate as an array of bytes.":"作为字节数组的x.509证书的密钥算法参数。","A hash value based on all values contained in the current ":"基于当前包含的所有值的哈希值","The key algorithm parameters for the X.509 certificate as a hexadecimal string.":"X.509证书作为十六进制字符串的密钥算法参数。"," object to add to the ":"对象添加到","The data to identify.":"识别的数据。"," specified by the ":"由","The index at which the ":"索引","The name of the principal to which the certificate was issued.":"签发证书的本金的名称。","The zero-based index where ":"基于零的索引","One of the enumeration values that indicate the content type of the provided data.":"指示提供数据的内容类型的枚举值之一。","The public key for the X.509 certificate as an array of bytes.":"X.509证书的公共密钥作为字节数组。"," object to retrieve.":"对象检索。"," parameter was added.":"添加了参数。"," to remove from the current ":"从电流中删除","The object identifier (OID) of the extension to retrieve.":"扩展程序的对象标识符（OID）要检索。","The zero-based index of the entry to locate in the current ":"条目的基于零的索引，以定位于当前","The location in the array at which copying starts.":"复制开始的阵列中的位置。","A string, encoded in hexadecimal format, that represents the subject key identifier (SKI).":"以十六进制格式编码的字符串，代表主题密钥标识符（SKI）。"," object that represents the pre-existing handle to use. Using ":"代表要使用的句柄的对象。 使用"," at the specified index of the current ":"在当前的指定索引处","An object that you can use to synchronize access to the ":"您可以使用的对象同步访问对"," object to use to iterate through the ":"用来通过迭代的目的"," is not null, the current exception is raised in a ":"不是零，当前例外是在","The current X.509 certificate object in the ":"当前的X.509证书对象","The collection of unmapped identities.":"未映射身份的集合。"," values that describes how to use the key.":"描述如何使用密钥的值。","An integer representing the number of ":"一个代表数量的整数","An object to compare with this ":"与此相比的对象"," to use the machine context; ":"使用机器上下文；"," objects in the ":"对象","The certificate's public key.":"证书的公钥。"," instance, or a null reference.":"实例或null引用。"," if the collection is thread safe; otherwise, ":"如果收集是安全的； 否则，"," or an empty string.":"或一个空字符串。","The private key.":"私钥。"," is an object with the same underlying type and value as this ":"是具有与此相同的基础类型和值的对象"," is the SID type for the ":"是SID类型"," object for ECDSA signatures.":"ECDSA签名的对象。","The name of the domain. This parameter can be ":"域名。 此参数可以是","The type being queried for validity to serve as a conversion from ":"查询有效性的类型作为从 "," object for RSA signatures.":"RSA签名的对象。","The SID, in SDDL format, for the account represented by the ":"SID，SDDL格式，用于代表的帐户"," or an empty string. Domain names that are null values are treated like an empty string.":"或一个空字符串。 null值的域名被视为一个空字符串。",". The following target types are valid:  \n  \n ":"。 以下目标类型有效：","The name of the account. This parameter cannot be ":"帐户的名称。 此参数不能是"," is a valid translation type for the ":"是一种有效的翻译类型","The hash algorithm to use for encoding.":"用于编码的哈希算法。","The account domain SID portion from the SID represented by the ":"帐户域SID部分来自由 ","A hash value for the current ":"电流的哈希值"," object if the SID represents a Windows account SID; otherwise, it returns ":"对象如果SID表示Windows帐户SID； 否则，它返回","The encoded value for the X.509 algorithm identifier.":"X.509算法标识符的编码值。"," operand to use for the equality comparison. This parameter can be ":"用于平等比较的操作数。 此参数可以是",". The following target types are valid:  \n  \n - ":"。 以下目标类型有效： \n  \n   - ","  \n  \n - ":" - ","The input data for which to produce the signature.":"产生签名的输入数据。","The length, in bytes, of the SID represented by the ":"以字节为单位的长度表示"," operand to use for the inequality comparison. This parameter can be ":" 用于不等式比较的操作数。 此参数可以是 "," class; otherwise ":"班级; 否则","An uppercase SDDL string for the SID represented by the ":"SID代表的SID的大写SDDL字符串","The left operand to use for the equality comparison. This parameter can be ":"用于平等比较的左操作数。 此参数可以是","The identity in string format.":"字符串格式的身份。","The hash algorithm to use to produce the signature.":"用于生成签名的哈希算法。","The right operand to use for the equality comparison. This parameter can be ":"合适的操作数用于平等比较。 此参数可以是","The account token for the user on whose behalf the code is running.":"代表代码正在运行的用户的帐户令牌。","The target type for the conversion from ":"转换的目标类型","The X.509 signature for the specified data.":"指定数据的X.509签名。"," are equal; otherwise ":"相等； 否则","(Informational use only.) The type of authentication used to identify the user.":"（仅信息用途。）用于识别用户的身份验证类型。","The public key associated with the private key with which signatures are being generated.":"与签名生成的私钥相关的公共密钥。","The left operand to use for the inequality comparison. This parameter can be ":"左操作数用于不平等比较。 此参数可以是","The converted identity.":"转换的身份。","One of the enumeration values.":"枚举值之一。","A handle to an ":"一个把手","The right operand to use for the inequality comparison. This parameter can be ":"用于不平等比较的正确操作数。 此参数可以是","The string value of the identity represented by the ":"由"," to indicate that the user is authenticated; otherwise, ":"表示用户已进行身份验证； 否则，"," are not equal; otherwise ":"不等； 否则","One of the enumeration values that specifies the location of the X.509 certificate store.":"指定X.509证书存储的位置的枚举值之一。","The initial number of items in the collection. The value of ":"集合中的最初数量。 的价值","The account name, in Domain \\ Account format.":"帐户名，域\\帐户格式。","One of the enumeration values that specifies the name of the X.509 certificate store.":"指定X.509证书存储名称的枚举值之一。","The object containing the account information for the user.":"包含用户帐户信息的对象。"," is a hint only; it is not necessarily the maximum number of items created.":"只是一个提示； 它不一定是创建的最大项目数。",". The target type must be a type that is considered valid by the ":"。 目标类型必须是一种被认为有效的类型","A bitwise combination of enumeration values that specifies the way to open the X.509 certificate store.":"枚举值的位组合指定了打开X.509证书存储的方式。","An object that indicates the stream characteristics.":"指示流特性的对象。"," if the collection contains the specified object.":"如果该集合包含指定的对象。","The name of the certificate store.":"证书存储的名称。","The UPN for the user on whose behalf the code is running.":"代表代码正在运行的用户的UPN。","The byte array that represents the SID.":"代表SID的字节数组。"," array object to which the ":"数组对象","The byte offset to use as the starting index in ":"字节偏移用作起始索引","An object that represents an anonymous user.":"代表匿名用户的对象。","The certificate to add.":"要添加的证书。"," collection is to be copied.":"收集要复制。","An integer that represents the binary form of a SID.":"代表SID的二进制形式的整数。","The collection of certificates to add.":"要添加的证书的集合。","An object that represents the current user.":"代表当前用户的对象。"," where the ":"在哪里","One of the enumeration values. This value must not be ":"枚举值之一。 这个值不得是","The certificate to remove.":"删除的证书。"," to return the ":"返回","The domain SID. This value is required for the following ":"域SID。 以下值需要此值"," if the specified object was removed from the collection.":"如果从集合中删除了指定的对象。"," values. This parameter is ignored for any other ":"值。 此参数被忽略","A range of certificates to remove.":"一系列要删除的证书。"," only if the thread is currently impersonating; ":"只有该线程当前处于模仿时；"," values.  \n  \n - ":"值。 \n  \n   - ","The type to which items in the collection are being converted.":"集合中的项目正在转换的类型。","A collection of certificates.":"证书的集合。"," of the thread if it is impersonating or the ":"如果线程模仿或","SDDL string for the SID used to create the ":"SID的SDDL字符串用于创建"," collection that represents the converted contents of the original collection.":"代表原始集合的转换内容的集合。"," of the process if the thread is not currently impersonating.":"如果线程当前没有模仿，则该过程的过程。"," if the instance is connected to an open certificate store; otherwise, ":"如果实例连接到开放证书存储； 否则，"," is equal to the value of the current ":"等于电流的值","A Boolean value that determines how conversion errors are handled.  \n  \n If ":"一个布尔值决定了如何处理转换错误。 \n  \n  如果","The byte array to receive the copied SID.":"字节阵列接收复制的SID。","The location of the certificate store.":"证书商店的位置。","An object that represents a Windows user.":"代表Windows用户的对象。",", conversion errors due to a mapping not being found for the translation result in a failed conversion and exceptions being thrown.  \n  \n If ":"，由于未在翻译中找到映射而导致的转换错误导致转换失败和异常。 \n  \n  如果"," if the SID represented by this ":"如果SID由此代表","A byte array that represents data to use to create the extension.":"代表用于创建扩展名的数据的字节数组。","The SafeAccessTokenHandle of the impersonated Windows identity.":"模仿的Windows身份的SafeAccessTokenHandle。",", types that failed to convert due to a mapping not being found for the translation are copied without being converted into the collection being returned.":"，由于未找到翻译的映射而未能转换的类型将被复制，而不会转换为返回的集合。"," object is a valid Windows account SID; otherwise, ":"对象是有效的Windows帐户SID； 否则，"," at the specified index in the collection. If ":"在集合中的指定索引上。 如果","The System.Action to run.":"系统的操作。","A read-only span of bytes that represents data to use to create the extension.":"仅读取字节的跨度，该字节代表用于创建扩展名的数据。","The SID to compare with this ":"与此相比的SID"," is greater than or equal to the number of nodes in the collection, the return value is ":"大于或等于集合中的节点数量，返回值为","The System.Func to run.":"System.func运行。"," object to use to create the extension.":"用于创建扩展名的对象。"," object is in the same domain as the ":"对象与","The result of the function.":"功能的结果。","The name used to create the ":"用于创建的名称"," SID; otherwise, ":"sid; 否则，"," object to create a subject key identifier (SKI) from.":"从中创建主题密钥标识符（SKI）的对象。"," object. This parameter cannot be ":"目的。 此参数不能是","The handle of the impersonated Windows identity.":"模仿窗口身份的手柄。"," values that identifies which hash algorithm to use.":"标识要使用的哈希算法的值。","The function to run.":"运行的功能。","One of the enumeration values that specifies the impersonation level.":"指定模仿级别的枚举价值之一。","A value to compare with the ":"与","A string, encoded in hexadecimal format, that represents the subject key identifier (SKI) for a certificate.":"以十六进制格式编码的字符串，代表证书的主题密钥标识符（SKI）。","A task that represents the asynchronous operation of the provided ":"表示所提供的异步操作的任务"," if the user account is an anonymous account; otherwise, ":"如果用户帐户是匿名帐户； 否则，","A task that represents the asynchronous operation of ":"代表异步操作的任务","The span to contain the resulting set of characters.":"包含生成的字符集的跨度。"," instance encodes, primarily which characters to encode.":"实例编码，主要是要编码的字符。"," if the user account is a ":"如果用户帐户是一个","The set of characters that the encoder is allowed to not encode.":"允许编码器不编码的字符集。","An object containing the information required to serialize the ":"包含序列化信息的对象"," that converts an ASCII encoded sequence of bytes into a sequence of Unicode characters.":"这将ASCII编码的字节序列转换为一系列Unicode字符。"," account; otherwise, ":"帐户; 否则，","A built-in instance of the ":"一个内置实例","A collection of claims that have the ":"具有的主张的集合","The Windows logon name of the user on whose behalf the code is being run.":"代表代码正在运行的用户的Windows登录名。"," that converts a sequence of Unicode characters into an ASCII encoded sequence of bytes.":"这将Unicode字符的序列转换为ASCII编码的字节序列。","A JavaScript encoder instance.":"JavaScript编码器实例。"," property key.":"属性密钥。","An object for the token owner.":"令牌所有者的对象。","The stream to which to write the encoded text.":"写编码文本的流。"," containing the results of decoding the specified sequence of bytes.":"包含解码指定字节序列的结果。","An object representing the groups the current Windows user belongs to.":"代表当前Windows用户属于的组的对象。","The handle of the access token associated with the current execution thread.":"与当前执行线程关联的访问令牌的句柄。","The array of characters to encode.":"要编码的字符数组。"," to use the big endian byte order (most significant byte first), or ":"使用大端字节订单（首先是最重要的字节）或"," object to be cloned.":"要克隆的对象。","An object for the user.":"用户的对象。"," to use the little endian byte order (least significant byte first).":"使用小末日字节订单（首先是最不重要的字节）。","The array index of the first character to encode.":"要编码的第一个字符的数组索引。","The RID of the Windows user group in which to check for the principal's membership status.":"Windows用户组的删除在其中检查主体的会员资格状态。","The allowed character ranges.":"允许的角色范围。"," method returns a Unicode byte order mark; otherwise, ":"方法返回一个Unicode字节订单标记； 否则，","The number of characters in the array to encode.":"编码数组中的字符数。","The string whose substring is to be encoded.":"将要编码子字符串的字符串。","The index where the substring starts.":"子字符串开始的索引。"," if the current principal is a member of the specified Windows user group, that is, in a particular role; otherwise, ":"如果当前的主体是指定的Windows用户组的成员，即在特定角色中； 否则，"," to use the big endian byte order (most significant byte first); ":"使用大端字节订单（首先是最重要的字节）；","The allowed character.":"允许的角色。","A source buffer containing the characters to encode.":"包含要编码的字符的源缓冲区。"," that uniquely identifies a Windows user group.":"这独特地标识了Windows用户组。","The allowed characters.":"允许的字符。","The serial number of the certificate as a big-endian hexadecimal string.":"证书的序列号为大型十六进制弦。"," to specify that an exception should be thrown when an invalid encoding is detected; otherwise, ":"指定当检测到无效编码时应抛出异常； 否则，","The destination buffer to which the encoded form of ":"编码形式的目标缓冲区"," if the current principal is a member of the specified Windows user group; otherwise, ":"如果当前主体是指定的Windows用户组的成员； 否则，","The allowed code points.":"允许的代码点。"," and is equal to the current object; otherwise, ":"并且等于当前对象； 否则，","The number of characters consumed from the ":"从","The object identifier of the signature algorithm.":"签名算法的对象标识符。","The range of characters to be allowed.":"允许的字符范围。","The name of the Windows user group for which to check membership.":"Windows用户组的名称要检查会员资格。","The string that contains the set of characters to encode.":"包含要编码的字符集的字符串。","The number of characters written to the ":"写在"," object that represents the name of the certificate subject.":"代表证书主题名称的对象。","The ranges of characters to be allowed.":"允许字符的范围。","A collection of all Windows device claims from this principal.":"所有Windows设备的集合从该主管声称。"," that converts a UTF-16 encoded sequence of bytes into a sequence of Unicode characters.":"这将UTF-16字节的编码序列转换为一系列Unicode字符。","The disallowed character.":"不允许的角色。"," to indicate there is no further source data that needs to be encoded; otherwise, ":"为了表明没有其他需要编码的源数据； 否则，","The thumbprint of the certificate.":"证书的指标。"," object of the current principal.":"当前本金的对象。"," object that converts a sequence of Unicode characters into a UTF-16 encoded sequence of bytes.":"将一个Unicode字符序列转换为UTF-16字节序列的对象。","An enumeration value that describes the result of the encoding operation.":"描述编码操作结果的枚举值。","The disallowed characters.":"不允许的角色。","The certificate format.":"证书格式。","A collection of all Windows user claims from this principal.":"所有Windows用户的集合都从此主体声明。","The encoded string.":"编码的字符串。","A byte array containing the Unicode byte order mark, if the ":"一个包含Unicode字节订单标记的字节数组，如果"," object to start the collection from.":"对象从中启动集合。","The range of characters to be disallowed.":"不允许的字符范围。","An X.509 certificate represented as an ":"X.509证书表示为","The code page identifier of the preferred encoding which the encoding provider may support.":"编码提供商可以支持的首选编码的代码页标识符。","A source buffer containing the UTF-8 text to encode.":"包含用于编码的UTF-8文本的源缓冲区。"," object is configured to supply one. Otherwise, this method returns a zero-length byte array.":"对象配置为提供一个。 否则，此方法返回零长度字节数组。","The ranges of characters to be disallowed.":"不允许的字符范围。"," object to locate in the collection.":" 对象在集合中定位。","The number of bytes consumed from the ":"从消耗的字节数 ","The encoding associated with the specified code page identifier, or ":"与指定代码页标识符相关联的编码，或者 "," object containing the results of decoding the specified sequence of bytes.":" 包含解码指定字节序列的结果的对象。","A byte span containing the Unicode byte order mark, if this object is configured to supply one; otherwise, the default span.":"如果该对象配置为提供一个字节，则包含Unicode字节订单标记的字节跨度； 否则，默认跨度。","X.509 certificate information in a byte array.":"X.509字节阵列中的证书信息。","A status code that describes the result of the encoding operation.":"描述编码操作结果的状态代码。"," if the provider does not support the requested codepage encoding.":"如果提供商不支持请求的编码编码。","The enumerator of allowed code points.":"允许的代码点的枚举器。","A string used to protect the byte array.":"用于保护字节数组的字符串。"," to specify that a Unicode byte order mark is provided; otherwise, ":"指定提供一个Unicode字节订单标记； 否则，","The text buffer to search.":"文本缓冲区要搜索。","The code page name of the preferred encoding which the encoding provider may support.":"编码提供商可以支持的首选编码的代码页名称。","The first code point in the range.":"范围内的第一个代码点。","The search criteria as an object.":"搜索标准作为对象。","The UTF-8 text input buffer to search.":"UTF-8文本输入缓冲区进行搜索。"," to compare with the current object.":"与当前对象进行比较。","The encoding associated with the specified code page, or ":"与指定代码页面相关联的编码","The number of code points in the range.":"该范围内的代码点数。"," if the provider does not support the requested encoding.":"如果提供商不支持所请求的编码。","The Bopomofo Unicode block (U+3105-U+312F).":"Creode Unicode块（U + 3105-U + 312F）。","The index of the first element in ":"第一个元素的索引","The first character in the range.":"范围内的第一个字符。"," that converts a UTF-32 encoded sequence of bytes into a sequence of Unicode characters.":"将UTF-32字节的UTF-32序列转换为一系列Unicode字符。","The last character in the range.":"范围内的最后一个角色。","An encoding provider that allows access to encodings not supported on the current .NET Framework platform.":"一个编码提供商，允许访问当前.NET框架平台上不支持的编码。"," that would be escaped by the current encoder instance, or -1 if no data in ":"当前的编码器实例将逃脱，如果没有数据","The Bopomofo Extended Unicode block (U+31A0-U+31BF).":"BOPOMOFO扩展Unicode块（U+31A0-U+31BF）。"," that converts a sequence of Unicode characters into a UTF-32 encoded sequence of bytes.":"这将一系列Unicode字符转换为UTF-32字节的编码序列。","A range that includes all characters between ":"包括所有字符之间的范围","The Box Drawing Unicode block (U+2500-U+257F).":"框图UNICODE块（U+2500-U+257F）。","The span that contains the set of characters to encode.":"包含要编码的字符集的跨度。","A byte span containing the Unicode byte order mark, if this object is configured to supply one; otherwise, a default span.":"如果该对象配置为提供一个字节，则包含Unicode字节订单标记的字节跨度； 否则，默认跨度。"," requires escaping.":"需要逃脱。"," containing the set of characters to encode.":"包含要编码的字符集。","A pointer to the buffer to which to write the encoded text.":"指向写编码文本的缓冲区的指针。","The Braille Patterns Unicode block (U+2800-U+28FF).":"盲文图案Unicode块（U+2800-U+28FF）。","A range that consists of the entire BMP.":"由整个BMP组成的范围。"," to specify that optional characters are allowed; otherwise, ":"指定允许可选的字符； 否则，","The actual number of bytes written at the location indicated by ":"在指示的位置编写的实际字节数"," object containing the set of characters to encode.":"包含要编码的字符集的对象。","The Alphabetic Presentation Forms Unicode block (U+FB00-U+FB4F).":"字母呈现形式构成Unicode块（U+FB00-U+FB4F）。","The Buginese Unicode block (U+1A00-U+1A1F).":"Buginese Unicode块（U+1A00-U+1A1F）。","The length of the destination ":"目的地的长度","The character span to encode.":"要编码的字符跨度。","The Arabic Unicode block (U+0600-U+06FF).":"阿拉伯语Unicode块（U+0600-U+06FF）。","The Buhid Unicode block (U+1740-U+175F).":"Buhid Unicode块（U+1740-U+175F）。"," in characters.":"在字符中。"," that converts a UTF-7 encoded sequence of bytes into a sequence of Unicode characters.":"这将一个UTF-7编码字节的序列转换为一系列Unicode字符。","The span to contain the resulting set of bytes.":"包含结果集的字节集的跨度。","When the method returns, indicates the number of characters written to the ":"当方法返回时，指示写入的字符数","The Arabic Extended-A Unicode block (U+08A0-U+08FF).":"阿拉伯语扩展-A Unicode块（U+08A0-U+08FF）。","The Cham Unicode block (U+AA00-U+AA5F).":"Cham Unicode块（U+AA00-U+AA5F）。"," that converts a sequence of Unicode characters into a UTF-7 encoded sequence of bytes.":"这将一系列Unicode字符转换为UTF-7编码字节序列。","The span containing the set of bytes to decode.":"包含要解码的字节集的跨度。"," method should return a Unicode byte order mark; otherwise, ":"方法应返回Unicode字节订单标记； 否则，","The Arabic Presentation Forms-A Unicode block (U+FB50-U+FDFF).":"阿拉伯语呈现形式-A Unicode块（U+FB50-U+FDFF）。","The Cherokee Unicode block (U+13A0-U+13FF).":"切诺基Unicode块（U+13A0-U+13FF）。"," is too small to fit the encoded text; otherwise, returns ":"太小了，无法适合编码的文本； 否则，返回"," to throw an exception when an invalid encoding is detected; otherwise, ":"当检测到无效编码时，引发例外； 否则，"," value will be encoded by this encoder; otherwise, returns ":"值将由此编码器编码； 否则，返回","The number of characters produced by decoding the specified byte span.":"通过解码指定的字节跨度产生的字符数。","The Cherokee Supplement Unicode block (U+AB70-U+ABBF).":"切诺基补充Unicode块（U+AB70-U+ABBF）。","The Arabic Presentation Forms-B Unicode block (U+FE70-U+FEFF).":"阿拉伯语呈现形式-B Unicode块（U+FE70-U+FEFF）。","The maximum number of characters.":"最大字符数。","The CJK Compatibility Unicode block (U+3300-U+33FF).":"CJK兼容性Unicode块（U+3300-U+33ff）。","A decoder that converts a UTF-8 encoded sequence of bytes into a sequence of Unicode characters.":"将UTF-8编码字节序列转换为Unicode字符序列的解码器。","The Arabic Supplement Unicode block (U+0750-U+077F).":"阿拉伯补品Unicode块（U+0750-U+077F）。","The actual number of characters written at the location indicated by ":"在指示的位置写的字符数","The Dingbats Unicode block (U+2700-U+27BF).":"Dingbats Unicode块（U+2700-U+27BF）。","The Armenian Unicode block (U+0530-U+058F).":"亚美尼亚的Unicode块（U+0530-U+058F）。","The Enclosed Alphanumerics Unicode block (U+2460-U+24FF).":"封闭的字母数字Unicode块（U+2460-U+24FF）。","The CJK Compatibility Forms Unicode block (U+FE30-U+FE4F).":"CJK兼容性形成Unicode块（U+Fe30-U+Fe4f）。"," that converts a sequence of Unicode characters into a UTF-8 encoded sequence of bytes.":"这将一系列Unicode字符转换为UTF-8编码字节序列。","The span containing the bytes to decode.":"包含要解码的字节的跨度。","The Arrows Unicode block (U+2190-U+21FF).":"箭头Unicode块（U+2190-U+21ff）。","The NKo Unicode block (U+07C0-U+07FF).":"NKO Unicode块（U+07C0-U+07FF）。","The Enclosed CJK Letters and Months Unicode block (U+3200-U+32FF).":"封闭的CJK字母和月份块（U+3200-U+32FF）。"," encoding object is configured to supply one. Otherwise, this method returns a zero-length byte array.":"编码对象配置为提供一个。 否则，此方法返回零长度字节数组。","The CJK Compatibility Ideographs Unicode block (U+F900-U+FAD9).":"CJK兼容性意识形图Unicode块（U+F900-U+FAD9）。","The Balinese Unicode block (U+1B00-U+1B7F).":"巴厘岛Unicode块（U+1B00-U+1B7F）。","A Unicode range with no elements.":"没有元素的Unicode范围。","Settings that control how the ":"控制如何控制如何","The Ethiopic Unicode block (U+1200-U+137C).":"Ethiopic Unicode块（U+1200-U+137C）。","The CJK Radicals Supplement Unicode block (U+2E80-U+2EFF).":"CJK自由基补充Unicode块（U+2e80-U+2eff）。","The Number Forms Unicode block (U+2150-U+218F).":"该数字形成Unicode块（U+2150-U+218F）。","The Bamum Unicode block (U+A6A0-U+A6FF).":"BAMUM UNICODE块（U+A6A0-U+A6FF）。","The Ethipic Extended Unicode block (U+2D80-U+2DDF).":"伦理扩展Unicode块（U+2D80-U+2DDF）。","The CJK Strokes Unicode block (U+31C0-U+31EF).":"CJK笔触Unicode块（U+31C0-U+31EF）。","The Basic Latin Unicode block (U+0021-U+007F).":"基本的拉丁unicode块（U+0021-U+007F）。","The Ogham Unicode block (U+1680-U+169F).":"Ogham Unicode块（U+1680-U+169F）。","The Ethiopic Extended-A Unicode block (U+AB00-U+AB2F).":"Ethiopic扩展-A Unicode块（U+AB00-U+AB2F）。","The CJK Symbols and Punctuation Unicode block (U+3000-U+303F).":"CJK符号和标点Unicode块（U+3000-U+303F）。","The Batak Unicode block (U+1BC0-U+1BFF).":"BATAK UNICODE块（U+1BC0-U+1BFF）。","The Ol Chiki Unicode block (U+1C50-U+1C7F).":"OL CHIKI UNICODE块（U+1C50-U+1C7F）。","The Ethiopic Supplement Unicode block (U+1380-U+1399).":"埃塞俄比亚补品Unicode块（U+1380-U+1399）。","The CJK Unified Ideographs Unicode block (U+4E00-U+9FCC).":"CJK统一的意识形志Unicode块（U+4E00-U+9FCC）。","The Optical Character Recognition Unicode block (U+2440-U+245F).":"光学特征识别Unicode块（U+2440-U+245F）。","The General Punctuation Unicode block (U+2000-U+206F).":"一般标点Unicode块（U+2000-U+206F）。","The Bengali Unicode block (U+0980-U+09FF).":"孟加拉语Unicode块（U+0980-U+09FF）。","The CJK Unitied Ideographs Extension A Unicode block (U+3400-U+4DB5).":"CJK统一的意识形志扩展一个Unicode块（U+3400-U+4DB5）。","The Oriya Unicode block (U+0B00-U+0B7F).":"Oriya Unicode块（u+0b00-u+0b7f）。","The Geometric Shapes Unicode block (U+25A0-U+25FF).":"几何形状Unicode块（U+25A0-U+25FF）。","The Block Elements Unicode block (U+2580-U+259F).":"块元素Unicode块（U+2580-U+259F）。","The Phags-pa Unicode block (U+A840-U+A87F).":"PHAGS-PA UNICODE块（U+A840-U+A87F）。","The Combining Diacritical Marks Unicode block (U+0300-U+036F).":"组合标记Unicode块（U+0300-U+036F）。","The Georgian Unicode block (U+10A0-U+10FF).":"Georgian Unicode块（U+10A0-U+10FF）。","The Combining Diacritical Marks Extended Unicode block (U+1AB0-U+1AFF).":"组合标记扩展Unicode块（U+1AB0-U+1AFF）。","The Phonetic Extensions Unicode block (U+1D00-U+1D7F).":"语音扩展Unicode块（u+1d00-u+1d7f）。","The Combining Diacritical Marks for Symbols Unicode block (U+20D0-U+20FF).":"符号的组合标记Unicode块（u+20d0-u+20ff）。","The Georgian Supplement Unicode block (U+2D00-U+2D2F).":"格鲁吉亚补品Unicode块（U+2D00-U+2D2F）。","The Phonetic Extensions Supplement Unicode block (U+1D80-U+1DBF).":"语音扩展补充Unicode块（U+1D80-U+1DBF）。","The Combining Diacritical Marks Supplement Unicode block (U+1DC0-U+1DFF).":"组合标记补充Unicode块（U+1DC0-U+1DFF）。","The Glagolitic Unicode block (U+2C00-U+2C5F).":"Glagolitic Unicode块（U+2C00-U+2C5F）。","The Rejang Unicode block (U+A930-U+A95F).":"Rejang Unicode块（U+A930-U+A95F）。","The Combining Half Marks Unicode block (U+FE20-U+FE2F).":"组合半标记Unicode块（U+Fe20-U+Fe2F）。","The Greek and Coptic Unicode block (U+0370-U+03FF).":"希腊和科普特Unicode块（U+0370-U+03FF）。","The Runic Unicode block (U+16A0-U+16FF).":"符文Unicode块（U+16A0-U+16FF）。","The Common Indic Number Forms Unicode block (U+A830-U+A83F).":"公共指示号码形成Unicode块（U+A830-U+A83F）。","The Greek Extended Unicode block (U+1F00-U+1FFF).":"希腊扩展Unicode块（u+1f00-u+1fff）。","The Control Pictures Unicode block (U+2400-U+243F).":"控制图片Unicode块（U+2400-U+243F）。","The Gujarti Unicode block (U+0A81-U+0AFF).":"Gujarti Unicode块（U+0A81-U+0AFF）。","The Samaritan Unicode block (U+0800-U+083F).":"Samaritan Unicode块（U+0800-U+083F）。","The Coptic Unicode block (U+2C80-U+2CFF).":"Coptic Unicode块（U+2C80-U+2CFF）。","The Gurmukhi Unicode block (U+0A01-U+0A7F).":"Gurmukhi Unicode块（U+0A01-U+0A7F）。","The Saurashtra Unicode block (U+A880-U+A8DF).":"Saurashtra Unicode块（U+A880-U+A8DF）。","The Sinhala Unicode block (U+0D80-U+0DFF).":"Sinhala Unicode块（U+0D80-U+0DFF）。","The Halfwidth and Fullwidth Forms Unicode block (U+FF00-U+FFEE).":"半宽和全宽度形成Unicode块（U+FF00-U+FFEE）。","The Currency Symbols Unicode block (U+20A0-U+20CF).":"货币符号Unicode块（U+20A0-U+20CF）。","The Hangul Compatibility Jamo Unicode block (U+3131-U+318F).":"Hangul兼容性JAMO UNICODE块（U+3131-U+318F）。","The Small Form Variants Unicode block (U+FE50-U+FE6F).":"小型变体Unicode块（U+Fe50-U+Fe6f）。","The Cyrillic Unicode block (U+0400-U+04FF).":"西里尔Unicode块（U+0400-U+04FF）。","The Spacing Modifier Letters Unicode block (U+02B0-U+02FF).":"间距修饰符字母Unicode块（U+02B0-U+02FF）。","The Hangul Jamo Unicode block (U+1100-U+11FF).":"Hangul Jamo Unicode块（U+1100-U+11FF）。","The Cyrillic Extended-A Unicode block (U+2DE0-U+2DFF).":"西里尔扩展-A Unicode块（U+2DE0-U+2DFF）。","The Specials Unicode block (U+FFF0-U+FFFF).":"特种Unicode块（U+FFF0-U+FFFF）。","The Hangul Jamo Extended-A Unicode block (U+A960-U+A97F).":"Hangul Jamo扩展-A Unicode块（U+A960-U+A97F）。","The Cyrillic Extended-B Unicode block (U+A640-U+A69F).":"西里尔扩展-B Unicode块（U+A640-U+A69F）。","The Sundanese Unicode block (U+1B80-U+1BBF).":"Sundanese Unicode块（U+1B80-U+1BBF）。","The Hangul Jamo Extended-B Unicode block (U+D7B0-U+D7FF).":"Hangul Jamo扩展B Unicode块（U+D7B0-U+D7FF）。","The Cyrillic Supplement Unicode block (U+0500-U+052F).":"西里尔补充unicode块（U+0500-U+052F）。","The Hangul Syllables Unicode block (U+AC00-U+D7AF).":"吊孔音节Unicode块（U+AC00-U+D7AF）。","The Sundanese Supplement Unicode block (U+1CC0-U+1CCF).":"Sundanese补充Unicode块（U+1CC0-U+1CCF）。","The Devangari Unicode block (U+0900-U+097F).":"Devangari Unicode块（U+0900-U+097F）。","The Superscripts and Subscripts Unicode block (U+2070-U+209F).":"上标和下标Unicode块（U+2070-U+209F）。","The Hanunoo Unicode block (U+1720-U+173F).":"Hanunoo Unicode块（U+1720-U+173F）。","The Devanagari Extended Unicode block (U+A8E0-U+A8FF).":"Devanagari扩展了Unicode块（U+A8E0-U+A8FF）。","The Hebrew Unicode block (U+0590-U+05FF).":"希伯来语Unicode块（U+0590-U+05FF）。","The Supplemental Arrows-A Unicode block (U+27F0-U+27FF).":"补充箭头-A Unicode块（U+27F0-U+27FF）。","The Hiragana Unicode block (U+3040-U+309F).":"Hiragana Unicode块（U+3040-U+309F）。","The Supplemental Arrows-B Unicode block (U+2900-U+297F).":"补充箭头-B Unicode块（U+2900-U+297F）。","The Ideographic Description Characters Unicode block (U+2FF0-U+2FFF).":"意识形态描述字符Unicode块（U+2FF0-U+2FFF）。","The IPA Extensions Unicode block (U+0250-U+02AF).":"IPA扩展Unicode块（U+0250-U+02AF）。","The Javanese Unicode block (U+A980-U+A9DF).":"Javanese Unicode块（U+A980-U+A9DF）。","The Kanbun Unicode block (U+3190-U+319F).":"Kanbun Unicode块（U+3190-U+319F）。","The Kangxi Radicals Supplement Unicode block (U+2F00-U+2FDF).":"Kangxi自由基补充Unicode块（U+2F00-U+2FDF）。","The Kannada Unicode block (U+0C81-U+0CFF).":"Kannada Unicode块（U+0C81-U+0CFF）。","The Katakana Unicode block (U+30A0-U+30FF).":"Katakana Unicode块（U+30A0-U+30FF）。","The Katakana Phonetic Extensions Unicode block (U+31F0-U+31FF).":"Katakana语音扩展Unicode块（U+31F0-U+31ff）。","The Kayah Li Unicode block (U+A900-U+A92F).":"Kayah Li Unicode块（U+A900-U+A92F）。","The Khmer Unicode block (U+1780-U+17FF).":"高棉Unicode块（U+1780-U+17FF）。","The Khmer Symbols Unicode block (U+19E0-U+19FF).":"高棉符号Unicode块（u+19e0-u+19ff）。","The Lao Unicode block (U+0E80-U+0EDF).":"LAO UNICODE块（U+0E80-U+0EDF）。","The Latin-1 Supplement Unicode block (U+00A1-U+00FF).":"Latin-1补充Unicode块（U+00A1-U+00FF）。","The Latin Extended-A Unicode block (U+0100-U+017F).":"拉丁扩展-A Unicode块（U+0100-U+017F）。","The Latin Extended Additional Unicode block (U+1E00-U+1EFF).":"拉丁语扩展附加的Unicode块（U+1E00-U+1eff）。","The Latin Extended-B Unicode block (U+0180-U+024F).":"拉丁扩展-B Unicode块（U+0180-U+024F）。","The Latin Extended-C Unicode block (U+2C60-U+2C7F).":"拉丁扩展-C Unicode块（U+2C60-U+2C7F）。","The Latin Extended-D Unicode block (U+A720-U+A7FF).":"Latin Extended-D Unicode块（U+A720-U+A7FF）。","The Latin Extended-E Unicode block (U+AB30-U+AB6F).":"拉丁语扩展-E Unicode块（U+AB30-U+AB6F）。","The Lepcha Unicode block (U+1C00-U+1C4F).":"Lepcha Unicode块（U + 1C00-U + 1C4F）。","The Letterlike Symbols Unicode block (U+2100-U+214F).":"字母符号Unicode块（U+2100-U+214F）。","The Limbu Unicode block (U+1900-U+194F).":"Limbu Unicode块（U+1900-U+194F）。","The Lisu Unicode block (U+A4D0-U+A4FF).":"LISU UNICODE块（U+A4D0-U+A4FF）。","The Malayalam Unicode block (U+0D00-U+0D7F).":"Malayalam Unicode块（U+0D00-U+0D7F）。","The Mandaic Unicode block (U+0840-U+085F).":"Mandaic Unicode块（U+0840-U+085F）。","The Mathematical Operators Unicode block (U+2200-U+22FF).":"数学运算符Unicode块（U+2200-U+22FF）。","The Meetei Mayek Unicode block (U+ABC0-U+ABFF).":"Meetei Mayek Unicode块（U + ABC0-U + ABFF）。","The Meetei Mayek Extensions Unicode block (U+AAE0-U+AAFF).":"Meetei Mayek扩展Unicode块（U+AAE0-U+AAFF）。","The Miscellaneous Mathematical Symbols-A Unicode block (U+27C0-U+27EF).":"其他数学符号 - 一个Unicode块（U+27C0-U+27EF）。","The Miscellaneous Mathematical Symbols-B Unicode block (U+2980-U+29FF).":"其他数学符号-B Unicode块（U+2980-U+29ff）。","The Miscellaneous Symbols Unicode block (U+2600-U+26FF).":"其他符号Unicode块（U+2600-U+26FF）。","The Miscellaneous Symbols and Arrows Unicode block (U+2B00-U+2BFF).":"其他符号和箭头Unicode块（U+2B00-U+2BFF）。","The Miscellaneous Technical Unicode block (U+2300-U+23FF).":"其他技术Unicode块（U+2300-U+23FF）。","The Modifier Tone Letters Unicode block (U+A700-U+A71F).":"修改器音调字母Unicode块（U+A700-U+A71F）。","The Mongolian Unicode block (U+1800-U+18AF).":"蒙古Unicode块（U+1800-U+18AF）。","The Myanmar Unicode block (U+1000-U+109F).":"缅甸Unicode块（U+1000-U+109F）。","The Myanmar Extended-A Unicode block (U+AA60-U+AA7F).":"缅甸扩展-A Unicode块（U+AA60-U+AA7F）。","The Myanmar Extended-B Unicode block (U+A9E0-U+A9FF).":"缅甸扩展-B Unicode块（U+A9E0-U+A9FF）。","The New Tai Lue Unicode block (U+1980-U+19DF).":"新的Tai Lue Unicode块（U+1980-U+19df）。"," object representing the host execution context of the current thread.":"代表当前线程的主机执行上下文的对象。"," to be set.":"要设置。"," to its previous state.":"到先前的状态。","The previous context state to revert to.":"先前的上下文状态要恢复为。","A variable containing the first value to be added. The sum of the two values is stored in ":"包含要添加的第一个值的变量。 两个值的总和存储在","An object for restoring the ":"用于还原的对象","The value to be added to the integer at ":"要添加到整数的值","The new value that was stored at ":"存储在","A variable containing the first value to be combined. The result is stored in ":"一个包含要组合的第一个值的变量。 结果存储在","The value to be combined with the integer at ":"与整数合并的值"," by this operation.":"通过此操作。",", whose value is compared with the value of ":"，其价值与价值相比"," and possibly replaced by ":"并可能取代"," that replaces the destination value if the comparison results in equality.":"如果比较导致平等，则取代目标值。","The destination object that is compared by reference with ":"通过引用比较的目标对象","The object that is compared by reference to the object at ":"通过参考对象进行比较的对象","The object that replaces the destination object if the reference comparison results in equality.":"如果参考比较会导致平等，则替换目标对象的对象。"," that is compared to the value at ":"比较"," and possibly replaced. This is a reference parameter (":"并可能更换。 这是参考参数（","The destination, whose value is compared by reference with ":"目的地，其价值通过引用与","The value that replaces the destination value if the comparison by reference results in equality.":"如果通过参考的比较导致平等，则替代目标值的值。"," in C#, ":"在C＃中，","The variable whose value is to be decremented.":"值将降低的变量。","The variable to set to the specified value.":"设置为指定值的变量。","The value that is compared by reference to the value at ":"通过参考值比较的值","The 64-bit value to be loaded.":"要加载的64位值。","The variable whose value is to be incremented.":"值将要增加的变量。","The variable to set to the specified value. This is a reference parameter (":"设置为指定值的变量。 这是参考参数（","The decremented value.":"降低值。","The incremented value.":"增量值。","A reference to initialize if it has not already been initialized. If it is ":"引用初始化是否尚未初始化。 如果是","The loaded value.":"加载值。"," to initialize if it hasn't already been initialized.":"初始化是否尚未初始化。","The initialized object.":"初始化对象。","A reference to an object used as the mutually exclusive lock for initializing ":"对用作初始化的互斥锁的对象的引用",", it is considered not initialized; otherwise, it's considered initialized.":"，它被认为不是初始化的； 否则，它被认为是初始化的。","A reference or value of type ":"类型的参考或价值","A reference to a Boolean value that determines whether the target has already been initialized.":"对布尔值的引用，该值确定目标是否已经初始化。","The function that is called to initialize the reference or value.":"调用来初始化参考或值的函数。",", a new object will be instantiated.":"，将实例化一个新对象。","The function that is called to initialize the reference.":"调用来初始化参考的函数。","A reference to an object used as the mutually exclusive lock for initializing\n            ":"对用作初始化的互斥锁的对象的引用"," to set the initial state to nonsignaled.":"将初始状态设置为非信号。","The method to invoke to initialize ":"调用初始化的方法","The reference to initialize if it hasn't already been initialized.":"引用初始化是否尚未初始化。","true to set the initial state to signaled; false to set the initial state to nonsignaled.":"真实地将初始状态设置为信号； 错误以将初始状态设置为非信号。"," event object for this ":"事件对象",". The output is ":"。 输出是","The message that describes the exception. The caller of this constructor must make sure that this string has been localized for the current system culture.":"描述异常的消息。 该构造函数的呼叫者必须确保该字符串已定位为当前系统文化。","true to set the initial state signaled; false to set the initial state to nonsignaled.":"真实设置初始状态信号； 错误以将初始状态设置为非信号。","The object on which to acquire the monitor lock.":"获取监视器锁的对象。","The number of spin waits that will occur before falling back to a kernel-based wait operation.":"在回到基于内核的等待操作之前，会发生的旋转等待数量。"," if the current thread holds the lock on ":"如果当前线程将锁定锁定","The exception that caused the current exception. If the ":"导致当前异常的例外。 如果是"," if the lock is acquired; otherwise, the output is ":"如果获取锁； 否则，输出为","The object on which to wait.":"等待的对象。","true if the event is set; otherwise, false.":"如果设置了事件，则为真实； 否则，错误。",". The output is set even if an exception occurs during the attempt to acquire the lock.  \n  \n Note   If no exception occurs, the output of this method is always ":"。 即使在尝试获取锁定期间发生异常，就可以设置输出。 \n  \n  注意如果没有例外，此方法的输出始终是","The object a thread is waiting for.":"线程正在等待的对象。"," to set the initial state signaled; ":"设置初始状态信号；","The result of the attempt to acquire the lock, passed by reference. The input must be ":"尝试通过引用通过的锁定的结果。 输入必须是","The object that sends the pulse.":"发送脉冲的对象。"," if the current thread acquires the lock; otherwise, ":"如果当前线程获取锁； 否则，","The object on which to release the lock.":"释放锁的对象。","Returns the number of spin waits that will occur before falling back to a kernel-based wait operation.":"返回将归还基于内核的等待操作之前会发生的旋转等待数量。","The amount of time to wait for the lock. A value of -1 millisecond specifies an infinite wait.":"等待锁的时间。 值为-1毫秒的值指定无限等待。",". The output is set even if an exception occurs during the attempt to acquire the lock.":"。 即使在尝试获取锁定期间发生异常，就可以设置输出。","The object on which to acquire the lock.":"获取锁的对象。"," if the call returned because the caller reacquired the lock for the specified object. This method does not return if the lock is not reacquired.":"如果呼叫返回，因为呼叫者会重新列出指定对象的锁。 如果未重新锁定锁定，此方法不会返回。"," to give the calling thread initial ownership of the mutex; otherwise, ":"给出呼叫线程的初始所有权； 否则，"," if the lock was reacquired after the specified time elapsed. The method does not return until the lock is reacquired.":"如果在指定的时间经过之后重新获得锁。 该方法在重新回到锁之前不会返回。","The number of milliseconds to wait for the lock.":"等待锁的毫秒数。"," or an empty string) or if the specified named system mutex was created; ":"或一个空字符串），或者如果创建了指定的命名系统Mutex；","The number of milliseconds to wait before the thread enters the ready queue.":"等待毫秒的毫秒数，直到线进入就绪队列。"," to give the calling thread initial ownership of the named system mutex if the named system mutex is created as a result of this call; otherwise, ":"如果此调用创建了命名系统互联克，则给出命名系统Mutex的调用线程初始所有权； 否则，"," if the specified named system mutex already existed. This parameter is passed uninitialized.":"如果指定的命名系统静音已经存在。 该参数通过非初始化。"," to exit and reacquire the synchronization domain for the context (if in a synchronized context) before the wait; otherwise, ":"等待之前，要退出并重新重新征求上下文（如果在同步上下文中）的同步域； 否则，"," if the lock was reacquired before the specified time elapsed; ":"如果锁定在经过的指定时间之前重新出现；"," representing the amount of time to wait for the lock. A value of -1 millisecond specifies an infinite wait.":"表示等待锁的时间。 值为-1毫秒的值指定无限等待。","When this method returns, contains a Boolean that is ":"当此方法返回时，包含一个布尔值","The name of the synchronization object to be shared with other processes. The name is case-sensitive.":"同步对象的名称将与其他进程共享。 该名称对大小写。"," representing the amount of time to wait before the thread enters the ready queue.":"表示在线程进入就绪队列之前等待的时间。"," object that represents the named mutex if the call succeeded, or ":"如果呼叫成功或","The sequence number.":"序列号。"," if a local mutex was created (that is, if ":"如果创建了局部静音（也就是说","An object that represents the named system mutex.":"代表命名系统静音的对象。","The number of times there was contention when trying to take the monitor's lock.":"试图取出显示器锁时，有次数的次数。"," if the named mutex was opened successfully; otherwise, ":"如果命名的Mutex成功打开； 否则，"," if the current thread holds the writer lock; otherwise, ":"如果当前线程包含作者锁； 否则，"," if the writer lock has been granted to any thread since the sequence number was obtained; otherwise, ":"如果已将作者锁定为任何线程，则自从获得序列编号以来； 否则，",") to wait indefinitely.":"）无限期地等待。","The current sequence number.":"当前序列号。","The time-out in milliseconds.":"超时的毫秒。"," if the calling thread entered write mode, otherwise, ":"如果调用线程输入写模式，则否则"," specifying the time-out period.":"指定超时时间。","The number of unique threads that have entered the lock in read mode.":"在读取模式下输入锁定的唯一线程数量。"," if the calling thread entered read mode, otherwise, ":"如果调用线程输入读取模式，否则，"," value representing the released lock.":"代表发布锁的值。","One of the enumeration values that specifies the lock recursion policy.":"指定锁定递归政策的枚举值之一。"," if the current thread has entered write mode; otherwise, ":"如果当前线程已输入写模式； 否则，"," if the current thread holds a reader lock; otherwise, ":"如果当前线程固定读取器锁； 否则，","The interval to wait, or -1 milliseconds to wait indefinitely.":"等待的间隔或-1毫秒无限地等待。"," if the current thread has entered read mode; otherwise, ":"如果当前线程已输入读取模式； 否则，","The number of milliseconds to wait, or -1 (":"等待的毫秒数，或-1（","0 (zero) if the current thread has not entered read mode, 1 if the thread has entered read mode but has not entered it recursively, or n if the thread has entered the lock recursively n - 1 times.":"0（零）如果当前线程尚未输入读取模式，则1如果线程已输入读取模式，但尚未递归输入，则n如果线程已递归递归n -1次。"," if the current thread has entered upgradeable mode; otherwise, ":"如果当前线程已输入可升级模式； 否则，"," if the calling thread entered upgradeable mode, otherwise, ":"如果调用线程输入可升级模式，否则，","The maximum number of requests for the semaphore that can be granted concurrently.":"可以同时批准的信号量的最大请求数。"," method was called.":"调用方法。","0 if the current thread has not entered upgradeable mode, 1 if the thread has entered upgradeable mode but has not entered it recursively, or n if the thread has entered upgradeable mode recursively n - 1 times.":"0如果当前线程尚未输入可升级的模式，则1如果线程已输入可升级模式但尚未递归输入，或者n如果线程已递归递归升级模式n -1次。"," that can be used to wait on the semaphore.":"可以用来等待信号量。"," token to observe.":"象征观察。","The initial number of requests for the semaphore that can be satisfied concurrently.":"可以同时满足的信号量请求的初始数量。","0 if the current thread has not entered write mode, 1 if the thread has entered write mode but has not entered it recursively, or n if the thread has entered write mode recursively n - 1 times.":"0如果当前线程尚未输入写入模式，则1如果线程已输入写入模式，但尚未递归输入，则n如果线程已递归输入n -1次写入模式。"," that represents the number of milliseconds to wait, a ":"这代表了要等待的毫秒数，一个","The number of times to exit the semaphore.":"退出信号量的次数。","The maximum number of requests for the semaphore that can be satisfied concurrently.":"可以同时满足的信号量的最大请求数。","The number of remaining threads that can enter the semaphore.":"可以输入信号量的剩余线程数。","The total number of threads that are waiting to enter read mode.":"等待进入读取模式的线程总数。"," that represents -1 milliseconds to wait indefinitely, or a ":"这代表了-1毫秒无限期等待的-1毫秒或"," object that represents the named semaphore if the call succeeded, or ":"如果呼叫成功，则表示指定信号的对象，或者"," if a local semaphore was created (that is, if ":"如果创建了本地信号量（也就是说","The total number of threads that are waiting to enter upgradeable mode.":"等待进入可升级模式的线程总数。"," if the named semaphore was opened successfully; otherwise, ":"如果指定的信号量成功打开； 否则，","Whether to capture and use thread IDs for debugging purposes.":"是否捕获和使用线程ID进行调试目的。"," that represents 0 milliseconds to test the wait handle and return immediately.":"这代表0毫秒来测试等待手柄并立即返回。"," or an empty string) or if the specified named system semaphore was created; ":"或一个空字符串）或如果创建了指定的命名系统信号量；","True if the lock is acquired; otherwise, false. ":"如果获取锁定，则为真实； 否则，错误。","The previous count of the ":"以前的计数","The total number of threads that are waiting to enter write mode.":"等待进入写入模式的线程的总数。","A task that will complete when the semaphore has been entered.":"信号量输入时将完成的任务。"," if the specified named system semaphore already existed. This parameter is passed uninitialized.":"如果指定的命名系统信号量已经存在。 该参数通过非初始化。"," must be initialized to false prior to calling this method.":"必须在调用此方法之前初始化为false。","The number of milliseconds to wait, ":"等待的毫秒数，"," (-1) to wait indefinitely, or zero to test the state of the wait handle and return immediately.":"（-1）无限期等待，或零以测试等待手柄的状态并立即返回。","(-1) to wait indefinitely, or zero to test the state of the wait handle and return immediately.":"（-1）无限期等待，或零以测试等待手柄的状态并立即返回。","The initial number of requests for the semaphore that can be granted concurrently.":"可以同时批准的信号量请求的初始数量。","An object that represents the named system semaphore.":"代表命名系统信号量的对象。","A Boolean value that indicates whether a memory fence should be issued in order to immediately publish the exit operation to other threads.":"一个布尔值，指示是否应发出内存围栏，以便立即将退出操作发布到其他线程。","A task that will complete with a result of ":"将完成的任务"," if the current thread successfully entered the ":"如果当前线程成功输入","true if thread ownership tracking is enabled for this instance; otherwise false.":"如果为此实例启用了线程所有权跟踪，则为正确； 否则错误。","The count on the semaphore before the ":"信号量之前的计数","true if the lock is currently held by any thread; otherwise false.":"如果锁当前由任何线程持有，则为是真的； 否则错误。"," to wait for all handles;  ":"等待所有手柄；","Whether the next call to ":"下一个打电话给",", otherwise with a result of ":"，否则","A minimum spin count after which ":"最低旋转计数之后"," object representing the current synchronization context.":"代表当前同步上下文的对象。"," may be used. A value of -1 disables the use of ":"可能用过了。 -1的值禁用"," without it having been previously initialized.":"没有先前初始化的。"," will yield the processor, triggering a forced context switch.":"将产生处理器，触发强制上下文开关。","true if the lock is held by the current thread; otherwise false.":"如果锁定由当前螺纹持有，则为thy； 否则错误。"," to track all values set on the instance and expose them through the ":"跟踪实例设置的所有值，并通过"," if wait notification is required; otherwise, ":"如果需要等待通知； 否则，","The reference to ":"引用","The result of calling ":"呼叫的结果","A delegate to be executed over and over until it returns true.":"一遍又一遍地执行的代表直到返回真实。"," property; ":"财产;"," on the ":"在"," if the condition is satisfied within the timeout; otherwise, false.":"如果在超时内满足条件； 否则，错误。"," that was read. This reference is the latest written by any processor in the computer, regardless of the number of processors or the state of processor cache.":"那是读的。 该引用是计算机上任何处理器编写的最新撰写，无论处理器数量或处理器缓存状态如何。"," delegate to call.":"委托打电话。"," otherwise. When set to ":"否则。 设置为","true if ":"是的，如果","The field where the value is written.":"值编写的字段。"," that represents the number of milliseconds to wait, or a TimeSpan that represents -1 milliseconds to wait indefinitely.":"这代表了要等待的毫秒数，或者代表无限期等待的时间pan。"," object to be set.":"要设置的对象。"," is initialized on the current thread; otherwise false.":"在当前线程上初始化； 否则错误。","Returns an integer that represents the number of times ":"返回一个代表次数的整数"," that contains the native operating system handles.":"其中包含本地操作系统手柄。",", a value stored from a given thread will be available through ":"，从给定线程存储的值将通过","The field where the object reference is written.":"编写对象引用的字段。"," to wait for all handles; ":"等待所有手柄；"," has been called on this instance.":"在此实例上已被调用。"," even after that thread has exited.":"即使在该线程退出之后。","Returns an instance of the object that this ThreadLocal is responsible for initializing.":"返回该线程局部负责初始化的对象的实例。"," to wait for any handle.":"等待任何手柄。","The maximum amount of time the transaction can exist, before it is aborted.":"交易中流产之前可以存在的最长时间。"," interface to check for completion and wait accordingly, or call ":"接口检查完成并相应等待，或致电"," invoked to produce a lazily-initialized value when an attempt is made to retrieve ":"试图检索时，被调用以产生懒惰的定义价值","A list for all of the values stored by all of the threads that have accessed this instance.":"所有已访问此实例的线程存储的所有值的列表。"," to wait for completion.":"等待完成。","The field to read.":"要阅读的字段。"," if the asynchronous commit operation completed synchronously; otherwise, ":"如果异步提交操作同步完成； 否则，"," structure that describes the transaction options to use for the new transaction.":"描述用于新事务的事务选项的结构。","A value taken from the OLE DB enumeration ":"从OLE DB枚举中获取的值","An object, which might contain arbitrary state information, associated with the asynchronous commitment. This object is passed to the callback, and is not interpreted by ":"可能包含与异步承诺相关的任意状态信息的对象。 该对象传递给回调，并且不解释"," delegate that is invoked when the transaction completes. This parameter can be ":"交易完成后调用的委托。 此参数可以是","A transmitter/receiver propagation token that marshals a distributed transaction. For more information, see ":"发射机/接收器的传播令牌，该令牌可宣传分布式交易。 有关更多信息，请参阅",". This property always returns ":"。 此属性总是返回","This value must be zero.":"此值必须为零。",". A null reference is permitted.":"。 允许零引用。","An explanation of why a rollback is triggered.":"关于为什么触发回滚的解释。"," even if the operation completed synchronously.":"即使操作同步完成。",", in which case the application is not notified of the transaction's completion. Instead, the application must use the ":"，在这种情况下，未通知该申请的交易完成。 相反，应用程序必须使用"," interface that can be used by the caller to check the status of the asynchronous operation, or to wait for the operation to complete.":"呼叫者可以使用的接口检查异步操作的状态，或等待操作完成。","Pointer to the caller-allocated ":"指向呼叫者的指针"," that represents the dependent clone.":"这代表依赖克隆。","The recovery information of an enlistment.":"入伍的恢复信息。"," that indicates why the transaction is being aborted. This parameter can be ":"这表明了为什么交易流产。 此参数可以是"," object associated with the asynchronous commitment.":"与异步承诺相关的对象。"," structure that will receive information about the transaction. This value must not be ":"将接收有关交易的信息的结构。 这个值不得是",", indicating that no reason for the abort is provided.":"，表明没有提供流产的理由。","A unique identifier for a resource manager, which should persist across resource manager failure or reboot.":"资源管理器的唯一标识符，该标识符应该在资源管理器失败或重新启动中持续存在。","The object provided as the last parameter of the ":"对象作为对象作为最后一个参数"," object used to send a response to the transaction manager.":"用于向事务管理器发送响应的对象。","An explanation of why a rollback is initiated.":"解释了为什么要发出回滚。","This value must be ":"这个值必须是"," interface to receive two phase commit notifications.":"接收到两个阶段提交通知的接口。"," method call.":"方法调用。","An explanation of why the transaction is in doubt.":"关于交易为何有疑问的解释。"," interface used to send a response to the transaction manager.":"接口用于向事务管理器发送响应。",", an asynchronous abort is performed and the caller must use ":"，进行异步中的流产，呼叫者必须使用"," if the resource manager wants to perform additional work during the prepare phase.":"如果资源经理希望在准备阶段执行其他工作。","The type of the distributed transaction processor.":"分布式事务处理器的类型。","The isolation level of the transaction.":"交易的隔离水平。"," to learn about the outcome of the transaction.":"了解交易的结果。"," used to send a response to the transaction manager.":"用于向交易管理器发送回复。"," object that describes the enlistment.":"描述入伍的对象。"," interface to receive two-phase commit notifications.":"接收两阶段提交通知的接口。"," that is a copy of the current transaction object.":"那是当前事务对象的副本。","Volatile data can be read. Before a transaction modifies data, it verifies if another transaction has changed the data after it was initially read. If the data has been updated, an error is raised. This allows a transaction to get to the previously committed value of the data.":"挥发性数据可以读取。 在交易修改数据之前，它会验证其他事务在最初读取后是否更改了数据。 如果数据已更新，则会增加错误。 这允许交易获得数据的先前承诺值。"," that contains a message that explains why the exception occurred.":"其中包含一条消息，解释了为什么发生异常。"," and this transaction are identical; otherwise, ":"而且这笔交易是相同的； 否则，"," that controls what kind of dependent transaction to create.":"这控制要创建什么样的依赖性交易。"," interface that must be able to receive single phase commit and two phase commit notifications.":"必须能够接收单阶段提交和两个阶段提交通知的接口。","A marshaled form of the transaction object.":"交易对象的填充形式。","Gets the exception instance that causes the current exception. For more information, see the ":"获取导致当前异常的异常实例。 有关更多信息，请参阅"," returned by the ":"由"," interface implemented by the participant.":"参与者实现的接口。"," value that specifies the maximum timeout interval that is allowed when creating new transactions.":"指定创建新事务时允许的最大超时间隔的值。"," for which event status is provided.":"为哪个事件状态提供。"," and this ":"和这个"," from the specified export cookie.":"从指定的导出cookie。"," method when the transaction is promoted.":"促进交易时的方法。"," that contains the creation time of the transaction.":"其中包含交易的创建时间。","A propagation token representing a transaction.":"代表交易的传播令牌。"," instance are identical; otherwise, ":"实例是相同的； 否则，","An object that acts as a commit delegate for a non-distributed transaction internal to a resource manager.":"作为对资源管理器内部非分配交易的提交交易的对象。"," enumeration that specifies the isolation level of the transaction.":"指定交易的隔离水平的枚举。"," that contains the unique identifier of the escalated transaction.":"其中包含升级交易的唯一标识符。","A unique identifier of the transaction.":"交易的唯一标识符。","An explanation of why a rollback occurred.":"解释为什么会发生回滚。"," from the specified transmitter propagation token.":" 从指定的发射机传播令牌。"," value that specifies the timeout period for the transaction.":"指定交易的超时周期的值。"," interface implementation that describes the enlistment.":" 描述登记的接口实现。"," that contains the status of the transaction.":"其中包含交易的状态。","A transaction to be marshaled into a propagation token.":"交易被整理成传播令牌。","The identifier for the transaction used by the distributed transaction manager.":"分布式事务管理器使用的交易的标识符。","The array of bytes to decode.":"字节的数组要解码。","This method, together with the ":"这种方法，以及"," instance to be marshaled.":"实例被封为。"," ) for this serialization.":"）为此序列化。","The transaction to be set as the ambient transaction, so that transactional work done inside the scope uses this transaction.":"要设置为环境事务的事务，以便在作用域内完成的事务工作使用此事务。"," instance that represents a ":"代表一个的实例"," that describes the current transaction.":"描述了当前的交易。"," method, provide functionality for Transmitter/Receiver propagation, in which the transaction is \"pulled\" from the remote machine when the latter is called to unmarshal the transaction.  \n  \n For more information on different propagation models, see ":"方法，为发射机/接收器传播提供功能，其中当调用后者汇总交易时，从远程计算机“从远程计算机中提取”了交易。 \n  \n  有关不同传播模型的更多信息，请参见","The position in the byte to begin decoding.":"字节中开始解码的位置。"," after which the transaction scope times out and aborts the transaction.":"之后，交易范围逐渐消失并中止交易。",".  The ":"。 这"," enumeration that describes how the associated transaction interacts with COM+ transactions.":"描述关联交易如何与COM+交易相互作用的枚举。"," values that indicates the isolation level of the transaction.":"表示交易的隔离水平的值。","The Whereabouts of the distributed transaction manager that ":"分布式交易经理的下落"," instance is compatible with the unmanaged form of ITransaction used by MSDTC and with the Managed form of ":"实例与MSDTC使用的不管理形式的ITransaction兼容，并与托管形式的形式"," object that specifies the decoding scheme.":"指定解码方案的对象。"," enumeration that describes whether the ambient transaction associated with the transaction scope will flow across thread continuations when using Task or async/await .NET async programming patterns.":"描述与交易范围相关的环境交易是否会在使用任务或异步/等待.NET异步编程模式时跨线程连续的枚举。"," that uniquely identifies the resource to be recovered from.":"这独特地标识了要从中恢复的资源。","A guid that uniquely identifies the format of the ":"唯一标识格式的guid "," used by ":"使用"," that specifies the decoding scheme.":"这指定了解码方案。"," that uniquely identifies the resource manager.":"这独特地标识了资源管理器。"," enumeration that describes the transaction requirements associated with this transaction scope.":"描述与此交易范围相关的交易要求的枚举。"," returned by the Promote method when the transaction is promoted.":"促进交易时，通过促销方法返回。","A decoded array of bytes.":"一个解码的字节。"," object to be marshaled.":"对象被封为。","Contains additional information of recovery information.":"包含恢复信息的其他信息。"," structure that describes the transaction options to use if a new transaction is created. If an existing transaction is used, the timeout value in this parameter applies to the transaction scope. If that time expires before the scope is disposed, the transaction is aborted.":"如果创建新事务，则描述要使用的事务选项的结构。 如果使用了现有的事务，则此参数中的超时值适用于事务范围。 如果该时间在处理范围之前到期，则交易将中止。","The position in the byte array at which to begin decoding.":"在字节数组中开始解码的位置。","An address that describes the location of the destination transaction manager. This permits two transaction managers to communicate with one another and thereby propagate a transaction from one system to the other.":"描述目标交易管理器的位置的地址。 这允许两个交易经理相互通信，从而传播从一个系统到另一个系统的交易。"," that contains additional information about the transaction.":"其中包含有关交易的其他信息。","A resource object that implements ":"实施的资源对象","An export transaction cookie representing the specified ":"代表指定的出口交易cookie"," object that describes a failed serialization.":"描述失败序列化的对象。"," that contains the transaction from which transaction information can be retrieved.":" 它包含可以从中检索事务信息的事务。"," to receive notifications.":"接收通知。","The array of bytes to encode.":"要编码的字节数组。"," that describes the enlistment.":"这描述了入伍。"," object that describes a failed serialization context.":"描述失败序列化上下文的对象。"," instance that represents the given ":"代表给定的实例","A string to encode.":"一个用于编码的字符串。","The position in the byte array at which to begin encoding.":"在要开始编码的字节阵列中的位置。","The number of characters in the string.":"字符串中的字符数。","The relative URI.":"相对URI。"," value that specifies the timeout interval for new transactions.":"指定新事务的超时间隔的值。","A value that indicates whether double quotation marks will be included around the encoded string.":"一个值指示在编码字符串周围是否包含双引号标记的值。","The atomized string or the existing string if one already exists in the ":"如果已经存在于","The number of bytes to encode.":"要编码的字节数。","An application resource stream.":"应用程序资源流。","The query string to parse.":"查询字符串解析。"," that contains a custom transaction factory.":" 它包含一个自定义事务工厂。","The text to encode.":"要编码的文本。"," is zero, String.Empty is returned.":"是零，字符串。"," for the current position.":"对于当前位置。","The URI of the data that is being added to the ":"正在添加到的数据的URI"," of query parameters and values.":"查询参数和值。","The atomized string or the existing string if it already exists in the ":"如果原子字符串或现有字符串已经存在于"," can be provided; otherwise, ":"可以提供； 否则，"," object that specifies the encoding scheme.":"指定编码方案的对象。","The base URI used to resolve the relative URI.":"基础URI用于解析相对URI。","A byte array with the data that corresponds to the provided URI.":"一个字节阵列，带有与提供的URI相对应的数据。","An encoded array of bytes.":"一个编码字节的数组。","The current line number or 0 if no line information is available (for example, ":"当前行号或0如果没有可用信息（例如，","The character array containing the name to find.":"字符阵列包含要查找的名称。","The URI to resolve. The URI can be absolute or relative. If absolute, this value effectively replaces the ":"URI解决。 URI可以是绝对的或相对的。 如果绝对，此值有效地取代了","The offset in the provided byte array where the data starts.":"数据启动的提供的字节数组中的偏移。"," that specifies the encoding scheme.":"这指定了编码方案。","The zero-based index into the array specifying the first character of the name.":"基于零的索引到数组中指定名称的第一个字符。","The current line position or 0 if no line information is available (for example, ":"当前的行位置或0如果没有线路信息（例如，"," value. If relative, it combines with the ":"价值。 如果相对，它与","A Unicode string in %":"％的Unicode字符串","The number of characters in the name.":"名称中的字符数。","The number of bytes to read from the byte array, starting at the provided offset.":"从提供的偏移开始，从字节数组读取的字节数。"," to make an absolute URI.":"做一个绝对的URI。"," value that specifies the type of namespace nodes to return.":"指定要返回的名称空间节点的类型的值。"," notation.":"符号。","The atomized string or ":"原子串或"," with the data that corresponds to the provided URI.":"使用与提供的URI相对应的数据。","The encoded text.":"编码文本。"," that contains the current in-scope namespaces.":"其中包含当前的范围内命名空间。"," representing the absolute URI or ":"代表绝对URI或","The URI returned from ":"URI从"," if the string has not already been atomized. If ":"如果字符串尚未被雾化。 如果","The text description.":"文本说明。"," if the relative URI cannot be resolved.":"如果相对URI无法解决。","The prefix whose namespace URI you wish to find.":"您希望找到其名称空间URI的前缀。","The current version of the .NET Framework for Silverlight does not use this parameter when resolving URIs. This parameter is provided for future extensibility purposes. For example, this parameter can be mapped to the xlink:role and used as an implementation-specific argument in other scenarios.":"Silverlight的.NET框架的当前版本在解析URI时不会使用此参数。 为将来的可扩展性提供了此参数。 例如，可以将此参数映射到Xlink：角色，并用作其他场景中的实现特定参数。","The name to find.":"要找到的名字。","The absolute URI to check.":"检查的绝对URI。","The type of object to return. The ":"要返回的对象的类型。 这"," value representing the severity of the validation event.":"代表验证事件严重性的值。","The namespace URI that is mapped to the prefix; ":"映射到前缀的名称空间URI；","The atomized string object or ":"雾化的字符串对象或"," supports ":"支持","The source of the event.  \n  \n Note Determine the type of a sender before using it in your code. You cannot assume that the sender is an instance of a particular type. The sender is also not guaranteed to not  be null. Always surround your casts with failure handling logic.":"事件的来源。 \n  \n  注意在代码中使用发件人之前，请确定发件人的类型。 您不能假设发件人是特定类型的实例。 发件人也不能保证不为空。 始终用失败处理逻辑包围演员。"," if the string has not already been atomized.":"如果字符串尚未被雾化。","The credentials that are used to authenticate the underlying web request.":"用于对基础web请求进行身份验证的凭据。"," if the prefix is not mapped to a namespace URI.":"如果前缀未映射到命名空间URI。"," objects and ":"对象和"," object copy of this ":"对象副本","The well-known DTDs that should be prepopulated into the cache.":"应预填充到缓存中的众所周知的Dtd。","The namespace URI whose prefix you wish to find.":"您希望查找其前缀的命名空间URI。","The collection of preloaded URIs.":"预装uris的集合。"," objects for URIs that were added as ":" 添加为Uri的对象 ","A copy of this ":"此副本",", or your own resolver.":"，或者你自己的解析器。","The prefix that is mapped to the namespace URI; ":"映射到名称空间URI的前缀；"," if this validated XML node was set as the result of a default being applied during schema validation; otherwise, ":"如果该验证的XML节点是由于在架构验证期间应用默认值而设置的； 否则，",". If the requested type is not supported by the resolver, an exception will be thrown. Use the ":". 如果解析器不支持请求的类型，则会引发异常。 使用 "," value of the validated XML element or attribute.":"验证的XML元素或属性的值。","The well-known DTDs that should be prepopulated into cache.":"应将其预先置入缓存的众所周知的DTD。"," if the namespace URI is not mapped to a prefix.":"如果名称空间URI未映射到前缀。"," if the value for this validated XML node is nil; otherwise, ":"如果该验证的XML节点的值为零； 否则，"," generic interface to use when you compare URIs.":"比较URI时要使用的通用接口。"," method to determine whether a certain ":"确定是否某个的方法","The type to return the validated XML element or attribute's value as.":"返回已验证的XML元素或属性值的类型。","The character array containing the string to add.":"字符数组包含要添加的字符串。"," object that represents the dynamic schema type for this validated XML node.":"代表此验证的XML节点的动态架构类型的对象。","The validation event handler that receives information about XML Schema validation errors.":"接收有关XML模式验证错误的信息的验证事件处理程序。"," is supported by this resolver.":"由该解析器支持。","The zero-based index into the array specifying the first character of the string.":"基于零的索引到数组中指定字符串的第一个字符。"," object used to resolve namespace prefixes.":" 用于解析命名空间前缀的对象。"," that corresponds to this validated XML node.":"与此验证的XML节点相对应。"," object that corresponds to the actual source.":"对应于实际源的对象。","The validation event handler that receives information about the XML Schema validation errors.":"接收有关XML模式验证错误的信息的验证事件处理程序。","The value of the validated XML element or attribute as the type requested.":"作为请求的类型，已验证的XML元素或属性的值。"," of the included and imported schemas.":"包括和进口的模式。","The URI of the data that should be removed from the ":"应从"," used to resolve namespaces referenced in ":"用于解析引用的名称空间"," if the validated XML element or attribute is an XPath node; ":"如果已验证的XML元素或属性是XPath节点；"," of this validated XML node.":"该验证的XML节点的。"," if schema has been compiled, otherwise, ":"如果汇编了架构，否则，","The supplied data stream.":"提供的数据流。"," value of this validated XML node.":"该验证的XML节点的值。"," attribute is specified, the default is ":"指定属性，默认为"," if the validated XML element or attribute is an atomic value.":" 如果验证的XML元素或属性是原子值。","The validation event handler that receives information about XML Schema syntax errors.":"接收有关XML模式语法错误的信息的验证事件处理程序。"," of schema elements in the schema.":" 模式中的模式元素。","Namespaces for attributes that are available for use. The default is ":"可用于使用的属性的名称空间。 默认值为"," associated with the validation event.":" 与验证事件相关联。","The current validated XML element or attribute as a boxed object of the most appropriate .NET type.":"当前验证的XML元素或属性是最合适的.NET类型的盒装对象。"," object representing the XML Schema.":"代表XML模式的对象。"," collection of all notations in the schema.":"集合中所有符号的集合。"," objects that represents the ":"代表的对象","The collection of attributes for the attribute group.":"属性组的属性集合。"," containing the XML Schema to read.":"包含XML模式以读取。"," of all schema types in the schema.":"模式中的所有模式类型。"," child nodes.":"儿童节点。","The validated XML element or attribute's value as a ":"已验证的XML元素或属性的值","The name of the attribute group.":"属性组的名称。","The validation event handler that receives information about the XML Schema syntax errors.":"接收有关XML模式语法错误的信息的验证事件处理程序。","The validated XML element or attribute's value as an ":"已验证的XML元素或属性的值","The schema target namespace.":"模式目标名称空间。","A Uniform Resource Identifier (URI) reference. The default is ":"统一资源标识符（URI）参考。 默认值为","The qualified name of the attribute group.":"属性组的合格名称。","The .NET type of the validated XML element or attribute. The default value is ":"已验证的XML元素或属性的.NET类型。 默认值是","An array of qualified ":"一系列合格"," value that indicates if attributes from the target namespace are required to be qualified with the namespace prefix. The default is ":"指示是否需要从目标名称空间中的属性符合名称空间前缀的属性。 默认值为","The common runtime library (CLR) object that holds the post-compilation value of the ":"具有保存库后值的普通运行时库（CLR）对象","The redefined attribute group property.":"重新定义属性组属性。"," for the validated XML element or attribute.":"对于已验证的XML元素或属性。","The default value for the attribute. The default is a null reference. Optional.":"属性的默认值。 默认值是null引用。 可选的。"," objects that do not belong to the schema target namespace.":"不属于模式目标名称空间的对象。"," collection of all the global attribute groups in the schema.":"架构中所有全局属性组的集合。","The name of the referenced attribute group. The value must be a QName.":"引用属性组的名称。 该值必须是qname。"," you want to add to this collection.":"您想添加到此集合中。","The collection of elements contained within ":"其中包含的元素集合"," collection of all the attributes in the schema.":"架构中所有属性的集合。","The version of the schema. The default value is ":"模式的版本。 默认值是","The fixed value for the attribute. The default is null. Optional.":"属性的固定值。 默认值为null。 可选择的。","The namespace URI associated with the schema. For XML Schemas, this will typically be the target namespace.":"与模式相关联的名称空间URI。 对于XML模式，这通常是目标名称空间。"," values. The default is the value of the ":"值。 默认值是","The namespace URI associated with the schema. For XML Schemas, this will typically be the ":"与模式相关联的名称空间URI。 对于XML模式，这通常是"," value representing the different methods for preventing derivation. The default value is ":"代表预防推导的不同方法的值。 默认值是","The collection of elements contained in ":"包含在"," of the schema element containing the attribute. Optional.":"包含属性的架构元素。 可选的。"," if a schema with the specified namespace is in the collection; otherwise, ":"如果包含指定名称空间的模式在集合中； 否则，"," value that indicates if elements from the target namespace are required to be qualified with the namespace prefix. The default is ":"指示是否需要使用名称空间前缀的目标命名空间元素的值。 默认值为","The URL that specifies the schema to load.":"指定加载模式的URL。","The post-compilation value of the ":"兼容后值","The string id. The default is ":"字符串ID。 默认值为"," collection of all the elements in the schema.":"架构中所有元素的收集。"," if there is a schema in the collection with the same ":"如果集合中有相同的架构",". Optional.":"。 可选的。","The name of the attribute declared.":"属性的名称已声明。"," added to the schema collection; ":"添加到模式集合中；","The simple type defined in this schema.":"此模式中定义的简单类型。"," collection of all the groups in the schema.":"集合中的所有组中的集合。","The array to copy the objects to.":"将对象复制到的数组。"," if the schema being added is an XDR schema or if there are compilation errors in the schema.":"如果添加的模式是XDR模式，或者架构中存在编译错误。"," objects that do not belong to the schema's target namespace.":"不属于模式目标名称空间的对象。","The ID of the string. The default value is ":"字符串的ID。 默认值是"," containing the schema to add.":"包含用于添加的模式。"," where copying will begin.":" 复制将开始的地方。","The name of the simple type.":"简单类型的名称。"," should check for Unique Particle Attribution (UPA) violations; otherwise, ":"应检查独特的粒子归因（UPA）违规； 否则，"," child elements.":"儿童元素。","One of either the ":"任一"," elements or ":"元素或","Namespaces for elements that are available for use. The default is ":"可用于使用的元素的名称空间。 默认值为","One of the following values: None, Prohibited, Optional, or Required. The default is Optional. Optional.":"以下值之一：无，禁止，可选或必需。 默认值是可选的。 可选的。","An enumerator for iterating over all schemas in the current collection.":"用于对当前集合中所有模式进行迭代的枚举。"," attribute (XDR schemas). If this is ":"属性（XDR模式）。 如果是"," classes.":"课程。","The number of namespaces defined in this collection.":"此集合中定义的名称空间数量。","The World Wide Web Consortium (W3C) ":"万维网联盟（W3C）"," values. If no ":"值。 如果不",", external references are not resolved.":"，外部参考未解决。","If this property is ":"如果此属性是"," to use for atomization while parsing the ":"解析雾化","The namespace URI associated with the schema you want to return. This will typically be the ":"与您要返回的模式相关联的名称空间URI。 这通常是","SerializationInfo.":"序列化Info。"," elements. If this is ":"元素。 如果是","StreamingContext.":"StreamingContext。"," object represents the xs:NCName type.":"对象表示XS：NCNAME类型。"," of the schema.":"模式。",", character data is allowed to appear between the child elements of the complex type (mixed content model). The default is ":"，允许角色数据出现在复杂类型的子元素之间（混合内容模型）。 默认值为"," added to the schema collection.":"添加到模式集合中。"," associated with the namespace URI; ":"与名称空间URI相关；"," description of the error condition.":"误差条件的描述。"," object to use while parsing the ":"解析时要使用的对象"," component of the complex content model.":"复杂内容模型的组成部分。"," object that caused this exception.":"引起此例外的对象。","The name of the notation.":"符号的名称。"," if there is no loaded schema associated with the given namespace or if the namespace is associated with an XDR schema.":"如果没有与给定名称空间关联的加载模式，或者该名称空间与XDR架构关联。","The line number of the XML that caused this exception.":"引起此异常的XML的线号。","The collection of attributes for the complex content.":"复杂内容的属性集合。"," object represents the xs:QName type.":"对象表示XS：QNAME类型。"," identifier. The value must be a valid Uniform Resource Identifier (URI).":"标识符。 该值必须是有效的统一资源标识符（URI）。","The name of the complex type from which this type is derived by extension.":"通过扩展得出此类型的复杂类型的名称。","The count of the items in the collection.":"集合中的项目计数。","The line position of the XML that caused this exception.":"引起此例外的XML线位置。"," that can be cast safely to the type returned by the ":"可以安全地施放于"," identifier. The value must be a valid URI.":"标识符。 该值必须是有效的URI。"," object that can be used to synchronize access to the collection.":"可用于同步访问集合的对象。","The collection of attributes for the complex type.":"复杂类型的属性集合。","The line number indicating where the error occurred.":"线号指示错误发生的位置。"," if the move was successful; ":"如果举动成功；"," value for the ":"值的价值","The line number.":"线号。","The name of the complex type from which this type is derived by restriction.":"通过限制得出此类型的复杂类型的名称。","The line position indicating where the error occurred.":"线位置指示错误发生的位置。"," component of the complex type.":"复杂类型的组成部分。","The current node.":"当前节点。","The line position.":"线位置。"," value for the simple type.":"简单类型的值。","Contains ":"包含","The description of the error condition of this exception.":"该异常的误差条件的描述。","The elements contained within the redefine element.":"重新定义元素中包含的元素。"," property for the schema object.":"模式对象的属性。","The Common Language Runtime (CLR) type of the item.":"项的公共语言运行时(CLR)类型。"," for all schema types in the schema. The post-compilation value of the ":"对于模式中的所有模式类型。 兼容后值","The collection of all the attributes from this complex type and its base types. The post-compilation value of the ":"该复杂类型及其基本类型的所有属性的集合。 兼容后值","A valid object instance represents a structural validation error in the XML Schema Object Model (SOM).":"有效的对象实例表示XML模式对象模型（SOM）中的结构验证错误。"," attribute. Optional.":"属性。 可选的。","The source location (URI) for the file.":"文件的源位置（URI）。","The URI location of the schema that caused the exception.":"导致例外的模式的URI位置。","The elements contained within the compositor.":"合成器中包含的元素。","The array that represents the documentation child nodes.":"代表文档子节点的数组。"," attribute prevents a complex type from being used in the specified type of derivation. The default is ":" attribute防止在指定类型的派生中使用复杂类型。 默认值为 ","The index at which the item has been added.":"添加了该项目的索引。"," for the referenced schema.":"对于引用的模式。"," object to use.":"要使用的对象。","A URI reference. The default is ":"URI参考。 默认值为","The post-schema-validated infoset value. The default is ":"扫描后验证的输液值。 默认值为"," if the specified qualified name is in the collection; otherwise, returns ":"如果指定的合格名称在集合中； 否则，返回","The URI location for the schema. Optional for imported schemas.":"图架的URI位置。 进口模式的可选。","The attribute used to block a type derivation. Default value is ":"用于阻止类型推导的属性。 默认值是"," value on the ":"价值","The schema ":"模式",". If null is supplied, ":"。 如果提供无效，"," property. The default is the ":"财产。 默认值是","The content model type that is one of the ":"内容模型类型是"," specified in the schema.":"在模式中指定。","Qualified attributes that belong to another target namespace.":"属于另一个目标名称空间的合格属性。","The collection of constraints.":"约束的集合。"," is returned because there is no qualified name with a null name.":"由于没有合格的名称，因此返回。"," object if the schema is valid. If the schema is not valid and a ":" 对象，如果架构是有效的。 如果模式无效，并且 ","The default value for the element. The default is a null reference. Optional.":"元素的默认值。 默认值是null引用。 可选的。","The post-compilation value of the content model for the complex type.":"复杂类型的内容模型的兼容后值。",", value is fixed; otherwise, ":"，值是固定的； 否则，","The iterator returns ":"迭代器返回","The value attribute.":"值属性。","The common language runtime object. The post-compilation value of the ":"通用语言运行时对象。 兼容后值"," is specified, then ":"指定，然后","The particle for the content type. The post-compilation value of the ":"内容类型的粒子。 兼容后值"," property. The default is ":"财产。 默认值为"," whose index you want to return.":"您想返回谁的索引。"," is returned and the appropriate validation event is raised. Otherwise, an ":"返回并提出适当的验证事件。 否则，一个","The name of the schema group.":"模式组的名称。"," particle.":" 粒子。"," property. Default value is the ":"财产。 默认值是","The index corresponding to the specified ":"与指定的索引相对应 "," object representing the qualified name of the schema group.":"代表模式组合格名称的对象。",", an element cannot use this ":"，一个元素不能使用此"," if a schema with the specified target namespace URI is in the ":"如果具有指定目标名称空间URI的模式在","The zero-based index at which an item should be inserted.":"应插入项目的基于零的索引。","The fixed value that is predetermined and unchangeable. The default is a null reference. Optional.":"固定值是预先确定且无法改变的。 默认值是null引用。 可选的。"," property, which is one of the ":"财产，这是"," object is in the ":"对象在"," element directly and must use a complex type that is derived from this ":"元素直接，必须使用从此派生的复杂类型","The item.":"项目。"," element. The default is ":"元素。 默认值为","The form for the element. The default is the ":"元素的形式。 默认值是","The name of a group defined in this schema.":"该模式中定义的组名称。","The index in the array where copying will begin.":"阵列中的索引将开始复制。"," value. Optional.":"价值。 可选的。","The old value.":"旧价值。",", if character data can appear between child elements of this complex type; otherwise, ":"，如果角色数据可以在这种复杂类型的子元素之间出现； 否则，","The collection of fields.":"田野的集合。"," object to remove from the ":"从中删除的对象",", the element cannot appear in the instance document. The default is ":"，该元素不能显示在实例文档中。 默认值为","The compositor type.":"合成器类型。"," at the end of the collection.":"在收藏结束时。","The name of the identity constraint.":"身份约束的名称。"," object removed from the ":"从","If nillable is ":"如果是可笑的","Provides the content of the type.":"提供类型的内容。"," if the schema was not found in the ":"如果未在","The XPath expression ":"XPath表达式"," if the qualified name specified exists in the collection; otherwise, ":"如果合格名称在集合中存在； 否则，","The input value to convert to the specified type.":"转换为指定类型的输入值。",", this enables an instance of the element to have the ":"，这使该元素的实例具有"," object and all its imports were successfully removed; otherwise, ":"对象及其所有进口已成功删除； 否则，","The annotation.":"注释。"," that can iterate through ":"可以迭代","The target type to convert the input value to.":"将输入值转换为的目标类型。"," attribute set to ":"属性设置为","The schema to reprocess.":"重新处理的模式。"," of the element to return.":"要返回的元素。","The target namespace for the imported schema as a URI reference. Optional.":"导入架构作为URI参考的目标名称空间。 可选的。","The converted input value.":"转换的输入值。"," attribute is defined as part of the XML Schema namespace for instances. The default is ":"属性定义为实例XML模式名称空间的一部分。 默认值为"," object containing the XML document to infer a schema from.":"包含XML文档以推断架构的对象。"," of the element in the ":"元素"," object if the schema is a valid schema. If the schema is not valid and a ":"对象如果架构是有效的架构。 如果架构无效，并且"," used for resolving namespace prefixes. This is only of use if the ":"用于解决名称空间前缀。 只有当","The name of the element. The default is ":"元素的名称。 默认值为 "," specified by qualified name.":"由合格名称指定。"," object containing the inferred schemas.":" 包含推断模式的对象。"," represents the xs:QName type or a type derived from it.":"表示XS：QNAME类型或从其派生的类型。"," is specified, ":" 被指定, ","The qualified name of the element. The post-compilation value of the ":"元素的合格名称。 兼容后值"," to validate against the simple type.":"验证简单类型。","A collection of all the named elements in the ":"在"," object containing all the schemas that have been added to the ":"包含已添加到的所有模式的对象","The reference name of the element.":"元素的参考名称。"," object containing an existing schema used to refine the inferred schema.":"包含用于完善推断模式的现有模式的对象。"," used to resolve namespaces or locations referenced in include and import elements of a schema.":"用于解析模式的包括和导入元素中引用的名称空间或位置。"," object containing the original exception that caused the ":"包含导致原始异常的对象","The type of the element.":"元素的类型。","A collection of all the values for all the elements in the ":"所有元素的所有值的集合 ",". If no schemas have been added to the ":". 如果没有模式被添加到 ","The content contained within the ":"内容中包含的内容","The line number in the XML document that caused the ":"XML文档中的行号，导致","The name of the built-in data type.":"内置数据类型的名称。","The maximum number of times the particle can occur. The default is 1.":"粒子可能发生的最大次数。 默认值为1。","The line position in the XML document that caused the ":"XML文档中的线位置导致","The collection of attributes for the ":"属性的集合","The qualified name of an element that is being substituted by this element. Optional.":"该元素代替的元素的合格名称。 可选的。",", an empty ":"，一个空 ","The number as a string value. ":"该数字为字符串值。","The QName of the key that this constraint refers to.":"此约束所指的密钥的QNAME。","The base type name.":"基本类型名称。","One of the valid ":"有效之一"," that belong to the given namespace. If no schemas have been added to the ":"属于给定的名称空间。 如果未添加模式"," indicates that ":"表示这"," attribute value of the ":"属性值"," object whose properties are set on successful validation of the text content of the element. This parameter can be ":"其属性的对象设置为成功验证元素的文本内容。 此参数可以是"," for the attribute value. Optional.":"对于属性值。 可选的。",". The default is an ":"。 默认值是"," is equal to the default value. The default is a null reference.":"等于默认值。 默认值是null引用。","The collection of attributes for a simple type.":"简单类型的属性集合。"," if the type has a mixed content model; otherwise, ":"如果类型具有混合内容模型； 否则，","The typed text content of the element.":"元素的键入文本内容。","The minimum number of times the particle can occur. The default is 1.":"粒子可能发生的最小次数。 默认值为1。"," instance with the ":"带有的实例","The simple type base value.":"简单类型的基本值。"," for all attributes in the schema. The post-compilation value of the ":"对于模式中的所有属性。 兼容后值","The parsed, typed simple content of the element.":"解析的，键入元素的简单内容。"," for the type built from the ":"对于从","The name of the base type.":"基本类型的名称。"," attribute of this type.":"这种类型的属性。","The number of logical schemas in the ":"在"," for all groups in the schema. The post-compilation value of the ":"对于模式中的所有组。 兼容后值"," object whose properties are set on successful verification that all the required attributes in the element context are present. This parameter can be ":"在成功验证中设置属性的对象，即存在元素上下文中所有必需的属性。 此参数可以是","One of the following facet classes:  \n  \n ":"以下方面类别之一：","The source object.":"源对象。","The collection of global attributes.":"全局属性的集合。"," generates the ":"生成","A text ":"文字","One of ":"之一"," attribute; otherwise, ":"属性; 否则，","The XML node that caused this ":"引起此的XML节点"," to validate in the current element context.":"在当前元素上下文中验证。","The collection of global elements.":"全球元素的集合。"," representing the type of the ":"代表"," object containing element and attribute names as atomized strings.":"包含元素和属性名称作为原子字符串的对象。"," used to pass the text value as a Common Language Runtime (CLR) type compatible with the XML Schema Definition Language (XSD) type of the attribute.":"用于将文本值作为通用语言运行时（CLR）类型传递，与XML模式定义语言（XSD）类型兼容属性。","The namespace of the XML element.":"XML元素的命名空间。","The collection of global simple and complex types.":"全球简单和复杂类型的集合。"," object containing the XML Schema Definition Language (XSD) schemas used for validation.":"包含用于验证的XML模式定义语言（XSD）架构的对象。","The item type for the simple type element.":"简单类型元素的项目类型。","A white space ":"一个空白"," of the member.":"成员。"," object used for resolving namespaces encountered during validation.":"用于解决验证过程中遇到的名称空间的对象。"," if the schemas in the ":"如果是","The type name of the simple type list.":"简单类型列表的类型名称。"," used to pass the white space value as a Common Language Runtime (CLR) type compatible with the XML Schema Definition Language (XSD) type of the attribute.":"用于将白空间值作为通用语言运行时（CLR）类型传递，与属性的XML模式定义语言（XSD）兼容。"," value specifying schema validation options.":"值指定模式验证选项。","The base type for the ":"的基本类型"," have been compiled since the last time a schema was added or removed from the ":"自上次添加架构或从","The overriding name of the enumeration member.":"枚举成员的压倒性名称。"," object representing the source URI for the XML node being validated; the default is ":"代表正在验证的XML节点的源URI的对象； 默认值为","The qualified name of the simple type restriction base type.":"简单类型限制基础类型的合格名称。"," object to add to the set of schemas used for validation.":"对象添加到用于验证的模式集中。","A table of atomized string objects.":"雾化字符串对象的表。","The value generated in an XML-document instance when the ":"当"," to replace.":"取代。","; the default is this ":"; 默认是此"," objects or an empty array if there are no expected attributes.":"如果没有预期属性，则对象或空数组。"," objects representing the type of the ":"代表类型的对象"," serializes the enumeration, or the value recognized when it is deserializes the enumeration member.":"序列化枚举或当枚举成员应确认的价值。","The collection of simple type base values.":"简单类型基本值的集合。"," object; the default is an ":"目的; 默认值是"," replaced.":"更换。"," objects or an empty array if there are no expected particles.":"如果没有预期的粒子，则对象或空数组。","The name of the XML root element.":"XML根元素的名称。","The string attribute value for the XPath expression.":"XPath表达式的字符串属性值。"," to populate with ":"填充"," to which you want to save.":"您要保存的。","An array that consists of a list of members of built-in data types or simple types.":"由内置数据类型或简单类型的成员列表组成的数组。","The name of the XML root element that is generated and recognized in an XML-document instance. The default is the name of the serialized class.":"在XML-Document实例中生成和识别的XML根元素的名称。 默认值是序列化类的名称。"," objects for any attributes not yet encountered during validation in the element context.":"在元素上下文中验证期间尚未遇到的任何属性的对象。"," values representing the complex type.":"代表复杂类型的值。","The location from which the node was loaded or String.Empty if the node has no base URI. Attribute nodes have the same base URI as their owner element. If an attribute node does not have an owner element, ":"节点已加载或字符串的位置。 属性节点与其所有者元素具有相同的基本URI。 如果属性节点没有所有者元素，","An object containing the attribute, text, or white space value. The object is a CLR type that corresponds to the XSD type of the attribute, text, or white space value.":"包含属性，文本或白空间值的对象。 该对象是与属性，文本或白色空间值的XSD类型相对应的CLR类型。","The namespace for the XML element.":"XML元素的名称空间。"," that represents the built-in complex type.":"这代表内置的复杂类型。"," stream from which the object is deserialized.":"该对象应得出的流。"," object used to initialize the validation context of the ":"用于初始化验证上下文的对象"," returns String.Empty.":"返回字符串。","The name of the static method that must be implemented.":"必须实现的静态方法的名称。"," object for partial validation.":"部分验证的对象。","The concatenated values of the node and all its children. For attribute nodes, this property has the same functionality as the ":"节点及其所有子女的串联值。 对于属性节点，此属性具有与"," of the complex type.":"复杂类型。","The name of the XML element that the ":"XML元素的名称",", if the class is a wildcard, or if the schema contains only the ":"，如果课程是通配符，或者模式仅包含"," object whose properties are set if the current element content is successfully skipped. This parameter can be ":"如果当前元素内容成功跳过，则设置其属性的对象。 此参数可以是","The name of the attribute node with the prefix removed. In the following example <book bk:genre= 'novel'>, the ":"删除了带有前缀的属性节点的名称。 在以下示例中"," values representing the simple type.":"代表简单类型的值。"," generates.":"生成。"," element; otherwise, ":"元素; 否则，"," of the attribute is ":"属性的是","The local name of the attribute to validate.":"要验证的属性的本地名称。"," that represents the built-in simple type.":"这代表内置的简单类型。","The name of the method that is invoked by the XML infrastructure to return an XML schema.":"XML基础结构调用的方法的名称返回XML模式。","The XML namespace of the XML element.":"XML元素的XML名称空间。"," of the simple type.":"简单类型。","The namespace URI of the attribute to validate.":"要验证的属性的名称空间URI。","The qualified name of the attribute node.":"属性节点的合格名称。","The name of the XML element.":"XML元素的名称。"," containing the namespace and prefix pairs.":"包含名称空间和前缀对。","The derived ":"派生","An XML namespace.":"XML名称空间。","The value of the attribute to validate.":"要验证的属性值。","The namespace URI of this node. If the attribute is not explicitly given a namespace, this property returns String.Empty.":"该节点的名称空间URI。 如果未明确给出命名空间，则此属性将返回string.empty。","The prefix associated with an XML namespace.":"与XML名称空间关联的前缀。","The order of the code generation.":"代码生成的顺序。","The node type for ":"节点类型"," to test the derived ":"测试派生"," object whose properties are set on successful validation of the attribute. This parameter can be ":"其属性设置为成功验证属性的对象。 此参数可以是"," objects that are used as qualified names in an XML document.":"在XML文档中用作合格名称的对象。"," against.":"反对。","The validated attribute's value.":"已验证的属性值。","The name of the XML attribute that the ":"XML属性的名称"," nodes is XmlNodeType.Attribute.":"节点是xmlnodetype.attribute。","The number of prefix and namespace pairs in the collection.":"集合中的前缀和名称空间对的数量。"," values representing a type derivation method to exclude from testing.":"代表用于排除测试的类型推导方法的值。"," used to pass the attribute's value as a Common Language Runtime (CLR) type compatible with the XML Schema Definition Language (XSD) type of the attribute.":"用于将属性的值作为通用语言运行时（CLR）类型传递，与属性的XML模式定义语言（XSD）类型兼容。"," of the member to be serialized.":"要序列化的成员。","An XML document to which this node belongs.":"该节点所属的XML文档。"," if the derived type is derived from the base type; otherwise, ":"如果派生类型是从基本类型派生的； 否则，","The name of the XML attribute that is generated.":"生成的XML属性的名称。"," object whose properties are set on successful validation of the attribute. This parameter and can be ":"其属性设置为成功验证属性的对象。 这个参数可以是","An XML Schema (XSD) data type.":"XML模式（XSD）数据类型。"," that the attribute belongs to or ":"该属性属于或","The built-in XSD data type, simpleType element, or complexType element.":"内置的XSD数据类型，SimpleType元素或复杂型元素。","The local name of the element to validate.":"要验证的元素的本地名称。","The namespace uniform resource identifier (URI).":"名称空间统一资源标识符（URI）。"," used to store the attribute.":"用于存储属性。"," if this attribute is not part of an ":"如果此属性不是","The namespace URI of the element to validate.":"要验证的元素的名称空间URI。","The parent XML document.":"父XML文档。"," object representing the base type of this schema type.":"代表此模式类型的基本类型的对象。","The name of the XML attribute. The default is the member name.":"XML属性的名称。 默认值是成员名称。"," added.":"添加。"," nodes, this property always returns ":"节点，此属性总是返回"," post-schema-compilation value.":"后校流值。"," object whose properties are set on successful validation of the element's name. This parameter can be ":"其属性设置为成功验证元素名称的对象。 此参数可以是","The duplicate node.":"重复节点。","The namespace prefix of this node. If there is no prefix, this property returns String.Empty.":"该节点的名称空间前缀。 如果没有前缀，则此属性返回string.empty。","An XSD (XML Schema Document) data type.":"XSD（XML模式文档）数据类型。"," if it is not found in the collection.":"如果在集合中找不到。"," attribute value of the element. This parameter can be ":"元素的属性值。 此参数可以是"," that is the reference node. The ":"那是参考节点。 这","The XML namespace of the XML attribute.":"XML属性的XML名称空间。"," object whose properties are set on successful validation of the element. This parameter can be ":"其属性设置为成功验证元素的对象。 此参数可以是"," containing the post-schema-validation-infoset of this node.":"包含此节点的扫描后验证侵蚀。","The index of the node to remove. The first node has index 0.":"删除节点的索引。 第一个节点具有索引0。"," is placed after the ":"放置在","The parsed, typed text value of the element if the element has simple content.":"如果元素具有简单的内容，则解析的，键入的文本值。"," if there is no attribute at the specified index.":"如果指定索引没有属性。"," if this attribute was explicitly given a value in the original instance document; otherwise, ":"如果此属性在原始实例文档中明确给出一个值； 否则，","The type of the XML attribute.":"XML属性的类型。"," inserted.":"插入。",". A value of ":"。 一个值","An attribute node to store in this collection. The node will later be accessible using the name of the node. If a node with that name is already present in the collection, it is replaced by the new one; otherwise, the node is appended to the end of the collection.":"存储在此集合中的属性节点。 该节点将稍后使用节点的名称访问。 如果该名称已经存在于集合中，则将其替换为新的。 否则，将节点附加到集合的末尾。","The XML element name of the serialized member.":"串行成员的XML元素名称。","The substring corresponding to the specified range.":"对应于指定范围的子字符串。"," is placed before this node.":"放置在此节点之前。"," indicates that the value of the attribute came from the DTD.":"表示属性的值来自DTD。"," replaces an existing node with the same name, the old node is returned; otherwise, the added node is returned.":"用相同名称替换现有节点，返回旧节点； 否则，返回添加的节点。","The data of the node.":"节点的数据。"," of an object derived from the member's type.":"从成员类型得出的对象。","The value returned depends on the ":"返回的值取决于","The concatenated values of the node and all the children of the node.":"节点的串联值和节点的所有子女。","The index of the attribute.":"属性的索引。"," to add. If it is an ":"添加。 如果是"," of the node. For ":"节点。 为了","An XML Schema data type.":"XML模式数据类型。","The attribute at the specified index.":"指定索引处的属性。","The length, in characters, of the string in the ":"字符串中字符的长度",", the entire contents of the document fragment are moved into the child list of this node.":"，文档片段的整个内容都移至该节点的子列表中。","The name of the generated XML element. The default is the member identifier.":"生成的XML元素的名称。 默认值是成员标识符。"," nodes, this property is the value of attribute.":"节点，此属性是属性的值。"," property. The length may be zero; that is, CharacterData nodes can be empty.":"财产。 长度可能为零； 也就是说，字符达塔节可以为空。","The qualified name of the attribute.":"属性的合格名称。","The attribute to insert.":"插入的属性。"," removed.":"删除。",". Valid formats include \"yyyy-MM-ddTHH:mm:sszzzzzz\" and its subsets.":"。 有效格式包括“ yyyy-mm-ddthh：mm：sszzzzzzzz”及其子集。","The value of the node.":"节点的值。","The attribute with the specified name. If the attribute does not exist, this property returns ":"带有指定名称的属性。 如果属性不存在，则此属性返回"," to append to the collection.":"附加到集合。","The new child ":"新孩子","One of the enumeration values that specify whether the date should be converted to local time or preserved as Coordinated Universal Time (UTC), if it is a UTC date.":"如果是UTC日期，则指定日期应转换为本地时间（UTC）的枚举值之一。","The content of the comment element.":"评论元素的内容。","The attribute with the specified local name and namespace URI. If the attribute does not exist, this property returns ":"带有指定的本地名称和名称空间URI的属性。 如果属性不存在，则此属性返回","The array that is the destination of the objects copied from this collection.":"是从该集合复制的对象的目的地的数组。","The passed-in string instance if all the characters in the string argument are valid whitespace characters, otherwise ":"传递的字符串实例如果字符串参数中的所有字符都是有效的空格字符，否则"," equivalent of the ":"等效于"," to clone only the node itself. Because comment nodes do not have children, the cloned node always includes the text content, regardless of the parameter setting.":"仅克隆节点本身。 由于评论节点没有孩子，因此克隆的节点总是包含文本内容，而不论参数设置如何。"," that contains the count of the attributes.":"其中包含属性的计数。","The reference attribute. ":"参考属性。"," that contains characters to verify.":"其中包含要验证的字符。","For comment nodes, the value is ":"对于评论节点，值是"," if the collection is synchronized.":"如果该集合已同步。","The string to convert. The string must conform to a subset of the W3C Recommendation for the XML dateTime type. For more information, see the dateTime section of the XML Schema specification.":"要转换的字符串。 字符串必须符合XML DateTime类型的W3C建议的子集。 有关更多信息，请参见XML模式规范的DateTime部分。","The passed-in string if all the characters and surrogate-pair characters in the string argument are valid XML characters, otherwise an ":"如果字符串参数中的所有字符和替代字符是有效的XML字符，则传递的字符串，否则"," is placed before the ":"放在之前"," that is the root of the collection.":"那是集合的根源。"," equivalent of the supplied string.":"等效于提供的字符串。","For comment nodes, the value is XmlNodeType.Comment.":"对于评论节点，该值是xmlnodetype.com。"," added to the collection.":"添加到集合中。"," is thrown with information on the first invalid character encountered.":"向遇到的第一个无效角色提供信息。"," that contains character data.":"其中包含字符数据。","The format from which ":"从中的格式","The name to be transformed.":"要转换的名称。","The XML version; see the ":"XML版本； 看到","The attribute to remove.":"要删除的属性。"," is converted. The format parameter can be any subset of the W3C Recommendation for the XML dateTime type. (For more information, see the dateTime section of the XML Schema specification..) The string ":"被转换。 格式参数可以是XML DateTime类型的W3C建议的任何子集。 （有关更多信息，请参见XML模式规范的DateTime部分。）字符串","The decoded name.":"解码名称。"," to clone only the node itself. Because CDATA nodes do not have children, regardless of the parameter setting, the cloned node will always include the data content.":"仅克隆节点本身。 由于CDATA节点不可能，无论参数设置如何，克隆的节点将始终包含数据内容。","The encoding scheme; see the ":"编码方案； 看到","The node removed or ":"删除节点或","For CDATA nodes, the local name is ":"对于CDATA节点，本地名称为"," is validated against this format.":"通过这种格式进行了验证。","Indicates whether the XML document depends on an external DTD; see the ":"指示XML文档是否取决于外部DTD； 看到","The name to be encoded.":"要编码的名称。","The namespace URI of the attribute (if any). String.Empty and ":"属性的名称空间URI（如果有）。 string.empty和"," to clone only the node itself. Because ":"仅克隆节点本身。 因为","For CDATA nodes, the name is ":"对于CDATA节点，名称为"," are equivalent. If ":"是等效的。 如果","An array of formats from which ":"一系列格式","The encoded name.":"编码名称。"," nodes do not have children, the cloned node always includes the data value, regardless of the parameter setting.":"节点没有孩子，克隆节点总是包含数据值，而不论参数设置如何。"," is xmlns, then this parameter must be ":"是XMLN，那么此参数必须为","A name to be translated.":"要翻译的名称。"," can be converted. Each format in ":"可以转换。 每种格式在","The node type. For CDATA nodes, the value is XmlNodeType.CDATA.":"节点类型。 对于CDATA节点，该值是XMLNODETYPE.CDATA。","The valid character encoding name. The most commonly supported character encoding names for XML are the following:  \n  \n ":"有效的字符编码名称。 XML编码名称的最常见的字符如下：","; otherwise an exception is thrown.":"; 否则会抛出例外。","The name with any invalid characters replaced by an escape string.":"任何无效字符的名称被逃生字符串代替。"," can be any subset of the W3C Recommendation for the XML dateTime type. (For more information, see the dateTime section of the XML Schema specification..) The string ":"可以是XML DateTime类型的W3C建议的任何子集。 （有关更多信息，请参见XML模式规范的DateTime部分。）字符串"," that is the parent of the current node. If a node has just been created and not yet added to the tree, or if it has been removed from the tree, the parent is ":"那是当前节点的父。 如果刚刚创建了一个节点，尚未添加到树上，或者从树中删除了节点，则父母为","The character to verify as a non-colon character.":"验证为非颜色字符的字符。","The content of the new ":"新的内容","  \n\n This value is optional. If a value is not set, this property returns String.Empty.  \n  \n If an encoding attribute is not included, UTF-8 encoding is assumed when the document is written or saved out.":"该值是可选的。 如果未设置值，则此属性将返回String.empty。 \n  \n  如果不包括编码属性，则在编写或保存文档时假设UTF-8编码。"," is validated against one of these formats.":"根据这些格式之一进行了验证。"," (that is, everything between ":"（也就是说，之间的一切",". For all other nodes, the value returned depends on the ":"。 对于所有其他节点，返回的值取决于","The prefix of the attribute (if any).":"属性的前缀（如果有）。"," if the character is a valid non-colon character type; otherwise, ":"如果字符是有效的非颜色字符类型； 否则，",", that is, \"true\" or \"false\".":"，也就是说，“ true”或“ false”。","The namespace URI of the attribute (if any).":"属性的名称空间URI（如果有）。"," of the node. The following table describes the possible return values for the ":"节点。 下表描述了"," nodes, the local name is ":"节点，本地名称是","String that contains character data to be added to document.":"包含要添加到文档的字符数据的字符串。"," object to validate.":"对象要验证。"," nodes, the name is ":"节点，名称是"," in the format yyyy-MM-ddTHH:mm:ss where 'T' is a constant literal.":"以Yyyy-mm-ddthh的格式：mm：ss“ t”是一个恒定的文字。","Name of the document type.":"文档类型的名称。"," to contain character data.":"包含字符数据。"," nodes, this value is XmlNodeType.XmlDeclaration.":"节点，此值是xmlNodeType.xmldeclaration。","The passed-in character if the character is a valid public id character, otherwise ":"如果字符是有效的公共ID字符，则传递字符，否则","The format structure that defines how to display the converted string. Valid formats include \"yyyy-MM-ddTHH:mm:sszzzzzz\" and its subsets.":"定义如何显示转换的字符串的格式结构。 有效格式包括“ yyyy-mm-ddthh：mm：sszzzzzzzz”及其子集。","The public identifier of the document type or ":"文档类型的公共标识符或","Valid values are ":"有效值为","The string to insert into the existing string.":"插入现有字符串的字符串。"," in the specified format.":"以指定格式。",". You can specify a public URI and also a system identifier to identify the location of the external DTD subset.":"。 您可以指定公共URI和系统标识符，以识别外部DTD子集的位置。"," if all entity declarations required by the XML document are contained within the document or ":"如果XML文档要求的所有实体声明都包含在文档中或"," if the character is a valid Start Name Character type; otherwise, ":" 如果字符是有效的开始名称字符类型；否则, "," values that specify how to treat the ":"指定如何处理的值","The system identifier of the document type or ":"文档类型的系统标识符或","The position within the string to start deleting.":"字符串中的位置开始删除。"," if an external document type definition (DTD) is required. If a standalone attribute is not present in the XML declaration, this property returns String.Empty.":"如果需要外部文档类型定义（DTD）。 如果XML声明中不存在独立属性，则此属性将返回String.empty。"," representation of the supplied ":"所提供的代表",". Specifies the URL of the file location for the external DTD subset.":"。 指定外部DTD子集的文件位置的URL。","The position within the string to insert the supplied string data.":"字符串中的位置插入提供的字符串数据。"," if the passed in character is a valid XML whitespace character; otherwise, ":"如果字符中传递的是有效的XML Whitespace字符； 否则，","The format to which ":"格式","The DTD internal subset of the document type or ":"文档类型的DTD内部子集或","The value is always ":"值总是 ","The cloned ":"克隆"," is converted. The format parameter can be any subset of the W3C Recommendation for the XML dateTime type. (For more information, see the dateTime section of the XML Schema specification..)":"被转换。 格式参数可以是XML DateTime类型的W3C建议的任何子集。 （有关更多信息，请参见XML模式规范的DateTime部分。","The qualified name of the element. If the name contains a colon then the ":"元素的合格名称。 如果该名称包含一个结肠，那么"," node.":"节点。"," representation in the specified format of the supplied ":"以所提供的指定格式表示"," if the passed in character is a valid XML character; otherwise, ":" 如果传入的字符是有效的XML字符；否则, ","The string data that is to be inserted into the existing string.":"要插入到现有字符串中的字符串数据。"," property reflects the part of the name preceding the colon and the ":"财产反映了结肠和结肠之前的名称的一部分","The string to convert. The string format must conform to the W3C XML Schema Part 2: Datatypes recommendation for duration.":"要转换的字符串。 字符串格式必须符合W3C XML架构第2部分：datatypes to datatypes tor持续时间。","The surrogate character to validate.":"替代特征要验证。","The qualified name of the attribute. If the name contains a colon, the ":"属性的合格名称。 如果该名称包含一个结肠，则","The position within the string to start replacing.":"字符串中的位置开始替换。","The name to verify.":"要验证的名称。"," property reflects the part of the name after the colon. The qualified name cannot include a prefix of 'xmlns'.":"财产反映了结肠后的名称的一部分。 合格的名称不能包括“ XMLNS”的前缀。","The number of characters to replace.":"要替换的字符数。"," property reflects the part of the name preceding the first colon and the ":"属性反映了第一个结肠之前的名称的一部分和"," if the passed in surrogate pair of characters is a valid XML character; otherwise, ":" 如果传入的代理项对字符是有效的XML字符；否则, ","The name, if it is a valid XML name.":"名称，如果是有效的XML名称。"," property will reflect the part of the name after the colon. The qualified name cannot include a prefix of 'xmlns'.":"财产将在结肠后反映出名称的一部分。 合格的名称不能包括“ XMLNS”的前缀。","The new data that replaces the old string data.":"替代旧字符串数据的新数据。"," property reflects the part of the name following the first colon. The ":"属性反映了第一个结肠后的名称的一部分。 这"," value, that is, ":"价值，也就是说","The name, if it is a valid NCName.":"名称，如果是有效的NCNAME。"," equivalent of the string.":"等效字符串。","The prefix of the new element (if any). String.Empty and ":"新元素的前缀（如果有）。 string.empty和"," remains empty unless the prefix is a recognized built-in prefix such as xmlns. In this case ":"除非前缀是公认的内置前缀，例如XMLN。 在这种情况下","The namespace URI of the new element (if any). String.Empty and ":"新元素的名称空间URI（如果有）。 string.empty和","The string containing a single character to convert.":"字符串包含一个要转换的字符。","The string you wish to verify.":"您希望验证的字符串。"," has a value of ":"有一个价值","String version of the ":"字符串版本的"," representing the single character.":"代表单个字符。"," of the new node. This parameter must be one of the values listed in the table below.":"的新节点。此参数必须是下表中列出的值之一。","The qualified name of the attribute. If the name contains a colon then the ":"属性的合格名称。 如果该名称包含一个结肠，那么","The name token, if it is a valid NMTOKEN.":"名称令牌，如果是有效的nmtoken。","The position within the string to start retrieving. An offset of zero indicates the starting point is at the start of the data.":"字符串内的位置开始检索。 偏移量为零表示起始点位于数据的起始点。","The format structure to apply to the converted ":"适用于转换的格式结构","The qualified name of the new node. If the name contains a colon, it is parsed into ":"新节点的合格名称。 如果该名称包含结肠，则将其解析为"," that contains the id to validate.":"其中包含要验证的ID。"," property will reflect the part of the name preceding the colon and the ":"财产将反映结肠和结肠之前的名称的一部分",". Valid formats include \"yyyy-MM-ddTHH:mm:sszzzzzz\" and its subsets. The string is validated against this format.":"。 有效格式包括“ yyyy-mm-ddthh：mm：sszzzzzzzz”及其子集。 该字符串针对此格式进行了验证。","The number of characters to retrieve.":"要检索的字符数。"," property will reflect the part of the name after the colon.":"财产将在结肠后反映出名称的一部分。"," components.":" 组件。","The passed-in string if all the characters in the argument are valid public id characters.":"如果参数中的所有字符都是有效的公共ID字符，则传递字符串。","The version must be \"1.0\".":"版本必须为“ 1.0”。","An array containing the format structures to apply to the converted ":"包含格式结构的阵列，适用于转换的","The namespaceURI of the attribute. If the qualified name includes a prefix of xmlns, then this parameter must be ":"属性的名称空间。 如果合格的名称包括XMLN的前缀，则此参数必须为","The namespace URI of the new node.":"新节点的名称空间URI。","The string value you wish to verify.":"您希望验证的字符串值。","The value of the encoding attribute. This is the encoding that is used when you save the ":"编码属性的值。 这是保存时使用的编码","The prefix of the attribute (if any). String.Empty and ":"属性的前缀（如果有）。 string.empty和"," of the new node.":"新节点。"," are equivalent.":"是等效的。","The token, if it is a valid token.":"令牌，如果它是有效的令牌。"," to a file or a stream; therefore, it must be set to a string supported by the ":"到文件或流； 因此，必须将其设置为由","The qualified name of the new node. If the name contains a colon then it is parsed into ":"新节点的合格名称。 如果该名称包含一个结肠，则将其解析为"," to verify.":"验证。"," class, otherwise ":"班级，否则","The prefix of the new node.":"新节点的前缀。"," fails. If this is ":"失败。 如果是","The local name of the new node.":"新节点的本地名称。"," or String.Empty, the ":"或string.empty，","The name of the processing instruction.":"处理指令的名称。"," method does not write an encoding attribute on the XML declaration and therefore the default encoding, UTF-8, is used.  \n  \n Note: If the ":"方法不在XML声明上编写编码属性，因此使用默认编码UTF-8。 \n  \n  注意：如果是","The data for the processing instruction.":"处理指令的数据。"," is saved to either a ":"保存到","The string must contain only the following characters &#20; &#10; &#13; and &#9;.":"字符串必须仅包含以下字符＆＃20; ＆＃10; ＆＃13; 和＆＃9;。",", this encoding value is discarded. Instead, the encoding of the ":"，此编码值被丢弃。 相反，编码","The text for the Text node.":"文本节点的文本。"," or the ":"或者"," is used. This ensures that the XML written out can be read back using the correct encoding.":"用来。 这样可以确保可以使用正确的编码来读取XML。","The value must be either \"yes\" or \"no\". If this is ":"该值必须是“是”或“否”。 如果是"," method does not write a standalone attribute on the XML declaration.":"方法不会在XML声明上编写独立属性。"," with the matching ID or ":"使用匹配ID或"," if no matching element is found.":"如果找不到匹配元素。"," containing a list of all matching nodes. If no nodes match ":"包含所有匹配节点的列表。 如果没有节点匹配",", the returned collection will be empty.":"，返回的收藏将为空。","The LocalName to match. The special value \"*\" matches all tags.":"匹配的localname。 特殊值“*”匹配所有标签。","NamespaceURI to match.":"namepaceuri匹配。"," containing a list of all matching nodes. If no nodes match the specified ":"包含所有匹配节点的列表。 如果没有节点匹配指定的","The node being imported.":"导入节点。"," to perform a deep clone; otherwise, ":"执行深度克隆； 否则，","The imported ":"进口","URL for the file containing the XML document to load. The URL can be either a local file or an HTTP URL (a Web address).":"包含要加载XML文档的文件的URL。 URL可以是本地文件或HTTP URL（网址）。","String containing the XML document to load.":"包含要加载的XML文档的字符串。","The XML source.":"XML源。"," if no more nodes exist.":"如果没有更多的节点。","The stream to which you want to save.":"您要保存的流。","The location of the file where you want to save the document.":"文件的位置要保存文档。"," object that receives information about schema validation warnings and errors.":"接收有关模式验证警告和错误的信息。"," object created from an ":"从一个","The location from which the node was loaded.":"加载节点的位置。"," that represents the root of the XML document tree. If no root exists, ":"这代表XML文档树的根。 如果没有根，"," containing the DocumentType (DOCTYPE declaration).":"包含DocumentType（Doctype声明）。"," object for the current document.":"当前文档的对象。","The values of the node and all its child nodes.":"节点的值及其所有子节点。","The markup of the children of the current node.":"当前节点的孩子的标记。"," if the current node is read-only; otherwise ":"如果当前节点仅读取； 否则"," nodes always return ":"节点总是返回"," nodes, the local name is #document.":"节点，本地名称为#document。"," nodes, the name is #document.":"节点，名称为#document。"," enabling you to get the atomized version of a string within the document.":"使您能够在文档中获取字符串的雾化版本。","The node type. For ":"节点类型。 为了"," nodes, this value is XmlNodeType.Document.":"节点，此值是xmlNodeType.document。"," nodes (":"节点（"," equals XmlNodeType.Document), this property always returns ":"等于xmlnodetype.document），此属性始终返回"," to preserve white space; otherwise ":"保存空白； 否则"," object representing the PSVI of the node.":"代表节点PSVI的对象。"," object containing the XML Schema Definition Language (XSD) schemas associated with this ":"包含XML模式定义语言（XSD）架构的对象与此关联","; otherwise, an empty ":"; 否则，一个空的"," to use.  \n  \n In version 1.1 of the.NET Framework, the caller must be fully trusted in order to specify an ":"使用。 \n  \n  在.NET框架的版本1.1中，必须完全信任呼叫者以指定一个","The XML document that is the source of the fragment.":"XML文档是片段的来源。","The markup of the children of this node.":"这个节点的孩子的标记。",", the name is ":"， 名字是"," nodes, this value is XmlNodeType.DocumentFragment.":"节点，此值是xmlnodeType.documentFragment。"}