{", the timestamp is shown in the content view.":"，时间戳显示在内容视图中。","The bounds of a round-rectangle to add to the path":"圆形的边界以添加到路径","the resulting argb color":"生成的argb颜色","A new array of 3 floats, containing tristimulus XYZ values":"一个新的3个浮子的新数组，包含tristimulus xyz值","set the paint's text size in pixel units.":"将油漆的文本大小设置为像素单元。","Approximate memory usage in bytes.":"在字节中近似内存使用。","true if the paragraph context is RTL, otherwise false":"如果段落上下文是RTL，则为the，否则为false","The x location of the camera":"相机的X位置","complete path name for the file to be decoded.":"完整的路径名，用于解码的文件。","The green component of the opaque sRGB color to create, in \\([0..1]\\)":"不透明SRGB颜色的绿色组件，以\\（[0..1] \\）创建","The amount to subtract from the rectangle's right":"从矩形的右边减去的金额","the blendmode to apply to the color":"用于颜色的搅拌机","The top edge being unioned with this rectangle":"与这个矩形结合的顶部边缘","The amount in the Y direction to offset the entire path":"y方向的数量以抵消整个路径","The bitmap we are subsetting":"我们子集的位图","true if the given settings is effective to at least one font file underlying this\n                    typeface. This function also returns true for empty settings string. Otherwise\n                    returns false":"如果给定设置有效至少一个字体文件，则为此 \n                     字体。 对于空设置字符串，此功能还返回true。 否则 \n                     返回false","The bottom position of the RenderNode, in pixels":"Rendernode的底部位置，以像素为单位","The new color (including alpha) to set in the paint.":"新颜色（包括α）将在油漆中设置。","The number of pixels to read from each row":"从每一行读取的像素数","alpha component (0..255) of the color to draw onto the canvas":"颜色的alpha组件（0..255）在画布上","A container for the current matrix and clip used to draw the NinePatch.":"当前矩阵和夹子的容器用于绘制尼尼点。","Set to the current value of the filter's ColorMatrix.":"设置为过滤器colormatrix的当前值。","The distance above(-) or below(+) the path to position the text":"上方（ - ）或以下（+）定位文本的距离（+）","The first Insets.":"第一个插图。","The distance to translate in X":"在x中翻译的距离","The path to compare with the current clip":"与当前剪辑进行比较的路径","the index + 1 of the end of the shaping context":"塑形上下文末端的索引 + 1","The destination rectangle.":"目的地矩形。","The parcel to read the point's coordinates from":"读取点的坐标的包裹","The sRGB color at the end of the gradient line.":"梯度线末端的SRGB颜色。","The colors from this shader are seen as the \"dst\" by the mode":"该着色器的颜色被模式视为“ DST”","the paint's text size in pixel units.":"油漆的文字大小为像素单元。","the entry name":"输入名称","The amount to subtract from the rectangle's bottom":"从矩形的底部减去的金额","The y location of the camera":"相机的位置","The blue component of the opaque sRGB color to create, in \\([0..1]\\)":"不透明SRGB颜色的蓝色组件创建，in \\（[0..1] \\）","The right edge being unioned with this rectangle":"与此矩形结合的右边缘","The starting index within the text to be drawn":"要绘制的文本中的起始索引","The x coordinate of the first pixel in source":"源中第一个像素的X坐标","Array of 8 values, 4 pairs of [X,Y] radii":"8个值的数组，4对[x，y]半径","the cursor position to move from":"光标位置从","the resulting decoded bitmap, or null if it could not be decoded.":"所得的解码位图，或者如果无法解码，则无效。","the alpha component of the returned argb color.":"返回的argb颜色的α组件。","The RenderNode's current elevation":"Rendernode的当前高程","SEQUENCE_INVARIANT or SEQUENCE_SENSITIVE":"sequence_invariant或sequence_sentive","set the paint's skew factor in X for drawing text.":"将油漆的偏斜因子设置为X绘制文本。","red component (0..255) of the color to draw onto the canvas":"红色组件（0..255）的颜色要画在画布上","The rectangle being intersected with this rectangle.":"矩形与该矩形相交。","The color long whose blue channel to extract":"颜色长的蓝色通道提取","May be null. The maskfilter to be installed in the\n                              paint":"可能是无效的。 将安装在 \n                               画","the porter-duff mode to apply to the color\n":"适用于颜色的搬运工模式","The translated path is written here. If this is null, then\n                       the original path is modified.":"翻译的路径在这里写。 如果这是无效的，那就 \n                        原始路径已修改。","Where to draw the NinePatch.":"在哪里绘制尼尼匹配。","The distance to translate in Y":"翻译成y的距离","The Shader tiling mode":"着色器平铺模式","the paint's color (and alpha).":"油漆的颜色（和alpha）。","The second Insets.":"第二个插图。","true if the path (transformed by the canvas' matrix)\n                               does not intersect with the canvas' clip":"如果路径（由画布的矩阵转换），则为true） \n                                不与画布的剪辑相交","The number of rows to read":"读的行数","The z location of the camera":"相机的Z位置","The colors from this shader are seen as the \"src\" by the mode":"该着色器的颜色被模式视为“ SRC”","true if the display list should be projected onto a\n                                 containing volume. Default is false.":"如果将显示列表投射到一个 \n                                  包含音量。 默认值为false。","how to move the cursor":"如何移动光标","index of caret position":"室内索引","The color space to chromatically adapt":"色度适应的颜色空间","The paint to draw the bitmap with. may be null":"绘制位图的油漆。 可能是无效的","The parcel to write the point's coordinates into":"将点的坐标写入的包裹","The color long whose color space to extract":"颜色长的颜色空间提取","the paint's skew factor in X for drawing text.":"油漆在X中的偏斜因子用于绘制文本。","OrientedBoundingBox":"定向盒","green component (0..255) of the color to draw onto the canvas":"绿色组件（0..255）的颜色要画在画布上","The x-coordinate of the control point on a quadratic curve":"二次曲线上控制点的X坐标","The matrix to store the inverse transform of the RenderNode":"矩阵存储呈现的逆变换","The direction to wind the round-rectangle's contour":"缠绕圆形轮廓的方向","maskfilter":"maskFilter","the width of the current drawing layer":"当前绘图层的宽度","Starting from index, the number of characters to draw":"从索引开始，绘制字符的数量","The file descriptor containing the bitmap data to decode":"文件描述符，其中包含用于解码的位图数据","The outer rectangular bounds of the roundRect to be drawn":"要绘制的圆形的外矩形边界","The y coordinate of the first pixel in source":"源中第一个像素的Y坐标","The bottom edge being unioned with this rectangle":"底部边缘与这个矩形结合","A float value in the range \\([0..1]\\)":"范围内的浮点值\\（[0..1] \\）","true if the specified rectangle and this rectangle intersect\n                         (and this rectangle is then set to that intersection) else\n                         return false and do not change this rectangle.":"如果指定的矩形和该矩形相交，则为true \n                          （然后将此矩形设置为该交叉点）否则 \n                          返回false，不要更改此矩形。","the rect to compare with the current clip":"与当前剪辑进行比较的矩","The new white point":"新的白点","The matrix to copy into this matrix":"矩阵复制到此矩阵中","max(a, b), i. e. the larger of every inset on every side is taken for the result.":"麦克斯（a，b），i。 e。 为结果采用每一侧的每个插图中的较大。","The blend mode that combines the colors from the two shaders.":"结合两个着色器的颜色的混合模式。","The Paint to draw through.":"绘画的油漆。","blue component (0..255) of the color to draw onto the canvas":"蓝色组件（0..255）的颜色要画在画布上","the paint's colorfilter (maybe be null)":"油漆的ColorFilter（也许为无效）","the text to render":"渲染的文字","The y-coordinate of the control point on a quadratic curve":"二次曲线上控制点的Y坐标","the offset of the next position, or -1":"下一个位置的偏移或-1","A non-null color space instance":"一个非无效的颜色空间实例","The distance to translate by on the X axis":"在X轴上翻译的距离","width measurement between start and offset":"开始和偏移之间的宽度测量","The path to be drawn":"要画的路","The scaled height of this bitmap, according to the density scale factor.":"根据密度尺度因子，该位图的缩放高度。","True if this RenderNode is a projection receiver, false otherwise.\n                                 Default is false.":"正确，如果此渲染是投影接收器，则为false否则。 \n                                  默认值为false。","The x-radius of the rounded corners on the round-rectangle":"圆角圆角的X-Radius","The parcel to write the rectangle's coordinates into":"将矩形坐标写入的包裹","the width of the bounding box of the target path":"目标路径的边界框的宽度","The matrix to store the transform of the RenderNode":"矩阵存储渲染的转换","May be null. The patheffect to be installed in the paint":"可能是无效的。 要安装在油漆中的路径效应","the paint's typeface (or null)":"油漆的字体（或空）","the decoded bitmap, or null":"解码的位图或空","The number of pixels in each row":"每行的像素数","Array of 8 float representing the x, y corner radii for top left,\n                              top right, bottom right, bottom left corners respectively on the outer\n                              rounded rectangle":"8个浮子的数组代表x，y角半径左上角， \n                               右上，右下，左下角分别在外部 \n                               圆形矩形","Alpha component \\([0..255]\\) of the color":"颜色的alpha组件\\（[0..255] \\）","The point whose values are copied into the new\n                     point.":"将其价值复制到新的点的点 \n                      观点。","true if the rect (transformed by the canvas' matrix)\n                         does not intersect with the canvas' clip":"如果矩形（由画布的矩阵转换），则为true \n                          不与画布的剪辑相交","The left side of the rectangle being intersected with this\n                        rectangle":"矩形的左侧与此相交 \n                         长方形","An integer representation of a color (ARGB).":"颜色的整数表示（argb）。"," instance with the same name, primaries,\n                    transfer functions and range as the specified color space":"带有相同名称的实例，初选， \n                     转移功能和范围作为指定的颜色空间","The bitmap to draw":"绘制的位图","The mode that combines the colors from the two shaders. If mode\n                            is null, then SRC_OVER is assumed.":"结合了两个着色器的颜色的模式。 如果模式 \n                             为null，然后假设src_over。","The color to test":"测试的颜色","The x-coordinate of the end point on a quadratic curve":"二次曲线上终点的X坐标","to be applied to the RenderNode. Passing null clears all previously\n                     configured RenderEffects":"应用于渲染。 通过Null以前清除了所有 \n                      配置的RendereFects","min(a, b), i. e. the smaller of every inset on every side is taken for the result.":"最小（a，b），i。 e。 为结果采用每一侧的每个插图中的较小。","The distance to translate by on the Y axis":"在y轴上翻译的距离","the paint's style setting (Fill, Stroke, StrokeAndFill)":"油漆的样式设置（填充，笔触，strokeandfill）","the paint's color, alpha, and ":"油漆的颜色，alpha和","The location and size of the NinePatch.":"九峰的位置和大小。","The density of the target canvas of the bitmap.":"位图的目标画布的密度。","the length of the context":"上下文的长度"," into which the string representation of\n                      the matrix will be written.":"其中的字符串表示形式 \n                       矩阵将被编写。","the start of the text to render. Data before this position can be used for\n                       shaping context.":"文本开始渲染。 可以在此位置使用之前的数据 \n                        塑造上下文。","The paint used to draw the path":"用于画路径的油漆","effect":"影响","The inner rectangular bounds of the roundRect to be drawn":"要绘制的圆形的内部矩形边界","The red component.":"红色组件。","the position of the underline in pixels":"下划线在像素中的位置","The y-radius of the rounded corners on the round-rectangle":"圆角圆角的Y-Radius","Parcel object to write the region data into":"包裹对象将区域数据写入","Red component \\([0..255]\\) of the color":"颜色的红色组件\\（[0..255] \\）","The number of rows":"行的数量","If not null, return the padding rect for the bitmap if\n                   it exists, otherwise set padding to [-1,-1,-1,-1]. If\n                   no bitmap is returned (null) then padding is\n                   unchanged.":"如果不是null，请返回位图的填充矩阵 \n                    它存在，否则将填充物设置为[-1，-1，-1，-1]。 如果 \n                    没有返回位图（null），然后填充是 \n                    不变。","The correlated color temperature, in Kelvin":"在开尔文中相关的色温","The ARGB source color used with the specified Porter-Duff mode":"指定的Porter-Duff模式使用的ARGB源颜色","the height of the bounding box of the target path":"目标路径的边界框的高度","boolean true if this RenderNode has a display list, false otherwise.":"Boolean True如果此渲染具有显示列表，则为false否则。","The top of the rectangle being intersected with this rectangle":"矩形的顶部与该矩形相交"," if the path should be considered antialiased,\n                    since that means it may affect a larger area (more pixels) than\n                    non-antialiased (":"如果应将路径视为抗逆性， \n                     由于这意味着它可能会影响更大的面积（更大的像素） \n                     非antiasias","Whether the matrix is affine.":"矩阵是否为仿射。","True if the color is in the sRGB color space, false otherwise":"如果颜色在SRGB颜色空间中，则为true，否则为否则","null if the NinePatch has no transparent region to\n            report, else a ":"null如果尼尼普atch没有透明的区域 \n             报告，否则","The rotation value of the display list, in degrees":"显示列表的旋转值，分别","The matrix used to transform the bitmap when it is drawn":"绘制矩阵时用于转换位图的矩阵","text to measure and return its bounds":"衡量和返回其界限的文本","The green component.":"绿色组件。","The picture to be drawn":"要绘制的图片"," encoded as a\n                 ":"编码为","The distance to translate by on the Z axis":"在z轴上翻译的距离","Green component \\([0..255]\\) of the color":"颜色的绿色组件\\（[0..255] \\）","The text to measure":"要测量的文字","The scaled width of this bitmap, according to the density scale factor.":"根据密度尺度因子，该位图的宽度宽度。","Amount to round sharp angles between line segments.":"等同于线段之间的圆角。","the end of the text to render. Data at or after this position can be used for\n                       shaping context.":"文本的末尾渲染。 该位置或之后的数据可用于 \n                        塑造上下文。","May be null. The new rasterizer to be installed in\n                   the paint.":"可能是无效的。 将安装在 \n                    油漆。","The y-coordinate of the end point on a quadratic curve":"二次曲线上终点的y坐标","true if the rect (transformed by the canvas' matrix)\n                               does not intersect with the canvas' clip":"如果矩形（由画布的矩阵转换），则为true \n                                不与画布的剪辑相交","the rectangle from which to take the values":"从中取值的矩形"," used to initialize the pixels.":"用于初始化像素。","null-ok; Options that control downsampling and whether the\n             image should be completely decoded, or just its size returned.":"null-ok; 控制缩减采样的选项以及是否 \n              图像应完全解码，或仅返回其大小。","The right side of the rectangle being intersected with this\n                         rectangle.":"矩形与此相交的右侧 \n                          长方形。","The porter-duff mode that is applied":"应用的搬运工模式","the region that will be iterated":"将要迭代的地区","Array of 8 float representing the x, y corner radii for top left,\n                              top right, bottom right, bottom left corners respectively on the\n                              outer rounded rectangle":"8个浮子的数组代表x，y角半径左上角， \n                               右上，右下，左下角分别在 \n                               外圆形矩形","the number of points needed":"所需的积分数","true if the RenderNode has an identity transform, false otherwise":"true如果渲染具有身份转换，则为false否则"," if the path should be considered antialiased,\n              since that means it may affect a larger area (more pixels) than\n              non-antialiased (":"如果应将路径视为抗逆性， \n               由于这意味着它可能会影响更大的面积（更大的像素） \n               非antiasias","The acceptable error for a line on the\n                                   Path. Typically this would be 0.5 so that\n                                   the error is less than half a pixel.":"一行的可接受错误 \n                                    小路。 通常这是0.5，所以 \n                                    错误小于一半像素。","true to set the underlineText bit in the paint's\n                                 flags, false to clear it.":"确实在油漆中设置UnderLineText位 \n                                  旗帜，错误清除。","An array of components for points approximating the Path.":"近似路径的点的组件数组。"," which is internally used by hardware bitmap\n            \n            Note: the HardwareBuffer does *not* have an associated ":"硬件位图内部使用 \n            \n             注意：硬件贝弗确实 *没有 *具有关联","index of the first char in the text to measure":"文本中第一个字符的索引","the distance below (positive) the baseline (descent) based on\n                    the current typeface and text size.":"以下（正）基线（下降）的距离基于 \n                     当前字体和文本大小。","an Insets instance with the appropriate values":"具有适当值的插图实例","array of ON and OFF distances":"一系列开关距离","array to receive the advance widths of the characters.\n                          Must be at least a large as the text.":"数组以接收角色的提前宽度。 \n                           必须至少像文本一样大。","True if the color is in a wide-gamut color space, false otherwise":"如果颜色在宽阔的颜色空间中，则为true，否则为错误","The scale value of the display list":"显示列表的比例值","Specifies a mutable bitmap for the canvas to draw into.":"为画布绘制的可变位图指定。","Corresponding XYZ values":"相应的XYZ值","The blue component.":"蓝色组件。","Number of values to skip before starting to draw.":"开始绘制之前要跳过的值数。","Blue component \\([0..255]\\) of the color":"蓝色组件\\（[0..255] \\）颜色","May be null. The paint used to draw the bitmap":"可能是无效的。 用于绘制位图的油漆","The amount to add to the x-coordinate of the previous point on\n                      this contour, to specify a line":"添加到上一个点的x坐标的金额 \n                       此轮廓，指定一行","The array [x0, y0, x1, y1, ...] of points to transform.":"要转换点的阵列[x0，y0，x1，y1，...]。","May be null. the new shader to be installed in the paint":"可能是无效的。 要安装在油漆中的新阴暗器","the index of the start of the shaping context":"塑造上下文开始的索引"," holding the parts of the specified bounds\n            that are transparent.":"保持指定边界的各个部分 \n             那是透明的。","the path":"路径","The resources object containing the image data":"包含图像数据的资源对象","true if the underlineText bit is set in the paint's flags.":"是的，如果UnderLineText位设置在油漆标志中。","The left side of the rectangle to compare with the\n                               current clip":"矩形的左侧与 \n                                当前剪辑","The source bitmap to be rendered by the created ":"由创建的源位图","True if this display list renders content which overlaps, false otherwise.":"如果此显示列表呈现与重叠的内容，则为the，否则为false。","The bounds of oval defining shape and size of the arc":"椭圆形的定义形状和大小","The paint used to draw the double roundRect":"用于绘制双向圆形的油漆","The colors to be distributed between the center and edge of the circle":"要分布在圆的中心和边缘之间的颜色","The bottom of the rectangle being intersected with this\n                        rectangle.":"矩形与此相交的底部 \n                         长方形。","Number of values to skip before the first color in the\n                 array of colors.":"在第一种颜色之前跳过的值数量 \n                  一系列颜色。","shader":"着色器","the left inset":"左插图","The adaptation method":"适应方法","the number of code units in the specified text.":"指定文本中的代码单元数量。","The color space to test against":"测试的颜色空间","Alpha component \\([0..1]\\) of the color":"颜色的alpha组件\\（[0..1] \\）",".\n            To render this object the same as its rendered with this Bitmap, you\n            should also call ":"。 \n             为了使此对象与使用该位图呈现的对象相同，您 \n             也应该打电话","A byte array representing a 9-patch data chunk.":"一个字节阵列，代表9点数据块。","true to set the dithering bit in flags, false to clear it":"确实在标志中设置抖动钻头，false以清除它","the index of the end of the shaping context":"塑造上下文结束的索引","The red component. (0-255)":"红色组件。 （0-255）","The amount to add to the y-coordinate of the previous point on\n                      this contour, to specify a line":"添加到上一个点的y坐标的金额 \n                       此轮廓，指定一行","The array of dst points (x,y pairs)":"DST点的数组（x，y对）","The bitmap to be drawn":"要绘制的位图","offset into the intervals array":"偏移到间隔数组","1 past the last char in the text to measure":"文本中的最后一个字符要测量的最后一个字符","The number of values to process, after skipping offset of them. Since one point\n                       uses two values, the number of \"points\" that are drawn is really (count >> 1).":"跳过偏移后要处理的值数量。 从一点点开始 \n                        使用两个值，绘制的“点”的数量确实是（计数>> 1）。","the clip bounds, or [0, 0, 0, 0] if the clip is empty.":"如果夹子为空，则夹子边界或[0，0，0，0]。","The color this RenderNode will cast for its elevation spot shadow.":"这种渲染的颜色将为其高程斑点阴影施放。","Optional subset of the bitmap to be part of the rendered output. If null\n                       is provided, the entire bitmap bounds are used.":"位图的可选子集是渲染输出的一部分。 如果为null \n                        提供了整个位图边界。","Number of colors in the array between rows (must be >=\n                 width or <= -width).":"行之间的阵列中的颜色数（必须为> = \n                  宽度或<= -Width）。","the thickness of the underline in pixels":"下划线以像素的厚度","May be <code>null</code>. Valid values are between <code>0.0f</code> and\n                            <code>1.0f</code>. The relative position of each corresponding color in\n                            the colors array. If <code>null</code>, colors are distributed evenly\n                            between the center and edge of the circle.":"可以是<code> null </code>。 有效值在<code> 0.0F </code>和 \n                             <code> 1.0F </code>。 每个相应颜色的相对位置 \n                             颜色数组。 如果<code> null </code>，颜色均匀分布 \n                             在圆的中心和边缘之间。","The green component. (0-255)":"绿色组件。 （0-255）","The resource id of the image data":"图像数据的资源ID","Red component \\([0..1]\\) of the color":"颜色的红色组件\\（[0..1] \\）","The first rectangle being tested for intersection":"第一个矩形正在测试交叉点","The top of the rectangle to compare with the current\n                               clip":"矩形的顶部与电流进行比较 \n                                夹子","an oriented bounding box":"面向边界的框","The x-radius of the oval used to round the corners on the outer rectangle":"椭圆形的X-Radius用于围绕外部矩形的角落","The white point to adapt from":"适应的白点","Sweep angle (in degrees) measured clockwise, treated\n                               mod 360.":"顺时针测量的扫角（以度为单位），处理过 \n                                mod 360。","the top inset":"顶部插图","True if this RenderNode has a shadow, false otherwise":"如果此渲染有阴影，则为false，否则为否则","true if the dithering bit is set in the paint's flags.":"如果在油漆的标志中设置了抖动位，则是的。","The X axis translation value of the display list, in pixels":"显示列表的X轴翻译值，以像素为单位","The array of src points (x,y pairs)":"SRC点的数组（x，y对）",".</p>\n            \n            Must not be modified while a wrapped Bitmap is accessing it. Doing so will\n            result in undefined behavior.</p>":"。</p> \n            \n             当包装位图访问它时，不得修改。 这样做会 \n             导致不确定的行为。</p>","The new style to set in the paint":"在油漆中设定的新样式","The path used in the difference operation":"差异操作中使用的路径","The amount to add to the x-coordinate of the end of the\n                      previous contour, to specify the start of a new contour":"添加到X坐标末端的X坐标的金额 \n                       以前的轮廓，指定新轮廓的开始","True if the color is in the specified color space, false otherwise":"如果颜色在指定的颜色空间中，则为true，否则为否则","The text to be drawn":"要绘制的文字","The blue component. (0-255)":"蓝色组件。 （0-255）","Optional matrix to be applied to the pixels":"可选矩阵将应用于像素","True if the specified byte array represents a 9-patch data chunk,\n                    false otherwise.":"如果指定的字节数组代表9点数据块，则为true， \n                     否则为错误。","array of 3 scalars [x, y, z] specifying the direction of the light source":"3个标量的数组[x，y，z]指定光源的方向","the x position at which to draw the text":"绘制文本的X位置","May be null. The subset of the bitmap to be drawn":"可能是无效的。 要绘制的位图的子集","The index of the first char to to measure":"衡量的第一个字符的索引","returns the unioned bounds of all the text. Must be allocated by the caller":"返回所有文本的联合界限。 必须由呼叫者分配","Bounds of the destination which the bitmap is translated and scaled to be\n                       drawn into within the bounds of the ":"位图被翻译和缩放为目的地的界限 \n                        被吸引到","The white point to adapt to":"适应的白点","the height of the RenderNode":"渲染的高度","set the paint's extra word-spacing for drawing text in pixels.":"将油漆的额外单词间隔设置为以像素为单位。","Green component \\([0..1]\\) of the color":"颜色的绿色组件\\（[0..1] \\）","The second rectangle being tested for intersection":"第二个矩形正在测试交叉点","the gesture to be sampled":"采样的手势","The y-radius of the oval used to round the corners on the outer rectangle":"椭圆形的Y-Radius用于围绕外部矩形的角落","the right inset":"正确的插图","The input stream that holds the raw data to be decoded into a\n                      bitmap.":"将原始数据解码为一个的输入流 \n                       位图。","The index of the first [x,y] pair of dst floats":"第一[x，y] DST浮子的索引","The amount to add to the y-coordinate of the end of the\n                      previous contour, to specify the start of a new contour":"添加到Y端末端的Y坐标的金额 \n                       以前的轮廓，指定新轮廓的开始","If true, always begin a new contour with the arc":"如果是真的，请始终用弧线开始新的轮廓","The right side of the rectangle to compare with the\n                               current clip":"矩形的右侧与 \n                                当前剪辑","The Y axis translation value of the display list, in pixels":"显示列表的Y轴翻译值，以像素为单位","true if the resulting clip is non-empty":"如果结果剪辑是非空的，则为true","May be null. The typeface to be installed in the paint":"可能是无效的。 油漆中要安装的字体","The x-coordinate of the center of the starting circle of the radial gradient,\n                           often referred to as the focal point.":"径向梯度起始圆的中心的X坐标， \n                            通常被称为焦点。","The alpha component.":"alpha组件。","True if this color is in the sRGB color space, false otherwise":"如果此颜色在SRGB颜色空间中","the y position at which to draw the text":"绘制文本的Y位置","indicates whether the renderer should attempt\n                             to use mipmaps":"指示渲染器是否应该尝试 \n                              使用mipmaps","true if force dark is allowed (default), false if it is disabled":"如果允许黑暗（默认），则为false，如果被禁用，则为false"," this RenderEffect is\n                       installed on":"此Renderefect是 \n                        安装","A 3x3 matrix as a non-null array of 9 floats":"一个3x3矩阵作为9个浮子的非壁阵列","set the paint's elegant metrics flag for drawing text.":"将油漆的优雅指标标志设置为绘制文本。","The paint that will be used to draw this NinePatch.":"将用于绘制这本九调的油漆。","0...1 amount of ambient light":"0 ... 1个环境光","array of chars to measure and return their unioned bounds":"衡量和返回其联盟界限的一系列字符","true if the source should be filtered.\n                   Only applies if the matrix contains more than just\n                   translation.":"如果要过滤源，则为正确。 \n                    仅当矩阵包含的时间不仅仅是 \n                    翻译。","Array of [x,y] positions, used to position each character":"[x，y]位置的数组，用于定位每个字符","The bottom of the rectangle to compare with the\n                               current clip":"矩形的底部与 \n                                当前剪辑","The index of the first [x,y] pair of src floats":"第一[x，y] src浮子的索引","The rectangle that the bitmap will be scaled/translated to fit into":"位图将缩放/翻译以适合的矩形","The end of the text slice to measure":"文本切片的结尾要测量","the paint's extra word-spacing for drawing text in pixels.":"油漆的额外单词间距用于绘制像素的文本。","typeface":"字体","Blue component \\([0..1]\\) of the color":"颜色的蓝色组件\\（[0..1] \\）","the size of the bitmap":"位图的大小","The decoded bitmap, or null if the image data could not be decoded.":"解码的位图，如果无法解码图像数据。","The alpha component. (0-255)":"alpha组件。 （0-255）","Returns the computed bounds of the path's control points.":"返回路径控制点的计算界限。","whether the run is in RTL direction":"运行是否在RTL方向","The y-coordinate of the center of the starting circle of the radial gradient,\n                            often referred to as the focal point.":"径向梯度起始圆的中心的y坐标， \n                             通常被称为焦点。","The amount to add to the x-coordinate of the last point on\n                       this contour, for the control point of a quadratic curve":"添加到最后一个点的x坐标的金额 \n                        此轮廓，对于二次曲线的控制点","The rectangle to perform a difference op with the current clip.":"矩形以使用电流夹执行差异OP。","if true this forces the RenderNode to use an intermediate buffer.\n                                Default & generally recommended value is false.":"如果为true，则迫使渲染使用中间缓冲区。 \n                                 默认值和通常建议的值是错误的。","true iff the two specified rectangles intersect. In no event are\n                         either of the rectangles modified.":"正确，如果FF这两个指定的矩形相交。 在任何情况下都不是 \n                          任何矩形修改了。","the bottom inset":"底部插图","The x-radius of the oval used to round the corners on the inner rectangle":"椭圆形的X-Radius用于圆形矩形的拐角处","the paint's transfer mode (or null)":"油漆的转移模式（或无效）","index of the first char in the array to measure":"阵列中第一个字符的索引要测量","The save level to restore to.":"保存级别要还原。","array to receive the advance widths of the characters.\n                            Must be at least a large as (end - start).":"数组以接收角色的提前宽度。 \n                             必须至少大于（端 - 开始）。","May be null. The xfermode to be installed in the paint":"可能是无效的。 要安装在油漆中的Xfermode","The number of points (x,y pairs) to transform":"要转换的点（x，y对）的数量（x，y对）","An integer between 1 and 4":"1至4之间的整数","The source bitmap.":"源位图。","The Dst pixels used in blending":"混合的DST像素","The paint used for the text (e.g. color, size, style)":"用于文本的油漆（例如颜色，尺寸，样式）","True if this color is in a wide-gamut color space, false otherwise":"如果这种颜色在宽阔的颜色空间中，则为thus，否则","true if the renderer should attempt to use mipmaps,\n                    false otherwise":"如果渲染器应该尝试使用mipmaps，则为真实， \n                     否则为错误","the rect to populate with the outline bounds, if set":"如果设置","The position of the left side of the bitmap being drawn":"绘制位图的左侧的位置","coefficient for specular highlights (e.g. 8)":"镜头亮点系数（例如8）","Whether or not a pivot was explicitly set with ":"是否明确设置了一个枢轴","The alpha component of the color.":"颜色的α组件。","The rectangle that specified the region to be decode.":"指定要解码区域的矩形。","A float value with a range defined by the specified color's\n            color space":"具有指定颜色定义的范围的浮点值 \n             色彩空间","true if elegant metrics are enabled for text drawing.":"如果启用了文本绘图，则是正确的，如果启用了优雅的指标。","The left side of the rectangle used in the difference operation":"差异操作中使用的矩形的左侧","Insets instance with the appropriate values":"具有适当值的插入实例","The radius of the starting circle of the radial gradient, often referred\n                               to as the focal radius. Must be greater than or equal to zero.":"径向梯度的起始圆的半径，通常是转介 \n                                作为焦点半径。 必须大于或等于零。","a bitmapSize x bitmapSize grayscale bitmap that is represented \n                    as a 1D array. The float at index i represents the grayscale \n                    value at pixel [i%bitmapSize, i/bitmapSize]":"一个位图的位图x位示意图灰度位图表示 \n                     作为1D阵列。 索引I代表灰度的漂浮物 \n                     在Pixel [i％bitmapsize，i/bitmapsize]的值","the paint":"油漆","The amount to add to the y-coordinate of the last point on\n                       this contour, for the control point of a quadratic curve":"添加到最后一个点的y坐标的金额 \n                        此轮廓，对于二次曲线的控制点","Array of glyph IDs. The length of array must be greater than or equal to\n                            ":"字形阵列是。 阵列的长度必须大于或等于","This parameter is no longer used.":"此参数不再使用。","The left side of the rectangle being tested for intersection":"矩形的左侧进行了交叉的测试","The blend mode, alpha, and ColorFilter to apply to the compositing layer.\n                                Only applies if forceToLayer is true. The paint's alpha is multiplied\n                                with ":"混合模式，alpha和ColorFilter适用于合成层。 \n                                 仅在Forcetolayer为真时适用。 油漆的alpha乘以 \n                                 和","xfermode":"Xfermode","The rectangle to transform.":"矩形要转换。"," was populated with outline\n                    bounds, or ":"被大纲填充 \n                     范围，或","the actual number of widths returned.":"返回的实际宽度数。","the number of chars, beginning at index, to measure":"从索引开始的字符数量，以测量","The Src pixels used in blending":"用于混合的SRC像素","A value between 0 (darkest black) and 1 (lightest white)":"0（最黑的黑色）和1（最轻的白色）之间的值","amount to blur before applying lighting (e.g. 3)":"在施加照明之前，等同于模糊（例如3）","The position of the top side of the bitmap being drawn":"绘制位图的顶部的位置","The color space to convert colors from":"转换颜色的颜色空间","true if the underlying pixels have been pre-multiplied, false\n                    otherwise":"如果底层像素已经预先塑造，则为false \n                     否则","The new bitmap's desired width.":"新的位图的所需宽度。","These bits will be cleared in the paint's flags":"这些位将在油漆的旗帜中清除","The amount to rotate, in degrees":"旋转的数量以度数","The index of the first character to draw":"第一个字符的索引",". If no pivot has been set then the pivot will be the center\n            of the RenderNode.":"。 如果没有设置枢轴，则枢轴将是中心 \n             Rendernode。","Number of elements to skip before drawing in <code>glyphIds</code>\n                                array.":"在绘制<code>滑翔机</code>之前要跳过的元素数量 \n                                 大批。","null-ok; Options that control downsampling.\n                        inPurgeable is not supported.":"null-ok; 控制下采样的选项。 \n                         不支持不可能。","The blue component of the color.":"颜色的蓝色组件。","A non-null instance of ":"一个非记录实例","a end hyphen edit value.":"端连字符编辑值。","a - b, i. e. all insets on every side are subtracted from each other.":"a -b，我。 e。 每一侧的所有插图彼此减去。","the start of the text to render":"文本开始渲染","The amount to add to the x-coordinate of the last point on\n                       this contour, for the end point of a quadratic curve":"添加到最后一个点的x坐标的金额 \n                        此轮廓，对于二次曲线的终点","The x-coordinate of the center of the radius for the end circle of the\n                            radial gradient":"半径的X坐标，用于末端圆的末端圆 \n                             径向梯度","The x-coordinate of the 1st control point on a cubic curve":"立方曲线上第一控制点的X坐标","if the scaling should keep the gesture's \n                   aspect ratio":"如果缩放应保持手势 \n                    纵横比"," to resolve the final alpha of the RenderNode.\n                                If null then no additional composition effects are applied on top of the\n                                composition layer.":"解决Rendernode的最终alpha。 \n                                 如果无效，则不会在顶部上应用其他组成效应 \n                                 组成层。","The top of the rectangle used in the difference operation":"差异操作中使用的矩形顶部","the result of calling rectStaysRect()":"调用RectStaySrect（）的结果"," if no outline bounds are set":"如果未设置大纲范围","The top of the rectangle being tested for intersection":"矩形的顶部正在测试交叉点","a value between 0 (darkest black) and 1 (lightest white)":"0（最黑的黑色）和1（最轻的白色）之间的值","A flattened X and Y position array. The first glyph X position must be\n                             stored at ":"一个扁平的X和Y位置阵列。 第一个字形X位置必须是 \n                              存储在","the paint's shader (or null)":"油漆的着色器（或无效）"," to be used to combine colors from the two\n                             ":"用于结合两者的颜色","the emboss maskfilter":"浮雕面罩","These bits will be set in the paint's flags":"这些位将设置在油漆的旗帜中","A non-null connector between the specified color space and sRGB":"指定的颜色空间和SRGB之间的非无效连接器","The number of characters to draw, starting from index.":"从索引开始要绘制的字符数。","The amount to add to the y-coordinate of the last point on\n                       this contour, for the end point of a quadratic curve":"添加到最后一个点的y坐标的金额 \n                        此轮廓，对于二次曲线的终点","string to measure and return its bounds":"量衡量和返回其界限","The new bitmap's desired height.":"新的位图的所需高度。","the left position in pixels":"像素的左位置","The x-coord for the pivot point (unchanged by the rotation)":"枢轴点的X涂层（旋转不变）","The paint used to draw the bitmap (may be null)":"用于绘制位图的油漆（可能为空）","The y-coordinate of the 1st control point on a cubic curve":"立方曲线上第一控制点的Y坐标","the current starting hyphen edit value":"当前的起始连字符编辑值","The right side of the rectangle used in the difference operation":"差异操作中使用的矩形的右侧","Where the transformed rectangle is written.":"写入转换的矩形的地方。","the argb color to convert. The alpha component is ignored.":"argb颜色要转换。 alpha组件被忽略。","Source outline to copy from.":"源大纲要复制。","the count of chars to render":"渲染炭的数量","The number of chars starting with index to measure":"从索引开始的字符数量","the gesture stroke to be sampled":"采样的手势中风","The decoded bitmap, or null if the image data could not be\n                    decoded.":"解码的位图，或者如果图像数据不可用 \n                     解码。","The y-coordinate of the center of the radius for the end circle of the\n                            radial gradient":"半径的Y坐标端圆圈的末端圆圈 \n                             径向梯度","The index of the key frame to assign":"要分配的关键框架的索引","Other Color struct.":"其他颜色结构。","true if the source should be filtered.":"如果要过滤源，则为正确。","true if the bitmap has been recycled":"如果位图已回收，则是真的",", or black if nothing\n            was set":"，或黑色的话 \n             被设置了","The right side of the rectangle being tested for\n                         intersection":"矩形的右侧进行了测试 \n                          路口","Radius of blur along the X axis":"沿x轴模糊半径",". The instance may be reused for every\n            frame, so the caller should not hold onto it for longer than a single render request.":"。 该实例可以重复使用 \n             框架，因此呼叫者不应比单个渲染请求更长。","Array of colors representing the pixels of the bitmap":"代表位图的像素的颜色数组","A color long":"颜色长","the shadow layer's color encoded as a ":"阴影层的颜色编码为",". The first glyph Y position must be stored\n                             at ":"。 必须存储第一个字形y位置 \n                              在","The x-coordinate of the 2nd control point on a cubic curve":"立方曲线上第二控制点的X坐标","index of the first char in the string to measure":"字符串中的第一个字符的索引要测量","The rectangle to be drawn.":"要绘制的矩形。","The new fill type for this path":"此路径的新填充类型","The ColorSpace to wrap. The ColorSpace must be either named or be an\n                              RGB ColorSpace with an ICC parametric transfer function.":"包装的色彩空间。 颜色空间必须命名或为 \n                               带有ICC参数传输功能的RGB Colorspace。","The amount that the left and right positions are offset in pixels":"左右位置以像素的抵消数量","The time (in mililiseconds) for this key frame. Based on the\n                   SystemClock.uptimeMillis() clock":"此关键框架的时间（以mililiseconds为单位）。 基于 \n                    systemclock.uptimillis（）时钟","The y-coord for the pivot point (unchanged by the rotation)":"枢轴点的Y型涂层（旋转不变）","the top position in pixels":"像素中的最高位置","true if the region decoder has been recycled":"如果区域解码器已回收，则为thue","An array of color components containing the XYZ values\n                     to convert from, and large enough to hold the number\n                     of components of this color space's model":"包含XYZ值的颜色组件数组 \n                      从中转换，足够大以保持数字 \n                      该颜色空间模型的组件","number of bytes between rows of the native bitmap pixels.":"本机位图像素行之间的字节数。","3 element array which holds the resulting HSV components.":"3个元素数组，可容纳所得的HSV组件。","used to construct the Outline. As of\n            ":"用于构建大纲。 作为","True if the structs are equal, otherwise, False.":"如果结构相等，则为错误，否则是错误的。","The bottom of the rectangle used in the difference operation":"差异操作中使用的矩形底部","the start of the context for shaping. Must be no greater than index.":"塑造上下文的开始。 必须不比索引大。","true if the other ":"如果另一个","The density scaling factor to use with this bitmap or\n                   ":"与此位图一起使用的密度缩放系数或","the number of points":"积分数","The original rectangle to be transformed.":"原始矩形要转换。","The radius of the ending circle for this gradient. This must be strictly\n                               greater than zero. A radius value equal to zero is not allowed.":"该梯度的末端圆的半径。 这一定是严格的 \n                                大于零。 不允许等于零的半径值。","Offset into the array of colors for the first pixel":"偏移到第一个像素的颜色数组","array to receive the advance widths of the characters.\n                            Must be at least a large as count.":"数组以接收角色的提前宽度。 \n                             必须至少大于计数。","The bottom of the rectangle being tested for intersection":"矩形的底部正在测试交叉点","The new X coordinate for the last point":"最后一点的新X坐标",", then the second glyph X position must be\n                             stored at ":"，然后第二个字形X位置必须为 \n                              存储在","the backing ColorSpace that this ParcelableColorSpace is wrapping.":"这个ParcelableColorSpace包装的背面色空间。","The ARGB color int to convert to an RGBA color long in sRGB":"argb颜色int可转换为srgb中的rgba颜色","The y-coordinate of the 2nd control point on a cubic curve":"立方曲线上第二控制点的Y坐标","true if the content rendered is opaque, false if the renderer should clear\n                          to transparent before rendering":"如果呈现的内容不透明，则为true，如果渲染器应清除，则为false \n                           在渲染之前透明","The paint used to draw the rectangle":"用于绘制矩形的油漆","Radius of blur along the Y axis":"沿y轴模糊半径","the unique ID for this RenderNode":"此渲染的唯一ID","a start hyphen edit value.":"开始连字符编辑值。","True if the value changed, false if the new value was the same as the previous value.":"正确，如果值更改，则为false，如果新值与上一个值相同。","Array of values associated with theis key frame":"与theis关键框架关联的值数组","1 past the last char in the string to measure":"1个过去的字符字符中的1个以进行测量","The value to pass to restoreToCount() to balance this save()":"传递到Restoretocount（）以平衡此保存（）的值",".\n                            The length of array must be greater than or equal to\n                            ":"。 \n                             阵列的长度必须大于或等于","The parcel file descriptor containing the data to decode":"包含要解码数据的包裹文件描述符","The array passed in parameter":"参数传递的数组","The number of colors in the array between rows (must be\n               >= width or <= -width).":"行之间的阵列中的颜色数（必须是 \n                > =宽度或<= -Width）。","the string to test whether there is glyph support":"测试是否有字形支持的字符串","the number of characters in the context for shaping. contexIndex +\n                       contextCount must be no less than index + count.":"上下文中的字符数量。 CONTEX索引 +上下文计数必须不小于索引 +计数。","The path to copy from when initializing the new path":"初始化新路径时复制的路径","the sampled points in the form of [x1, y1, x2, y2, ..., xn, yn]":"以[x1，y1，x2，y2，...，xn，yn]的形式采样点","The integer 4 or 5":"整数4或5"," has the same effect on text measurement.":"对文本测量具有相同的影响。","The array [x0, y0, x1, y1, ...] of vectors to transform.":"向量转换的阵列[x0，y0，x1，y1，...]。"," if the density is unknown.":"如果密度未知。","The x coordinate of the pixel to replace (0...width-1)":"像素的X坐标替换（0 ... width-1）","true if a compositing layer is forced, false otherwise":"如果强制组合层，则为true，否则为否","The x-coordinate of the end point on a cubic curve":"立方曲线上终点的X坐标","The rectangle whose coordinates are copied into the new\n                     rectangle.":"将坐标复制到新的矩形 \n                      长方形。",", it is no longer required to be\n            convex.":"，不再需要 \n             凸。","The path to intersect with the current clip":"与电流夹相交的路径","The green component of the color.":"颜色的绿色组件。","The new Y coordinate for the last point":"最后一点的新Y坐标","the text to retrieve the path from":"从","the right position in pixels":"像素的正确位置","true iff the specified rectangle intersects this rectangle. In\n                         no event is this rectangle modified.":"tre Iff，指定的矩形与此矩形相交。 在 \n                          该矩形修改没有任何事件。","true if the renderer is opaque, false otherwise":"如果渲染器不透明，则为true，否则为否则","The rect to be drawn":"要绘制的矩","The red component of the sRGB color to create, in \\([0..1]\\)":"SRGB颜色的红色组件要创建，in \\（[0..1] \\）","the position of the strike-through line in pixels":"像素在像素中的罢工线的位置","Policy for how to blur content near edges of the blur kernel":"如何模糊内容的政策在模糊内核边缘附近","flag bits that specify which parts of the Canvas state\n                  to save/restore":"指定画布状态哪些部分的标志位 \n                   保存/还原","(may be null) Optional array of 4 blend values":"（可能为null）4个混合值的可选阵列","used to construct the Outline.":"用于构建大纲。","How to interpret the array of vertices":"如何解释顶点数组","The input stream that holds the raw data to be decoded into a\n                      BitmapRegionDecoder.":"将原始数据解码为一个的输入流 \n                       bitmapregiondecoder。","Alpha component [0-255].":"alpha组件[0-255]。","to assign to the bitmap":"分配到位图","the index of the first character in text":"文本中第一个字符的索引","The bounds of oval defining the shape and size of the arc":"椭圆形的边界，定义弧的形状和大小","true if the typeface has a glyph for the string":"如果字体有字符串的字形，则为true","The array of dst vectors (x,y pairs)":"DST矢量的数组（x，y对）","The X component of the color value":"颜色值的X组件","The y coordinate of the pixel to replace (0...height-1)":"像素的Y坐标替换（0 ...高1）","Number of elements to skip before drawing in ":"绘制之前要跳过的元素数量","true to set the fakeBoldText bit in the paint's\n                                flags, false to clear it.":"是真的在油漆中设置假粘合物位 \n                                 旗帜，错误清除。","The y-coordinate of the end point on a cubic curve":"立方曲线上终点的Y坐标","the width of the RenderNode":"渲染的宽度","The translucency of the display list, must be a value between 0.0f and 1.0f":"显示列表的透明度必须是0.0F和1.0F之间的值","The content to set as the root RenderNode. If null the content root is removed\n                           and the renderer will draw nothing.":"要将其设置为root Rendernode的内容。 如果null删除了内容根 \n                            渲染器一无所获。","The amount to add to the rectangle's left and right coordinates":"添加到矩形的左右坐标中的金额","How the clip is modified":"剪辑如何修改","The matrix to apply to the path":"矩阵应用于路径","The X coordinate for where to draw the bitmap":"x坐标以绘制位图","A scaling factor of the default density or ":"默认密度或","the horizontal center of the rectangle. If the computed value\n                    is fractional, this method returns the largest integer that is\n                    less than the computed value.":"矩形的水平中心。 如果计算值 \n                     是分数，此方法返回最大的整数 \n                     小于计算值。","The paint used to draw the rect":"用于绘制矩形的油漆","The destination color space, cannot be null":"目的地颜色空间，不能为空","The green component of the sRGB color to create, in \\([0..1]\\)":"SRGB颜色的绿色组件要创建，in \\（[0..1] \\）","The number of values in the vertices array (and corresponding texs and\n                       colors arrays if non-null). Each logical vertex is two values (x, y), vertexCount\n                       must be a multiple of 2.":"顶点数组中的值数（以及相应的Texs和 \n                        颜色阵列如果非挂钩）。 每个逻辑顶点是两个值（x，y），vertexcount \n                        必须是2的倍数。","Input RenderEffect that provides the content to be blurred, can be null\n                               to indicate that the drawing commands on the RenderNode are to be\n                               blurred instead of the input RenderEffect":"输入Renderefect提供了要模糊的内容，可以为null \n                                指示渲染上的绘图命令将是 \n                                模糊而不是输入rendereffect","Existing paint used to initialized the attributes of the\n                         new paint.":"现有的油漆用于初始化的属性 \n                          新油漆。","Where to write the computed values (may be NULL).":"在哪里编写计算值（可能为null）。","true to set the strikeThruText bit in the paint's\n                                  flags, false to clear it.":"确实在油漆中设置strikeThrutext \n                                   旗帜，错误清除。","The ARGB color to write into the bitmap":"argb颜色要写入位图","May be null. The maximum size the offscreen render target\n                          needs to be (in local coordinates)":"可能是无效的。 最大尺寸在屏幕外渲染目标 \n                           需要（在本地坐标中）","The array of src vectors (x,y pairs)":"SRC矢量的阵列（x，y对）","The color this RenderNode will cast for its elevation shadow.":"这种渲染的颜色将为其高程阴影施放。","the number of characters starting with index":"以索引开头的字符数","The x-coordinate of the center of a circle to add to the path":"圆的中心的X坐标添加到路径","Blue component [0-255].":"蓝色组件[0-255]。","A non-null color instance in the specified color space":"指定的颜色空间中的非无彩色实例","\n                    if the scaling factor is unknown.":"如果缩放因子未知。","true if the fakeBoldText bit is set in the paint's flags.":"是的，如果伪造的钻头设置在油漆的标志中。","The format of the compressed image":"压缩图像的格式","the vertical center of the rectangle. If the computed value\n                    is fractional, this method returns the largest integer that is\n                    less than the computed value.":"矩形的垂直中心。 如果计算值 \n                     是分数，此方法返回最大的整数 \n                     小于计算值。","The blue component of the sRGB color to create, in \\([0..1]\\)":"SRGB颜色的蓝色组件要创建，在\\（[0..1] \\）中","A new BitmapRegionDecoder, or ":"一个新的位图二核编码器或","The Y coordinate for where to draw the bitmap":"y坐标用于绘制位图的位置","the path's fill type":"路径的填充类型","The alpha for the ambient shadow. If unsure, a reasonable default\n                                      is 0.039f.":"环境阴影的alpha。 如果不确定，合理的默认值 \n                                       为0.039f。","The left side of the rectangle to be drawn":"绘制矩形的左侧","Set to the local matrix of the shader, if the shader's matrix is non-null.":"如果着色器的矩阵是非编号，则将其设置为着色器的本地矩阵。","The Y component of the color value":"颜色值的Y组成部分",".\n                                  The first glyph X position must be stored at ":"。 \n                                   第一个字形X位置必须存储在","The transformed path is written here. If dst is null,\n                          then the the original path is modified":"转换的路径在这里写。 如果DST为null， \n                           然后修改了原始路径","set the paint's letter-spacing for drawing text.":"设置油漆的字母间距，以绘制文本。","The rectangle to intersect with the current clip.":"矩形与电流夹相交。","Array of vertices for the mesh":"网格的顶点阵列","The amount to add to the rectangle's top and bottom coordinates":"添加到矩形的顶部和底部坐标的数量"," bit is set in the paint's flags.":"位设置在油漆的标志中。","how the values were computed (even if values == null)":"如何计算值（即使值== null）","The distance in pixels, must always be positive":"像素中的距离必须始终为正","The colors to write to the bitmap":"写入位图的颜色","Green component [0-255].":"绿色组件[0-255]。","ColorFilter applied to the content in the input RenderEffect":"ColorFilter应用于输入RendereFect中的内容","The number of vectors (x,y pairs) to transform":"向量的数量（x，y对）转换","The y-coordinate of the center of a circle to add to the path":"圆的中心的y坐标以添加到路径","The sRGB color int to convert":"srgb颜色int转换","initial flag bits, as if they were passed via setFlags().":"初始标志位，好像它们是通过setflags（）通过的。","This is copied, and is applied to the offscreen when\n                          restore() is called.":"这是复制的，当 \n                           restore（）被调用。","The alpha for the spot shadow. If unsure, a reasonable default is\n                                      0.19f.":"现场阴影的alpha。 如果不确定，合理的默认值为 \n                                       0.19f。","the x coordinate of the text's origin":"文本起源的X坐标","The rectangle being tested for containment.":"矩形被测试以遏制。","The rect to intersect with the current clip":"与电流夹相交的矩","The color to fill as packed by the ":"填充的颜色被包装","The path to stamp along":"沿邮票的途径","The new \"left\" coordinate for the rectangle":"矩形的新“左”坐标","The alpha component of the sRGB color to create, in \\([0..1]\\)":"SRGB颜色的α分量要创建，in \\（[0..1] \\）","The file descriptor containing the data to decode":"文件描述符，其中包含要解码的数据","Hint to the compressor, 0-100. The value is interpreted\n                            differently depending on the ":"提示压缩机，0-100。 值解释 \n                             不同于不同的","True if the alpha channel of the colors contains valid\n                 values. If false, the alpha byte is ignored (assumed to\n                 be 0xFF for every pixel).":"如果颜色的alpha频道包含有效 \n                  值。 如果是错误的，则忽略alpha字节（假定为 \n                  每个像素为0xff）。","The top side of the rectangle to be drawn":"要绘制的矩形的顶部","The Z component of the color value":"颜色值的z组件","The number of extra points that may be added to this\n                                path":"可能会添加的额外点数 \n                                 小路","Red component [0-255].":"红色组件[0-255]。","the paint's letter-spacing for drawing text.":"油漆的绘制文本绘制字母间隔。","true if the shader has a non-identity local matrix":"如果着色器具有非身份本地矩阵",".\n                                  The first glyph Y position must be stored at\n                                  ":"。 \n                                   必须将第一个字形y位置存储在","true to set the FILTER_BITMAP_FLAG bit in the paint's\n                          flags, false to clear it.":"正确设置paint中的filter_bitmap_flag位 \n                           旗帜，错误清除。","The time (in milliseconds) used to sample into the\n                   Interpolator. Based on the SystemClock.uptimeMillis() clock":"用来采样的时间（以毫秒为单位） \n                    插造器。 基于systemclock.uptimillis（）时钟","Number of values in the verts to skip before drawing.":"在绘图之前，要跳过的值中的值数。","Source to be transformed by the specified ":"来源要由指定的","the line cap style for the paint, used whenever the paint's\n                    style is Stroke or StrokeAndFill.":"涂料的线盖样式，每当油漆的 \n                     样式是中风或strokeandfill。","the bounds to clip to. If null, the additional clip is removed.":"夹夹的边界。 如果无效，则删除附加夹。","The new \"top\" coordinate for the rectangle":"矩形的新“顶部”坐标","The destination color space":"目的地颜色空间","The array of src [x,y] pairs (points)":"src [x，y]对的数组（点）","This field has been ignored since\n                               ":"从那以后就被忽略了","The X position of the light source":"光源的X位置","The radius of a circle to add to the path":"一个圆的半径添加到路径上",", then the second glyph X position must be\n                                  stored at ":"，然后第二个字形X位置必须为 \n                                   存储在","value to pass to restoreToCount() to balance this save()":"价值传递到RestorEtocount（）以平衡此保存（）","The index of the first color to read from pixels[]":"从像素读取的第一种颜色的索引[]","true iff the specified rectangle r is inside or equal to this\n                         rectangle":"是的，如果指定的矩形R在内部或等于此 \n                          长方形","The first Color to compare.":"比较的第一种颜色。"," to draw to.":"画。","the y coordinate of the text's origin":"文本起源的y坐标","The right side of the rectangle to be drawn":"绘制矩形的右侧","The left side of the rectangle to intersect with the\n                          current clip":"矩形的左侧与 \n                           当前剪辑","The red component of the color to create":"颜色的红色组件要创建","new bitmap containing the alpha channel of the original bitmap.":"包含原始位图的alpha通道的新位图。","The outputstream to write the compressed data.":"输出流以编写压缩数据。","The new flag bits for the paint":"油漆的新旗","The shader's new local matrix, or null to specify identity":"着色器的新局部矩阵或null以指定身份","set the alpha component [0..255] of the paint's color.":"设置油漆颜色的α组件[0..255]。","The bitmap to draw using the mesh":"使用网格绘制的位图","May be null. If not null, specifies the coordinates to sample into the current\n                       shader (e.g. bitmap tile or gradient)":"可能是无效的。 如果未零，则指定坐标以采样到当前 \n                        着色器（例如位图瓷砖或梯度）","The second operand (for difference, the subtrahend)":"第二个操作数（差异，子图）","spacing between each stamp of shape":"每张邮票之间的间距","A new array whose size is equal to the number of color\n                    components as returned by ":"一个大小等于颜色数量的新数组 \n                     返回的组件","offset along the x axis in pixels":"沿着像素的X轴偏移","true to set the linearText bit in the paint's flags,\n                              false to clear it.":"确实在油漆标志中设置线性文本位， \n                               错误清除它。","Number of glyphs to be drawn.":"要画的字形数量。","The number of colors in pixels[] to skip between rows.\n                            Normally this value will be the same as the width of\n                            the bitmap, but it can be larger (or negative).":"像素中的颜色数量[]在行之间跳过。 \n                             通常，此值将与宽度相同 \n                             位图，但可能更大（或负）。","May be null. The maximum size the offscreen bitmap\n                          needs to be (in local coordinates)":"可能是无效的。 最大尺寸在屏幕外部图 \n                           需要（在本地坐标中）","The direction to wind the circle's contour":"缠绕圆形轮廓的方向","Index of the first pair of src values":"第一对SRC值的索引","A color long in the destination color space":"目的地颜色空间中的颜色长","the alpha component of the paint's color.":"油漆颜色的α组成部分。","The bottom side of the rectangle to be drawn":"绘制矩形的底部","This field has always been ignored.":"该领域一直被忽略。","The Y position of the light source":"光源的Y位置","The X coordinate of the point being tested for containment":"测试的点的X坐标","The top of the rectangle to intersect with the current clip":"矩形的顶部与电流夹相交","The second Color to compare.":"比较的第二种颜色。","the path to receive the data describing the text. Must be allocated by the caller":"接收描述文本的数据的路径。 必须由呼叫者分配","The parcel to read the rectangle's coordinates from":"包裹以阅读矩形的坐标","whether the SurfaceTexture will be in single buffered mode.":"SurfaceTexture是否处于单个缓冲模式。","The green component of the color to create":"颜色的绿色组件要创建","true if successfully compressed to the specified stream.":"如果成功地压缩到指定的流，则为正确。","true if the display list should clip to its bounds, false otherwise.":"正确，如果显示列表应夹在其边界上，则否则为false。","The number of columns in the mesh. Nothing is drawn if this is 0":"网格中的列数。 如果这是0","Optional paint used to modify the alpha values in the\n                         resulting bitmap. Pass null for default behavior.":"可选的油漆用于修改Alpha值 \n                          结果位图。 通过null以实现默认行为。","the paint's Join.":"油漆的加入。","the paint's flags (see enums ending in _Flag for bit masks)":"油漆的标志（请参阅im thim _flag的枚举）","Opacity of the result after drawing.\n                 ":"绘制后结果的不透明度。","offset along the y axis in pixels":"沿着像素的Y轴偏移","Number of values in texs to skip before drawing.":"在绘图之前，得克萨斯州的值数量。","The index of the component":"组件的索引","amount to offset before the first shape is stamped":"在盖章之前，等同于抵消","see _SAVE_FLAG constants, generally ":"参见_save_flag常数，通常","True if operation succeeded, false otherwise and this path remains unmodified.":"如果操作成功，则为错误，否则为错误，此路径仍未修改。","true if the lineartext bit is set in the paint's flags":"如果在油漆的标志中设置了线性文本位","Font used for drawing.":"字体用于绘图。","true if clipping to the outline.":"如果剪切到大纲，则为thue。","byte array of compressed image data.":"压缩图像数据的字节数组。","The bounds of the oval to add as a closed contour to the path":"椭圆形的边界以添加为封闭轮廓到路径","true to set the antialias bit in the flags, false to clear it":"确实在标志中设置the antialias位，错误地清除它","The x coordinate of the first pixel to write to in\n                            the bitmap.":"第一个像素的X坐标 \n                             位图。","The array of dst [x,y] pairs (points)":"dst [x，y]对的数组（点）","The desired config for the resulting bitmap":"结果位图的所需配置","The Y coordinate of the point being tested for containment":"测试的点的Y坐标","The rectangle whose coordinates are copied into this\n                      rectangle.":"将坐标复制到此的矩形 \n                       长方形。","The right side of the rectangle to intersect with the\n                          current clip":"矩形的右侧与 \n                           当前剪辑","The number of rows in the mesh. Nothing is drawn if this is 0":"网格中的行数。 如果这是0","the first character in the text":"文本中的第一个字符","The RenderNode to draw, must be non-null.":"要绘制的渲染，必须是非效果。","The blue component of the color to create":"颜色的蓝色组件要创建","The color long to convert":"颜色很长以转换","the OpenGL texture object name (e.g. generated via glGenTextures)":"OpenGL纹理对象名称（例如，通过GlgentExtures生成）","The Z position of the light source. Must be >= 0.":"光源的Z位置。 必须为> = 0。","True if the Colors are equal, otherwise False.":"如果颜色相等，则为否则为错误。"," means that the\n                 implementation did not change whether the image has alpha. Return\n                 this unless you added transparency (e.g. with the code above, in\n                 which case you should return\n                 ":"意味着 \n                  实现没有改变图像是否具有alpha。 返回 \n                  除非您添加透明度（例如，使用上面的代码， \n                  你应该返回的那种情况","Optional array that returns the X (index 0) and Y\n                            (index 1) offset needed to position the returned bitmap\n                            so that it visually lines up with the original.":"返回x（索引0）和y的可选数组 \n                             （索引1）定位返回的位图所需的偏移 \n                             因此，它可以视觉上与原件对齐。","set the miter limit on the paint, used whenever the paint's\n                         style is Stroke or StrokeAndFill.":"在油漆上设置斜切限制，每当油漆 \n                          样式是中风或strokeandfill。","the font feature settings string to use, may be null.":"字体功能设置字符串可能为空。","The first operand (for difference, the minuend)":"第一台操作数（差异，最小值）","target RenderEffect used to render in the offset coordinates.":"目标renderefect用于在偏移坐标中渲染。"," is recommended\n                          for performance reasons.":"被推荐 \n                           出于绩效原因。","A floating point value greater than ":"浮点值大于","how to transform the shape at each position as it is stamped":"如何在盖章时在每个位置上改变形状","Paint used for drawing. The typeface set to this paint is ignored.":"用于绘画的油漆。 设置为该油漆的字体被忽略。","Index of the first pair of dst values":"第一对DST值的索引","1 past the last character in the text":"文本中的最后一个角色","May be null. If not null, specifies a color for each vertex, to be interpolated\n                       across the triangle.":"可能是无效的。 如果不是零，则为每个顶点指定颜色，以插值 \n                        穿过三角形。","True if the clipToOutline value changed, false if previous value matched the new\n                    value.":"如果更改CliptoOutline值，则为true，如果以前的值匹配新的值 \n                     价值。","The direction to wind the oval's contour":"缠绕椭圆形轮廓的方向","The y coordinate of the first pixel to write to in\n                            the bitmap.":"第一个像素的Y坐标 \n                             位图。","the paint's maskfilter (or null)":"油漆的口罩纤维（或无效）",") or you\n                 forced the image to be opaque (e.g. by drawing everywhere with an\n                 opaque color and ":"） 或者您 \n                  强迫图像是不透明的（例如，通过 \n                  不透明的颜色和","offset into data for where the decoder should begin\n                          parsing.":"抵消解码器应在哪里开始的数据 \n                           解析。","Array of x,y pairs, specifying where the mesh should be drawn. There must be at\n                       least (meshWidth+1) * (meshHeight+1) * 2 + vertOffset values in the array":"x，y对的数组，指定应绘制网格的位置。 一定有 \n                        最少（Meshwidth+1） *（Meshheight+1） * 2+数组中的Vertoffset值","True if the resulting bitmap should be mutable (i.e.\n                             its pixels can be modified)":"如果由此产生的位图应该是可变的（即 \n                              它的像素可以修改）","The left side of the rectangle being tested for containment":"矩形的左侧进行了测试","The rectangular bounds of the roundRect to be drawn":"要绘制的圆形的矩形边界","true if the antialias bit is set in the paint's flags.":"如果在油漆的标志中设置了attialias位，则是的。","The radius of the light source. Smaller radius will have sharper edges,\n                               larger radius will have softer shadows.":"光源的半径。 较小的半径将具有更清晰的边缘， \n                                较大的半径将具有更柔和的阴影。","Color struct to be cast to an integer.":"颜色结构将被铸成整数。","The X coordinate of the left side of the rectangle":"矩形左侧的X坐标","The name of the OpenGL ES texture that will be created.  This texture name\n            must be unusued in the OpenGL ES context that is current on the calling thread.":"将创建的OpenGL ES纹理的名称。 此纹理名称 \n             必须在调用线程上当前的openGL ES上下文中不使用。","The bottom of the rectangle to intersect with the current\n                          clip":"矩形的底部与电流相交 \n                           夹子","the paint's currently set font feature settings. Default is null.":"油漆当前设置的字体功能设置。 默认为null。","The alpha component of the color to create, in \\([0..1]\\)":"在\\（[0..1] \\）中创建的颜色的alpha组件","The red component of the color to convert":"颜色的红色组件转换","the paint's miter limit, used whenever the paint's style is\n                    Stroke or StrokeAndFill.":"涂料的斜切极限，每当油漆的样式是 \n                     中风或strokeandfill。","The name of the RenderNode, used for debugging purpose. May be null.":"Rendernode的名称，用于调试目的。 可能是无效的。","new bitmap containing the (optionally modified by paint) alpha\n                    channel of the original bitmap. This may be drawn with\n                    Canvas.drawBitmap(), where the color(s) will be taken from the\n                    paint that is passed to the draw call.":"包含（可选的涂料修改）alpha的新位图 \n                     原始位图的频道。 这可以用 \n                     canvas.drawbitmap（），颜色将从 \n                     传递给抽奖电话的油漆。","The x-coordinate of the start point of the line":"线的起点的X坐标","A floating point value less than ":"浮点值小于","The number of pairs/points to be used. Must be [0..4]":"对使用的对/点的数量。 必须是[0..4]","The path that will be measured by this object":"该对象将测量的路径","True if the path is convex.":"如果路径为凸面，则为正确。","the elevation in pixels":"像素的高程","The width of the text":"文本的宽度","Number of values in colors to skip before drawing.":"绘图前要跳过的颜色值数量。","the text to measure.":"要测量的文字。","The number of colors to copy from pixels[] per row":"每行从像素[]复制的颜色数","The top of the rectangle being tested for containment":"矩形的顶部被测试","The maximum size the offscreen bitmap needs to be\n                             (in local coordinates)":"屏幕外位图的最大尺寸必须为 \n                              （在本地坐标中）","The bitmap to use inside the shader":"着色器内使用的位图","The path that is appended to the current path":"附加到当前路径的路径","the array into which the 4x4 matrix will be stored.  The array must have exactly\n                16 elements.":"将存储4x4矩阵的阵列。 阵列必须完全有 \n                 16个元素。","Number of verts elements to skip before drawing":"绘图之前要跳过的Verts元素数量","recommend line spacing based on the current typeface and\n                     text size.":"根据当前字体推荐线间距，并 \n                      字体大小。","The green component of the color to convert":"颜色的绿色组件转换","The x-radius of the oval used to round the corners":"椭圆形的X-Radius用来圆角","The region to operate on the current clip, based on op":"基于OP上在当前剪辑上操作的区域","The Y coordinate of the top of the rectangle":"矩形顶部的Y坐标","Integer representation of the Color.":"整数表示颜色。","A value between 0.0f and 1.0f":"0.0F和1.0F之间的值",",\n                 in which case you should return ":"，，，， \n                  在这种情况下，您应该返回","the distance above (negative) the baseline (ascent) based on the\n                    current typeface and text size.":"基于基线（负）的距离（负）基于 \n                     当前字体和文本大小。","The color long whose red channel to extract":"颜色长，其红色通道提取","the new bitmap, or null if the copy could not be made.":"新的位图，如果无法制作副本，则为空。","The current generation ID for this bitmap.":"此位图的当前一代ID。","set the paint's stroke width, used whenever the paint's\n                         style is Stroke or StrokeAndFill.":"设置油漆的中风宽度，每当油漆 \n                          样式是中风或strokeandfill。","The debug name to use for this HardwareRenderer instance":"用于此HardWarerenderer实例的调试名称","The y-coordinate of the start point of the line":"线的起点的y坐标",").\n                 ":"）。","Whether or not to allow force dark.":"是否允许强迫黑暗。","The alpha to apply to the offscreen when it is\n                                    drawn during restore()":"当它申请的alpha时 \n                                     在还原期间绘制（）","The index of the first character to start measuring":"第一个字符开始测量的索引","An integer between ":"之间的整数","The number of rows to write to the bitmap":"写入位图的行数","May be null. The blend mode to be installed in the paint":"可能是无效的。 将安装在油漆中的混合模式","The X coordinate of the right side of the rectangle":"矩形右侧的X坐标","The tiling mode for x to draw the bitmap in.":"x绘制位图的平铺模式。","The listener to use, or null to remove the listener.":"使用的侦听器或null删除侦听器。","The y-radius of the oval used to round the corners":"椭圆形的Y-Radius用来圆角","red component value \\([0..255]\\)":"红色组件值\\（[0..255] \\）","the index of the first character to measure":"第一个字符的索引","If true, then the path will be considered as \"closed\"\n                   even if its contour was not explicitly closed.":"如果是真的，则该路径将被视为“封闭” \n                    即使其轮廓没有明确关闭。","true if the path is empty (contains no lines or curves)":"如果路径为空（不包含线条或曲线），则为true）","true if the matrix was set to the specified transformation":"如果将矩阵设置为指定的转换，则为true","The path to add as a new contour":"添加为新轮廓的路径","The x coordinate (0...width-1) of the pixel to return":"像素的X坐标（0 ... width-1）返回","The matrix to preconcatenate with the current matrix":"与当前矩阵的矩阵矩阵","the paint's currently set font variation settings. Default is null.":"油漆当前设置了字体变化设置。 默认为null。","The right side of the rectangle being tested for containment":"矩形的右侧进行了测试","True if the Colors are not equal, otherwise False.":"如果颜色不相等，则为否，否则是错误的。","If not null, array of indices to reference into the vertex (texs, colors)\n                       array.":"如果不是零，则需要引用顶点的一系列零件（Tex，颜色） \n                        大批。","The recorded ":"记录","The blue component of the color to convert":"颜色的蓝色组件转换","May be null. Specifies a color at each vertex, which is interpolated across the\n                       cell, and whose values are multiplied by the corresponding bitmap colors. If not\n                       null, there must be at least (meshWidth+1) * (meshHeight+1) + colorOffset values\n                       in the array.":"可能是无效的。 指定每个顶点的颜色，该颜色在 \n                        单元格，其值乘以相应的位图颜色。 如果不 \n                        null，至少必须有（Meshwidth+1） *（Meshheight+1）+colorOffset值 \n                        在数组中。","the paint's stroke width, used whenever the paint's style is\n                    Stroke or StrokeAndFill.":"每当油漆的风格是 \n                     中风或strokeandfill。","The shadow color set by ":"阴影颜色由"," is recommended\n                             for performance reasons.":"被推荐 \n                              出于绩效原因。","The paint used to draw the line":"用于画线的油漆","False if the content is guaranteed to be non-overlapping,\n                                           true otherwise.":"错误，如果保证内容是非重叠的， \n                                            否则否则。","the paint's blend mode (or null)":"油漆的混合模式（或无效）","The surface to render into. If null then rendering will be stopped. If\n                           non-null then ":"表面呈现。 如果无效，则将停止渲染。 如果 \n                            然后非效果","1 beyond the index of the last character to measure":"1超出最后一个字符的索引","The tiling mode for y to draw the bitmap in.":"y绘制位图的平铺模式。","The new target density of the canvas, which is used\n            to determine the scaling factor when drawing a bitmap into it.  Use\n            ":"画布的新目标密度 \n             在绘制位图时确定缩放因子。 利用","The distance along the associated path":"沿相关路径的距离","true if the filltype is one of the INVERSE variants":"如果filltype是逆变体之一，则为true","The paint used to draw the roundRect":"用于绘制圆形的油漆","the number of characters to measure":"要测量的字符数","The HardwareBuffer to wrap.":"可以包装的硬件缓冲器。","The handler on which the listener should be invoked, or null\n to use an arbitrary thread.\n":"应调用听众的处理程序或无效 \n  使用任意线程。","The Y coordinate of the bottom of the rectangle\n":"矩形底部的Y坐标"," means that\n                 the implementation added transparency. This is safe to return even\n                 if the image already had transparency. This is also safe to return\n                 if the result is opaque, though it may draw more slowly.\n                 ":"意思是 \n                  实施增加了透明度。 这是安全返回的 \n                  如果图像已经具有透明度。 这也可以安全返回 \n                  如果结果不透明，尽管它可能会慢得多。","The amount to translate the path in X as it is added":"添加x中的路径的数量","input path":"输入路径","The bottom of the rectangle being tested for containment":"矩形的底部被测试","True if this color space is the sRGB color space (or a\n                    close approximation), false otherwise":"如果此颜色空间是SRGB颜色空间（或一个 \n                     关闭近似），错误否则","The red component of the color.":"颜色的红色组件。","The y coordinate (0...height-1) of the pixel to return":"像素的Y坐标（0 ...高1）要返回","If not null, returns the bounds of the path if it specifies\n                        a rectangle":"如果不是null，则返回路径的边界，如果它指定 \n                         矩形","The x-coordinate of the center":"中心的X坐标","The outline to use for this RenderNode.":"用于此渲染的大纲。","value to pass to restoreToCount() to balance this call":"价值传递到Restoretocount（）以平衡此通话","true iff the the 4 specified sides of a rectangle are inside or\n                         equal to this rectangle":"是的，如果Ff矩形的4个指定侧面在内部或 \n                          等于这个矩形","The amount to scale in X":"x中规模的数量","the source rectangle to map from.":"要从中映射的源矩形。","number of entries in the indices array (if not null).":"indices数组中的条目数（如果不是null）。","green component value \\([0..255]\\)":"绿色分量值\\([0..255]\\)"," of drawing commands that will be\n                          drawn into the returned Bitmap.":" 绘制命令，将\n                          绘制到返回的位图中。","true to set the subpixelText bit in the paint's\n                                flags, false to clear it.":"在油漆中设置子像素文本位是真的\n                                标志，假来清除它。","the destination rectangle to map to.":"目标矩形要映射到。","The alpha component of the color to convert, in \\([0..1]\\)":"要转换的颜色的alpha分量，在\\([0..1]\\)","The text to measure. Cannot be null.":"要测量的文本。 不能为null。","THe number of characters to measure, beginning with start":"要测量的字符数，从start开始","Array of points to draw [x0 y0 x1 y1 x2 y2 ...]":"点的数组绘制[x0y0x1y1x2y2...]","Allocated by the caller, this is set to the transformation\n        associated with the position and tangent at the specified distance":"由调用方分配，这被设置为转换\n        与指定距离处的位置和切线相关联"," must be true.":" 一定是真的。","the index of the first character to use for shaping context.\n                                Context must cover the measureing target.":"用于整形上下文的第一个字符的索引。\n                                上下文必须复盖测量目标。","The radius to extend the blur from the original mask. Must be > 0.":"从原始蒙版扩展模糊的半径。 必须>0。","The rectangle to add as a closed contour to the path":"要作为闭合轮廓添加到路径的矩形","The first rectangle being intersected with":"与之相交的第一个矩形","The x-coordinate of the origin of the text being drawn":"绘制文本原点的x坐标","The color space of the bitmap. Must be a ":"位图的颜色空间。 必须是一个 ","Number of color elements to skip before drawing":"绘制前要跳过的颜色元素数量","3x3 column-major transform matrix from RGB to the profile\n                            connection space CIE XYZ as an array of 9 floats, cannot be null":"3X3列-从RGB到配置文件的主要变换矩阵\n                            连接空间CIE XYZ作为9个浮点数的数组，不能为null","Integer representation of a Color.":"颜色的整数表示。","The paint used to draw the points":"用于提取点的油漆"," means that the\n                 implementation forced the image to be opaque. This is safe to return\n                 even if the image was already opaque.\n                 ":" 意思是\n                 实现强制图像不透明。 这是安全的返回\n                 即使图像已经不透明。\n                 ","output path (may be the same as src)":"输出路径（可能与src相同）",", or black if\n            nothing was set":"，或黑色如果\n            什么都没有设定","The y-coordinate of the center":"中心的y坐标","The pivot value of the display list on the X axis, in pixels":"显示列表在X轴上的枢轴值，以像素为单位"," at the specified coordinate":" 在指定的坐标","the exact horizontal center of the rectangle as a float.":"矩形作为浮点数的确切水平中心。","The amount to scale in Y":"以Y表示的比例","blue component value \\([0..255]\\)":"蓝色分量值\\([0..255]\\)","The direction to wind the rectangle's contour":"缠绕矩形轮廓的方向","Specifies the shader to use if the texs array is non-null.":"指定texs数组非null时要使用的着色器。","An immutable bitmap with a HARDWARE config whose contents are created\n            from the recorded drawing commands in the Picture source.":"具有创建内容的硬件配置的不可变位图\n            从图片源中记录的绘图命令。","true if the path specifies a rectangle":"如果路径指定矩形，则为true","true if the subpixel bit is set in the paint's flags":"如果在油漆的标志中设置了亚像素位，则为true","The source color space, cannot be null":"源颜色空间，不能为null","If true, measure forwards, starting with the\n                        first character in the string. Otherwise,\n                        measure backwards, starting with the\n                        last character in the string.":"如果为true，则向前测量，从\n                        字符串中的第一个字符。 否则的话,\n                        向后测量，从\n                        字符串中的最后一个字符。","the paint's patheffect (or null)":"油漆的路径效应（或null）","the ScaleToFit option":"ScaleToFit选项","Specified what aspects should be returned in the matrix.\n":"指定应该在矩阵中返回哪些方面。\n","The Blur to use":"使用的模糊","The second rectangle being intersected with":"与之相交的第二个矩形","The y-coordinate of the baseline of the text being drawn":"绘制文本基线的y坐标"," colorspace.\n                              If null, SRGB is assumed.":" 色空间。\n                              如果为null，则假定SRGB。","The x-coordinate of the center of the cirle to be drawn":"要绘制的圆的中心的x坐标","Parameters for the transfer functions":"传递函数的参数","String representation of the Color.":"颜色的字符串表示。","true if the path should be filled, or false if it should be\n                            drawn with a hairline (width == 0)":"如果路径应该填充，则为true，如果应该填充，则为false\n                            用发际线绘制（宽度==0）","a new Source object, which can be passed to\n                 ":"一个新的源对象，可以传递给\n                 ","A canvas to record drawing operations.":"记录绘图操作的画布。","Number of values in the array to skip before drawing.":"绘制前要跳过的数组中的值数。","The sRGB color to use at the start of the sweep":"扫描开始时使用的sRGB颜色","The argb ":"Argb ","the number of character to use for shaping context.\n                                Context must cover the measureing target.":"用于整形上下文的字符数。\n                                上下文必须复盖测量目标。","The pivot value of the display list on the Y axis, in pixels":"显示列表在Y轴上的枢轴值，以像素为单位","the exact vertical center of the rectangle as a float.":"矩形作为浮点数的确切垂直中心。","The x-coord for the pivot point (unchanged by the scale)":"枢轴点的x坐标（按比例不变）","An ARGB color in the sRGB color space":"SRGB颜色空间中的ARGB颜色","The left side of a rectangle to add to the path":"要添加到路径的矩形的左侧","The x-coordinate of the end of a line":"行尾的x坐标","Return the clip bounds here. If it is null, ignore it but\n                          still return true if the current clip is non-empty.":"在这里返回剪辑边界。 如果为null，则忽略它，但\n                          如果当前剪辑非空，仍然返回true。","A new, non-null array whose size is equal to ":"一个新的非空数组，其大小等于 ","The maximum width to accumulate.":"要累积的最大宽度。","The new alpha component (0..255) of the paint's color.":"新的alpha分量（0。.255)的油漆的颜色。","The width of the bitmap":"位图的宽度","true if the matrix can be represented by the rectangle mapping.":"如果矩阵可以由矩形映射表示，则为true。","The distance along the current contour to sample":"沿当前轮廓到采样的距离","the paint's Align value for drawing text.":"绘制文本的油漆对齐值。","The new blur maskfilter":"新的模糊maskfilter","The index of the first character in text to draw":"要绘制的文本中第一个字符的索引","true iff the two specified rectangles intersect. If they do, set\n                         this rectangle to that intersection. If they do not, return\n                         false and do not change this rectangle.":"true iff两个指定矩形相交。 如果他们这样做，设置\n                         这个矩形到那个交点. 如果他们不这样做，返回\n                         false并且不要更改此矩形。","The y-coordinate of the center of the cirle to be drawn":"要绘制的圆的中心的y坐标","A value of 0 maps the color to gray-scale. 1 is identity.":"值0将颜色映射到灰度。 1是身份。","A bitmap wrapping the buffer, or null if there was a problem creating the bitmap.":"包装缓冲区的位图，如果创建位图时出现问题，则为null。","If this object is not null, its fields are filled with\n                the appropriate values given the paint's text attributes.":"如果此对象不为null，则其字段将填充为\n                给出油漆的文本属性的适当值。"," if a match is found, null otherwise":" 如果找到匹配项，否则为null","The width of the recording viewport. This will not alter the width of the\n                          RenderNode itself, that must be set with ":"记录视口的宽度。 这不会改变\n                          RenderNode本身，必须设置为 ","The sRGB color to use at the end of the sweep":"扫描结束时使用的sRGB颜色","The number of values in the array to process, after skipping \"offset\" of them.\n                       Since each line uses 4 values, the number of \"lines\" that are drawn is really\n                       (count >> 2).":"数组中要处理的值的数量，在跳过它们的\"偏移量\"之后。\n                       由于每行使用4个值，因此绘制的\"线\"的数量是真的\n                       （计数>>2）。","The position rectangle in pixels":"以像素为单位的位置矩形","array to receive the advances, must have room for all advances.\n                            This can be null if only total advance is needed":"阵列要接收进阶，必须拥有所有进阶的空间。\n                            如果只需要总提前，这可以是空的","to retrieve from.":"来检索。","Returns a new String of the form \"left top right bottom\"":"返回形式为\"left top right bottom\"的新字符串","The array to receive the bitmap's colors":"接收位图颜色的数组","The y-coord for the pivot point (unchanged by the scale)":"枢轴点的y坐标（按比例不变）","The ARGB color int to create a <code>Color</code> from":"ARGB颜色int创建一个<代码>颜色</代码>从","The top of a rectangle to add to the path":"要添加到路径的矩形的顶部","true if the current clip is non-empty.":"如果当前剪辑非空，则为true。","An array of floats whose size must be at least\n                             ":"一个大小必须至少为浮动的数组\n                             ","The y-coordinate of the end of a line":"行尾的y坐标","Optional. If not null, returns the actual width\n                     measured.":"可选择的。 如果不为null，则返回实际宽度\n                     测量的。","The new red component (0..255) of the paint's color.":"新的红色分量（0..255)的油漆的颜色。","The bitmap describing the patches.":"描述补丁的位图。","The height of the bitmap":"位图的高度","If not null, eturns the sampled position (x==[0], y==[1])":"如果不为null，则返回采样位置（x==[0]，y==[1]）","the paint's locale value for drawing text, must not be null.":"绘制文本的绘制区域设置值不能为null。","The Canvas to set the transform matrix onto":"将变换矩阵设置为","(end - 1) is the index of the last character in text to draw":"（end-1）是文本中最后一个要绘制的字符的索引","The radius of the cirle to be drawn":"要绘制的圆的半径","The rectangle being unioned with this rectangle":"与此矩形合并的矩形","4x5 matrix used to transform colors. It is copied into\n                          the filter, so changes made to the matrix after the filter\n                          is constructed will not be reflected in the filter.":"用于变换颜色的4x5矩阵。 它被复制到\n                          滤波器，因此在滤波器之后对矩阵所做的更改\n                          被构造不会反映在滤波器中。","the font's interline spacing.":"字体的行间距。","Parcel object to write the bitmap data into":"要将位图数据写入的Parcel对象","A non-null String of length >= 1":"长度>=1的非空字符串","The height of the recording viewport. This will not alter the height of the\n                          RenderNode itself, that must be set with ":"记录视口的高度。 这不会改变高度的\n                          RenderNode本身，必须设置为 ","The rectangle bounds of the oval to be drawn":"要绘制的椭圆形的矩形边界","The sRGB colors to be distributed between around the center.\n                            There must be at least 2 colors in the array.":"SRGB颜色分布在中心周围.\n                            数组中必须至少有2种颜色。","the position in advances at which to put the advance corresponding to\n                                 the character at start":"前进的位置，以使前进的位置对应于\n                                 开始时的角色","of the image file.":"的图像文件。","The first index to write into pixels[]":"写入像素的第一个索引[]","The insets to inset the rect by.":"插入矩形的插入。","The color long to create a <code>Color</code> from":"长的颜色来创建一个<代码>颜色</代码>","The amount to skew in X":"在X中偏斜的量","The right side of a rectangle to add to the path":"要添加到路径的矩形的右侧","The left position of the RenderNode, in pixels":"RenderNode的左侧位置，以像素为单位","the height of the current drawing layer":"当前绘图层的高度",", can be null":"，可以为null","The offset into text to begin measuring at":"将偏移量转换为文本，以开始测量","The x-coordinate of the start of a new contour":"新轮廓开始的x坐标","The 9-patch data chunk describing how the underlying bitmap\n                         is split apart and drawn.":"描述底层位图如何的9补丁数据块\n                         被分割开并绘制。","The new green component (0..255) of the paint's color.":"新的绿色成分（0..255)的油漆的颜色。","If not null, returns the sampled tangent (x==[0], y==[1])":"如果不为null，则返回采样切线(x==[0],y==[1])","The bitmap config to create.":"要创建的位图配置。","the paint's primary Locale used for drawing text, never null.":"绘画用于绘制文本的主要区域设置，从不为null。","The matrix to copy the current transforms into":"复制当前的矩阵转换为","The x-coordinate of origin for where to draw the text":"用于绘制文本的原点的x坐标","Array of floats used to transform colors, treated as a 4x5\n                         matrix. The first 20 entries of the array are copied into\n                         the filter. See ColorMatrix.":"用于转换颜色的浮动数组，视为4x5\n                         矩阵。 数组的前20个条目被复制到\n                         的过滤器。 请参阅ColorMatrix。","The paint used to draw the circle\n":"用来画圆的油漆\n","the text to measure. Cannot be null.":"要测量的文本。 不能为null。","The x coordinate of the point to add to the rectangle":"要添加到矩形的点的x坐标","byte array of compressed image data":"压缩图像数据的字节数组","An array of color components containing the color space's\n                     color value to convert to XYZ, and large enough to hold\n                     the resulting tristimulus XYZ values":"包含颜色空间的颜色组件的数组\n                     颜色值转换为XYZ，并大到足以容纳\n                     得到的三刺激XYZ值","the bottom position in pixels":"以像素为单位的底部位置","The paint used to draw onto the canvas":"画在画布上的颜料","May be NULL. The relative position of\n                            each corresponding color in the colors array, beginning\n                            with 0 and ending with 1.0. If the values are not\n                            monotonic, the drawing may produce unexpected results.\n                            If positions is NULL, then the colors are automatically\n                            spaced evenly.":"可能为NULL。 的相对位置\n                            颜色数组中的每个相应颜色，开始\n                            以0结尾，以1.0结尾。 如果值不是\n                            单调，绘图可能会产生意想不到的结果。\n                            如果positions为NULL，则颜色会自动显示\n                            间隔均匀。","the total advance in pixels":"以像素为单位的总进步","The number of entries in pixels[] to skip between\n                 rows (must be >= bitmap's width). Can be negative.":"在像素[]之间跳过的条目数\n                 行（必须是>=位图的宽度）。 能为负。","The first component of the value to convert from (typically R in RGB)":"值转换的值的第一个组件（通常为RGB中的R）","the number of bits per pixel of the given format or -1 if the\n                    format doesn't exist or is not supported.":"给定格式的每像素位数或-1，如果\n                    格式不存在或不受支持。","The components of the color to create, with alpha as the last component":"要创建的颜色的分量，alpha作为最后一个分量","The amount to skew in Y":"在Y中偏斜的量","The bottom of a rectangle to add to the path":"要添加到路径的矩形的底部","The top position of the RenderNode, in pixels":"渲染节点的顶部位置，以像素为单位","True if drawing operations are hardware accelerated,\n                    false otherwise.":"如果绘图操作是硬件加速的，则为True,\n                    否则是假的。","The array passed as a parameter if not null, or a new array of length\n                    ":"如果不是null，则作为参数传递的数组，或者是一个新的长度数组\n                    ","The amount to add(subtract) from the rectangle's left(right)":"从矩形的左（右）中加（减）的量","The number of maximum number of entries to measure. If count\n              is negative, then the characters are measured in reverse order.":"要测量的最大条目数。 如果算\n              是负的，则以相反的顺序测量字符。","The y-coordinate of the start of a new contour":"新轮廓开始的y坐标","The new blue component (0..255) of the paint's color.":"新的蓝色分量（0..255)的油漆的颜色。","The picture is drawn to this canvas":"这幅画画在这幅画布上","the paint's locale list for drawing text, must not be null or empty.":"绘制文本的paint区域设置列表不能为null或空。","Display metrics for the display this bitmap will be\n                 drawn on.":"显示此位图的显示度量将是\n                 上绘制。","The angle of rotation around the X axis, in degrees":"绕X轴旋转的角度，以度为单位","The y-coordinate of origin for where to draw the text":"用于绘制文本的原点的y坐标","The color long whose green channel to extract":"颜色长，其绿色通道提取","The 9-patch data chunk describing how the underlying\n                         bitmap is split apart and drawn.":"描述底层如何的9补丁数据块\n                         位图被分割并绘制.","the color to draw onto the canvas":"画在画布上的颜色","the index of the start of the range to measure":"要测量的范围开始的索引","The y coordinate of the point to add to the rectangle":"要添加到矩形的点的y坐标","offset into imageData for where the decoder should begin\n                          parsing.":"偏移到imageData，用于解码器应该开始的位置\n                          解析。","the distance along the Z axis in pixels.":"沿z轴的距离，以像素为单位。","The ninepatch object to render":"要呈现的ninepatch对象","The color to use at the start of the sweep":"扫描开始时要使用的颜色","the text":"文本","The second component of the value to convert from (typically G in RGB)":"要转换的值的第二个分量（通常是RGB中的G）","The x coordinate of the first pixel to read from\n                 the bitmap":"从读取的第一个像素的x坐标\n                 位图","The first Insets to add.":"第一个插入添加。","The color space of the color to create":"要创建的颜色的颜色空间","The second Insets to add.":"第二个插入添加。","The amount to add from the rectangle's left":"从矩形左侧添加的数量","The right position of the RenderNode, in pixels":"渲染节点的正确位置，以像素为单位","true if the device that the current layer draws into is opaque":"如果当前图层绘制到的设备不透明，则为true","The amount to add(subtract) from the rectangle's top(bottom)":"要从矩形的顶部（底部）添加（减去）的量","The y-coordinate for the end of the gradient line":"渐变线末端的y坐标","The end of the text slice to measure.":"文本切片的末端来测量。","The amount in the X direction to offset the entire path":"X方向偏移整个路径的量","May be null. The new filter to be installed in the paint":"可能为null。 要安装在油漆中的新过滤器","true if the Picture can only be drawn to a hardware-accelerated canvas,\n                    false otherwise.":"如果图片只能绘制到硬件加速的画布上，则为true,\n                    否则是假的。"," used to initialize the pixels.\n                 This array must be at least as large as width * height.":" 用于初始化像素。\n                 此数组必须至少与width*height一样大。","The angle of rotation around the Y axis, in degrees":"绕Y轴旋转的角度，以度为单位","The path the text should follow for its baseline":"文本应遵循的基线路径","3 element array which holds the input HSV components.":"3元素数组，保存输入HSV组件。","The name of the source for the bitmap. Might be null.":"位图的源的名称。 可能为空。"," to draw onto the canvas. See the ":" 画在画布上. 查看 ","the index + 1 of the end of the range to measure":"要测量的范围结束的索引+1","The left edge being unioned with this rectangle":"与此矩形统一的左边缘","the paint's LocaleList used for drawing text, never null or empty.":"paint的LocaleList用于绘制文本，从不为null或empty。","true if the render node clips to its bounds, false otherwise.":"如果渲染节点剪辑到其边界，则为true，否则为false。","width relative to start of run":"相对于运行开始的宽度","The color to use at the end of the sweep":"扫描结束时要使用的颜色","the start of the context":"上下文的开始","The y coordinate of the first pixel to read from\n                 the bitmap":"从读取的第一个像素的y坐标\n                 位图","filter":"过滤器","The third component of the value to convert from (typically B in RGB)":"要转换的值的第三个分量（通常是RGB中的B）","The red component of the opaque sRGB color to create, in \\([0..1]\\)":"要创建的不透明sRGB颜色的红色分量，在\\([0..1]\\)","The amount to add from the rectangle's top":"从矩形顶部添加的数量","a + b, i. e. all insets on every side are added together.":"a+b，即每一侧的所有插入都加在一起。","the number of bytes, beginning at offset, to parse":"从offset开始要解析的字节数","The matrix to replace the current matrix with. If it is\n                          null, set the current matrix to identity.":"用的矩阵替换当前矩阵。 如果是\n                          null，将当前矩阵设置为identity。","If true, include the center of the oval in the arc, and close it if it is\n                       being stroked. This will draw a wedge":"如果为true，则将椭圆形的中心包含在弧中，如果为则将其关闭\n                       被抚摸着。 这将画一个楔子","The sRGB color at the start of the gradient line.":"渐变线开始处的sRGB颜色。","If true, measure forwards, starting at start.\n                        Otherwise, measure backwards, starting with end.":"如果为true，则从开始开始向前测量。\n                        否则，从end开始向后测量。","The bitmap config to create. If the config does not\n                 support per-pixel alpha (e.g. RGB_565), then the alpha\n                 bytes in the colors[] will be ignored (assumed to be FF)":"要创建的位图配置。 如果配置没有\n                 支持每像素alpha（例如RGB_565），然后是alpha\n                 颜色[]中的字节将被忽略（假设为FF）","The angle of rotation around the Z axis, in degrees":"绕Z轴旋转的角度，以度为单位","The distance along the path to add to the text's starting position":"要添加到文本起始位置的路径上的距离","\n                         class for details about ":"\n                         有关详情的课程 ","the paint's scale factor in X for drawing/measuring text":"绘画/测量文本的x比例因子","True if this RenderNode clips to its outline, false otherwise":"如果此RenderNode剪辑到其轮廓，则为True，否则为false","The colors to be distributed between around the center.\n                            There must be at least 2 colors in the array.":"要在中心周围分布的颜色。\n                            数组中必须至少有2种颜色。","the end of the context":"上下文的结尾","font variation settings. You can pass null or empty string as\n                                         no variation settings.":"字体变化设置。 您可以将null或空字符串传递为\n                                         没有变化设置。","index of offset":"偏移量索引"," object. In case of ":" 对象。 的情况下 ","The paint used to draw the arc":"用于绘制弧线的油漆",", the default\n                          typeface is used instead.":"，默认\n                          使用字体代替。","The style (normal, bold, italic) of the typeface.\n                          e.g. NORMAL, BOLD, ITALIC, BOLD_ITALIC":"字体的样式（正常，粗体，斜体）。\n                          例如：正常，粗体，斜体，BOLD_ITALIC","The best matching typeface.":"最佳匹配的字体。","May be null. The name of the font family.":"可能为null。 字体系列的名称。","The desired weight to be drawn.":"要绘制的期望权重。"," if italic style is desired to be drawn. Otherwise, ":" 如果需要绘制斜体样式。 否则的话, "," object for drawing specified weight and italic style. Never\n                    returns ":" 对象，用于绘制指定的权重和斜体样式。 从来没有\n                    申报表 ","Returns the current target density of the canvas, which is used\n            to determine the scaling factor when drawing a bitmap into it.":"返回使用的画布的当前目标密度 \n             在绘制位图时确定缩放因子。","The bounds of oval used to define the shape and size of the arc":"椭圆形的边界用于定义弧的形状和大小","Starting angle (in degrees) where the arc begins":"弧开始的起始角（以度为单位）","Sweep angle (in degrees) measured clockwise":"扫角（以度为单位）顺时针旋","The x-coordinate for the start of the gradient line":"梯度线开始的X坐标","The y-coordinate for the start of the gradient line":"梯度线开始的Y坐标","The x-coordinate for the end of the gradient line":"梯度线末端的X坐标","null-ok; Options that control downsampling and whether the\n             image should be completely decoded, or just is size returned.":"null-ok; 控制缩减采样的选项以及是否 \n              图像应完全解码，或者只是返回大小。","This drawable.":"这可以绘制。","an array of\n            ":"一系列","The handler on which the callback should be invoked, or ":"应调用回调的处理程序，或"," or, the desired\n                       delay between events in microseconds. Specifying the delay in microseconds only\n                       works from Android 2.3 (API level 9) onwards. For earlier releases, you must use\n                       one of the ":"或者，所需的 \n                        微秒中事件之间的延迟。 仅指定微秒中的延迟 \n                        从Android 2.3（API 9级）开始工作。 对于早期版本，您必须使用 \n                        中的一个","the intrinsic height (in pixels)":"内在高度（以像素为单位）","an additional amount of x offset of the result glyphs.":"结果字形的另外数量的X偏移。","type of sensor requested":"请求的传感器类型","Another MeteringRectangle":"另一个MeteringRectangle",". If\n                              inset parameter is ":"。 如果 \n                               插图参数为","How the current device is connected to the display sink. For example, the display\n            can be connected immediately to the device or there can be a receiver in between.":"当前设备如何连接到显示槽。 例如，显示 \n             可以立即连接到设备，也可以在两者之间有一个接收器。"," to write the DNG file to.":"将DNG文件写入。","The application's asset manager":"申请的资产经理","The input device or null if not found.":"如果找不到输入设备或无效。","The runnable that you no longer want called.":"您不再需要调用的可运行。","The Drawable at the specified frame index":"在指定的框架索引处绘制","the bottom padding in pixels, or -1 to use computed\n                          padding":"像素中的底部填充或-1使用计算 \n                           填充","The color of the stroke":"中风的颜色"," as specified in\n            the constructor and ":"如指定 \n             构造函数和","A color state list to attach.":"要附加的颜色状态列表。"," if the user does not have any of the\n                requested authenticators enrolled, or ":"如果用户没有任何 \n                 要求的验证者已注册，或","number of pixels to inset from the left bound":"从左键插入的像素数","The new callback to send torch mode status to":"将火炬模式状态发送到的新回调","Type of the monitoring system.":"监视系统的类型。","The page. Cannot be null.":"这页纸。 不能无效。",", may be null":"，可能是无效的","<code>true</code> if this is a wake-up sensor, <code>false</code> otherwise.":"<code> true </code>如果这是一个唤醒传感器，<code> false </code>否则。","true if focus starts to move, false if focus stops to move":"如果焦点开始移动，则为真实，如果焦点停止移动，则为错误"," the ":"这"," to use\n                           the current thread's ":"使用 \n                            当前线程的","callbacks to be invoked when the state of the\n                             CameraExtensionSession changes":"当状态的状态 \n                              Cameraxtensionsessessessession","The callback object to notify every time the\n            request finishes processing. If null, no metadata will be\n            produced for this stream of requests, although image data will\n            still be produced.":"每次通知的回调对象 \n             请求完成处理。 如果无效，则不会 \n             为此请求流制作，尽管图像数据将 \n             仍在生产。","blue pixel":"蓝色像素","Manufacturer Plug and Play ID.":"制造商插件ID。","an additional amount of y offset of the result glyphs.":"结果字形的另外数量偏移。","the intrinsic width (in pixels)":"内在宽度（以像素为单位）","\n            objects representing the ranges that the transmitter can support, or\n            null if there was an error communicating with the Consumer IR Service.":"表示发射器可以支持的范围的对象，或 \n             null是否存在与消费者IR服务通信的错误。","the new resolved layout direction":"新的解决布局方向","a ColorStateList":"色彩常识","The length in pixels of the dashes, set to 0 to disable dashes":"破折号像素的长度，设置为0以禁用破折号"," if the metering rectangles are equal, ":"如果计量矩形相等，","the index of the drawable to display":"可绘制的索引显示","The callback object to notify every time the\n            request finishes processing.":"每次通知的回调对象 \n             请求完成处理。",". The list should not be modified.":"。 该列表不应修改。","The unique identifier of the camera device that the flash unit belongs to.":"闪光灯属于相机设备的唯一标识符。","the start padding in pixels, or -1 to use computed padding":"以像素为单位的开始填充，或-1使用计算的填充","The type of the monitoring system.":"监视系统的类型。","The file name of the font data in the assets directory":"资产目录中字体数据的文件名","The max delay for this sensor in microseconds.":"该传感器在微秒中的最大延迟。"," if none are\n                currently supported/enabled. Returns ":"如果没有 \n                 当前支持/启用。 返回","number of pixels to inset from the right bound":"从正确的界限插入的像素数","The input device ids.":"输入设备ID。","true if the animation is running, false otherwise":"如果动画运行，则为thue，否则为否","The pages or an empty list.":"页面或空列表。",", this parameter is\n                              ignored.":"，此参数为 \n                               被忽略。","flag to indicate whether the Sensor is a wake-up or non wake-up sensor.":"标志以指示传感器是唤醒还是非唤醒传感器。","The week of manufacture which ranges from 1 to 53, or -1 it is not available.\n            Typically, it is not present if model year is available.":"制造一周的范围为1至53，或-1不可用。 \n             通常，如果有模型年度，则不存在。","greater or equal to ":"更大或等于","as in ":"如","the Camera service object\n":"相机服务对象"," if the layout direction change has caused the\n                    appearance of the drawable to change such that it needs to be\n                    re-drawn, ":"如果布局方向变化导致 \n                     可绘制的更改的外观，以至于需要 \n                     重新绘制，"," of the image to write, in pixels.":"以像素为单位的图像。","extension configuration":"扩展配置"," will be delivered to.":"将交付给。","padding for the left side (in pixels)":"左侧填充（以像素为单位）","The Executor on which the callback will be invoked.":"将调用回调的执行人。","true if this text is shaped for RTL direction, false otherwise.":"如果此文本为RTL方向形状，则为the，否则为false。"," if one of the requested\n                authenticators can currently be used (enrolled and available).":"如果要求之一 \n                 当前可以使用身份验证器（已注册和可用）。","The page info. Cannot be null.":"页面信息。 不能无效。","true if the device has an infrared emitter, else false.":"如果设备具有红外发射器，则为否则否。","Indicates whether the system is currently available or not.":"指示系统是否当前可用。","x coordinate >= 0":"X坐标> = 0","the number of pixels to inset from the start bound, or\n                    ":"从开始界插入的像素的数量，或","maximum range of the sensor in the sensor's unit.":"传感器单元中传感器的最大范围。","The session type.":"会话类型。","the Paint object that defines this shape's characteristics":"定义该形状特征的油漆对象","the theme to apply":"适用的主题"," to check":"去检查","An input/output surface that was used to create this session or the result of\n                           ":"用于创建此会话的输入/输出表面或","The gap in pixels between dashes":"破折号之间的像素差距","the end padding in pixels, or -1 to use computed padding":"像素中的末端填充，或-1使用计算的填充","a non-modifiable set of supported slower high-resolution sizes, or ":"一套不可修改的支持较慢的高分辨率尺寸，或",", null to remove tint":"，无效去除色调","The new typeface.":"新字体。","The number of frames in the animation":"动画中的帧数","the default sensor matching the requested type and wakeUp properties if one exists\n                    and the application has the necessary permissions, or null otherwise.":"默认传感器匹配所请求的类型和唤醒属性，如果存在 \n                     并且该应用程序具有必要的权限，否则为无效。"," if the drawable changed, ":"如果可绘制的更改，","The desired state of the torch mode for the target camera device. Set to\n                        ":"目标摄像头设备的火炬模式的所需状态。 调成","The year of manufacture, or -1 it is not available. Typically,\n            one of model year or manufacture year is available.":"制造年份或-1不可用。 通常， \n             可以使用模型年度或制造年份之一。"," object\n                       that will receive the sensor events. If the application is interested in receiving\n                       flush complete notifications, it should register with\n                       ":"目的 \n                        这将收到传感器事件。 如果申请有兴趣接收 \n                        齐平通知，应注册","padding for the top (in pixels)":"顶部的填充（以像素为单位）"," of pixel data to write.":"要写的像素数据。","The IR carrier frequency in Hertz.":"赫兹的红外载体频率。","the extension type.":"扩展类型。","error code:\n ":"错误代码：","A blank page.":"空白页。","Returns true if the level change has caused the appearance of\n            the Drawable to change (that is, it needs to be drawn), else false\n            if it looks the same and there is no need to redraw it since its\n            last level.":"如果级别的变化导致出现 \n             可以更改的绘制（也就是说，需要绘制），否则错误 \n             如果看起来相同，并且没有必要重新刷新，因为它 \n             最后级别。","a paint used for shaping text.":"用于塑造文本的油漆。","y coordinate >= 0":"y坐标> = 0","The configuration for the input ":"输入的配置","A bit field representing the types of ":"一点点字段，代表","the Outline to be populated with the result. Must be\n                           non-":"结果填充的轮廓。 一定是 \n                            非","Latitude of the geofence":"lat"," if the surface can support offline mode and can be passed as argument to\n                    ":"如果表面可以支持离线模式，并且可以作为参数传递给"," if\n                    the BURST_CAPTURE capability is not supported":"如果 \n                     不支持burst_capture功能","The drawable to inset.":"可以插入插图。"," if not specified":"如果未指定","a list of dynamic sensors matching the requested type.":"与请求类型匹配的动态传感器列表。","the start padding in pixels, or -1 if not explicitly specified":"以像素为单位的开始填充，或-1如果未明确指定","Set to true if the Drawable should be mirrored, false if not.":"设置为true如果应镜像可绘制，如果没有，则设置为false。","The executor which should be used to invoke the callback. In general it is\n                            recommended that camera operations are not done on the main (UI) thread.":"应用来调用回调的执行人。 通常是 \n                             建议不要在主（UI）线程上进行相机操作。","the minimum delay allowed between two events in microseconds\n            or zero if this sensor only returns a value when the data it's measuring\n            changes. Note that if the app does not have the\n            ":"微秒中的两个事件之间允许的最小延迟允许 \n             或零，如果该传感器仅在数据测量数据时返回值 \n             变化。 请注意，如果该应用没有"," if the gradient should be scaled based on\n                            level, ":"如果应根据 \n                             等级，",", which is a subset of the provided\n            ":"，这是提供的子集","The path to the font data.":"字体数据的路径。","padding for the right side (in pixels)":"右侧填充（以像素为单位）"," that may\n                                  be used for authentication.":"可能 \n                                   用于身份验证。","the offset of the raw image in bytes.  This indicates how many bytes will\n                          be skipped in the input before any pixel data is read.":"字节中原始图像的偏移。 这表明将有多少个字节 \n                           在读取任何像素数据之前，请在输入中跳过。","Inset in pixels around the drawable.":"插入可绘制的像素。","Model year of the device. Return -1 if not available. Typically,\n            one of model year or manufacture year is available.":"设备的型号。 返回-1如果不可用。 通常， \n             可以使用模型年度或制造年份之一。","Pass true if the animation should only play once":"如果动画只能播放一次，请通过True","The alternating on/off pattern in microseconds to transmit.":"微秒中的交替开/关模式发射。","a shape result":"形状结果","The amount of time to fade in milliseconds.":"以毫秒为单位淡入的时间。"," to turn on the torch mode. Set to ":"打开火炬模式。 调成","The detected faces in a list":"列表中检测到的面孔","The output stream. Cannot be null.":"输出流。 不能无效。"," with non-negative x1, y1, x2, y2":"使用非负X1，Y1，X2，Y2","Returns true if the state change has caused the appearance of\n            the Drawable to change (that is, it needs to be drawn), else false\n            if it looks the same and there is no need to redraw it since its\n            last state.":"如果国家的变化导致出现 \n             可以更改的绘制（也就是说，需要绘制），否则错误 \n             如果看起来相同，并且没有必要重新刷新，因为它 \n             最后状态。","A list of output configurations for the capture session.":"捕获会话的输出配置列表。","The new set of Surfaces that should be made available as\n                           targets for captured image data.":"应该提供的新表面 \n                            捕获的图像数据的目标。","Client-specified collection of input/output camera registered surfaces\n                                   that need to be switched to offline mode along with their pending\n                                   capture requests. Do note that not all camera registered\n                                   surfaces can be switched to offline mode. Offline processing\n                                   support for individual surfaces can be queried using\n                                   ":"客户指定的输入/输出摄像头注册表面的集合 \n                                    需要切换到离线模式以及他们的待处理 \n                                    捕获请求。 请注意，并非所有摄像机都注册了 \n                                    表面可以切换到离线模式。 离线处理 \n                                    可以使用对单个表面的支持"," instead.":"反而。","number of pixels to inset from the top bound":"从顶部绑定的像素数量","one of the sizes returned by ":"返回的尺寸之一"," permission, the\n            minimum delay is capped at 5000 microseconds (200 Hz).":"许可， \n             最小延迟限制为5000微秒（200 Hz）。","inclination matrix see ":"倾斜矩阵见","The full path to the font data.":"字体数据的完整路径。","Input configuration.":"输入配置。","the top padding in pixels, or -1 if not explicitly specified":"像素中的顶部填充，或-1（如果未明确指定）"," if the event could not be verified.":"如果无法验证事件。","boolean Returns true if this Drawable will be automatically mirrored.":"如果可以自动镜像此绘制，则布尔值将返回true。","Longitude of the geofence":"地理经度","padding for the bottom (in pixels)":"底部的填充（以像素为单位）","Display name.":"显示名称。","true if any part of the drawable is <em>not</em> opaque.":"正确，如果可绘制的任何部分是<em>不是不透明的。","the type of shape used by this drawable":"可绘制的形状类型","Latitude in WGS84 geodetic coordinates -- positive is east.":"WGS84大地坐标中的纬度 - 正向东。","One opacity value.":"一个不透明度值。","True of the animation will play once, false otherwise":"动画的真实会播放一次，否则否则","The group of multi-resolution stream info, which is used to create\n                       a multi-resolution reader containing a number of ImageReader objects. Each\n                       ImageReader object represents a multi-resolution stream in the group.":"多分辨率流信息组，用于创建 \n                        一个包含许多ImagerEader对象的多分辨率读取器。 每个 \n                        ImageReader对象代表组中的一个多分辨率流。","the drawable to wrap":"可以包裹的",". Additionally offline mode\n                                   switches are not available for shared surfaces\n                                   ":"。 另外，离线模式 \n                                    开关不适合共享表面","a text buffer to be shaped":"要形状的文本缓冲区","an array of integer format, or empty array if no multi-resolution reprocessing is\n                    supported":"一系列整数格式，如果没有多分辨率的重新处理，则空数阵列是 \n                     支持的","name string of the sensor. The name is guaranteed to be unique\n            for a particular sensor type.":"传感器的名称字符串。 该名称是唯一的 \n             对于特定的传感器类型。","A state callback interface implementation.":"状态回调接口实现。"," service object\n":"服务对象","The capture result of the output image or one of the output images used\n                                  to generate the reprocess input image for this capture request.":"输出图像的捕获结果或使用的输出图像之一 \n                                   为了生成此捕获请求的重新加工输入图像。"," collection for the given allowed authenticator types.":"给定的允许身份验证器类型的收集。","The desired delay between two consecutive events in microseconds.\n                       This is only a hint to the system. Events may be received faster or slower than\n                       the specified rate. Usually events are received faster. Can be one of\n                       ":"微秒中两个连续事件之间的所需延迟。 \n                        这只是系统的提示。 事件的收到的速度可能比 \n                        指定的费率。 通常，事件会更快地收到。 可以是之一","Inset in fraction (range: [0, 1)) of the inset content bounds.":"插图内容的插图（范围：[0，1））。","the explicit width of the layer, or -1 if not specified":"层的显式宽度，或-1（如果未指定）","Seekable file descriptor to read from.":"可从中读取可读取的文件描述符。","the default typeface that corresponds to the style":"与样式相对应的默认字体","The bounds of the drawable (which may change later, so caller\n                    beware). DO NOT ALTER the returned object as it may change the\n                    stored bounds of this drawable.":"可绘制的界限（可能以后会更改，因此呼叫者 \n                     谨防）。 请勿更改返回的对象，因为它可能会更改 \n                     存储了此绘制的界限。"," to turn off the\n                        torch mode.":"关闭 \n                         火炬模式。","Longitude in WGS84 geodetic coordinates -- positive is north.":"WGS84大地坐标中的经度 - 正向北。"," if the gradient should be scaled based on level,\n                    ":"如果应根据水平缩放梯度，","The geomagnetic inclination angle in radians.":"弧度中的地磁倾斜角。","a non-modifiable set of supported high speed video recording FPS ranges The upper\n                    bound of returned ranges is guaranteed to be greater than or equal to 120.":"一组不可修改的支持的高速视频记录FPS范围范围 \n                     返回范围的界限保证大于或等于120。","The canvas to draw into\n":"画布","Manufacturer product ID.":"制造商产品ID。","The id of the input device that was added.\n":"添加的输入设备的ID。"," or the delay in\n                       microseconds.":"或延迟 \n                        微秒。","an instance of your ShaderFactory implementation":"您的ShaderFactory实现的实例","The capture session input configuration.":"捕获会话输入配置。","A bit field representing the type(s) of authenticators that may be invoked by the\n            prompt (as defined by ":"一点点字段，表示可以由 \n             提示（如","the x and y radii of the corners":"角落的X和Y半径","the new width of the Shape":"形状的新宽度"," if the given session configuration is supported by the camera device\n                    ":"如果给定的会话配置由相机设备支持","The format of the Image that this multi-resolution reader will produce.\n                       This must be one of the ":"该多分辨率读者将产生的图像格式。 \n                        这一定是","the current zoom value. In smooth zoom mode, camera\n                  calls this for every new zoom value.":"当前的缩放值。 在光滑的变焦模式下，相机 \n                   为每个新的缩放值调用。","Radius of the geofence (in meters)":"地理半径（以米为单位）","the power in mA used by this sensor while in use":"使用该传感器时使用的MA功率","the wrapped drawable":"包裹的可绘制"," and surfaces\n                                   as part of a surface group.":"和表面 \n                                    作为表面组的一部分。","Left inset in pixels.":"将插图留在像素中。","The rectangle region to be compressed. The medthod checks if rectangle is\n                             inside the image. Also, the method modifies rectangle if the chroma pixels\n                             in it are not matched with the luma pixels in it.":"要压缩的矩形区域。 Medthod检查矩形是否是 \n                              图像内部。 另外，该方法会修改矩形，如果色度像素 \n                              其中不与其中的Luma像素匹配。","a shape result.":"形状结果。","Another opacity value.":"另一个不透明度值。","an image format from ":"图像格式","Altitude in WGS84 geodetic coordinates, in meters.":"WGS84大地坐标的高度，以米为单位。","rotation matrix see ":"旋转矩阵见","the left padding in pixels, or -1 if not explicitly specified":"像素中的左填充，或-1如果未明确指定","The left eye position, or ":"左眼位置，或","one of the FPS ranges returned by ":"返回的FPS范围之一"," constants. Note that not all formats are\n                       supported, like ImageFormat.NV21. The supported multi-resolution\n                       reader format can be queried by ":"常数。 请注意，并非所有格式都是 \n                        支持，例如ImageFormat.nv21。 支持的多分辨率 \n                        可以查询读者格式"," instance or null if no callback was set.":"实例或null如果未设置回调。","whether smooth zoom is stopped. If the value is true,\n                this is the last zoom update for the application.":"是否停止光滑变焦。 如果值为真， \n                 这是应用程序的最后一个缩放更新。","the radius for the corners of the rectangle":"矩形拐角的半径","The current state of the geofence. Can be one of\n                   ":"地理林的当前状态。 可以是之一","The callback to remove from the notification list":"从通知列表中删除的回调","Callback to add.":"回调要添加。","the gravity":"重力","A capture request that includes the initial values for any available\n                          session wide capture keys. Tags (see ":"捕获请求，其中包括任何可用的初始值 \n                           会话宽捕获键。 标签（请参阅","the new height of the Shape":"形状的新高度","the extension type":"扩展类型","The page index.":"页面索引。","), or 0 if this field was not set.":"），或0如果未设置此字段。","the width of the Drawable being drawn":"绘制的宽度被绘制","The name of the virtual display, must be non-empty.":"虚拟显示的名称必须是非空的。","the color state list used to fill this gradient, or ":"用于填充此梯度的颜色状态列表，或","The id of the input device that changed.\n":"更改的输入设备的ID。","Maximum time in microseconds that events can be delayed before\n                       being reported to the application. A large value allows reducing the power\n                       consumption associated with the sensor. If maxReportLatencyUs is set to zero,\n                       events are delivered as soon as they are available, which is equivalent to calling\n                       ":"在微秒中，最大时间可以延迟事件之前 \n                        被报告给应用程序。 大价值允许降低功率 \n                        与传感器相关的消耗。 如果MaxReportlatencyus设置为零， \n                        事件可在可用后立即交付，这相当于致电","The executor which will be used for invoking the offline callback listener.":"将用于调用离线回调侦听器的执行人。","an array of 3 floats to hold the result.":"一个3浮子的阵列以保持结果。","Hint to the compressor, 0-100. 0 meaning compress for\n                             small size, 100 meaning compress for max quality.":"提示压缩机，0-100。 0含义压缩 \n                              小尺寸，100表示最大质量的压缩。","Reporting mode for the input sensor, one of REPORTING_MODE_* constants.":"输入传感器的报告模式，其中一种是reporting_mode_*常数。","Time at which to evaluate the declination, in milliseconds\n                       since January 1, 1970. (approximate is fine -- the declination\n                       changes very slowly).":"评估偏差的时间，以毫秒为单位 \n                        自1970年1月1日以来。（大约是可以的 - 拒绝 \n                        变化非常缓慢）。","Top inset in pixels.":"顶部插图以像素为单位。","The picture to associate with the drawable. May be null.":"与可绘制的图片相关联。 可能是无效的。"," if unknown.":"如果未知。","A non-modifiable set of video sizes to create high speed capture sessions for high\n                    speed streaming use cases.":"一组不可修道的视频尺寸，以创建高速捕获会话 \n                     速度流用例。","A mask of the changing configuration parameters, as\n            defined by ":"不断变化的配置参数的掩码，如 \n             被定义为","the buffer to add to the queue. The size of the\n              buffer must match the values described above.":"缓冲区添加到队列中。 大小 \n               缓冲区必须匹配上述值。","the width of the shape (in pixels)":"形状的宽度（以像素为单位）","a byte array of the picture data":"图片数据的字节数组","a group of supported ":"一组支持","The number of layers.":"层数。","int The combined opacity value.":"int组合的不透明度值。",") and\n                          output targets (see ":"） 和 \n                           输出目标（请参阅","The maximum number of images the user will want to\n                       access simultaneously. This should be as small as possible to\n                       limit memory use. Once maxImages images are obtained by the\n                       user from any given internal ImageReader, one of them has to be released before\n                       a new Image will become available for access through the ImageReader's\n                       ":"用户想要的最大图像数 \n                        同时访问。 这应该尽可能小 \n                        限制内存使用。 一旦通过 \n                        来自任何给定的内部成像器的用户，其中之一必须在之前发布 \n                        新图像将用于通过Imagereader的访问","Callback to remove.":"回调要删除。","size of the capture output surface. If it is not in the supported\n                                     output sizes, maximum capture output size is used for the estimation":"捕获输出表面的大小。 如果不在支持中 \n                                      输出尺寸，最大捕获输出大小用于估计","the gravity applied to the bitmap":"重力应用于位图","the rotation matrix to be transformed. Usually it is the matrix\n                   returned by ":"要转换的旋转矩阵。 通常是矩阵 \n                    返回","the radius in pixels of the corners of the rectangle shape, or 0":"矩形形状角的像素的半径，或0","A page that can be rendered.":"可以渲染的页面。","The id of the input device that was removed.\n":"已删除的输入设备的ID。","List of the keys contained in this map.":"此地图中包含的键列表。","The width of the virtual display in pixels, must be greater than 0.":"像素中虚拟显示的宽度必须大于0。","An object that can be used to cancel authentication.":"可用于取消身份验证的对象。","(milliseconds) Defines the best-effort description\n                   of how soon should the callback be called when the transition\n                   associated with the Geofence is triggered. For instance, if\n                   set to 1000 millseconds with ":"（毫秒）定义最佳及时描述 \n                    过渡时应拨打回调多久 \n                    触发与地理林的关联。 例如，如果 \n                    设置为1000毫秒","Returns a mask of the changing configuration parameters, as\n            defined by ":"返回不断变化的配置参数的掩码，如 \n             被定义为","The callback object to notify for offline session events.":"回调对象以通知离线会话事件。","the heigh of the Drawable being drawn":"绘制的高度被绘制","the height of the shape (in pixels)":"形状的高度（以像素为单位）","The mouth position, or ":"嘴位置，或","the callback to run":"要运行的回调"," if callback didn't exist in the call back list, or ":"如果回调返回列表中不存在回调，或者","a format from ":"来自","OutputStream to write the compressed data.":"输出流以编写压缩数据。","The array values passed as argument.":"数组值作为参数传递。","The action being scheduled.":"被安排的动作。",") are ignored if\n                          set. Parameter values not part of\n                          ":"）如果 \n                           放。 参数值不是一部分","The declination of the horizontal component of the magnetic\n                    field from true north, in degrees (i.e. positive means the\n                    magnetic field is rotated east that much from true north).":"磁性的水平分量的下降 \n                     来自True North的领域，以程度（即正表示 \n                     磁场从真实的北部向东旋转。","Right inset in pixels.":"正确的像素插图。","resolution of the sensor in the sensor's unit.":"传感器单元中传感器的分辨率。","An internal ImageReader within ":"内部的成像器","padding mode, one of:\n                       <ul>\n                       <li>":"填充模式，之一： \n                        <ul> \n                        <li>"," is not\n                     a supported multi-resolution input, an empty group is returned.":"不是 \n                      支持的多分辨率输入，返回一个空组。","the contents of the preview frame in the format defined\n  by ":"定义格式中预览框架的内容 \n   经过","the picture associated with the drawable, or null.":"与可绘制的或无效的图片。","True if the hardware can control the led brightness, otherwise false.":"如果硬件可以控制LED亮度，则为错误。","The height of the virtual display in pixels, must be greater than 0.":"像素中虚拟显示的高度必须大于0。","the colors used to draw the gradient, or ":"用于绘制梯度的颜色，或","device-specific extension output format":"设备特定的扩展输出格式","An array of resource Ids to associate with the image.\n                            Switch to this image by calling setState().":"与图像相关联的一系列资源ID。 \n                             通过调用SetState（）切换到此图像。","defines the axis of the new cooridinate system that coincide with the X axis of the\n                   original coordinate system.":"定义与原始坐标系的X轴相吻合的新坐标系的轴。","a font buffer":"字体缓冲区"," if\n                    callback has been removed successfully.":"如果 \n                     回调已成功删除。","whether the camera should play the system shutter sound\n                           when ":"相机是否应该播放系统快门声音 \n                            什么时候","The right eye position, or ":"右眼位置，或","camera offline session which in case of successful offline switch will move in ready\n                    state after clients receive ":"摄像机离线会话，如果成功的离线开关将在准备好的情况下移动 \n                     客户收到的状态","the current color filter, or ":"当前的颜色过滤器或","An executor to handle callback events.":"执行人处理回调事件。","long frame number":"长框架号","The page count.":"页面计数。","Total field strength in nanoteslas.":"纳米纳特斯拉群岛的总场强。",",\n                   the callback will be called 1000 milliseconds within entering\n                   the geofence.":"，，，， \n                    该回调将在输入中称为1000毫秒 \n                    地理林。","True if anti-aliasing is enabled, false otherwise.":"如果启用了反缩减，则为fress，否则为否则。","The stream info describing the internal ":"描述内部的流信息","The time (in milliseconds) to run.":"时间（以毫秒为单位）运行。","the rotation vector to convert":"转换的旋转向量"," to nest each layer inside the\n                       padding of the previous layer\n                       <li>":"筑巢的每一层 \n                        上一层的填充 \n                        <li>","Bottom inset in pixels.":"底部插图以像素为单位。"," will also be ignored. It\n                          is recommended to build the session parameters using the same template type as\n                          the initial capture request, so that the session and initial request parameters\n                          match as much as possible.":"也将被忽略。 它 \n                           建议使用相同的模板类型构建会话参数 \n                           初始捕获请求，以便会话和初始请求参数 \n                           尽可能匹配。","The type of this sensor as a string.":"该传感器的类型作为字符串。","True if the compression is successful.":"如果压缩成功，则为真实。","an array of integer format, or empty array if multi-resolution output is not\n                    supported":"整数格式的数组，或空数组，如果多分辨率输出不是 \n                     支持的",". In case the\n                    offline switch was not successful clients will receive respective\n                    ":"。 万一 \n                     离线开关没有成功的客户将获得各自的","a non-modifiable set of sizes, or ":"一套不可修改的尺寸，或","String The physical camera device ID of the respective failing output.\n                    ":"将各个失败输出的物理相机设备ID串起。","True if the mipmap hint is set, false otherwise. If the bitmap\n                    is null, this method always returns false.":"如果设置了MIPMAP提示，则为true，否则为false。 如果是位图 \n                     为null，此方法始终返回false。",", which can be queried\n  with ":"，可以查询 \n   和"," if none set":"如果没有设置","an array containing the radii for each of the 4 corners, or\n                    ":"一个包含四个角中每个半径的阵列，或","An object to receive authentication events.":"接收身份验证事件的对象。","The image to show. Note this must be a unique Drawable that is not shared\n                            between any other View or Drawable otherwise the results are\n                            undefined and can lead to unexpected rendering behavior":"要显示的图像。 请注意，这必须是一个不共享的独特绘图 \n                             在任何其他视图或可绘制之间，否则结果是 \n                             未定义，可能导致意外的渲染行为","The density of the virtual display in dpi, must be greater than 0.":"DPI中虚拟显示的密度必须大于0。","True if the hardware can control the RGB led, otherwise false.":"如果硬件可以控制RGB LED，则为FALSE。","A capture request that includes the initial values for any available\n                    session wide capture keys.":"捕获请求，其中包括任何可用的初始值 \n                     会话宽捕获键。","The ripple color":"连锁颜色","The X (northward) component of the magnetic field in nanoteslas.":"纳米特拉斯中磁场的X（向北）组件。","The time limit after which the\n                   ":"时间限制在此之后"," to stack each layer directly\n                       atop the previous layer\n                       </ul>":"直接堆叠每一层 \n                        在上一层 \n                        </ul>","the range of estimated minimal and maximal capture latency in milliseconds\n            or null if no capture latency info can be provided":"毫秒中估计最小和最大捕获延迟的范围 \n             或null如果没有捕获延迟信息，则无效","a file path of the font":"字体的文件路径","If to scale the document.":"如果要扩展文档。","A group of multi-resolution input info for the specified format.":"指定格式的一组多分辨率输入信息。","A uri referring to local content:// or file:// image data.":"涉及本地内容的URI：//或file：//图像数据。","defines the axis of the new cooridinate system that coincide with the Y axis of the\n                   original coordinate system.":"定义与原始坐标系的Y轴一致的新坐标系的轴。","Left inset in fraction (range: [0, 1)) of the inset content bounds.":"插图的左插图（范围：[0，1））的界面内容边界。","The listener that will be run.":"将运行的听众。"," if the shutter sound state was successfully\n                    changed. ":"如果快门声音状态成功 \n                     更改。","The client's Callback implementation.":"客户的回调实现。"," is not\n                     a supported multi-resolution output, an empty group is returned.":"不是 \n                      支持的多分辨率输出，返回一个空组。","an array of floats in which to store the computed quaternion":"一系列浮子来存储计算的四个","generic type of this sensor.":"该传感器的通用类型。","the number of row bytes in each image plane.":"每个图像平面中的行字节数。","The surface to which the content of the virtual display should\n be rendered, or null if there is none initially.":"虚拟显示的内容应在 \n  渲染，或者如果最初没有。","A cryptographic operation to be unlocked after successful authentication.":"成功身份验证后将解锁的加密操作。","List of light ids in the request.":"请求中的光ID列表。"," if the format was not available.":"如果格式不可用。","the transformed rotation matrix. inR and outR should not be the same\n                   array.":"转换的旋转矩阵。 INR和OUT不应相同 \n                    大批。","Top inset in fraction (range: [0, 1)) of the inset content bounds.":"插图内容界限的最高插图（范围：[0，1））。","The content drawable, may be ":"可以绘制的内容，可能是","a result of the text measurement":"文本测量结果","Byte array storing compressed bitmap data of a type that\n                        ":"字节阵列存储压缩位图数据的类型","The capture session type.":"捕获会话类型。",".\n  If ":"。 \n   如果"," if the shutter sound state could not be\n                    changed. ":"如果百叶窗声状态无法 \n                     更改。","the orientation of the gradient defined in this drawable":"在此绘制中定义的梯度的方向"," in case the capture request has no associated physical camera device.":"如果捕获请求没有相关的物理摄像头设备。","The Y (eastward) component of the magnetic field in nanoteslas.":"纳米磁场中磁场的Y（向东）组件。","the current padding mode":"当前的填充模式","Format of the input buffers. One of ImageFormat or PixelFormat constants.":"输入缓冲区的格式。 ImageFormat或PixelFormat常数之一。","font variation settings":"字体变化设置","the state set to look up":"状态设置要查找","A copy of the drawable's bounds":"可绘制的边界的副本","The executor which will be used when invoking the callback.":"调用回调时将使用的执行人。"," notification.":"通知。"," transition\n                   should be triggered. This paramter is defined in milliseconds.":"过渡应触发。 该参数以毫秒为单位定义。","True if the bitmap should be anti-aliased, false otherwise.":"如果比特图应抗偏见，则为否则为错误。","The width in pixels of the camera stream":"相机流像素的宽度","the YUV data.":"YUV数据。","is an array of 9 floats holding the rotation matrix <b>R</b> when\n                   this function returns. R can be null.\n                   <p>":"是持有旋转矩阵<b> r </b>的9个浮子的数组 \n                    此功能返回。 r可以为null。 \n                    <p>","a non-":"非 - "," to remove the\n                       existing color filter":"删除 \n                        现有的颜色过滤器","a class which has a non-empty array returned by ":"一个具有非空数阵列的课程","A combination of virtual display flags:\n ":"虚拟显示标志的组合：","List of light states":"轻态清单","vendor string of this sensor.":"该传感器的供应商字符串。","an array of supported slower high-resolution sizes, or ":"一系列支持的较慢的高分辨率尺寸，或","The mask drawable, may be ":"可以绘制的面具，可能是","\n                        can decode (see ":"可以解码（请参阅","the index of the provided state set, or -1 if not found":"提供的状态集的索引，如果找不到-1","\n             is never called, the default will be the YCbCr_420_SP\n             (NV21) format.":"从来没有打电过，默认为ycbcr_420_sp \n              （NV21）格式。","for a single paragraph":"单段"," is also returned if shutter sound playback\n                    is already set to the requested state.":"如果快门声音播放也可以返回 \n                     已设置为请求的状态。","The description for the prompt, or null if the prompt has no description.":"提示的说明，如果提示没有说明，则为null。","Width of the input buffers.":"输入缓冲区的宽度。","Modified output configuration.":"修改后的输出配置。","the X-position of the center of the gradient":"梯度中心的X位置","The height in pixels of the camera stream":"相机流像素的高度","<code>true</code> on success. <code>false</code> if the input\n                    parameters are incorrect, for instance if X and Y define the same\n                    axis. Or if inR and outR don't have the same length.":"<code> true </code>成功。 <code> false </code>如果输入 \n                     参数不正确，例如，如果x和y定义了相同 \n                     轴。 或者如果INR和OUT的长度不相同。","Right inset in fraction (range: [0, 1)) of the inset content bounds.":"插图内容边界的右插图（范围：[0，1））。","True if the bitmap should use mipmaps, false otherwise.":"正确，如果位图应使用mipmap，则为false否则。","a glyph ID":"字形ID","the accessory description, or ":"附件描述，或","int The reason code.":"int原因代码。","The Z (downward) component of the magnetic field in nanoteslas.":"纳米磁场中磁场的Z（向下）组件。","the color and intensity in ARGB format. The A channel is ignored. return 0 when\n            calling LightsManager.getLightState with\n            ":"ARGB格式的颜色和强度。 A频道被忽略。 返回0时 \n             致电LightsManager.getLightState","Rect to receive the drawable's bounds (allocated by the\n                          caller).":"接收可绘制的界限（由 \n                           呼叫者）。","the right padding in pixels, or -1 if not explicitly specified":"像素中的正确填充，或-1（如果未明确指定）","is an array of 9 floats holding the rotation matrix <b>I</b> when\n                   this function returns. I can be null.\n                   <p>":"是持有旋转矩阵<b> i </b>的9个浮子的数组 \n                    此功能返回。 我可以无效。 \n                    <p>"," to use as the target for a capture request.":"用作捕获请求的目标。","the height of the image.":"图像的高度。","Callback to call when the state of the ":"当状态","The X coordinate of the center of the hotspot":"热点中心的X坐标","version of the sensor's module.":"传感器模块的版本。"," if the\n                    BURST_CAPTURE capability is not supported":"如果是 \n                     不支持burt_capture功能","an output-compatible size":"与输出兼容的大小"," object reference":"对象引用","Ripple color as a color state list.":"连锁颜色作为颜色状态列表。","Offset into <code>data</code> at which the bitmap data starts":"将位图数据启动的<code>数据偏移到<code>数据</code>","true if explicit user confirmation is required, or false otherwise.":"如果需要明确的用户确认，则为true。","The index of the drawable.":"可绘制的索引。","Horizontal component of the field strength in nanoteslas.":"纳米纳特斯拉群岛场强的水平分量。","Height of the input buffers.":"输入缓冲区的高度。","the Camera service object.\n":"相机服务对象。","The Canvas from which the density scale must be obtained.":"必须从中获得密度尺度的画布。","the Y-position of the center of the gradient":"梯度中心的Y位置","The request associated with this failed capture. Never ":"与此失败捕获相关的请求。 绝不","a line number of this paragraph":"本段的一行编号","List of keys supported by this CameraDevice for CaptureRequests.":"此cameradeVice为CaptureRequests支持的钥匙列表。","Bottom inset in fraction (range: [0, 1)) of the inset content bounds.":"插图的底部插图（范围：[0，1））的界面界限。","total number of accessible camera devices, or 0 if there are no\n              cameras or an error was encountered enumerating them.":"可访问的摄像头设备的总数，如果没有 \n               遇到摄像机或错误列举了它们。"," changes":"变化","a paint object used for resolving glyph style":"用于解决字形样式的油漆对象","The physical camera Id the camera stream is associated with":"相机流的物理相机ID与"," will be delivered.":"会被交付。","the player ID.":"玩家ID。","is an array of 3 floats containing the gravity vector expressed in\n                   the device's coordinate. You can simply use the\n                   ":"是3个浮子的阵列，其中包含在 \n                    设备的坐标。 您可以简单地使用","an array of supported high speed video recording FPS ranges The upper bound of\n                    returned ranges is guaranteed to be larger or equal to 120.":"一系列支持的高速视频记录FPS范围范围 \n                     返回的范围保证更大或等于120。","Length of the bitmap data":"位图数据的长度","The index of the layer to modify, must be in the range\n                         ":"要修改的图层的索引，必须在该范围内"," if not set":"如果未设置","The current drawable that will be used by this drawable. For simple drawables, this\n                    is just the drawable itself. For drawables that change state like\n                    ":"该绘制将使用的当前绘制可用于使用。 对于简单的可抽签，这是 \n                     只是可绘制的本身。 对于更改状态的可抽奖者","the width of the image.":"图像的宽度。","The inclination of the magnetic field in degrees -- positive\n                    means the magnetic field is rotated downwards.":"磁场的倾斜度为阳性 \n                     表示磁场向下旋转。","a minimum frame duration ":"最小框架持续时间","The ripple effect color as a color state list.":"连锁效果颜色作为颜色状态列表。","non-modifiable list of available sizes or an empty list if the Surface output is not\n            supported":"如果表面输出不 \n             支持的","the radius of the gradient in pixels":"像素中梯度的半径","unmodifiable list of partial results":"部分结果列表"," object to denote sensor to be operated.":"对象表示要操作的传感器。","The negative button text for the prompt, or null if no negative button text was set.":"提示的负按钮文本，如果未设置负面按钮文本，则为null。","The Y coordinate of the center of the hotspot":"热点中心的Y坐标","The handler on which the listener should be invoked, or null\n if the listener should be invoked on the calling thread's looper.":"应调用听众的处理程序或无效 \n  如果应该在调用线程的循环器上调用侦听器。","int The ID for the sequence of requests that this capture failure is the result of":"int iD的请求顺序，即此捕获失败是","an array of supported high speed video recording FPS ranges The upper bound of\n                    returned ranges is guaranteed to be greater than or equal to 120.":"一系列支持的高速视频记录FPS范围范围 \n                     返回的范围保证大于或等于120。","The DisplayMetrics indicating the density scale for this drawable.":"显示器表示该绘制的密度尺度。","an inclusive start index of the range":"该范围的包容性开始索引","a list of drawables to use as layers in this new drawable,\n                          must be non-null":"在此新的可绘制中用作层的可抽签列表， \n                           必须是非记器","a new Camera object for the first back-facing camera, or null if there is no\n             backfacing camera":"第一个背面摄像头的新相机对象，或者如果没有 \n              反向摄像头","format of this input configuration.":"此输入配置的格式。"," returned by a\n                   ":"由a返回","timestamp of the OIS sample.":"OIS样品的时间戳。","The drawable at the index.":"可在索引上绘制。","The sensor to be enabled.":"传感器可以启用。","the key name for the parameter":"参数的关键名称","The id associated with the geofence.":"与Geofence相关的ID。","a nullable destination object. If null is passed, this function just\n                                 return the horizontal advance. If non-null is passed, this function\n                                 fills bounding box information to this object.":"一个无效的目标对象。 如果通过了空，则此功能只是 \n                                  返回水平进步。 如果通过非挂钩，此功能 \n                                  将边界框信息填充到此对象。","List of keys supported by this CameraDevice for CaptureResults.":"该摄影库支持的钥匙列表。"," this will be the child drawable\n                    currently in use.":"这将是可以画的孩子 \n                     目前正在使用。","ripple radius in pixels, or ":"像素中的波纹半径或"," 0 in nanoseconds, or\n                     0 if the minimum frame duration is not available.":"0在纳秒中或 \n                      0如果最小框架持续时间不可用。","A path to a file that contains compressed bitmap data of\n                      a type that ":"文件的路径，其中包含压缩位图数据的 \n                       一种类型","the accessory manufacturer":"配件制造商","The drawable to set for the layer.":"可为图层设置的绘制。","the type of gradient used by this drawable":"该绘制使用的梯度类型","an exclusive end index of the range":"该范围的独家端索引","The subtitle for the prompt, or null if the prompt has no subtitle.":"该提示的字幕，如果提示没有字幕，则为null。","position in pixels of the left bound":"位于左键的像素","unmodifiable map between physical camera ids and their capture result metadata":"物理摄像头ID与其捕获结果元数据之间的不可变化图","the YUV format as defined in ":"定义的YUV格式","an array of supported high speed video recording sizes":"一系列支持的高速视频记录大小","The density scale for this drawable.":"该绘制的密度尺度。","rate level defined in ":"定义的速率水平","True if this <code>HardwareBuffer</code> is in a closed state,\n                    false otherwise.":"是的，如果此<code> HardwareBuffer </code>处于封闭状态， \n                     否则为错误。","non-modifiable list of available sizes or an empty list if the format is not\n            supported.":"如果格式不是 \n             支持的。","The type of the hardware subsystem that should be used\n                   to monitor the geofence.":"应该使用的硬件子系统的类型 \n                    监视地理林。","boolean True if the image was captured, false otherwise.":"布尔值为true如果捕获图像，则否则为错误。","the amount of horizontal advance in pixels":"像素中的水平进步量"," of a\n                   ":"一个","The drawable to add as a new layer.":"可绘制的添加为新层。","true if the sensor was successfully enabled.":"如果成功启用了传感器，则为是真的。","the hardware camera to access, between 0 and\n                ":"访问的硬件摄像头在0到","The display object, or null if there is no valid display with the given id.":"显示对象，如果没有有效的显示，则显示对象或null。","focus distances in meters. output must be a float\n        array with three elements. Near focus distance, optimal focus\n        distance, and far focus distance will be filled in the array.":"仪表仪的聚焦距离。 输出必须是浮标 \n         带有三个元素的数组。 接近焦点距离，最佳焦点 \n         距离和远距离距离将在阵列中填充。","height of this input configuration.":"此输入配置的高度。","List of keys that can be overridden in individual physical device requests.\n            In case the camera device doesn't support such keys the list can be null.":"可以在单个物理设备请求中覆盖的密钥列表。 \n             如果相机设备不支持此类密钥，则列表可能为空。","The dirty bounds of this drawable":"这个可绘制的肮脏界限","shift of the OIS sample in x direction.":"OIS样品沿X方向移动。","The index of the state set.":"状态集的索引。","The title of the prompt, which is guaranteed to be non-null.":"提示的标题，保证是非无效的。","the accessory model":"配件模型","The color state list used to fill the shape":"用于填充形状的颜色状态列表"," object associated with the\n                   geofence.":"与 \n                    地理林。","The replacement ":"替换","position in pixels of the top bound":"位于顶部绑定的像素"," of type\n                   ":"类型"," can decode.":"可以解码。","Additional flags about how the object should be written.\n                         May be 0 or ":"有关如何编写对象的其他标志。 \n                          可能是0或","a new Camera object, connected, locked and ready for use.":"连接，锁定并准备使用的新相机对象。","non-modifiable list of available extensions":"可用扩展名的不可修改列表","a non-modifiable set of supported sizes for ":"一套不可修改的支撑大小","one of the FPS range returned by ":"返回的FPS范围之一","an output parameter":"输出参数","The X repeat mode for this drawable.":"可绘制的X重复模式。","drawable that should be rendered in the background":"应在后台渲染的可绘制"," to\n                          compute the radius based on the container size":"至 \n                           根据容器尺寸计算半径","The index of the new layer.":"新层的索引。","a paint object used for retrieving font metrics.":"用于检索字体指标的油漆对象。","unmodifiable map between physical camera ids and their total capture result metadata":"物理摄像头ID与其总捕获结果元数据之间的地图不可变化","* starting report or changing rate: positive sensor report token on success,\n                                                        0 on failure;\n                    * stopping report: 1 on success, 0 on failure.":"*启动报告或变化率：正面传感器报告成功的代币， \n                                                         0失败； \n                     *停止报告：1关于成功的1，失败0。","An array containing all displays.":"一个包含所有显示的数组。","available sensors.":"可用的传感器。","The result field to read.":"结果字段要读取。","shift of the OIS sample in y direction.":"OIS样品向y方向移动。","List of keys that can be passed during capture session initialization. In case the\n            camera device doesn't support such keys the list can be null.":"在捕获会话初始化期间可以通过的键列表。 万一 \n             相机设备不支持此类密钥，列表可以为null。",".\n                   <p>":"。 \n                    <p>","The ConstantState associated to that Drawable.":"与该绘图相关联的恒定态。","the int value of the parameter\n":"参数的int值","this input configuration is multi-resolution or not.":"该输入配置是否是多分辨率。","The state set at the index.":"状态设置为索引。","the settings for this capture":"此捕获的设置","The context for the application whose resources should be used to resolve the\n                           given resource ID.":"应该使用资源来解决的应用程序的上下文 \n                            给定的资源ID。","The color used to fill the shape":"用于填充形状的颜色"," that will be use to notify the\n                   transition.":"这将被用来通知 \n                    过渡。"," was replaced (could return false if\n                    the id was not found).":"被替换（如果 \n                     没有找到ID）。","the radius in pixels of the fully expanded ripple if an explicit\n                    radius has been set, or ":"如果有明确的，则完全展开的连锁的像素的半径 \n                     半径已设置，或者","the unique serial number, or ":"唯一的序列号，或","the angle that the picture will be rotated clockwise.\n                           Valid values are 0, 90, 180, and 270.":"图片将顺时针旋转的角度。 \n                            有效值为0、90、180和270。","an array big enough to hold at least [TODO: @value for `#COUNT`] elements after the\n                     ":"一个足够大的数组至少可以容纳[todo：@value for`＃count']元素","drawable that should be rendered in the foreground":"应在前景中渲染的可绘制","an offset of the character.":"角色的偏移。","position in pixels of the right bound":"位于正确绑定的像素","An array of video sizes to create high speed capture sessions for high speed streaming\n                    use cases.":"一系列视频尺寸，以创建高速捕获会话 \n                     用例。","the String value of the parameter\n":"参数的字符串值","The new accuracy of this sensor, one of\n                    ":"该传感器的新准确性，之一","the bottom padding in pixels, or -1 if not explicitly specified":"像素中的底部填充，或-1如果未明确指定","The characteristics field to read.":"要阅读的特征字段。","the executor which will be used for invoking the\n                            listener.":"将用于调用的执行人 \n                             听众。"," format,\n                     or ":"格式， \n                      或者","a long value (guaranteed to be finite)":"长期价值（保证是有限的）","a nullable destination object. If null is passed, this function only\n                             retrieve recommended interline spacing. If non-null is passed, this function\n                             fills to font metrics to it.":"一个无效的目标对象。 如果通过了空，则仅此功能 \n                              检索推荐的交织间距。 如果通过非挂钩，此功能 \n                              填充字体指标。","<code>true</code> if channel is valid.":"<code> true </code>如果频道有效。","The Y repeat mode for this drawable.":"该绘制的Y重复模式。","ID of the drawable resource":"可绘制资源的ID","a SensorListener object":"一个感觉列表对象"," if this is a reprocess capture request. ":"如果这是重新处理捕获请求。","The requested display category or null to return all displays.":"请求的显示类别或null返回所有显示。","the rect to populate with the hotspot bounds":"用热点边界填充的矩","an array containing 2 or more ARGB colors":"一个包含2个或更多ARGB颜色的阵列","true when the geofence is successfully sent to the hardware for addition.":"在成功发送到硬件以添加的硬件时，是事实。","is an array of 3 floats containing the geomagnetic vector\n                   expressed in the device's coordinate. You can simply use the\n                   ":"是包含地磁载体的3个浮子的阵列 \n                    在设备的坐标中表示。 您可以简单地使用","width of this input configuration.":"此输入配置的宽度。","a non-negative offset into the array":"阵列中的非负偏移"," if the radius is\n                    computed based on the container size":"如果半径是 \n                     根据容器大小计算","The number of states contained in this drawable.":"此绘制中包含的状态数量。","position in pixels of the bottom bound":"位于底部绑定的像素","the background drawable managed by this drawable":"可绘制的可绘制的背景","The callback object to notify once this request has been\n            processed. If null, no metadata will be produced for this capture,\n            although image data will still be produced.":"此请求后要通知的回调对象 \n             处理。 如果无效，则不会生成此捕获的元数据， \n             尽管仍将生成图像数据。","the accessory URI, or ":"附件URI或","The callback to run":"要运行的回调","the end padding in pixels, or -1 if not explicitly specified":"像素中的末端填充，或-1（如果未明确指定）","total amount of advance":"预付总数","GPS altitude in meters.\n":"GPS高度为米。","a floating point value (guaranteed to be finite)":"浮点值（保证是有限的）","The id to assign to the layer.":"为分配给图层的ID。"," frame\n            reported from sensor hardware.":"框架 \n             从传感器硬件报告。","The callback object to notify once this request has\n                            been processed.":"此请求有一个回调对象 \n                             已处理。","an array of integer format":"整数格式","a locale list":"语言环境列表"," on which flush was called.":"在哪个冲洗上被称为。"," is not a supported output.":"不是支持的输出。"," if the bitmap does not repeat,\n                    ":"如果位图不重复，","Name of the package containing the resource in question":"包含所讨论资源的软件包的名称","The value of that key, or ":"该键的价值，或","a SensorEventListener object":"SensoreDentListener对象","\n                     elements after the ":"之后的元素","True to enable cross fading, false otherwise.":"忠实于启用交叉褪色，否则为错误。","the column index in the the raw pixel array.":"原始像素数组中的列索引。","An array containing all displays sorted by order of preference.":"包含所有显示的数组，按优先顺序排序。","optional array of floating point parameters representing the positions\n                           of the colors. Null evenly disperses the colors":"代表位置的浮点参数的可选阵列 \n                            颜色。 无效均匀分散颜色","true if this drawable actually has a padding, else false. When false is returned,\n            the padding is always set to 0.":"是的，如果可绘制的绘制实际上有填充，则是错误的。 返回false时 \n             填充始终设置为0。","the handler on which the listener should be invoked, or\n            ":"应调用听众的处理程序，或者","An array of all the monitoring types.\n                    An array of length 0 is returned in case of errors.":"所有监视类型的数组。 \n                     如果发生错误，则返回长度为0的数组。","the gravity to set for the layer":"为层设定的重力"," if this is not a\n            reprocess capture request.":"如果这不是 \n             重新计算捕获请求。","The layer ID to search for.":"要搜索的图层ID。","the resolved layout direction for the drawable,\n                                   either ":"可绘制的解决布局方向， \n                                    任何一个","starting angle in degrees":"开始角度","effective ascent value":"有效上升值","the accessory version, or ":"配件版本，或","int A unique capture sequence ID used by\n            ":"int使用的唯一捕获序列ID","A Surface for camera to output to.\n            \n            <p>This constructor creates a default configuration, with a surface group ID of\n            [TODO: @value for `#SURFACE_GROUP_ID_NONE`].</p>":"摄像机输出的表面。 \n            \n             <p>此构造函数创建默认配置，并具有一个表面组ID \n             [todo：@value for`＃surface_group_id_none`]。</p>","GPS latitude coordinate.\n":"GPS纬度坐标。","<code>true</code> on success, <code>false</code> on failure (for\n                    instance, if the device is in free fall). Free fall is defined as\n                    condition when the magnitude of the gravity is less than 1/10 of\n                    the nominal value. On failure the output matrices are not modified.":"<code> true </code>成功，<code> false </code>失败（用于 \n                     实例，如果设备处于自由下落）。 自由跌倒定义为 \n                     当重力大小小于1/10时的条件 \n                     名义值。 故障时，输出矩阵未修改。","The ID of the sensor being monitored":"传感器的ID正在监视","the sensor to unregister from":"从中注册的传感器","The listener on which the\n                   ":"听众","an unique identifier for the font source data.":"字体源数据的唯一标识符。","The handler on which the listener should be invoked, or null\n            if the listener should be invoked on the calling thread's looper.":"应调用听众的处理程序或无效 \n             如果应该在调用线程的循环器上调用侦听器。","the listener to notify":"听众通知","the foreground drawable managed by this drawable":"可绘制的可绘制的前景","a non-empty array of sizes, or ":"一系列非空数或","True if cross fading is enabled, false otherwise.":"如果启用了交叉褪色，则为true，否则为false。","a non-modifiable set of supported sizes,\n                     or ":"一套不可修改的支撑大小， \n                      或者","An array of resource Ids describing the current state.":"描述当前状态的一系列资源ID。","the drawable to clip":"可绘制的剪辑"," in which to load the drawable; used\n                           to access ":"在其中加载可绘制的； 用过的 \n                            访问"," to use the current thread's ":"使用当前线程的","The callback object to notify every time the\n                            request finishes processing.":"每次通知的回调对象 \n                             请求完成处理。","\n                                   or ":"或者","color channel from ":"颜色通道来自"," if the field is not set.":"如果未设置字段。","the row index in the raw pixel array.":"原始像素数组中的行索引。","an array of length >= 8 containing 4 pairs of X and Y\n                         radius for each corner, specified in pixels":"长度> = 8的阵列包含4对x和y \n                          每个角的半径，以像素为单位","the interface":"接口","starting angle for rotation in degrees":"旋转的起始角度","The new accuracy of this sensor.":"该传感器的新准确性。","The id of the logical display that was added.\n":"添加的逻辑显示的ID。","an array of floats in which to store the rotation matrix":"一系列用于存储旋转矩阵的浮子","Size for the deferred surface.":"递延表面的大小。","the index of the layer to adjust":"层的索引调整"," for the highest-indexed layer that has the\n                    given ID, or null if not found.":"对于具有的最高指数层 \n                     给定的ID或未找到的null。","the last tag Object set on this request, or ":"此请求上设置的最后一个标签对象，或","int A unique capture sequence ID used by\n                        ":"int使用的唯一捕获序列ID","effective descent value":"有效下降值","GPS longitude coordinate.\n":"GPS经度坐标。","\n                   is delivered.It should be the same as the one used\n                   in ":"交付。它应该与使用的 \n                    在","a callback object that receives a copy of the next preview frame,\n                or null to stop receiving callbacks.":"接收下一个预览帧副本的回调对象， \n                 或null停止接收回调。","the mask path object used to clip the drawable":"用于剪辑可绘制的掩模路径对象","Current status of the monitoring type.":"监视类型的当前状态。","a font style":"字体样式","a class which is supported by ":"由","The duration to use if no transition is running.":"如果没有过渡，则使用的持续时间。","X position around which to rotate":"x旋转的位置","The id of the logical display that changed.\n":"更改的逻辑显示的ID。"," is specified\n            for this drawable.":"指定 \n             为此可绘制。","The radius in pixels of the corners of the rectangle shape":"矩形形状角的像素的半径","gravity constant (see ":"重力常数（见"," is not a supported output":"不是支持的输出","Use case id.":"用例ID。",", for example.":"， 例如。","the configuration's ID":"配置的ID","a bit masks of the sensors to unregister from":"有点掩盖传感器，可以从中注册","The new level, from 0 (minimum) to 10000 (maximum).":"新级别从0（最小）到10000（最大）。","a color channel offset.":"颜色通道偏移。","The set of combinations of currently connected camera devices, that may have\n                    sessions configured concurrently. The set of combinations will be empty if no such\n                    combinations are supported by the camera subsystem.":"当前连接的相机设备的组合集，可能具有 \n                     会话同时配置。 如果没有这样的组合，则组合将是空的 \n                     相机子系统支持组合。","within the range [0, ":"在范围内[0，"," object reference that indicates the source of\n                       this surface. Only ":"指示来源的对象参考 \n                        这个表面。 仅有的","a list of sensors matching the asked type.":"匹配询问类型的传感器列表。"," if\n                no tag has been set.":"如果 \n                 没有设置标签。","the Parameters to use for this Camera service":"用于此相机服务的参数","The ID of the layer to return.":"要返回的图层的ID。","height in pixels, or -1 to use the intrinsic height":"像素的高度或-1用于使用固有高度","the glyph index":"字形索引","a TTC index value":"TTC索引值","The length of the transition in milliseconds":"毫秒的过渡长度","The processing method to get this location.\n":"获取此位置的处理方法。","The new values for the sensor.":"传感器的新值。","An array of resource IDs to associate with the keyframe":"一系列资源ID与密钥帧关联","the list of settings for this burst capture":"此爆发捕获的设置列表","The type of the gradient: ":"梯度的类型：","true if the X pivot represents a fraction of the drawable\n                       width, or false if it represents an absolute value in pixels":"如果X枢轴表示可绘制的一小部分，则为true \n                        宽度，如果代表像素中的绝对值，则宽度"," used to position\n                           the clipped drawable within the parent container":"用于定位 \n                            可在父容器中绘制的剪裁","A fresh instance of a drawable for this image, yours to keep.":"该图像可绘制的新实例，可以保留。","The sensor to check":"传感器检查"," and has a\n                     non-empty array returned by ":"并有一个 \n                      返回的非空数组","The id of the geofence.":"Geofence的ID。","Resources used to resolve attribute values":"用于解析属性值的资源","The sensor for which the trigger request should be canceled.\n                   If null, it cancels receiving trigger for all sensors associated\n                   with the listener.":"应取消触发请求的传感器。 \n                    如果无效，它会取消接收所有相关传感器的触发器 \n                    与听众。"," 0 in nanoseconds, or 0 if the stall duration is\n                    not available.":"0在纳秒中，或0如果失速持续时间为 \n                     无法使用。","a gain factor >= [TODO: @value for `#MINIMUM_GAIN_FACTOR`]":"增益因子> = [todo：@value for`＃minimum_gain_factor`]","The index of the layer with the specified ID.":"带有指定ID的图层索引。","The id of the camera device to query. This could be either a standalone\n            camera ID which can be directly opened by ":"相机设备查询的ID。 这可能是独立的 \n             可以直接打开的相机ID","the number of endpoints":"端点的数量","Returns true if this change in level has caused the appearance\n            of the Drawable to change (hence requiring an invalidate), otherwise\n            returns false.":"如果这种级别的变化导致外观，则返回真实 \n             可更改可绘制的（因此需要无效），否则 \n             返回false。","A group ID for this output, used for sharing memory between multiple outputs.":"该输出的组ID，用于在多个输出之间共享内存。"," in which to load the drawable; see\n                           ":"在其中加载可绘制的； 看","number of pixels to add to the left bound":"添加到左键的像素数","<code>true</code> if dynamic sensor discovery is supported, <code>false</code>\n            otherwise.":"<code> true </code>如果支持动态传感器发现，<code> false </code> \n             否则。","the angle (in degrees) where the arc begins":"弧开始的角度（以度为单位）","The drawable to show when in the specified state, may not be null":"在指定状态下的绘制可显示的可能不为null","bitwise-or of ":"钻头或","the font object used for drawing the glyph at the given index":"用于在给定索引上绘制字形的字体对象","XML parser from which to inflate this Drawable":"XML解析器可以从中膨胀此绘制","The callback object to notify each time one of the\n            requests in the burst has been processed. If null, no metadata will be\n            produced for any requests in this burst, although image data will still\n            be produced.":"回调对象，以通知每次 \n             爆发中的请求已被处理。 如果无效，则不会 \n             在此爆发中为任何请求生成，尽管图像数据仍将 \n             被生产。","true when the geofence is successfully sent to the hardware for pausing.":"在成功发送到硬件进行暂停时，是事实。","true if successfully canceled.":"如果成功取消，则为真实。","an index of the font":"字体索引","whether the toggle for the sensor is supported on this device.":"该设备上是否支持传感器的切换。","a stall duration ":"摊位持续时间"," where each gain factor >= [TODO: @value for `#MINIMUM_GAIN_FACTOR`]":"每个增益因子> = [todo：@value for`＃minimum_gain_factor`]","An object that implements the\n                   ":"实现的对象","number of pixels to add to the top bound":"像素的数量要添加到顶部绑定","The id of the logical display that was removed.\n":"删除的逻辑显示的id。\n","The index of the layer, must be in the range\n                         ":"层的索引必须在该范围内","a callback object that receives a copy of each preview frame,\n                or null to stop receiving callbacks.":"接收每个预览帧副本的回调对象,\n                或null停止接收回调。","the configuration's remote-wakeup attribute":"配置的远程启动属性","The camera ID for the camera that produced this capture result.":"产生此捕获结果的相机的相机ID。"," or null in case the camera device\n                    doesn't have any recommendation for this use case or the recommended configurations\n                    are invalid.":" 或空的情况下，相机设备\n                    对此用例或推荐的配置没有任何建议\n                    是无效的。","a new ":"一个新的 ","true if the X pivot represents a fraction of the drawable width,\n                    or false if it represents an absolute value in pixels":"如果x枢轴表示可绘制宽度的一小部分，则为true,\n                    如果它表示以像素为单位的绝对值，则为false",",\n                            ":",\n                            ","an array of supported sizes for ":"支持的大小数组 ","The unique identifier for the keyframe":"密钥帧的唯一标识符","the sweep angle (in degrees). Anything equal to or\n                              greater than 360 results in a complete circle/oval.":"扫角（以度为单位）。 等于或等于或 \n                               大于360个导致完整的圆/椭圆形。"," shared memory object.":"共享内存对象。","A Surface for camera to output to.":"相机输出到的表面.","Base set of attribute values":"属性值的基础集"," to send to its target once the drawable\n                           is available. The ":" 发送到它的目标，一旦drawable\n                           是可用的。 该 ","a registered font":"注册字体","The surface to set, or null to detach the surface from the virtual display.":"要设置的表面，或从虚拟显示中分离表面。","The new set of states to be displayed.":"要显示的新状态集。",", or a physical camera ID that\n            can only used as part of a logical multi-camera.":"，或物理相机ID\n            只能用作逻辑多摄像机的一部分。","List of camera characteristic keys that require the\n                    ":"需要的相机特征键列表","An glyph ID of the font.":"字体的字形ID。","The frame number":"帧号"," at the specified layer index.":"在指定的层索引处。"," iff the ":"iff","Maximum number of events of this sensor that could be batched. If this value is zero\n            it indicates that batch mode is not supported for this sensor. If other applications\n            registered to batched sensors, the actual number of events that can be batched might be\n            smaller because the hardware FiFo will be partially used to batch the other sensors.":"该传感器可批处理的最大事件数。 如果此值为零\n            它表示此传感器不支持批处理模式。 如果其他应用\n            注册到批处理传感器，可以批处理的实际事件数可能是\n            较小，因为硬件FiFo将部分用于批量其他传感器。","the executor which will be used for invoking the listener.":"将用于调用侦听器的执行器。","GPS timestamp (UTC in seconds since January 1,\n                  1970).\n":"GPS时间戳（UTC以秒为单位，自1月1日,\n                  1970).\n"," and/or\n                              ":" 和/或\n                              ","Type of the monitor":"显示器的类型","Theme to apply, may be null":"主题适用，可能是无效的"," object\n                   which was previously used in a registerListener call.":"目的 \n                    以前在registerListener呼叫中使用。","the desired orientation (angle) of the gradient":"梯度的所需方向（角度）","The details of the event.\n":"事件的细节。\n","object associated with the call or null if none required.":"与呼叫或null关联的对象（如果不需要）。","\n                   interface for receiving callbacks.":"\n                   用于接收回调的接口。"," permission. The list can be empty in case\n                    there are no currently present keys that need additional permission.":"允许。 如果列表可以为空，以防万一 \n                     目前没有需要额外许可的密钥。","the number of fonts registered in this family.":"该家庭注册的字体数量。","number of pixels to subtract from the right bound":"要从右边界中减去的像素数","The callback object to notify each time one of the\n            requests in the burst has been processed.":"回调对象，以通知每次 \n             爆发中的请求已被处理。"," 0 in nanoseconds":" 0以纳秒为单位","The request associated with this result. Never ":"与此结果相关的请求。 绝不","A X offset in pixels":"像素中的X偏移量","a callback object that receives a copy of the preview frame,\n                or null to stop receiving callbacks and clear the buffer queue.":"接收预览帧副本的回调对象,\n                或null停止接收回调并清除缓冲区队列。","Number of events reserved for this sensor in the batch mode FIFO. This gives a\n            guarantee on the minimum number of events that can be batched.":"在批处理模式下为该传感器保留的事件数量。 这给出了 \n             保证可以批处理的最小事件数量。","the configuration's self-powered attribute":"配置的自供电属性","CharSequence with the mandatory combination description.":"CharSequence与强制性组合描述。"," with non-negative width and height":" 具有非负宽度和高度","the intrinsic height, or -1 if no intrinsic height":"固有高度，或-1如果没有固有高度","Set of physical camera ids for this logical camera device.":"该逻辑相机设备的一组物理摄像头ID。","sensor listener object":"传感器侦听器对象","Callback that will be called.":"将被调用的回调。","the sweep angle (in degrees)":"扫描角度（以度为单位）","an object that can be used to cancel authentication":"可用于取消身份验证的对象","Y position around which to rotate":"绕其旋转的Y位置","Unique identifier of the starting keyframe":"起始关键帧的唯一标识符","a non-modifiable set of Integer formats":"一组不可修改的整数格式","The sensor pixel mode this OutputConfiguration will be used with\n            </p>":"该输出配置将与传感器像素模式一起使用\n            </p>","\n                           property is populated with the Drawable.":"\n                           属性使用Drawable填充。","containing the Surface on which to place the preview,\n                or null to remove the preview surface":"包含放置预览的表面， \n                 或无效以删除预览表面","Returns true if this change in state has caused the appearance\n            of the Drawable to change (hence requiring an invalidate), otherwise\n            returns false.":"如果此状态更改已导致外观，则返回true\n            的Drawable更改（因此需要无效），否则\n            返回false。","the configuration's max power":"配置的最大功率","The properties of the given camera":"给定相机的属性","optional flags; should be 0":"可选标志； 应该是0","the intrinsic width, or -1 if no intrinsic width":"固有宽度，如果没有固有宽度，则-1","Highest direct report rate level of this sensor. Note that if the app does not have\n            the ":"该传感器的最高直接报告率水平。 请注意，如果该应用没有 \n             这","a bit masks of the sensors to register to":"有点掩盖传感器要注册到","an array of supported sizes,\n                     or ":"支持大小的数组,\n                     或 ","The high speed capture request that will be used to generate the high speed\n                           request list.":"将用于产生高速的高速捕获请求 \n                            请求列表。","a non-modifiable set of supported high speed video recording FPS ranges The upper\n                    bound of returned ranges is guaranteed to be larger or equal to 120.":"一组不可修改的支持的高速视频记录FPS范围范围 \n                     返回范围的绑定保证更大或等于120。","The drawable that is requesting the update.\n":"请求更新的drawable。\n","the width of the thumbnail, in pixels":"缩略图的宽度，以像素为单位","<code>true</code> if the flush is initiated successfully on all the sensors\n                    registered for this listener, false if no sensor is previously registered for this\n                    listener or flush on one of the sensors fails.":"<code>true</code>如果在所有传感器上成功启动刷新\n                    为此侦听器注册，如果以前未为此注册任何传感器，则为false\n                    感器之一上的监听器或刷新失败。","Left padding of the gradient shape":"渐变形状的左侧填充","The details of the event.":"事件的细节。","a weight value":"一个权重值","a non-modifiable set of supported high speed video recording sizes":"一套不可修道的高速视频记录大小","whether this drawable filters its bitmaps":"是否可以绘制可过滤其位图","number of pixels to subtract from the bottom bound":"要从底边减去的像素数","The callback object to notify once this request has been\n            processed.":"一旦此请求已被通知的回调对象\n            处理过的。","int The ID for the sequence of requests that this capture result is a part of":"此捕获结果是其中一部分的请求序列的ID","A Y offset in pixels.":"以像素为单位的Y偏移。","The id of the layer or ":"层的id或 ","a Path that defines the geometric paths for this shape":"定义此形状的几何路径的路径","true on success":"成功的真谛"," in case the mandatory stream combination contains an input,\n                    ":" 如果强制流组合包含一个输入,\n                    ","One of supported modes for the capability. For example, for available extended\n            scene modes, this will be one of ":"能力的支持模式之一。 例如，对于可用的扩展\n            场景模式，这将是一个 ","to be ":"要成为 ","Unique identifier of the ending keyframe":"结束关键帧的唯一标识符","Color to use for tinting this drawable":"用于着色此drawable的颜色","The surface to be added.":"要添加的表面。"," to which the preview\n                images are to be sent or null to remove the current preview surface\n                texture":" 预览\n                要发送图像或为null以删除当前预览图面\n                纹理","the configuration's name, or ":"配置的名称，或 ","The id of the camera device to query. This must be a standalone\n            camera ID which can be directly opened by ":"摄像设备的id进行查询。 这必须是一个独立的\n            相机ID，可直接由 ","True if the Y pivot represents a fraction of the drawable\n                       height, or false if it represents an absolute value in pixels":"如果Y枢轴表示可绘制的一小部分，则为True\n                       高度，如果它表示以像素为单位的绝对值，则为false","an object to receive authentication events":"接收身份验证事件的对象","<code>true</code> if the sensor is supported and successfully\n                    enabled":"<code>true</code>如果传感器支持并成功\n                    已启用","A unmodifiable CaptureRequest list that is suitable for constrained high speed\n                    capture.":"适用于受约束高速的不可修改的CaptureRequest列表\n                    捕获。"," if this class is supported as an output, ":" 如果此类作为输出支持, ","The drawable being scheduled.":"正在计划的抽签。","the height of the thumbnail, in pixels":"缩略图的高度，以像素为单位"," permission, the highest\n            direct report rate level is ":" 许可，最高\n            直接报告率水平为 ","pressure at sea level":"海平面气压","Top padding of the gradient shape":"渐变形状的顶部填充"," if the user does not have any strong\n                biometrics enrolled, or ":" 如果用户没有任何强\n                登记生物测定学，或 "," if this is supported, ":" 如果支持这一点, ","True if this drawable changes its appearance based on state,\n                    false otherwise.":"如果此drawable根据状态更改其外观，则为True,\n                    否则是假的。"," that\n                       have had ":" 那个\n                       有过 ","a slant value":"倾斜值","an object containing the static\n                     ":"包含静态的对象\n                     ","the number of glyphs":"字形的数量"," if the\n                    layer has no id.":" 如果\n                    层没有id。","true when the geofence is successfully sent to the hardware for removal.                     .":"当地理围栏成功发送到硬件进行删除时为true。                     .","Non-modifiable list of stream information.":"流信息的不可修改列表。","number of pixels to inset from the end bound, or\n                    ":"从结束边界插入的像素数，或\n                    ",", and\n            ":"，而\n            "," when\n                            ":" 何时\n                            "," drawable to use as a transition, may not be null":" drawable用作过渡，可能不是null","The multi-resolution image reader object.":"的多分辨率图像读取器对象。","BlendMode to apply to the drawable, a value of null sets the default\n                             blend mode value of ":"BlendMode要应用于drawable，值为null设置默认值\n                             混合模式值 "," if the property could not be read":" 如果无法读取该属性","The list of currently connected camera devices.":"当前连接的摄像设备列表。","zoom value. The valid range is 0 to ":"缩放值。 有效范围为0至 ","the standard width for the shape. Any changes to the\n                            width with resize() will result in a width scaled based\n                            on the new width divided by this width.":"形状的标准宽度。 任何更改\n                            使用resize()的宽度将导致基于缩放的宽度\n                            在新的宽度除以这个宽度。","true if the Y pivot represents a fraction of the drawable height,\n                    or false if it represents an absolute value in pixels":"如果Y枢轴表示可绘制高度的一小部分，则为true,\n                    如果它表示以像素为单位的绝对值，则为false","an optional handler to handle callback events":"处理回调事件的可选处理程序"," to register to.":" 注册到。","An enumeration selecting the audio restriction mode for this camera device.":"选择此相机设备的音频限制模式的枚举。"," iff using a ":" iff使用 ","The time (in milliseconds) to run.  The timebase is\n             ":"运行的时间（以毫秒为单位）。  时间基是\n             ","the width for pictures, in pixels":"图片的宽度，以像素为单位",". If the sensor\n            does not support direct report mode, this returns ":". 如果传感器\n            不支持直接报告模式，此返回 "," if none are currently\n                supported/enabled. Returns ":" 如果目前没有\n                支持/启用。 申报表 ","atmospheric pressure":"大气压力","Right padding of the gradient shape":"渐变形状的右填充","an image format from either ":"任何一种图像格式 "," invoked with a valid\n                       output Surface after ":" 用有效的调用\n                       输出表面后 ","font variation settings.":"字体变化设置。",",\n                    ":",\n                    ","The X offset added to glyph position.":"添加到字形位置的X偏移量。","a metadata object to generate tags from.":"元数据对象以从中生成标记。","Bitwise OR of ":"按位或 ","the index of the layer":"层的索引"," rectangle with all x,y,w,h dimensions >= 0":" 所有x，y，w，h尺寸的矩形>=0","number of pixels to inset from the start bound":"从开始边界插入的像素数","The supported zoom ratio range supported by this capability":"此功能支持的支持缩放比例范围"," finished":" 完成了","Whether the transition can be reversed":"过渡是否可以逆转","the maximum number of surfaces that can be added per each OutputConfiguration.":"每个OutputConfiguration可以添加的最大曲面数。","Color state list to use for tinting this drawable, or\n                       ":"用于着色此drawable的颜色状态列表，或\n                       ","the number of configurations":"配置的数量"," if the given combination of session configurations and corresponding\n                                 camera ids are concurrently supported by the camera sub-system,\n                    ":" 如果给定的会话配置组合和相应的\n                                 相机子系统同时支持相机id,\n                    ","the callback for image capture moment, or null":"图像捕获时刻的回调，或null","ending angle in degrees":"结束角度（以度为单位）","the standard height for the shape. Any changes to the\n                             height with resize() will result in a height scaled based\n                             on the new height divided by this height.":"形的标准高度。 任何更改\n                             使用resize()的高度将导致基于缩放的高度\n                             在新的高度除以这个高度。","true if at least one fingerprint is enrolled, false otherwise":"如果注册了至少一个指纹，则为true，否则为false"," are\n                       delivered at. This is only a hint to the system. Events may be received faster or\n                       slower than the specified rate. Usually events are received faster. The value must\n                       be one of ":" 是\n                       送到。 这只是对系统的提示。 事件可能会更快收到或\n                       比规定的速率慢。 通常事件接收得更快。 值必须\n                       成为其中之一 ","The current system-wide mute mode setting in effect":"当前系统范围内的静音模式设置生效","the color filter to apply, or ":"要应用的滤色器，或 ","An array of elements whose length is divisible by [TODO: @value for `#POINT_SIZE`]":"长度可被[TODO:@value for`#POINT_SIZE`]整除的元素数组","The sensor id that will be unique for the same app unless the device is factory\n            reset. Return value of 0 means this sensor does not support this function; return value of -1\n            means this sensor can be uniquely identified in system by combination of its type and name.":"除非设备出厂，否则同一应用程序的传感器id将是唯一的\n            重置。 返回值为0表示此传感器不支持此功能；返回值为-1\n            意味着该传感器可以通过其类型和名称的组合在系统中唯一标识。","the height for pictures, in pixels":"图片的高度，以像素为单位"," if a strong biometric can currently\n                be used (enrolled and available).":" 如果一个强大的生物识别目前可以\n                被使用（注册和可用）。","Altitude in meters":"海拔以米为单位","Bottom padding of the gradient shape":"渐变形状的底部填充"," if using a ":" 如果使用 ","the list of requests to cycle through indefinitely":"无限期循环的请求列表","FontVariationAxis[] the array of parsed font variation axis. ":"FontVariationAxis[]解析字体变化轴的数组。 ","the user description string.":"的用户描述字符串。","The Y offset added to glyph position.":"添加到字形位置的Y偏移量。","int Current level, from 0 (minimum) to 10000 (maximum).":"int当前电平，从0（最小值）到10000（最大值）。","true when the geofence is successfully sent to the hardware for resumption.":"当地理围栏成功发送到硬件进行恢复时为true。","the gravity used to position or stretch the specified layer\n                    within its container":"用于定位或拉伸指定图层的重力\n                    在其容器内","width in pixels, or -1 to use the intrinsic width":"以像素为单位的宽度，或使用固有宽度的-1","weight >= 0":"重量>=0"," elements":" 元素","The canvas to draw into":"要画成的画布"," on which to notify the ":" 通知 "," to clear the tint":" 清除色彩","the devices's class":"设备的类"," otherwise OR if the set of camera devices provided is not a subset of\n                                  those returned by ":" 否则或者如果所提供的摄像装置的集合不是\n                                  返回的人 ","The sensor pixel mode to be removed.":"要移除的传感器像素模式。","the callback for raw (uncompressed) image data, or null":"原始（未压缩）图像数据的回调，或null","the Canvas within which this shape should be drawn":"绘制此形状的画布","ending angle for rotation in degrees":"旋转结束角度（以度为单位）","true if hardware is present and functional, false otherwise.":"如果硬件存在且功能正常，则为true，否则为false。"," or, the desired delay\n                       between events in microseconds. Specifying the delay in microseconds only works\n                       from Android 2.3 (API level 9) onwards. For earlier releases, you must use one of\n                       the ":" 或者，期望的延迟\n                       以微秒为单位的事件之间。 指定延迟（以微秒为单位）仅有效\n                       从Android2.3（API级别9）开始。 对于早期版本，您必须使用\n                       该 ","An enumeration selecting the use case for this request. Not all template\n            types are supported on every device. See the documentation for each template type for\n            details.":"选择此请求用例的枚举。 并非所有模板\n            每个设备都支持类型。 请参阅每个模板类型的文档\n            细节。","The drawable being unscheduled.":"抽签正在计划中。"," elements after the ":" 后的元素 ","<code>true</code> if the sensor supports sensor additional information API":"<code>true</code>如果传感器支持传感器附加信息API","the minimum preview fps (scaled by 1000).":"最小预览fps（按1000缩放）。","bit field consisting of constants defined in ":"由定义在 ","The desired shape for this drawable: ":"此可绘制的所需形状: ","current rotation matrix":"当前旋转矩阵"," will be\n                     supported with ":" 将是\n                     支持与 ","this ":"这 ","The callback object to notify each time one of the\n            requests in the repeating bursts has finished processing. If null, no\n            metadata will be produced for this stream of requests, although image\n            data will still be produced.":"要通知每个回调对象中的一个\n            重复突发中的请求已完成处理。 如果为null，则不\n            将为此请求流生成元数据，尽管图像\n            数据仍然会产生。","a text buffer to be shaped. Any styled spans stored in this text are ignored.":"要成形的文本缓冲区。 存储在此文本中的任何样式跨度都将被忽略。"," if settings\n                                        has no font variation settings.":" 如果设置\n                                        没有字体变化设置。","The minimum height suggested by this Drawable. If this Drawable\n                    doesn't have a suggested minimum height, 0 is returned.":"此Drawable建议的最小高度。 如果这个Drawable\n                    没有建议的最小高度，返回0。","The ID of the geofence.":"地理围栏的ID。","the index of the drawable to adjust":"要调整的drawable的索引","The opacity to use, or ":"使用的不透明度，或 "," with both x,y >= 0":" 同时使用x，y>=0","an array big enough to hold at least ":"一个大到足以容纳至少 ","a color, as in ":"一种颜色，如 ","The color filter to apply, or ":"要应用的滤色器，或 ","A Porter-Duff blending mode to apply to the drawable, a value of null sets\n                            the default Porter-Diff blending mode value\n                            of ":"应用于drawable的Porter-Duff混合模式，null值集\n                            默认的Porter-Diff混合模式值\n                            的 ","the device ID":"设备ID","The unique identifier of the camera device to open":"要打开的摄像设备的唯一标识符","The surface to be removed.":"要去除的表面。","callback with postview image data, may be null":"带有postview图像数据的回调，可能为null","the Paint object that defines this shape's characteristics\n":"定义此形状特征的Paint对象\n","the drawable to scale":"可绘制的比例","The device id.":"的设备id。","<code>true</code> if the sensor is supported and successfully enabled.":"<code>true</code>如果传感器受支持并成功启用。","a builder for a capture request, initialized with default\n            settings for that template, and no output streams":"捕获请求的构建器，使用默认初始化\n            该模板的设置，并且没有输出流","The action being unscheduled.\n":"未计划的行动。\n","type of shared memory used by direct channel.":"直接通道使用的共享内存类型。","at least 0 but no greater than ":"至少0但不大于 ","the maximum preview fps (scaled by 1000).":"最大预览fps（按1000缩放）。",".\n                                  If multiple authenticators are queried, a logical OR will be applied.\n                                  For example, if ":".\n                                  如果查询多个身份验证器，则将应用逻辑OR。\n                                  例如，如果 ","The width of the shape used by this drawable":"此drawable使用的形状的宽度","previous rotation matrix":"先前的旋转矩阵","red pixel":"红色像素","The callback object to notify each time one of the\n            requests in the repeating bursts has finished processing.":"要通知每个回调对象中的一个\n            重复突发中的请求已完成处理。"," object to set.":" 对象来设置。","an array of FontVariationAxis.":"FontVariationAxis的数组。","The minimum width suggested by this Drawable. If this Drawable\n                    doesn't have a suggested minimum width, 0 is returned.":"此Drawable建议的最小宽度。 如果这个Drawable\n                    没有建议的最小宽度，返回0。","a start index of shaping target in the buffer.":"缓冲区中目标的开始索引。","the explicit height of the layer, or -1 if not specified":"层的显式高度，如果未指定，则为-1","The geofence ID of the geofence":"地理围栏的地理围栏ID"," with width, height >= 0":" 宽度，高度>=0","this same object, for use in chained construction":"这个相同的对象，用于链式结构"," for the default behavior":" 对于默认行为"," elements after the\n                     ":" 后的元素\n                     "," to remove the\n            existing color filter\n":" 要删除\n            现有滤色器\n","Set to true if visible, false if not.":"如果可见则设置为true，如果不可见则设置为false。","the device name":"设备名称","the surface group ID associated with this ":"与此相关联的表面组ID ","The callback which is invoked once the camera is opened":"相机打开后调用的回调","the callback for JPEG image data, or null\n":"JPEG图像数据的回调，或null\n","An array of 8 radius values, for the outer roundrect. \n                              The first two floats are for the top-left corner\n                              (remaining pairs correspond clockwise). For no rounded\n                              corners on the outer rectangle, pass ":"8个半径值的数组，用于外圆半径。 \n                              前两个浮标是左上角的\n                              （其余成对应顺时针方向）。 对于没有四舍五入\n                              外矩形上的角，通 "," used to position\n                           the scaled drawable within the parent container":" 用于定位\n                           父容器内的缩放drawable","The last known location according to the monitoring system.":"根据监控系统的最后已知位置。","rate of events. This is only a hint to the system. events may be\n                   received faster or slower than the specified rate. Usually events\n                   are received faster. The value must be one of\n                   ":"率的事件。 这只是对系统的提示。 事件可能是\n                   接收比指定速率更快或更慢。 通常事件\n                   接收速度更快。 该值必须是\n                   ","The new set of Surfaces that should be made available as\n                           targets for captured high speed image data.":"新的一组表面应作为\n                           捕获的高速图像数据的目标。","The color to draw.":"要绘制的颜色。","<code>true</code> if the specified shared memory type is supported.":"<code>true</code>如果支持指定的共享内存类型。","the width of the pictures, in pixels":"图片的宽度，以像素为单位"," pair mapping the tone for that index":" 对映射该索引的音调","The height of the shape used by this drawable":"此drawable使用的形状的高度"," |\n                                  ":" |\n                                  ","an an array of floats (z, x, and y) in which the angle change\n                   (in radians) is stored":"一个浮动数组（z、x和y），其中角度发生变化\n                   （以弧度为单位）存储","green pixel (even row)":"绿色像素（偶数行）","the orientation value to set, one of:\n                               <ul>\n                                 <li>":"要设置的方向值，其中一个:\n                               <ul>\n                                 <李>","the request to repeat indefinitely":"无限期重复的请求","String a valid font variation settings string.":"字符串有效的字体变体设置字符串。","a length of shaping target in the buffer.":"缓冲区中整形目标的一个长度。","boolean Returns true if the new visibility is different than\n                    its previous state.":"如果新的可见性不同于\n                    其先前的状态。","number of pixels to inset from the bottom bound":"从底边插入的像素数","coordinate >= 0":"坐标>=0","the device's subclass":"设备的子类","a blending mode, as in ":"混合模式，如 ","the left padding in pixels, or -1 to use computed padding":"左填充（以像素为单位），或-1使用计算填充","element (non-":"元素(非-","The frame to add":"要添加的框架","You can supply true here to force the drawable to behave\n                           as if it has just become visible, even if it had last\n                           been set visible.  Used for example to force animations\n                           to restart.":"你可以在这里提供true来强制drawable的行为\n                           仿佛它刚刚成为可见的，即使它有最后\n                           被设置为可见。  用于例如强制动画\n                           以重新启动。","the device's protocol":"设备的协议",".\n                    The default value is [TODO: @value for `#SURFACE_GROUP_ID_NONE`].":".\n                    默认值为[TODO:@value for'#SURFACE_GROUP_ID_NONE']。","The handler on which the callback should be invoked, or\n             ":"应在其上调用回调的处理程序，或\n             ","true if focus was successful, false if otherwise":"如果聚焦成功，则为true，否则为false","A RectF that specifies the distance from the inner\n                         rect to each side of the outer rect. For no inner, pass\n                         ":"指定与内部的距离的RectF\n                         rect到外rect的每一侧。 对于没有内心，通过\n                         ","width scaling factor [0...1] to use then the level is\n                              at the maximum value, or -1 to not scale width":"宽度缩放因子[0。..1]要使用那么水平是\n                              在最大值，或-1不缩放宽度","The timestamp (elapsed real time in milliseconds) when the transition was\n                   detected":"过渡时的时间戳（以毫秒为单位的经过的实时时间）\n                   检测到"," is queried and only\n                                  ":" 被查询并且仅\n                                  ","The callback to notify about the status of the new capture session.":"通知新捕获会话状态的回调。","A value between 0 and 255.":"0到255之间的值。","<code>true</code> if the sensor is a dynamic sensor (sensor added at runtime).":"<code>true</code>如果传感器是动态传感器（运行时添加的传感器）。","number of points stored in this tonemap for that color's curve (>= 0)":"此色调图中存储的该颜色曲线的点数(>=0)","the height of the pictures, in pixels":"图片的高度，以像素为单位","The width in pixels of the stroke":"笔划的宽度（以像素为单位）","the new callback to send camera availability notices to":"将相机可用性通知发送到","green pixel (odd row)":"绿色像素（奇数行）","of sensors requested":"所要求的传感器","</li>\n                                 <li>":"</李>\n                                 <李>"," of pixel data.":" 的像素数据。","a set of system fonts":"一套系统字体","Returns null if the Drawables has no transparent region to\n            report, else a Region holding the parts of the Drawable's bounds that\n            are transparent.":"如果Drawable没有透明区域，则返回null\n            报告，否则一个区域包含绘制边界的部分\n            是透明的。","a start index of context used for shaping in the buffer.":"缓冲区中用于整形的上下文的开始索引。","the configuration":"配置","number of pixels to inset from the end bound":"从结束边界插入的像素数","the top padding in pixels, or -1 to use computed padding":"以像素为单位的顶部填充，或使用计算填充的-1","height scaling factor [0...1] to use then the level\n                               is at the maximum value, or -1 to not scale height":"高度缩放因子[0。..1]使用然后水平\n                               是在最大值，或-1不缩放高度","width >= 0":"宽度>=0","to be used for processing":"用于加工","How long in milliseconds the frame should appear":"帧应该出现多长时间（毫秒）","The rotation angle in degrees relative to the\n                 orientation of the camera. Rotation can only be 0,\n                 90, 180 or 270.":"以度为单位的旋转角度\n                 摄像机的方位。 旋转只能为0,\n                 90，180或270。","the list of surfaces associated with this ":"与此相关联的曲面列表 ","a list of output configurations for the capture session":"捕获会话的输出配置列表","the Camera service object":"相机服务对象","An array of 8 radius values, for the inner roundrect.\n                              The first two floats are for the top-left corner\n                              (remaining pairs correspond clockwise). For no rounded\n                              corners on the inner rectangle, pass ":"8个半径值的数组，用于内圆角。\n                              前两个浮标是左上角的\n                              （其余成对应顺时针方向）。 对于没有四舍五入\n                              内矩形上的角，通过 ","height >= 0":"高度>=0","int The color to draw.":"int颜色来绘制。"," is set up, this API will\n                                  return ":" 已设置，此API将\n                                  回来吧 ","The color state list of the stroke":"笔划的颜色状态列表","the number of interfaces":"接口的数量","true if the apps intend to record videos using\n             ":"如果应用程序打算使用以下方式录制视频，则为true\n             "," to use\n                        the current thread's ":" 要使用\n                        当前线程的 ","the default sensor matching the requested type if one exists and the application\n                    has the necessary permissions, or null otherwise.":"匹配请求类型的默认传感器（如果存在）和应用程序\n                    具有必要的权限，否则为null。","</li>\n                               </ul>":"</李>\n                               </ul>"," object with the format\n                          ":" 具有格式的对象\n                          ","the right padding in pixels, or -1 to use computed padding":"以像素为单位的正确填充，或使用计算填充的-1","a length of context used for shaping in the buffer.":"缓冲区中用于整形的上下文长度。","the Shape that this ShapeDrawable should be":"这个ShapeDrawable应该是的形状","a String of parameters (key-value paired) that\n                  are semi-colon delimited\n":"一串参数（键值配对）\n                  分号分隔\n","the executor which will be used for invoking the callbacks":"用于调用回调的执行器","The duration in milliseconds of the frame at the\n                    specified index":"帧的持续时间（以毫秒为单位）\n                    指定索引","weight between [TODO: @value for `#METERING_WEIGHT_MIN`] and\n                   [TODO: @value for `#METERING_WEIGHT_MAX`] inclusively":"[TODO:@value for`#METERING_WEIGHT_MIN`]和[TODO:@value for'#METERING_WEIGHT_MIN']之间的权重\n                   [TODO:@value for`#METERING_WEIGHT_MAX`]含","The alpha value to set, between 0 and 255.":"要设置的alpha值，介于0和255之间。","the manufacturer name, or ":"制造商名称，或 ","the device product ID":"设备产品ID","the product name, or ":"产品名称，或 ","the serial number name, or ":"序列号名称，或 ","the device vendor ID":"设备供应商ID","the device version":"设备版本","the endpoint for this transaction":"此事务的终结点","buffer for data to send or receive; can be ":"数据发送或接收的缓冲区；可以 "," to wait for next\n                          transaction without reading data":" 等待下一个\n                          不读取数据的事务"}