{"The number of continuous pages that were paginated.":"分页的连续页面数量。","The command binding to register.":"命令绑定到注册。"," that specifies what format to check for. See the ":"这指定要检查的格式。 看到"," if this method call did not force focus.":"如果此方法调用不强制焦点。"," to send a ":" 发送一个 ","The page number (zero-based) of first page that was paginated.":"分页的第一页的页码（基于零）。","The type to register ":"注册的类型"," to retrieve all formats that data stored in this data object is stored in, or can be converted to; ":"要检索存储在此数据对象中的数据的所有格式都存储在或可以转换为；","The.dependency property to check.":"依赖性属性要检查。"," HTTP header with the initial request; otherwise, ":"带有初始请求的HTTP标头； 否则，"," to retrieve only formats that data stored in this data object is stored in (excluding formats that the data is not stored in, but can be automatically converted to).":"仅检索将存储在此数据对象中的数据存储的格式（不包括数据不存储而又可以自动转换为数据的格式）。"," to use for Internet access.":"用于互联网访问。","The property value as if no animations are attached to the specified dependency property.":"属性值好像没有附加动画附加到指定的依赖属性。","The input binding to register.":"输入绑定到注册。","The new DPI scale information.":"新的DPI秤信息。","A string that specifies what format to store the data in. See the ":"一个指定要存储数据格式的字符串。请参阅","Information about the previous DPI scale.":"有关先前DPI量表的信息。","The element to remove ":"要删除的元素","The uniform resource identifier (URI) of the resource associated with the request.":"请求相关联的资源的统一资源标识符(URI)。","An object, if implementation of a derived class has an alternate parent connection to report.":"如果派生类的实现具有要报告的备用父连接，则对象。"," that specifies what format to store the data in. See the ":"这指定了要存储数据的格式。请参阅","The sender object.":"发件人对象。","A traversal request, which contains a property that indicates either a mode to traverse in existing tab order, or a direction to move visually.":"遍历请求，其中包含一个属性，该属性指示在现有选项卡顺序中遍历的模式，或者是视觉移动的方向。"," that contains the cursor.":"其中包含光标。","The number of milliseconds to wait before the request times out.":"等待请求时间之前等待的毫秒数。","The DPI scale on the X axis.":"X轴上的DPI刻度。"," if the requested traversal was performed; otherwise, ":"如果执行要求的遍历； 否则，","The identifier for the routed event that is being handled.":"正在处理的路由事件的标识符。","The default authentication credentials to use with the pack URI request.":"默认身份验证凭据将与PACK URI请求一起使用。"," if to scale with dpi; otherwise, ":"如果与DPI进行扩展； 否则，","The type-specific ":"特定于类型的","The DPI scale on the Y axis.":"Y轴上的DPI刻度。"," if keyboard focus is moved to this element or already was on this element; otherwise, ":"如果将键盘焦点移至此元素或已经在此元素上； 否则，","The URI to create the Web request.":"创建Web请求的URI。","The file that contains the cursor.":"包含光标的文件。"," class that contains the identifier for the event to raise.":"包含活动筹集的标识符的课程。","The DPI scale for the X axis.":"X轴的DPI刻度。"," that contains event data. This event data must contain the identifier for the ":"其中包含事件数据。 此事件数据必须包含标识符","The pack URI Web request.":"PACK URI Web请求。","The name of the cursor.":"光标的名称。","The DPI scale for the Y axis.":"Y轴的DPI刻度。","Identifier of the routed event for which the handler is attached.":"连接处理程序的路由事件的标识符。"," that contains the event data. This event data reports details about the mouse button that was pressed and the handled state.":"其中包含事件数据。 此事件数据报告了有关按下和处理状态的鼠标按钮的详细信息。","The converted object, or ":"转换的对象或","The response stream.":"响应流。","The DPI along the X axis.":"沿X轴的DPI。"," that contains the event data. The event data reports that the left mouse button was pressed.":"其中包含事件数据。 事件数据报告按下左鼠标按钮。","The MIME type of the stream's content.":"流的内容的MIME类型。","The specific handler implementation to remove from this element's event handler collection.":"从此元素的事件处理程序集合中删除的特定处理程序实现。","The converted object, or an empty string if ":"转换后的对象或一个空字符串，如果","The DPI along the Y axis.":"沿Y轴的DPI。"," that contains the event data. The event data reports that the left mouse button was released.":"其中包含事件数据。 事件数据报告释放了左鼠标按钮。","The collection of Web response ":"网络响应的收集"," if the element can have focus set to it; otherwise, ":"如果元素可以将重点设置为它； 否则，","A collection that holds a standard set of valid values.":"具有标准有效值集的集合。","A delegate that references the handler method to be added.":"引用要添加的处理程序方法的委托。"," that contains the event data. The event data reports that the right mouse button was pressed.":"其中包含事件数据。 事件数据报告按下正确的鼠标按钮。","The AppStarting cursor.":"AppStarting Cursor。"," if the mouse pointer is over this element; otherwise, ":"如果鼠标指针超过此元素； 否则，","The response data as a ":"响应数据作为一个","A reference to the dependency object that is the source of the data being dragged.":"对依赖性对象的引用，该对象是要拖动的数据源。"," if the mouse pointer is over the element or its child elements; otherwise, ":"如果鼠标指针在元素或其子元素上； 否则，"," if the response is from the package cache; ":"如果响应来自软件包缓存；"," that contains the event data. The event data reports that the right mouse button was released.":"其中包含事件数据。 事件数据报告发布了正确的鼠标按钮。","The arrow cursor.":"箭头光标。","A data object that contains the data being dragged.":"包含要拖动的数据的数据对象。","The arrowCd cursor.":"箭头光标。"," if the stylus is over the element; otherwise, ":"如果手写笔在元素上； 否则，"," if the response is from a Web request.":"如果响应来自Web请求。"," that contains the event data. The event data reports that the mouse button was released.":"其中包含事件数据。 事件数据报告释放了鼠标按钮。"," values that specifies permitted effects of the drag-and-drop operation.":"指定拖放操作的允许效果的值。","The URI of the response.":"响应的URI。"," that contains the event data. The event data reports that one or more mouse buttons were pressed.":"其中包含事件数据。 事件数据报告按下一个或多个鼠标按钮。","The Crosshair cursor.":"十字准则。"," if the stylus cursor is over the element or its child elements; otherwise, ":"如果手写笔光标超过元素或其子元素； 否则，"," values that specifies the final effect that was performed during the drag-and-drop operation.":"指定在拖放操作过程中执行的最终效果的值。"," that contains the event data. The event data reports that one or more mouse buttons were released.":"其中包含事件数据。 事件数据报告说一个或多个鼠标按钮已释放。","The hand cursor.":"手光标。","A string that contains the accelerator key.":"包含加速器密钥的字符串。"," to associate with the custom property.":"与自定义属性关联。","The direction of the requested focus traversal.":"请求的焦点遍历的方向。","The help cursor.":"帮助光标。","A delegate that references the handler method to be removed.":"引用要删除的处理程序方法的委托。","The access key for the specified element.":"指定元素的访问密钥。","The element that would have received focus if ":"如果","The value of the custom property. ":"自定义属性的价值。","The IBeam cursor.":"IBEAM光标。"," object for which to get a relative drop point.":"要获得相对下降点的对象。"," were actually invoked.":"实际上被调用了。","The UI Automation identifier for the specified element.":"指定元素的UI自动化标识符。"," must be of type ":"必须类型","A drop point that is relative to the element specified in ":"相对于指定元素的下降点","The No cursor.":"没有光标。","A string containing the help text for the specified element. The string that is returned generally is the same text that is provided in the tooltip for the control.":"一个包含指定元素的帮助文本的字符串。 返回的字符串通常与该控件工具提示中提供的文本相同。"," that contains the event data and also identifies the event to raise.":"其中包含事件数据，还标识了要提出的事件。"," or an array of these data types; however it cannot be an array of type ":"或这些数据类型的数组； 但是它不能是类型的数组","The none cursor.":"无光标。"," enumeration that specifies which operations are allowed by the originator of the drag event.":"列出的枚举由阻力事件的发起人允许进行哪些操作。"," that indicates whether the specified element is a ":"这表明指定元素是","The device to release.":"要释放的设备。"," object .":"目的 。","A data object that contains the data associated with the corresponding drag event.":"包含与相应阻力事件关联的数据的数据对象。","The pen cursor.":"笔光标。","A value that specifies how an element determines how the ":"一个指定元素如何确定如何确定的值"," if the touch device is released; otherwise, ":"如果触摸设备释放； 否则，"," if the specified property data identifier is in the ":"如果指定的属性数据标识符在"," enumeration specifying the target drag-and-drop operation.":"枚举指定目标拖放操作。","The scroll all cursor.":"滚动所有光标。"," property is determined.":"确定属性。","The identifier of the.routed event for which the handler is attached.":"附加处理程序的标识符。"," associated with the custom property to get.":"与要获得的自定义属性相关联。"," flag enumeration.":"标志枚举。","A scroll east cursor.":"滚动的东部光标。"," that indicates whether the specified element is ":"这表明指定元素是","The specific handler implementation to remove from the event handler collection on this element.":"特定的处理程序实现以从该元素上的事件处理程序集合中删除。","The value of the custom property associated with the specified ":"与指定的自定义属性的值","Represents the initial time interval of this duration.":"表示此持续时间的初始时间间隔。","A scroll north cursor.":"滚动北光标。"," of the given element.":"给定元素。"," that represents the property data identifiers.":"这代表属性数据标识符。"," if this element can be used as the target of a drag-and-drop operation; otherwise, ":"如果该元素可以用作拖放操作的目标； 否则，","The element that is targeted by the label.":"标签针对的元素。"," that represents the value of the current instance plus ":"代表当前实例加的值","A scroll northeast ":"东北的卷轴","EventArgs":"Eventargs"," if at least one touch is captured to this element; otherwise, ":"如果至少捕获了此元素的触摸； 否则，","If both instances of ":"如果两个实例","A scroll north/south ":"向北/南的卷轴","The name of the specified element.":"指定元素的名称。"," if the objects are not equal; otherwise, ":"如果对象不相等； 否则，"," if at least one touch is captured to this element or any child elements in its visual tree; otherwise, ":"如果至少捕获了该元素或视觉树中的任何子元素的触摸； 否则，","The scroll northwest ":"滚动西北","The dependency object on which to get the property value.":"获得属性值的依赖关系对象。"," have values, an instance of ":"有值，一个实例"," associated with the custom property to remove.":"与要删除的自定义属性相关联。"," if at least one touch is pressed over this element; otherwise, ":"如果至少在此元素上按下一个触摸； 否则，","The scroll south cursor.":"滚动的南光标。"," attached property of ":"附件的财产"," that represents the combined values. Otherwise this method returns ":"这代表组合值。 否则此方法返回","The color of a ":"颜色","The south/east scrolling cursor.":"南/东滚动光标。"," if at least one touch is pressed over this element or any child elements in its visual tree; otherwise, ":"如果至少对该元素或视觉树中的任何子元素按下一触感； 否则，",", a negative value that represents the difference. If ":"，代表差异的负值。 如果"," on which to set the property.":"在哪些设置属性上。"," to use Bezier smoothing to render the ":"使用bezier平滑来渲染","The collection of all ":"所有人的集合","The scroll southwest cursor.":"滚动西南光标。",", zero. If ":"， 零。 如果","The accelerator key value to set.":"要设置的加速器键值。","The value that indicates the height of the stylus used to draw the ":"表示绘制的手写笔高度的值"," if the element is focusable; otherwise ":"如果元素是可集中的； 否则",", a positive value that represents the difference.":"，代表差异的正值。","The scroll west cursor.":"滚动西部光标。"," to indicate that the thickness of the stroke is uniform; ":"表明中风的厚度是均匀的；","The access key value to set.":"访问密钥值设置。","Object to check for equality.":"对象检查平等。"," if this element has animations attached to any of its properties; otherwise, ":"如果此元素在其任何属性上都附有动画； 否则，","A west/east scrolling cursor.":"西/东滚动光标。"," to indicate that the thickness of a rendered ":"表明渲染的厚度","The UI Automation identifier value to set.":"UI自动化标识符值要设置。"," if value is equal to the current instance of Duration; otherwise, ":"如果值等于持续时间的当前实例； 否则，"," increases when pressure is increased. The default is ":"当压力增加时增加。 默认值为","The collection of input bindings.":"输入绑定的集合。","A four-headed sizing cursor.":"一个四头尺寸的光标。","The help text value to set.":"帮助文本值要设置。"," to check for equality.":"检查平等。"," to render the ":"渲染"," if the element is enabled; otherwise, ":"如果启用元素； 否则，"," as a highlighter; otherwise, ":"作为荧光笔； 否则，"," is equal to the current instance of ":"等于当前实例"," if this element has logical focus; otherwise, ":"如果此元素具有逻辑焦点； 否则，","A two-headed northeast/southwest sizing cursor.":"一个两头的东北/西南尺寸光标。","The value to set; ":"要设置的值；"," that specifies the transformation to perform on the stylus' tip.":"这指定了在手写笔的提示上执行的转换。"," if an input method is active; otherwise, ":"如果输入方法是活动的； 否则，","First instance of ":"第一个实例"," if the element is meant to be a column header, otherwise ":"如果该元素是作为列标题，否则","A two-headed north/south sizing cursor.":"一个两头北/南尺寸的光标。","The width of the stylus used to draw the ":"用于绘制的手写笔的宽度"," if the element is meant to be required to be filled out on a form, otherwise ":"如果要在表格上填写元素，否则","Second instance of ":"第二个实例","A two-headed northwest/southwest sizing cursor.":"一个两头的西北/西南尺寸光标。",". The default value of the underlying attached property is ":"。 附属属性的默认值为","The old ":"老人"," if the element is meant to be a row header, otherwise ":"如果该元素是将作为行标题，否则","A two-headed west/east sizing cursor.":"一个两头的西/东尺寸光标。","; however, this value is influenced by the state of input methods at runtime.":"; 但是，此值受运行时输入方法状态的影响。"," have ":"有"," if this element has keyboard focus; otherwise, ":"如果此元素具有键盘焦点； 否则，","The item status value to set.":"要设置的项目状态值。","An up arrow cursor.":"一个箭头光标。","The width of the stylus shape.":"手写笔形的宽度。"," values, this method returns the sum of those two values. If either value is set to ":"值，此方法返回这两个值的总和。 如果将任何一个值设置为","The item type value to set.":"要设置的项目类型值。"," if keyboard focus is on the element or its child elements; otherwise, ":"如果键盘的重点是元素或其子元素； 否则，","A wait cursor.":"等待光标。",". If either value is set to ":"。 如果将任何一个值设置为","The height of the stylus shape.":"手写笔的高度。",".  \n  \n If either ":"。 \n  \n  如果是","The command associated with this event.":"与此事件关联的命令。"," if the element has mouse capture; otherwise, ":"如果元素具有捕获鼠标； 否则，","The labeled by value to set.":"按值设置的值标记。","The angle of the stylus shape.":"手写笔的角度。"," has no value, this method returns ":"没有价值，此方法返回"," if this element or a contained element has mouse capture; otherwise, ":"如果此元素或包含的元素具有鼠标捕获； 否则，","The value to assign to the property.":"分配给属性的值。","The command-specific data. The default value is ":"特定于命令的数据。 默认值是","The recognized ink gesture.":"公认的墨水手势。"," if both instances of ":"如果两个实例","The name value to set.":"要设置的名称值。","An element that is a focus scope.":"元素是焦点范围。"," if the mouse pointer is over the same element result as a hit test; otherwise, ":"如果鼠标指针与HIT测试相同的元素结果； 否则，"," levels.":"水平。"," have values and are equal, or if both instances of ":"具有价值和相等的价值，或者两个实例","The dependency object on which to set the property.":"设置属性的依赖关系对象。","The element in the specified focus scope with logical focus.":"指定焦点范围中的元素具有逻辑焦点。"," if mouse pointer is over the element or its child elements; otherwise, ":"如果鼠标指针超过元素或其子元素； 否则，",". Otherwise, this method returns ":"。 否则，此方法返回"," that specifies the application gestures the ":"指定应用程序手势"," have values and ":"有值和"," if the element has stylus capture; otherwise, ":"如果该元素具有捕获的手写笔； 否则，","The accelerator key.":"加速器键。"," will recognize.":"会认识。","The element to get the closest focus scope for.":"获得最接近焦点范围的元素。"," from which an instance of ":"从哪个实例"," if stylus capture is held within this element; otherwise, ":"如果在此元素中保存了手写笔捕获； 否则，"," that contains gestures the ":"其中包含手势","The string that contains the access key.":"包含访问密钥的字符串。","The focus scope for the specified element.":"指定元素的焦点范围。"," is implicitly created.":"是隐式创建的。","The control type.":"控制类型。"," if the stylus is over the same element as a hit test; otherwise, ":"如果手写笔与命中测试的元素相同； 否则，","The element from which to read the attached property.":"读取附件属性的元素。"," is set to recognize.":"被设置为识别。","The identifier.":"标识符。"," to search for gestures.":"寻找手势。"," if the stylus is over the element or its child elements; otherwise, ":"如果手写笔是元素或其子元素的元素； 否则，"," on the specified element; otherwise, ":"在指定元素上； 否则，"," if exactly one of ":"如果正是一个","The string that contains the identifier.":"包含标识符的字符串。"," objects that are captured to this element.":"捕获到此元素的对象。"," that contains application gestures that the ":"其中包含应用程序手势","The focus scope in which to make the specified element the ":"使指定元素在其中的焦点范围","The bounding rectangle.":"边界矩形。"," objects that are captured to this element or any child elements in its visual tree.":"捕获到该元素或其视觉树中任何子元素的对象。"," represent a value, or if they both represent values that are not equal; otherwise, ":" 表示一个值，或者如果它们都表示不相等的值；否则, ","The element to give logical focus to.":"给出逻辑重点的元素。"," recognized.":" 认可。","The collection of child elements.":"子元素的集合。"," objects that are over this element.":" 此元素上方的对象。","The element to make a focus scope.":"成为焦点范围的元素。"," to subtract.":"减去。"," that specifies the application gestures you wish the ":"指定您希望的应用程序手势","The class name.":"班级名称。"," objects that are over this element or any child elements in its visual tree.":"该元素或其视觉树中任何子元素的对象。"," is a focus scope; otherwise, ":"是重点范围； 否则，","A point in the clickable area of the element.":"元素可点击区域中的点。"," that represents the value of ":"代表的价值"," to get the parent from.":"从父母那里得到。"," to recognize.":"去辨认。","The command that will be executed when the command source is invoked.":"调用命令源时将执行的命令。",". Otherwise this method returns ":"。 否则此方法返回","A point within the clickable area of the element.":"元素可点击区域内的点。"," if the recognition component is available; otherwise, ":"如果有识别组件可用； 否则，","The parent element in the current tree.":"当前树中的父元素。","The command specific data.":"命令特定数据。"," to subtract from the current instance.":"从当前实例中减去。"," to reparent.":"修复。","A list of automation peers for the controlled elements.":"受控元素的自动化同行列表。"," objects to add to the ":"对象添加到"," whose value is the result of this instance minus the value of ":"其价值是此实例的结果减去的值","The object that the command is being executed on.":"命令正在执行的对象。","The points to add":"要添加的要点","The new parent element.":"新的父元素。","The help text.":"帮助文本。"," object representing the current input language for this input language source object.":"代表此输入语言源对象的当前输入语言的对象。"," is hit testing; otherwise, ":"正在命中测试； 否则，"," representation of this instance of ":"此实例的表示"," to enable clipping in a multi-monitor display; otherwise, ":"在多监视器显示中启用剪辑； 否则，","This method returns the hosted ":"此方法返回托管"," initialized to an automatic value.":"初始化为自动值。"," that contains the strokes that have been removed from the lasso path since the last time the ":"其中包含从上一次从拉索路径上删除的笔触","An enumerable object that represents the list of input languages supported by this input language source object.":"代表此输入语言源对象支持的输入语言列表的枚举对象。"," initialized to a forever value.":"初始化为永远的价值。"," if the user needs to use the ALT key to invoke a shortcut; otherwise, ":"如果用户需要使用alt键来调用快捷方式； 否则，"," to UI Automation for controls that host ":"进行UI自动化以进行主机的控件"," that contains the strokes that have been surrounded by the lasso path since the last time the ":"其中包含自上次被拉索路径包围的笔触","The element to use as the frame of reference for calculating the position of the ":"用作计算位置的参考框架的元素","True if this Duration is a ":"如果这个持续时间是"," being queried for conversion support.":"被询问转换支持。","The status.":"状态。"," of the custom property which changed.":"更改的自定义属性。"," if the manipulation is canceled; otherwise, ":"如果取消操作； 否则，","The kind of item.":"那种物品。"," can convert; otherwise, ":"可以转换； 否则，"," value; otherwise, false.":" 值；否则为false。","The new custom property object.":"新的自定义属性对象。","A unique identifier for the object.":"对象的唯一标识符。"," object whose value is respected during conversion.":"在转换过程中尊重其价值的对象。"," value that this ":"重视这一点"," for the element that is targeted by the ":"对于由","The previous custom property object.":"先前的自定义属性对象。","The rate that resizing slows in device-independent units (1/96th inch per unit) per square milliseconds. The default is ":"调整大小的速率减慢了与设备无关的单位（每单位1/96英寸）每平方毫秒。 默认值为"," being converted.":"被转换。","The amount the element resizes at the end of inertia. The default is a ":"元素在惯性结束时大小的量。 默认值为","Type being evaluated for conversion.":"评估转换的类型。"," object that contains information about the event.":"包含有关事件的信息的对象。","The notification characteristics.":"通知特征。","The object that represents the ":"表示代表的对象"," that has its ":"有它的","The notification characteristics of a live region.":"现场区域的通知特征。","Cultural information that is respected during conversion.":"转换过程中尊重的文化信息。"," object that specifies the appearance of the ":" 指定外观的对象 "," of the returned converted object.":"返回的转换对象。","The type of the control.":"控件的类型。","The initial average radius.":"初始平均半径。","The unique identifier for the property.":"该物业的唯一标识符。","String value to convert to an instance of ":"字符串值转换为一个实例","A converted CultureInfo object to a given object type.":"转换为给定对象类型的培养物对象。","The string that contains the label.":"包含标签的字符串。","The initial rate the element resizes at the start of inertia.":"元素在惯性开始时大小的初始速率。","Duration value to convert from.":"持续价值要转换。"," or an array of these data types, except ":"或这些数据类型的数组，除了","The name for the data format.":"数据格式的名称。","The rate the rotation slows in degrees per squared millisecond. The default is ":"旋转速率以每平方毫秒为单位的度减速。 默认值为"," that contains the registered objects.":"其中包含注册对象。","The orientation of the control.":"控制的方向。",", which is not allowed.":"，不允许。","The integer ID for the data format.":"数据格式的整数ID。","The rotation, in degrees, at the end of the inertial movement. The default is ":"惯性运动结束时的旋转程度。 默认值为","The type to start the search with. Base classes are included in the search.":"开始搜索的类型。 搜索中包括基础类。","The parent automation peer.":"母公司自动化对等。","The numeric ID of the data format.":"数据格式的数字ID。"," if the custom property exists; otherwise, returns ":"如果存在自定义属性； 否则，返回","The initial rate of the rotation at the start of the inertia phase.":"惯性阶段开始时旋转的初始速率。","The object that implements the pattern interface; ":"实现模式接口的对象；","The name of the data format.":"数据格式的名称。","An array of matching routed event identifiers if any match is found; otherwise, ":"如果找到任何匹配，则一系列匹配的路由事件标识符； 否则，"," object onto which the stroke will be rendered.":"中风将呈现的对象。","The rate the linear movement slows in device-independent units (1/96th inch per unit) per squared millisecond.  The default is ":"线性运动的速率减慢了独立的单位（每单位1/96英寸），每平方毫秒。 默认值为","The numeric ID of the data format to request a ":"数据格式的数字ID请求"," if this peer does not support this interface.":"如果此对等不支持此接口。","The type of the class that is declaring class handling.":"宣布课堂处理的类的类型。"," object defining the attributes of the stroke that is drawn.":"定义绘制绘制的属性的对象。"," object for.":"对象的。","The position on the screen to get the ":"屏幕上的位置以获取","The linear movement of the manipulation at the end of inertia. The default is ":"惯性结束时操纵的线性运动。 默认值为","The routed event identifier of the event to handle.":"事件的路由事件标识符要处理。","The initial rate of linear movement at the start of the inertia phase.":"惯性阶段开始时线性运动的初始速率。"," that contains the stylus points along the spine of a ":"其中包含沿着脊柱的手写笔点"," at the specified point.":"在指定点。"," object that contains the numeric ID and the name of the requested data format.":"包含数字ID和请求数据格式名称的对象。","A reference to the class handler implementation.":"对类处理程序实现的引用。"," structure defining the bounding box for the ":"定义边界框的结构","The command to associate with ":"与之关联的命令"," to invoke this class handler even if arguments of the routed event have been marked as handled; ":"即使已将路由事件的争论标记为处理，即使调用此类处理程序；","The name of the data format to request a ":"要请求的数据格式的名称 ","  property.":"  财产。","The input gesture to associate with ":"与之相关的输入手势","The points that specify the line which defines where to clip.":"指定定义在哪里剪辑的行的点。","An object that represents the data to store in this data object.":"代表要存储在此数据对象中的数据的对象。","The associated command.":"相关命令。","A one-based integer value that describes the position this element occupies in a group or set.":"一个基于一个基的整数值，描述了该元素在组或集合中占据的位置。"," to retain the default behavior of not invoking the handler on any marked-handled event.":"保留在任何标记的手柄事件中不调用处理程序的默认行为。"," that contains copies of the segments of the current ":"其中包含电流段的副本","The command-specific data. The default is ":"特定于命令的数据。 默认值为","A string that specifies the format for the data. For a set of predefined data formats, see the       ":"一个指定数据格式的字符串。 对于一组预定义的数据格式，请参阅","An integer value that describes the size of the group or set that this element belongs to.":"描述该元素所属的组大小或设置的整数值。","The name of the routed event. The name must be unique within the owner type and cannot be ":"路由事件的名称。 该名称必须在所有者类型中是唯一的，不能是","A string that specifies the format for the data. For a set of predefined data formats, see the ":"一个指定数据格式的字符串。 对于一组预定义的数据格式，请参阅","The target of the command. The default is ":"命令的目标。 默认值为"," that are within the specified bounds.":"在指定的范围内。","The routing strategy of the event as a value of the enumeration.":"事件的路由策略是枚举的价值。"," if the element has keyboard focus; otherwise, ":" 如果元素具有键盘焦点;否则, ","The data to store in this data object.":"存储在此数据对象中的数据。","The associated gesture. The default is ":"相关的手势。 默认值为"," if the element is a content element; otherwise, ":"如果元素是内容元素； 否则，"," that specifies the area to clip.":"这指定了要夹的区域。","The type of the event handler. This must be a delegate type and cannot be ":"事件处理程序的类型。 这必须是代表类型，不能是"," to allow the data to be converted to another format on retrieval; ":"为了使数据在检索时转换为另一种格式；"," if the element is a control; otherwise, ":"如果元素是控制； 否则，","The owner class type of the routed event. This cannot be ":"路由事件的所有者类类型。 这是不可能的"," that are within the bounds of ":"在","Always returns 0. This deviates from the standard ":"总是返回0。 这偏离了标准 "," to prohibit the data from being converted to another format on retrieval.":" 以禁止在检索时将数据转换为另一种格式。"," if the element supports interaction; otherwise, ":" 如果元素支持交互；否则, ","The identifier for the newly registered routed event. This identifier object can now be stored as a static field in a class and then used as a parameter for methods that attach handlers to the event. The routed event identifier is also used for other event system APIs.":"新注册路由事件的标识符。 现在可以将此标识符对象存储为类中的静态字段，然后用作将处理程序附加到事件的方法的参数。 路由事件标识符还用于其他事件系统API。"," that specifies the area to erase.":"这指定了要擦除的区域。"," implementation for ":" 为 "," that specifies the format for the data. For a set of predefined data formats, see the ":"这指定了数据的格式。 对于一组预定义的数据格式，请参阅"," that contains the segments of the current ":"其中包含电流的片段"," if the automation peer can receive and send events; otherwise, ":"如果自动化同行可以接收并发送事件； 否则，","The non-NULL event identifier to be associated with this event route.":"与此事件路线关联的非NULL事件标识符。",", which should return the index where the new item was added to the collection.":"，它应该返回添加新项目的索引。","The dependency object (a ":"的依赖对象(a "," that are outside the specified bounds.":"超出指定的界限。","The source that is reporting input for this device.":"该设备报告输入的来源。"," if the element can accept keyboard focus; otherwise, ":"如果元素可以接受键盘焦点； 否则，","Specifies the target object of which the handler is to be added to the route.":"指定将处理程序添加到路由的目标对象。",") to which to add the event handler.":"）添加活动处理程序。","Specifies the handler to be added to the route.":"指定要添加到路线的处理程序。"," if the element is not on the screen; otherwise, ":"如果元素不在屏幕上； 否则，"," that specifies the path that dissects the ":"指定了剖析的路径","The element that receives input.":"接收输入的元素。","A delegate that references the handler method to add.":"引用处理程序方法添加的委托。"," that specifies the shape of the eraser.":"这指定了橡皮擦的形状。","The input device to associate with this event.":"与此事件关联的输入设备。"," if the element contains sensitive content such as a password; otherwise, ":"如果元素包含敏感内容，例如密码； 否则，","Indicates whether or not the listener detects events that have already been handled.":"指示听众是否检测到已经处理的事件。"," if the data object contains data in the ":"如果数据对象在","The top-most element on the event route stack at which two logical trees diverge.":"事件路线堆栈中的最高元素，两个逻辑树散开。"," if the element contains sensitive content; otherwise, ":"如果元素包含敏感内容； 否则，"," if the data object contains data in a text data format; otherwise, ":"如果数据对象包含文本数据格式的数据； 否则，"," after it is dissected by the specified path.":"在用指定路径解剖之后。","The time when the input occurred.":"输入发生的时间。","A stream that contains data in the ":"一条包含数据的流"," that are outside the bounds of the specified ":"在指定的范围之外","The source for the top-most element on the event route stack at which two logical trees diverge.":"事件路线堆栈中最高元素的源，这两个逻辑树发动了。"," if the element must be completed; otherwise, ":"如果必须完成元素； 否则，","The input device associated with this event.":"与此事件关联的输入设备。"," that determines the ":"这决定了","The top-most node on the event route stack at which two logical trees diverge.":"事件路线堆栈上的最高节点在该路线堆栈中，两个逻辑树散开。"," to attempt to automatically convert the data to the specified format; ":" 尝试自动将数据转换为指定的格式; "," if the element is must be completed; otherwise, ":"如果必须完成元素； 否则，","The number of milliseconds that have elapsed since the last reboot. After about 24.9 days this value reaches ":"自上次重新启动以来经过的毫秒数。 约24.9天后该值达到 "," containing the property data.":"包含属性数据。"," for no data format conversion.":"对于没有数据格式转换。"," value that represents the relationship between the two instances of ":" 表示的两个实例之间的关系的值 "," and restarts at (the negative) ":"并重新启动（负）"," that represents the bounds of the area to hit test.":"这代表了该区域进行测试的边界。"," that indicates whether UI Automation is listening for the event.":"这表明UI自动化是否正在聆听该事件。","A data object with the data in the specified format, or ":"具有指定格式数据的数据对象，或","The target of the command.":"命令的目标。","The percentage of the length of the ":"长度的百分比"," to compare for equality.":"比较平等。"," if the data is unavailable in the specified format.  \n  \n If the ":"如果数据以指定格式不可用。 \n  \n  如果是","The input event data to compare this gesture to.":"输入事件数据以将此手势比较。","The class that implements ":"实现的类 ",", that must be in ":"，那一定是"," if two instances are equal; otherwise, ":"如果两个实例相等； 否则，"," if the gesture matches the input; otherwise, ":"如果手势与输入匹配； 否则，"," and the data cannot be converted to the specified format, or if automatic conversion is disabled (by calling ":"并且数据不能转换为指定格式，或者如果禁用自动转换（通过调用自动转换）"," proxy.":" 代理。"," object to compare for equality.":"对象比较平等。"," to be considered hit.":"被认为是命中。","The gesture to add to the collection.":"添加到集合的手势。","The automation peer.":"自动化对等。"," if the current stroke is within the specified bounds; otherwise ":"如果当前的中风在指定的范围内； 否则","), this method returns ":"），此方法返回 ","The gesture to locate in the collection.":"要定位在收藏中的手势。","An integer value between one and nine that corresponds to the usStretchValue definition in the OpenType specification.":"一到九之间的整数值，对应于OpenType规范中的usStretchValue定义。","The proxy.":"代理。"," if the data is in, or can be converted to, the specified format; otherwise, ":"如果数据在或可以转换为指定格式； 否则，"," value representing the hash code for the object.":"代表对象的哈希代码的值。","The path that ":"那条路"," if the gesture is in the collection; otherwise, ":"如果手势在收藏中； 否则，","The previous value of the property.":"属性的先前值。","A string that specifies the data format to check. For a set of predefined data formats, see the ":"指定要检查的数据格式的字符串。 对于一组预定义的数据格式，请参阅"," follows for hit testing":"以下进行命中测试"," when the specified ":"指定时","An array into which the collection is copied.":"复制该集合的阵列。","The new value of the property.":"属性的新价值。"," to check only for the specified format; ":"仅检查指定格式；"," specifying the format to use.  \n  \n -or-  \n  \n ":"指定要使用的格式。 \n  \n  -或者-","The shape of ":"形状","The index position in the ":"索引位置"," that is the source of events.":"那是事件的来源。"," containing the value of the current instance in the specified format.":"在指定格式中包含当前实例的值。","Index at which to insert ":"插入的索引"," to also check whether data stored in this data object can be converted to the specified format.":"还可以检查存储在此数据对象中的数据是否可以转换为指定格式。"," with which to hit test.":"用它进行测试。"," if the element that is associated with this ":"如果与此关联的元素","An integer value between 1 and 999 that corresponds to the ":"整数值在1到999之间，对应于"," that specifies the data format to check. F or a set of predefined data formats, see the ":"指定要检查的数据格式。 f或一组预定义的数据格式，请参阅"," hosts ":"主持人"," intersects the current stroke; otherwise, ":"相交当前的中风； 否则，","The gesture to insert.":"插入的手势。"," definition in the OpenType specification.":"Opentype规范中的定义。","A collection of strings, where each string specifies the name of a file in the list of dropped files, or ":"字符串集合，每个字符串在其中指定删除文件列表中的文件名，或"," to hit test.":"进行测试。"," in Windows Presentation Foundation (WPF); otherwise, ":"在Windows演示基金会（WPF）中； 否则，","The gesture to remove.":"的手势移除。"," value representation of the object.":"对象的值表示。"," has not been created by the ":"尚未由","An array of strings, with each string specifying the name of a format that this data object supports.":"一系列字符串，每个字符串指定此数据对象支持的格式的名称。"," that defines the center of the area to hit test.":"这定义了该区域的中心进行测试。","The zero-based index of the gesture to remove.":"基于零的手势索引要删除。","Context information of a type.":"类型的上下文信息。","The access key for this ":"访问密钥","The diameter of the area to hit test.":"该区域的直径进行测试。"," to retrieve all formats in which the data in this data object is stored, or can be converted to; ":"检索该数据对象中数据中的数据的所有格式，也可以转换为；"," can create a ":"可以创建一个","The number of gestures in the collection.":"集合中的手势数量。"," if the specified area intersects the current stroke; otherwise, ":"如果指定的区域相交当前的中风； 否则，","A string containing the automation identifier.":"包含自动化标识符的字符串。"," to retrieve only formats in which the data in this data object is stored.":" 仅检索存储此数据对象中的数据的格式。","The desired type that this instance of ":"此实例的所需类型"," if the collection read-only; otherwise, ":"如果收集只读; 否则，"," if the current stroke is within the bounds of ":"如果当前的中风在","The point that represents the clickable space that is on the element.":"表示元素上可点击空间的点。","An array of strings, with each string specifying the name of a format supported by this data object.":"一系列字符串，每个字符串指定该数据对象支持的格式的名称。","The event data that describes the property that changed, as well as old and new values.":"描述更改的属性以及旧值的事件数据。"," is being evaluated for conversion to.":"正在评估转换。","The gesture at the specified index.":"指定索引处的手势。","The string that describes the functionality of the ":"描述功能的字符串"," object defining the transformation.":"定义转换的对象。"," data, or an empty string if no ":"数据，或一个空字符串，如果没有"," if the converter can convert ":" 如果转换器可以转换 ","The object that can be used to synchronize access to the collection.":"可用于同步访问集合的对象。","A string containing the status.":"包含状态的字符串。"," data is available.":"数据可用。"," to apply the transformation to the tip of the stylus; otherwise, ":"将转换应用于手写笔的尖端； 否则，","The string that contains the item type.":"包含项目类型的字符串。"," created from the converted ":"由转换的"," object representing a new current input language.":"代表新的当前输入语言的对象。"," that specifies the specific text data format to retrieve.":"这指定要检索的特定文本数据格式。"," that contains the stylus points that represent the current ":"其中包含表示当前的手写笔点","The notification characteristics of the live region.":"现场区域的通知特征。"," object representing the previous current input language.":" 表示先前当前输入语言的对象。",") from which to remove the event handler.":"）从中删除事件处理程序。","The type this instance of ":"此实例的类型","The strokes to add to the ":"要添加到 "," interface if ":"接口如果","The object created from the converted instance of ":"从转换的实例创建的对象"," to reject the initiated change of input language; otherwise, ":"拒绝输入语言的启动变更； 否则，","A delegate that references the handler method to remove.":"引用处理程序方法删除的委托。","A stream that contains ink data.":"包含墨水数据的流。","The value of UI Automation's ":"UI自动化的价值","A value that represents a condensed ":"代表凝结的值","A byte array that contains audio data to store in the data object.":"一个字节数组，其中包含用于存储在数据对象中的音频数据。"," object representing the new current input language.":" 表示新的当前输入语言的对象。"," that specifies the area to be clipped.":"这指定了要剪裁的区域。"," attached property.":"附件。","A value that represents an expanded ":"代表扩展的值"," if the specified custom property identifier is in the ":"如果指定的自定义属性标识符在","The dependency object for which to retrieve the input language.":"检索输入语言的依赖项对象。","A stream that contains audio data to store in the data object.":"一个包含音频数据以存储在数据对象中的流。"," if the element has keyboard input focus; otherwise, ":"如果元素具有键盘输入焦点； 否则，","A value that represents an extra-condensed ":"代表超敏化的值"," object that specifies the format for the data. For a set of predefined data formats, see the ":"指定数据格式的对象。 对于一组预定义的数据格式，请参阅"," object representing the input language for the specified dependency object.":" 表示指定依赖项对象的输入语言的对象。"," on which to draw the ":" 在其上绘制 ","A value that represents an extra-expanded ":"代表超扩张的值","A string that contains \"Pane\".":"一个包含“窗格”的字符串。"," object that contains the image data to store in the data object.":"包含要存储在数据对象中的图像数据的对象。"," that specifies the area to be erased.":"指定要删除的区域。","The dependency object for which to retrieve the value of ":"检索值的依赖关系对象","The pointer to the ":"指向"," data to store in the data object.":"数据存储在数据对象中。","A value that represents a medium ":"代表介质的值"," that specifies the path to be erased.":"这指定了要删除的路径。","The current value of ":"当前值"," was not created by the ":"不是由","A value that represents a normal ":"代表正常的值","A string that contains the text data to store in the data object.":"一个包含要存储在数据对象中的文本数据的字符串。","The accelerator key for the ":"加速器密钥"," for the specified dependency object.":"对于指定的依赖项对象。"," that contains the bounds of the strokes in the ":"其中包含中风的边界","A value that represents a semi-condensed ":"表示半凝聚的值 ","The access key for the ":"访问密钥"," that specifies the text data format to store.":"指定要存储的文本数据格式。","The minimum percentage of each ":"每个的最小百分比","An object that specifies the input language to register.  This object must implement the ":"指定要注册的输入语言的对象。 此对象必须实现","The string that uniquely identifies the ":"唯一标识的字符串","A value that represents a semi-expanded ":"代表半扩展的值"," object representing the new input language.":"代表新输入语言的对象。"," that must be contained within the lasso for it to be considered hit.":"必须在拉索中包含它才能被视为命中。","This method supports the standard return values E_INVALIDARG, E_UNEXPECTED, and E_OUTOFMEMORY, as well as the following:":"此方法支持标准返回值E_INVALIDARG，E_UNEDECT和E_OUTOFMEMORY，以及以下内容："," that contains the coordinates of the element.":"其中包含元素的坐标。","A value that represents an ultra-condensed ":"代表超音量的值"," object representing the previous input language.":"代表先前输入语言的对象。"," that hit tests the ":"打击测试"," containing data ready to be copied.":"包含准备复制的数据。"," elements than correspond to the child elements of the ":"元素比与儿童元素相对应的元素","A value that represents an ultra-expanded ":"代表超扩展的值"," that specifies the tip of the stylus.":"这指定了手写笔的尖端。"," to indicate that the reported change of input language was accepted; otherwise, ":"表明所报告的输入语言的变化被接受； 否则，"," value indicating whether the copy is part of a drag-and-drop operation. ":"值表示该副本是否是拖放操作的一部分。"," on the element that allows a click. The point values are (":"在允许单击的元素上。 点值是（"," value that represents the ":"代表"," to indicate that the copy is part of a drag-and-drop operation; otherwise, ":"指示该副本是拖放操作的一部分； 否则，"," that represent the custom property identifiers.":"代表自定义属性标识符。",") if the element is not both a ":"）如果元素不是两个","The dependency object on which to set the ":"依赖关系对象设置"," to show the two instances are equal; otherwise, ":"表明这两个实例是相等的； 否则，"," that represents the bounds of the area to be hit tested.":"这代表要击中的区域的边界。",". If this parameter is set to ":"。 如果此参数设置为","A 32-bit hash code, which is a signed integer.":"32位哈希代码，这是一个签名整数。"," object representing the new value for the ":"代表新值的对象","A string that describes the functionality of the ":"描述功能的字符串","The acceptable length of the ":"可接受的长度"," event fires when dragging is initiated.":"启动拖动时，事件会发射。"," to show the specified ":"显示指定的","The dependency object for which to set the value of ":"设置值的依赖关系对象","A string that represents the item type that the ":"一个代表项目类型的字符串",", as a percentage, for ":"，百分比"," to show ":"以显示","The data object associated with the ":"与","A Boolean value to set the ":"布尔值"," for the element that targets the ":"对于针对的元素"," that represents the value of the ":"代表了","The object where the event handler is attached.":"事件处理程序附加的对象。"," attached property to.":"附加财产。"," to contain.":"包含装有。","The string that represents the ":"表示代表的字符串"," if the command has been canceled; otherwise, ":"如果命令已取消； 否则，"," that has strokes with at least the specified percentage within the ":"这至少具有指定百分比"," object, such as \"Normal\", \"Italic\", or \"Oblique\".":"对象，例如“正常”，“斜体”或“斜”。","An enumerator for currently available input languages, or ":"当前可用输入语言的枚举器，或"," attached property":"附件"," if the associated event is part of a drag-and-drop operation; otherwise, ":"如果关联的事件是拖放操作的一部分； 否则，","An array to type ":"键入阵列","Reads ":"阅读"," if the converter can convert the provided type to an instance of ":" 如果转换器可以将提供的类型转换为 "," if no input languages are available. This property has no default value.":" 如果没有可用的输入语言。 此属性没有默认值。"," and returns the value.":"并返回值。"," containing the data to be pasted.":"包含要粘贴的数据。"," if the converter can convert this instance of ":"如果转换器可以转换此实例"," that represents the path to be hit tested.":"这代表了被击中测试的路径。"," object associated with the current context.  \n  \n This property has no default value.":"与当前上下文关联的对象。 \n  \n  该属性没有默认值。"," can participate in hit testing or accept focus; otherwise, ":"可以参加命中测试或接受重点； 否则，"," value indicating whether the paste is part of a drag-and-drop operation. ":"值表示粘贴是否是拖放操作的一部分。"," object representing the currently selected input language. This property may not be set to ":"代表当前选择的输入语言的对象。 此属性可能不会设置为","A value that represents an italic ":"表示斜体的值 "," that specifies the shape of ":"指定的形状"," to indicate that the paste is part of a drag-and-drop operation; otherwise, ":"表明糊状物是拖放操作的一部分； 否则，",". \n The default value is ":"。 \n  默认值是"," if the element can receive keyboard focus; otherwise, ":"如果元素可以接收键盘焦点； 否则，","A value that represents an oblique ":"代表倾斜的价值"," of strokes that intersect with ":"与","The menu to leave.":"菜单要离开。"," event is fired on drop.":"事件被放弃。"," is required to be completed on a form; otherwise, ":"必须在表格上填写； 否则，","The point to hit test.":"进行测试的重点。"," value that indicates the relationship between the two instances of ":"表示两个实例之间关系的价值"," that is returned by ":"归还","The input to process.":"处理的输入。","A string specifying the preferred data format to use for the paste operation. See the ":"指定首选数据格式的字符串用于粘贴操作。 看到"," objects that intersect the specified point.":"与指定点相交的对象。",". When the return value is less than zero, ":". 当返回值小于零时, "," that contains the coordinates of the element. Optionally, if the element is not both a ":"其中包含元素的坐标。 可选，如果该元素不是同时","The currently suggested ":"目前建议的"," if all input events were handled; otherwise, ":"如果处理所有输入事件； 否则，","The size of the area around the ":"周围区域的大小"," to use for the paste operation.  \n  \n Getting this value returns the currently suggested ":"用于粘贴操作。 \n  \n  获得此值返回当前建议的","A list of child ":"孩子名单","The menu to enter.":"要输入的菜单。"," that specifies the bounds to be hit tested.":"这指定要击中测试的边界。",". When this value is zero, it indicates that both operands are equal. When the value is greater than zero, it indicates that ":". 当该值为零时，表示两个操作数相等。 值大于零时，表示 ","The string that contains the ":"包含的字符串"," for the paste operation.  \n  \n Setting this value specifies a new suggested ":"用于糊操作。 \n  \n  设置此值指定新建议的","The minimum required length of a Stroke that must exist within bounds for it to be considered hit.":"必须将其视为命中的范围内必须存在的中风的最小长度。"," object, such as \"Light\", \"Normal\", or \"UltraBold\".":"物体，例如“光”，“正常”或“超毛”。","The input manager.":"输入管理器。"," to use for the paste operation.":"用于粘贴操作。","The stroke whose position is required.":"需要其位置的中风。"," for the element that is targeted to the ":"对于针对性的元素","A value that represents a \"Black\" font weight.":"代表“黑色”字体重量的值。","The collection of input provides.":"输入的集合提供。","A string specifying the suggested data format to use for the paste operation.  \n  \n Getting this value returns the currently suggested data format to use for the paste operation.  \n  \n Setting this value specifies a new suggested data format to use for the paste operation.":"指定用于粘贴操作的建议数据格式的字符串。  \n  \n 获取此值将返回当前建议的用于粘贴操作的数据格式。  \n  \n 设置此值可指定用于粘贴操作的新建议数据格式。","A value from the enumeration.":"来自枚举的价值。","The index of the stroke.":"中风的索引。","A value that represents a \"Bold\" font weight.":"代表“粗体”字体重量的值。"," is in menu mode; otherwise, ":"处于菜单模式； 否则，","The specified index.":"指定的索引。","A copy of the original data object associated with the paste operation.":"与糊操作关联的原始数据对象的副本。"," that contains the value of ":"包含的价值","A value that represents a \"Demi-bold\" font weight.":"代表“ demi-bold”字体重量的值。","The input device.":"输入设备。"," to which a new data format is being added.":"正在添加新的数据格式。","The specified stroke":"指定的中风","A value that represents an \"Extra-black\" font weight.":"代表“超黑”字体重量的值。"," if the element is focusable by the keyboard; otherwise ":"如果元素可以通过键盘进行焦点； 否则","The keyboard device.":"的键盘装置。"," to which to save the ":"为了保存","A value that represents an \"Extra-bold\" font weight.":"代表“额外”字体重量的值。","A string specifying the new data format that is being added to the accompanying data object. See the ":"指定要添加到随附数据对象的新数据格式的字符串。 查看 "," that contains the value that is returned by ":"其中包含由","The mouse device.":"鼠标设备。"," to compress the ":"压缩","A string specifying the new data format that is being added to the accompanying data object.":"指定正在添加到随附数据对象的新数据格式的字符串。","A value that represents an \"Extra-light\" font weight.":"代表“超灯”字体重量的值。","The position at which to replace the stroke.":"更换中风的位置。",", if it's set; otherwise ":"，如果设置； 否则","The dependency object for which to retrieve the input scope.":"检索输入范围的依赖项对象。","The object for which to find the XAML source.":"找到XAML源的对象。","A value that represents a \"Heavy\" font weight.":"代表“重”字体重量的值。","The size to report in the event data.":"在事件数据中报告的大小。"," object representing the current input scope for the specified dependency object.":"代表指定依赖项对象的当前输入范围的对象。","A value that represents a \"Light\" font weight.":"代表“轻”字体重量的值。","Information about the XAML source document if available; otherwise, ":"有关XAML源文档（如果可用）的信息；否则, ","The stroke to replace the current stroke.":"的行程来替代当前行程。"," enumeration specifying the current ":"指定当前的枚举","Size of the window after resizing.":"调整大小后窗口的尺寸。"," which specifies the transformation to perform on the ":"指定要在","A value that represents a \"Medium\" font weight.":"代表“中”字体重量的值。"," to which an element (Child) was either added or removed.":"添加或删除了元素（儿童）。","The new value for the ":"新价值"," that contains the added strokes.":"其中包含附加的笔触。"," if the Clipboard contains data in the ":"如果剪贴板在","A value that represents a \"Normal\" font weight.":"代表“正常”字体重量的值。"," that was added to or removed from another element (Parent).":" 它被添加到另一个元素（父元素）或从另一个元素（父元素）中删除。"," enumeration representing the new value for the ":"代表新价值的枚举","A value that represents a \"Regular\" font weight.":"代表“常规”字体重量的值。"," data format; otherwise, ":"数据格式； 否则，"," that contains the removed strokes.":"其中包含删除的笔触。","The index in the Parent element's children where the Child element is located when the add or remove operation is complete.":"当添加或删除操作完成时，父元素的子元素的索引位于子元素的位置。"," that will be used as the parent element for the configuration UI.  This parameter can be ":"它将用作配置UI的父元素。 此参数可以是","The format of the data to look for. See ":"要查找的数据格式。 看","A value that represents a \"Semi-bold\" font weight.":"表示\"半粗体\"字体粗细的值。"," that contains the strokes that are created after the eraser path erases part of ":"其中包含在橡皮图路径擦除一部分后创建的笔触","A value that indicates whether the Child element was added to another element (Parent) or removed.":"指示子元素是添加到另一个元素（父元素）还是删除的值。","A string that specifies a value to register.":"指定要注册的值的字符串。"," that is intersected by the eraser path.":"这是由橡皮擦路径相交的。"," for predefined formats.":"用于预定义格式。","An enumeration value that indicates whether the child element was Added or Removed.":"指示是否添加或删除子元素的枚举值。","A value that represents a \"Thin\" font weight.":"代表“薄”字体重量的值。"," that will be used as the parent element for the word registration UI.  This parameter can be ":"这将用作单词注册UI的父元素。 此参数可以是"," if data in the specified format is available on the Clipboard; otherwise, ":"如果剪贴板上有指定格式的数据； 否则，"," if configuration UI can be displayed; otherwise, ":"如果可以显示配置UI； 否则，","The element that was added to or removed from the Parent element.":"从父元素中添加或删除的元素。","The replaced ":"替换","A value that represents an \"Ultra-black\" font weight.":"代表“超黑”字体重量的值。",".  \n  \n This property has no default value.":"。 \n  \n  该属性没有默认值。","A value that represents an \"Ultra-bold\" font weight.":"代表“超折”字体重量的值。","The height of the stylus.":"手写笔的高度。"," enumeration that specifies the text data format to query for.":"指定要查询文本数据格式的枚举。","The element to which the child element was either added or removed.":"添加或删除子元素的元素。","A value that represents an \"Ultra-light\" font weight.":"代表“超光”字体重量的值。"," if word registration UI can be displayed; otherwise, ":" 如果可以显示word注册UI;否则, ","The angle of the stylus.":"触笔的角度。","The URI of the source document where the element is declared.":"声明元素的源文档的URI。"," if the Clipboard contains data in the specified text data format; otherwise, ":"如果剪贴板以指定的文本数据格式包含数据； 否则，","The width of the stylus.":"手写笔的宽度。","A reference to an ":"提及","The collection whose items should be added to the new ":"应将其项添加到新的集合 ","The line number in the source document where the element is declared.":"声明元素的源文档中的行号。","A stream that contains the data in the ":"一个包含数据的流"," if other elements are invoked; otherwise, ":"如果调用其他元素； 否则，","The position on the line in the source document where the element is declared.":"源文档中的线路上的位置声明了元素。"," object associated with the current context, or null if there is no active input method.  \n  \n This property has no default value.":"与当前上下文关联的对象，如果没有活动输入方法，则为null。 \n  \n  该属性没有默认值。","A value that is greater than or equal to 0 that specifies the number of elements the new collection can initially store.":"大于或等于0的值指定新集合最初可以存储的元素数量。","The access key.":"访问密钥。","The visual representation of the page.":"页面的视觉表示。"," format, or ":" 格式，或 "," enumeration specifying the current input method state for handwriting input.  \n  \n The default value is ":"枚举指定当前输入方法状态用于手写输入。 \n  \n  默认值是",". This value cannot be ":"。 这个值不能是"," if the Clipboard does not contain data in this format.":"如果剪贴板不包含此格式的数据。"," that listens to this event.":"这会听这个事件。","The size of the page, including margins, as it will be after any cropping.":"页面的大小，包括边距，就像任何裁剪后一样。"," enumeration specifying the conversion mode.  \n  \n The default value is ":"枚举指定转换模式。 \n  \n  默认值是","A modifiable copy of this collection and its contents. The copy's ":"此集合及其内容的可修改副本。 副本","The area for print production-related bleeds, registration marks, and crop marks that may appear on the physical sheet outside the logical page boundaries.":"与逻辑页面边界外的物理表上可能出现的与印刷生产相关的区域流血，注册标记和作物标记。","A string that specifies the format of the data to retrieve. For a set of predefined data formats, see the ":"指定要检索的数据的格式的字符串。 有关一组预定义的数据格式，请参阅 ","The event handler to be added.":"活动处理程序要添加。","A modifiable clone of the collection and its contents. The cloned object's ":"该系列及其内容的可修改克隆。 克隆的对象的","The area of the page within the margins.":"边距内的页面区域。"," enumerations specifying the sentence mode.  \n  \n The default value is ":" 指定句子模式的枚举。  \n  \n 默认值为 ","An object that specifies the size and location of a rectangle.":"指定矩形的大小和位置的对象。","An object that contains the data in the specified format, or ":"以指定格式包含数据的对象，或","The object to locate in this collection. This object may be ":"在此集合中定位的对象。 这个对象可能是"," enumeration specifying the state of the input method editor associated with this input method.  \n  \n The default value is ":"指定与此输入方法关联的输入方法编辑器的状态。 \n  \n  默认值是","The presentation source to query for ":"要查询的演示文稿源 "," if value is found in the ":"如果在","The size of the page.":"页面的大小。"," enumeration specifying the current input method state for microphone input.  \n  \n The default value is ":"枚举指定麦克风输入的当前输入方法状态。 \n  \n  默认值是"," if the data is unavailable in the specified format.":" 如果数据以指定的格式不可用。","The key to query.":"查询的关键。"," should simply return whether it can be frozen. ":"应该简单地返回是否可以冷冻。"," representing the size and location of the bleed box area.":"代表流血盒区域的大小和位置。"," enumeration specifying the current speech mode.  \n  \n The default value is ":" 指定当前语音模式的枚举。  \n  \n 默认值为 ","A data object that enables access to the entire contents of the system Clipboard, or ":"可以访问系统剪贴板的整个内容的数据对象，或"," instance should actually freeze itself when this method is called.":"当调用此方法时，实例应实际上冻结自身。"," if the key is registered; otherwise, ":"如果钥匙已注册； 否则，"," if it cannot be made unmodifiable.  \n  \n If ":"如果无法使其无法修饰。 \n  \n  如果","A collection of strings, where each string specifies the name of a file in the list of dropped files on the Clipboard, or ":"字符串集合，每个字符串在剪贴板上删除文件列表中指定文件的名称，或"," property changed; otherwise, ":"属性更改； 否则，"," representing the area of the page, not including the margins.":"代表页面区域，而不包括边距。","The scope for the access key.":"访问密钥的范围。"," enumeration specifying a name for this input scope.  \n  \n The default value is ":"枚举为此输入范围指定名称。 \n  \n  默认值是"," if the data is unavailable in this format.":"如果数据以这种格式不可用。"," if it cannot be made unmodifiable, with the side effect of having begun to change the frozen status of this object.":"如果无法使其无法解码，则开始改变该对象的冷冻状态的副作用。"," representing the height and width of the page.":"表示页面的高度和宽度。","Indicates if ":"指示是否","An object containing a collection of phrases to be used as suggested input patterns by input processors.  This object implements the ":"一个包含输入处理器建议输入模式的短语集合的对象。 这个对象实现","An enumerator for the entire ":"整个枚举者"," object that contains data in the ":"对象，其中包含数据"," depicting the page.":"描绘页面。"," has multiple matches.":" 有多个匹配项。"," interface.  \n  \n This property has no default value.":" 界面。  \n  \n 此属性没有默认值。"," if an occurrence of ":"如果发生"," if there are more keys that match; otherwise, ":"如果有更多键匹配的键； 否则，"," passed to ":"传递","A string that defines a regular expression to be used as a suggested text input pattern by input processors.  \n  \n This property has no default value.":"定义正则表达式的字符串用作输入处理器的建议文本输入模式。 \n  \n  该属性没有默认值。"," data , or an empty string if no ":"数据，或一个空字符串，如果没有"," was found in the collection and removed; ":"在收藏中发现并删除；","The element to associate ":"要关联的元素"," that identifies the asynchronous task to cancel.":"这确定了要取消的异步任务。"," data is available on the Clipboard.":"数据可在剪贴板上找到。","A string that specifies any SRGS markup to be used as a suggested input pattern by input processors.  \n  \n This property has no default value.":"一个字符串，指定任何SRGS标记，以用作输入处理器建议的输入模式。 \n  \n  该属性没有默认值。"," could not be found in the collection.":"在收藏中找不到。","The event handler to be removed.":"活动处理程序将要删除。","A unique identifier for the asynchronous task.":"异步任务的唯一标识符。"," that specifies the text data format to retrieve.":" 指定要检索的文本数据格式。","The zero-based index of the object to remove.":"对象的基于零的索引要删除。","An object that describes any type descriptor context.  This object must implement the ":"描述任何类型描述符上下文的对象。 此对象必须实现","The element from which to disassociate ":"分离的元素","The zero-based page number of the document page that is needed.":"所需文档页面的基于零的页面号。","A string containing text data in the specified data format, or an empty string if no corresponding text data is available.":"在指定数据格式中包含文本数据的字符串，或者如果没有相应的文本数据，则包含一个空字符串。"," interface.  This parameter may be ":"界面。 此参数可能是","A zero-based ":"零基础 ","The generic handler to call in a type-specific way.":"以特定于类型的方式致电的通用处理程序。"," if the page does not exist.":"如果页面不存在。","A data object to compare to the contents of the system Clipboard.":"与系统剪贴板的内容进行比较的数据对象。","The target to call the handler on.":"打电话给处理程序的目标。"," that receives the copied items from the ":" 接收从复制的项目 "," to check for conversion compatibility.":"检查转换兼容性。","The zero-based page number of the ":"基于零的页码"," if the specified data object matches what is on the system Clipboard; otherwise, ":"如果指定的数据对象匹配系统剪贴板上的内容； 否则，","The element's scope.":"元素的范围。"," object containing any cultural context for the conversion.  This parameter may be ":"包含任何文化背景的对象。 此参数可能是","The first position in the specified ":"指定的第一个位置"," if pagination is complete and ":"如果分页完成了，并且","A byte array that contains audio data to store on the Clipboard.":"一个字节阵列，其中包含用于存储剪贴板上的音频数据。","A source object to convert from.  This object must be a string.":"一个要转换的源对象。 此对象必须是字符串。","The element that raised this event.":"提出此事件的元素。"," is the total number of pages; otherwise, ":"是页面的总数； 否则，"," to receive the copied contents.":"接收复制的内容。","The command.  \n  \n ":"命令。","A stream that contains audio data to store on the Clipboard.":"一个包含音频数据存储在剪贴板上的流。"," object converted from the specified source object.":"对象从指定的源对象转换。",", if pagination is in process and ":"，如果分页正在进行， ","The command.":"命令。","The zero-based index at which to insert the ":"基于零的索引插入","A string that specifies the format to use to store the data. See the ":"一个指定用于存储数据的格式的字符串。 看到","The number of elements contained by this ":"此包含的元素数量","The source object to stop listening for.":"源对象停止聆听。","An object to convert from.  This object must be of type ":"一个要转换的对象。 此对象必须是类型"," is the number of pages currently formatted (not the total).  \n  \n This value may revert to ":"是当前格式的页面数（不是总计）。 \n  \n  此值可能会恢复到"," if the enumerator successfully advanced to the next element in the collection; otherwise, ":"如果枚举者成功地升级到集合中的下一个元素； 否则，",", after being ":"，之后","A destination type to convert type.  This type must be string.":"转换类型的目标类型。 此类型必须是字符串。"," if the event can be executed on the command target; otherwise, ":" 如果事件可以在命令目标上执行；否则, "," class for a set of predefined data formats.":"一组预定义数据格式的类。","A new object of the specified type (string) converted from the given ":"从给定转换的指定类型（字符串）的新对象"," enumeration that indicates the effects of the drag-and-drop operation.":"表明拖放操作的影响的枚举。","An object representing the data to store on the Clipboard.":"代表要存储在剪贴板上的数据的对象。","The command. Unless the command is a custom command, this is generally a ":"命令。 除非命令是自定义命令，否则这通常是"," or content changes; because those events would force a repagination.":"或内容更改； 因为这些事件会迫使返回。","The input scope name which modifies how input from alternative input methods is interpreted.":"输入范围名称，该名称修改了如何解释来自替代输入方法的输入。","A data object (an object that implements ":"数据对象（实现的对象",". There is no default value.":"。 没有默认值。","A Boolean value that indicating whether default cursor feedback behavior should be used for the associated drag-and-drop operation. ":"一个布尔值，指示是否应将光标反馈行为用于关联的拖放操作。","A count of the number of pages that have been formatted.":"已格式化的页面数量计数。","The object to be added as the child of this ":"为此添加的对象",") to place on the system Clipboard.":"）放在系统剪贴板上。"," if the routed event should continue to route through element tree; otherwise, ":"如果路由事件应继续穿过元素树； 否则，"," to use default feedback cursor behavior; otherwise, ":"使用默认反馈光标行为； 否则，"," representing the width and height of each page.":"表示每页的宽度和高度。","The text added to the ":"文本添加到",".   The default value is ":"。 默认值是"," to leave the data on the system Clipboard when the application exits; ":"当应用程序退出时，将数据留在系统剪贴板上；","A Rect representing the size and position of the window.":"一个代表窗口的大小和位置的矩形。"," representing the element being paginated.":"代表分页的元素。"," to clear the data from the system Clipboard when the application exits.":"当应用程序退出时，从系统剪贴板中清除数据。","The command data.  The default value is ":"命令数据。 默认值是","The input scope name value which modifies how input from alternative input methods is interpreted.":"输入范围名称值，用于修改来自替代输入方法的输入的解释方式。","The object to return the ":"返回的对象","The HwndDpiChangedEventArgs object.":"hwndddpichangedeventargs对象。","The command target that is invoking the handler.":"调用处理程序的命令目标。"," is being evaluated to be converted to.":"正在评估要转换为。","A string collection that contains the dropped file list to store in the data object.":"包含要存储在数据对象中的已删除文件列表的字符串集合。","The child element that the bounding rectangles are returned for.":"返回边界矩形的子元素。","The command to base the new ":"基于新的命令"," of.":"的。","The type to convert the ":"要转换的类型 "," on.":"上。","A collection of bounding rectangles for a child element.":"子元素的边界矩形集合。"," object that contains the image data to store on the Clipboard.":" 包含要存储在剪贴板上的图像数据的对象。"," of the given object.":"给定对象。","A string specifying the initial value for the ":"一个指定初始值的字符串","The handler for the ":"管理器","The content position whose page number is needed.":"需要页码的内容位置。"," data to store on the Clipboard.":"数据存储在剪贴板上。","Mouse coordinates relative to the ContentHost.":"鼠标坐标相对于ContentHost。"," property.  This value cannot be ":"财产。 这个值不能是"," event on the new ":"新事件"," representing zero-based page number where the specified ":"表示基于零的页码指定的位置","A string that contains the text data to store on the Clipboard.":"一个包含要存储在剪贴板上的文本数据的字符串。","A descendant of ":"后代","An object to add as a child.":"一个小时候添加的对象。"," appears.":"出现。","The command associated with this binding.":"与此绑定关联的命令。"," that specifies the specific text data format to store.":"这指定要存储的特定文本数据格式。","A string to add.":"添加的字符串。","The content position element to return the page number of.":"内容位置元素要返回页码。",", or NULL if no such element exists.":"，如果没有这样的元素存在，则为NULL。","The collection whose items are copied to the new ":"将项目复制到新的集合","An identifier for the routed event to be handled.":"要处理路由事件的标识符。","The page whose position is needed.":"需要其位置的页面。","The binding to add to the collection.":"绑定以添加到集合中。","Child element whose ":"儿童元素谁","A string containing the descriptive name for this ":"一个包含描述名称的字符串","0, if the operation was successful (note that this is not the index of the added item).":"0，如果操作成功（请注意，这不是添加项目的索引）。","A reference to the handler implementation.":"处理程序实现的引用。"," representing the position of ":" 代表的位置 ","The command to invoke.":"调用的命令。"," has changed":"已经改变","An identifier for the.routed event to be handled.":"将要处理的。","The collection of items to add to the end of this ":"要添加到结尾的项目的集合","The key to be associated with ":"与之关联的关键"," if background pagination is enabled; otherwise, ":"如果启用了背景分页； 否则，","Enumeration containing all descendant ":"包含所有后代的枚举"," to register the handler such that it is invoked even when the routed event is marked handled in its event data; ":"注册处理程序以使其被调用，即使在事件数据中对路由事件进行了标记，也会被调用；","The binding to locate in the collection.":"结合到集合中的绑定。","The modifiers to be associated with ":"与之关联的修饰符","-derived classes, as well as all ":" - 衍生的课程以及所有"," for the requested ":"对于要求的"," is in the collection; otherwise, ":"在收藏中； 否则，"," to register the handler with the default condition that it will not be invoked if the routed event is already marked handled.  \n  \n The default is ":"要注册处理程序的默认条件，如果已对路由事件进行了标记，则不会调用它。 \n  \n  默认值为","The key combination to associate with ":"与之相关的关键组合","-derived classes that are a direct descendant of the ":" - 衍生的班级，是"," parameter passed to ":"参数传递给",".  \n  \n Do not routinely ask to rehandle a routed event.":".  \n  \n 不要经常要求重新处理路由事件。","The key sequence. The default value is ":"关键序列。 默认值是","The array into which the collection is copied.":"复制收集的阵列。"," or one of its descendant ":"或它的后代之一","The exception that occurred during the asynchronous operation; or NULL if there were no errors.":"异步操作期间发生的例外； 如果没有错误，则无效。","The key part of the ":"关键部分","The event route that handlers are added to.":"将处理程序添加到的事件路线。"," at which copying starts.":" 复制开始的时候。"," if the asynchronous operation was canceled; otherwise, ":"如果取消异步操作； 否则，","The event data that is used to add the handlers. This method uses the ":"用于添加处理程序的事件数据。 此方法使用"," classes. In other words, elements for which the ":"课程。 换句话说，元素","The modifier keys of the ":"修饰符键"," property of the arguments to create the handlers.":"参数创建处理程序的属性。","The enumerator for this collection.":"该集合的枚举者。"," creates a visual representation (":"创建视觉表示（","The unique ":"独特","The element on which to set keyboard focus.":"设置键盘焦点的元素。","The identifier for the property to animate.":"属性动画的标识符。","-derived classes) or whose layout is driven by the ":" - 衍生的类）或其布局是由","The binding to insert.":"与插入物的结合。","The document page for the page specified in the call to ":"调用中指定的页的文档页 ","The animation clock that controls and declares the animation.":"控制和声明动画的动画时钟。","The element with keyboard focus.":"具有键盘焦点的元素。","The binding to remove.":"绑定以删除。"," (the first-level descendant ":"（第一级后裔","The property to animate.":"动画属性。","The page number passed to ":"页码传递给","The specified key.":"指定的密钥。","-derived classes).":" - 衍生的类）。","The number of bindings in the collection.":"集合中的绑定数。","The page number where the ":"页码","A value of the enumeration. The default is ":"枚举的价值。 默认值为"," is in the down state; otherwise, ":"处于下降状态； 否则，","A string that specifies what format to retrieve the data as. See the ":"一个字符串，指定用于检索数据的格式。 看到","The content position passed to ":"内容位置传递给",", which will stop any existing animation and replace with the new one.":"，这将停止任何现有动画并替换为新动画。"," if the collection is thread-safe; otherwise, ":"如果该集合是线程安全的； 否则，"," is in the toggled state; otherwise, ":"处于切换状态； 否则，","A data object with the data in the specified format, or null if the data is not available in the specified format.":"带有指定格式数据的数据对象，如果以指定格式可用数据，则为null。","The page number (zero-based) for the ":"页码（基于零）","The property to animate, which is specified as a dependency property identifier.":"动画属性，该属性被指定为依赖关系属性标识符。","The key to check.":"检查的钥匙。","The position in the collection.":"集合中的位置。"," for no data format conversion.  \n  \n If this parameter is ":"对于没有数据格式转换。 \n  \n  如果此参数为","The object that performs the actual content pagination.":"执行实际内容分页的对象。"," is in the up state; otherwise, ":"处于上升状态； 否则，","The timeline of the animation to start.":"动画开始的时间表。","The binding at the specified index.":"指定索引处的绑定。",", the method returns data in the specified format if available, or ":"，该方法如果可用，以指定格式返回数据，或","The property to animate, which is specified as the dependency property identifier.":"动画属性，该属性被指定为依赖关系属性标识符。","The page number (zero-based) of first page that changed.":"更改的第一页的页码（基于零）。","An enumeration value that specifies the behavior of WPF when restoring focus. The default in ":"枚举值指定恢复焦点时WPF的行为。 默认为中","The element to attach ":"要附加的元素"," if the data is not available in the specified format.":"如果数据以指定格式不可用。","The focused element.":"集中元素。","The number of continuous pages that changed.":"更改的连续页面数量。","The timeline of the animation to be applied.":"动画的时间表要应用。","The can execute handler.":"可以执行处理程序。","The device.":"设备。"," object that specifies what format to retrieve the data as. See the ":" 指定以何种格式检索数据的对象。 查看 ","The page number (zero-based) of first page paginated.":"第一页的页码（基于零）分页。","The executed handler.":"执行的处理程序。","A value of the enumeration that specifies how the new animation interacts with any current (running) animations that are already affecting the property value.":"枚举的值指定了新动画如何与已经影响属性值的任何当前（运行）动画进行交互。","The input manager associated with this ":"与此关联的输入管理器","The number of continuous pages paginated.":"连续页面的数量分页了。","A string that specifies what format to check for. See the ":"一个指定要检查格式的字符串。 看到","The class with which to register ":"注册的课程","The element to move focus to.":"将重点转移到的元素。"," if the mouse is successfully captured; otherwise, ":"如果鼠标成功捕获； 否则，"," class for a set of pre-defined data formats.":"一组预定义的数据格式的类。","The element that has keyboard focus.":"具有键盘焦点的元素。"," if the stylus is successfully captured; otherwise, ":"如果手写笔成功捕获； 否则，"," to only check for the specified format; ":"仅检查指定格式；"," to also check whether or not data stored in this data object can be converted to the specified format.":"还可以检查该数据对象中存储的数据是否可以转换为指定格式。","The device to capture.":"捕获的设备。"," if the specified touch is captured to this element; otherwise, ":"如果将指定的触摸捕获到该元素； 否则，"," if keyboard focus could be set to this element; ":"如果可以将键盘焦点设置为此元素；"}