{"The access mask for the ACE to be removed.":"删除ACE的访问掩码。"," method computes the hash code. This parameter is ignored.":"方法计算哈希代码。 此参数被忽略。"," if the digital signature is valid for the provided data; otherwise, ":"如果数字签名对提供的数据有效； 否则，","The key salt used to derive the key.":"用来推导钥匙的钥匙盐。","The claims with which to populate the claims identity.":"填充索赔身份的索赔。","The starting index at which to compute the hash.":"计算哈希的起始索引。","The number of iterations for the operation.":"操作的迭代次数。","0 if ":"0如果","Flags that specify the inheritance properties of the ACE to be removed.":"指定要删除ACE的继承属性的标志。","The type of authentication used.":"使用的身份验证类型。"," instance; otherwise, 1 if ":"实例; 否则1","An array that contains the signed data.":"包含签名数据的数组。","The password to use to derive the key.":"用于得出密钥的密码。","Flags that specify the inheritance propagation properties for the ACE to be removed.":"指定要删除ACE的继承传播属性的标志。","The claim type to use for name claims.":"用于姓名索赔的索赔类型。","This method always returns \"()\".":"此方法始终返回“（）”。","The key salt to use to derive the key.":"用于得出钥匙的钥匙盐。","The claim type to use for role claims.":"用于角色主张的索赔类型。","The identity of the class of objects to which the removed ACE applies.":"删除ACE适用的对象类别的身份。","The starting index of the signed portion of ":"签名部分的起始索引","The hash algorithm to use to derive the key.":"用于得出密钥的哈希算法。","The serialized data.":"序列化数据。","The identity of the class of child objects which can inherit the removed ACE.":"可以继承删除ACE的子对象类别的身份。","There is no acceptable value for ":"没有可接受的价值"," that were signed.":"签名。","The context for serialization.":"序列化的上下文。","The size of the random salt that you want the class to generate.":"您希望班级生成的随机盐的大小。","0, the number of elements in this ":"0，此中的元素数量","The type of access control (allow or deny) to set.":"要设置的访问控制（允许或拒绝）的类型。","The hash of the data signed with ":"与","The algorithm name for which to derive the key.":"为其得出键的算法名称。","The identity from which to base the new claims identity.":"基于新索赔身份的身份。"," for which to set an ACE.":"为此设置王牌。","The value tuple's first element.":"值元组的第一个元素。","The signed hash.":"签名的哈希。","The claims with which to populate the new claims identity.":"填充新索赔身份的主张。"," for which to set access.":"为其设置访问权限。","The hash algorithm name to use to derive the key.":"用于得出密钥的哈希算法名称。","The tuple to compare with this instance.":"与此实例进行比较的元组。","The data hash to verify.":"数据哈希验证。","The claim to add.":"声称要添加。","The binary data from which to create the new ":"创建新的二进制数据","The value tuple to compare with this instance.":"与此实例进行比较的值元组。","The size of the key, in bits, to derive.":"钥匙的大小，位于位。","The claims to add.":"要求添加的主张。","The signature to be verify.":"要验证的签名。","The offset at which to begin unmarshaling.":"开始解散的偏移。"," if the current instance is equal to the specified tuple; otherwise, ":"如果当前实例等于指定的元组； 否则，"," that points to the claim.":"这表明了主张。"," object this method creates.":"对象此方法创建。","The hash code for the current ":"当前的哈希代码"," if the digital signature is valid for the hash; otherwise, ":"如果数字签名对哈希有效； 否则，","The initialization vector (IV) to use to derive the key.":"用于得出密钥的初始化向量（IV）。"," objects are unequal; otherwise, ":"物体不平等； 否则，","The value tuple's second element.":"值元组第二个元素。","The derived key.":"派生的键。","The function that performs the matching logic.":"执行匹配逻辑的功能。","The instance of Digital Signature Algorithm (":"数字签名算法的实例（","The type of this ACE.":"这个王牌的类型。"," if the current instance is equal to the specified objects; otherwise, ":"如果当前实例等于指定的对象； 否则，","The matching claims. The list is read-only.":"匹配主张。 该列表仅阅读。","The audit information associated with this Access Control Entry (ACE).":"与此访问控制条目（ACE）相关的审计信息。",") that holds the key.":"）持有钥匙。","The size of key to derive.":"派出的钥匙大小。","The claim type against which to match claims.":"符合索赔的索赔类型。","The value tuple's third element.":"值元组的第三个要素。","The name of the hash algorithm to use for the signature deformatter.":"用于签名变形的哈希算法的名称。","A byte array containing the created PBKDF2 derived key.":"包含创建的PBKDF2派生键的字节数组。","Flags that specify the inheritance properties of this ACE.":"指定该ACE的继承属性的标志。","The first matching claim or ":"第一个匹配主张或"," that holds the key.":"那是钥匙。"," if this ACE is inherited; otherwise, ":"如果该王牌继承； 否则，","The value tuple's fourth element.":"值元组的第四元素。","The buffer to fill with a derived key.":"缓冲区充满派生键。","Flags that specify the inheritance propagation properties of this ACE.":"指定该ACE的继承传播属性的标志。"," if the signature is valid for the data; otherwise, ":"如果签名对数据有效； 否则，","A byte array of length ":"长度的字节阵列","The claim type to match.":"匹配的索赔类型。","The value tuple's fifth element.":"值元组的第五元素。","The destination for this serialization. Can be ":"此序列化的目的地。 可","The array into which copies of the ":"阵列中的副本","The value tuple's sixth element.":"值元组的第六个元素。","The instance of the Digital Signature Algorithm (":"数字签名算法的实例（"," that is filled with pseudo-random key bytes.":"充满了伪随机键字节。"," if a matching claim exists; otherwise, ":"如果存在匹配的主张； 否则，"," objects contained by the current ":"电流包含的对象","The digital signature for the specified data.":"指定数据的数字签名。","The value tuple's seventh element.":"值元组的第七元素。","The hash algorithm used for byte derivation.":"用于字节推导的哈希算法。","The type of the claim to match.":"要求匹配的主张的类型。"," are placed.":"摆放在。"," can range from 0 (the index of ":"可以从0（索引","The name of the hash algorithm to use for the signature formatter.":"用于签名格式的哈希算法的名称。","The key salt value for the operation.":"操作的关键盐值。","The value of the claim to match.":"匹配索赔的价值。"," where the copying begins.":"复制开始的地方。",") to 6 (the index of  ":"）至6（索引","The friendly name of the identifier.":"标识符的友好名称。"," object, cast as an instance of the ":"对象，作为实例施放","The secret key to be used for the symmetric algorithm. The key size must be 128, 192, or 256 bits.":"用于对称算法的秘密键。 关键大小必须为128、192或256位。"," if a match is found; otherwise, ":"如果发现比赛； 否则，","An instance of any value tuple type that contains the values of the value's tuple's remaining elements.":"任何值元组类型的实例，其中包含值的元素剩余元素的值。","The claim to remove.":"要求删除的主张。","The IV to be used for the symmetric algorithm.":"用于对称算法的IV。","Specifies which sections (access rules, audit rules, primary group, owner) of the security descriptor to get.":"指定要获得的安全描述符的哪些部分（访问规则，审计规则，主要组，所有者）。","An object representing the named curve.":"代表命名曲线的对象。","The major version number.":"主要版本号。","A symmetric ":"对称"," if the claim was successfully removed; otherwise, ":"如果索赔成功删除； 否则，","The object identifier to use.":"要使用的对象标识符。","The SDDL representation of the specified sections of the security descriptor associated with this ":"与此关联的安全描述符指定部分的SDDL表示","The minor version number.":"次要版本号。"," if the security descriptor associated with this  ":"如果安全描述符与此关联","The dotted number of the identifier.":"标识符的虚线数。","Additional data provided by the derived type.":"派生类型提供的其他数据。"," decryptor object.":"解密对象。","The build number.":"构建编号。"," if the curve is an explicit characteristic 2 curve; ":"如果曲线是显式特征2曲线；"," object can be converted to the Security Descriptor Definition Language (SDDL) format; otherwise, ":"对象可以转换为安全描述符定义语言（SDDL）格式； 否则，"," encryptor object.":"加密对象。","The calling party that was granted delegation rights.":"被授予代表团权利的呼叫方。","The revision number.":"修订号。","The access mask for this ":"访问面具"," if the curve is a named characteristic 2, prime, or implicit curve.":"如果曲线是命名的特征2，Prime或隐式曲线。","A string containing the major, minor, build, and revision numbers, where each number is delimited with a period character ('.').":"一个包含专业，辅助，构建和修订号的字符串，其中每个数字都用一个周期字符（'。'）界定。","The feedback size in bits.":"反馈尺寸成位。","The authentication type.":"身份验证类型。"," if the curve is an explicit curve (either prime or characteristic 2); ":"如果曲线是显式曲线（素数或特征2）；"," object associated with this ":"与此关联的对象"," whose values are a copy of the current ":"其价值是当前的副本","The bootstrap context.":"引导程序上下文。"," if the curve is a named or implicit curve.":"如果曲线是命名或隐式曲线。"," object is a container object.":"对象是容器对象。","The initialization vector (IV) to use for the symmetric algorithm.":"用于对称算法的初始化矢量（IV）。","A signed integer that indicates the relative values of the two objects, as shown in the following table.\n\n ":"一个指示两个对象的相对值的签名整数，如下表所示。","The collection of claims associated with this claims identity.":"与此索赔身份相关的索赔的收集。","The type of securable object with which the new ":"新的可靠对象的类型"," if the curve is a named curve; ":"如果曲线是命名曲线；","The secret key used for the symmetric algorithm.":"用于对称算法的秘密键。"," are both ":"都是"," if the identity has been authenticated; otherwise, ":"如果身份已得到认证； 否则，"," object is associated.":"对象关联。"," if the curve is an implicit or an  explicit curve (either prime or characteristic 2).":"如果曲线是隐式或显式曲线（素数或特征2）。","The size, in bits, of the secret key used for the symmetric algorithm. The default is 256 bits.":"用于对称算法的秘密密钥的大小。 默认值为256位。"," objects, and every component of the current ":"对象和当前的每个组件","The label.":"标签。","The handle of the securable object with which the new ":"新的可靠对象的手柄","The name or ":"名称或"," object matches the corresponding component of the ":"对象与","The mode for operation of the symmetric algorithm. The default is ":"对称算法的操作模式。 默认值为"," if the curve is an explicit prime curve; ":"如果曲线是明确的序曲线；"," enumeration values that specifies the sections of the security descriptor (access rules, audit rules, owner, primary group) of the securable object to include in this ":"指定安全描述符（访问规则，审计规则，所有者，主要组）的列表值，以包含在此中","A read-only span of characters that contains a version number to convert.":"仅读取字符的跨度，其中包含要转换的版本编号。","The name claim type.":"名称声明类型。","A delegate implemented by integrators that provides custom exceptions.":"由集成商实施的代表，提供自定义异常。","The padding mode used in the symmetric algorithm. The default is ":"对称算法中使用的填充模式。 默认值为"," if the curve is a named prime, characteristic 2 or implicit curves.":"如果曲线是命名的素数，则具有特征2或隐式曲线。","An object that is equivalent to the version number specified in the ":"等效于在","The identifier of a named curve.":"指定曲线的标识符。","The role claim type.":"角色主张类型。","A new instance of the default implementation of ":"默认实现的新实例","An object that contains contextual information about the source or destination of the exception.":"包含有关异常源或目的地的上下文信息的对象。","The identities from which to initialize the new claims principal.":"初始化新索赔本金的身份。","A string that contains a version number to convert.":"一个包含要转换版本号的字符串。","A brainpoolP160r1 named curve.":"BrainPoolp160R1名为曲线。","A new ephemeral RSA key with the specified key size.":"具有指定键大小的新临时RSA键。","The name of the securable object with which the new ":"使用新的对象的名称","The identity from which to initialize the new claims principal.":"初始化新索赔本金的身份。"," representation of the values of the major, minor, build, and revision components of the current ":"当前的主要，次要，构建和修订组件的值的代表","A new ephemeral RSA key.":"新的短暂RSA键。","A brainpoolP160t1 named curve.":"BrainPoolp160T1名为曲线。","The handle of the securable object with which this ":"使用此的可靠对象的手柄"," object, as depicted in the following format. Each component is separated by a period character ('.'). Square brackets ('[' and ']') indicate a component that will not appear in the return value if the component is not defined:\n\n major.minor[.build[.revision]]\n\n For example, if you create a ":"对象，如以下格式所示。 每个组件都由周期字符（'。'）隔开。 Square Brackets（'['and']）表示一个组件，如果未定义组件，则不会在返回值中出现： \n\n  major.minor [.build [.revision]] \n\n  例如，如果您创建一个","The principal from which to initialize the new claims principal.":"初始化新索赔本金的本金。","The name of the implementation of ":"实施的名称","A brainpoolP192r1 named curve.":"Brainpoolp192r1命名为曲线。"," enumeration values that specifies the sections of the security descriptor (access rules, audit rules, owner, primary group) of the securable object to save.":"指定安全描述符（访问规则，审计规则，所有者，主要组）的枚举值要保存。","A brainpoolP192t1 named curve.":"BrainPoolp192T1名为曲线。","The claims identities to add.":"索赔身份要添加。","The data to decrypt.":"解密的数据。","The name of the securable object with which this ":"使用此的可靠对象的名称"," object using the constructor ":"使用构造函数的对象","A brainpoolP224r1 named curve.":"BrainPoolp224R1名为曲线。","The claims identity to add.":"索赔身份要添加。","The padding mode.":"填充模式。","A brainpoolP224t1 named curve.":"BrainPoolp224T1名为曲线。","The numeric error code.":"数字错误代码。",", the returned string is \"1.1\". If you create a ":"，返回的字符串为“ 1.1”。 如果您创建一个","A new copy of the ":"新副本","The name of the securable object with which the ":"使用的可靠对象的名称","The decrypted data.":"解密的数据。",", the returned string is \"1.3.4.2\".":"，返回的字符串为“ 1.3.4.2”。","A brainpoolP256r1 named curve.":"BrainPoolp256R1名为曲线。","The handle of the securable object with which the ":"可靠的对象的手柄","The cipher text to be decrypted.":"密码文本要解密。","The created claims identity.":"创建的索赔身份。","The number of components to return. The ":"要返回的组件数量。 这","A brainpoolP256t1 named curve.":"BrainPoolp256T1名为曲线。","The resulting decryption of the ":"由此产生的解密","The matching claims.":"匹配主张。"," this delegate creates.":"这个代表创造了。"," parameter in plain text.":"纯文本中的参数。","The type of object to which the rule applies.":"规则应用的对象的类型。"," ranges from 0 to 4.":"范围从0到4。","A brainpoolP320r1 named curve.":"Brainpoolp320R1名为Curve。","The role for which to check.":"检查的角色。","The type of child object that can inherit the rule.":"可以继承规则的子对象的类型。","A brainpoolP320t1 named curve.":"Brainpoolp320T1名称曲线。","The data to encrypt.":"加密的数据。"," if claims principal is in the specified role; otherwise, ":"如果索赔本金在指定角色； 否则，"," object, each separated by a period character ('.'). The ":"对象，每个对象被周期字符（'。'）隔开。 这","The claims associated with this principal.":"与该委托人相关的索赔。","Specifies whether this rule allows or denies access.":"指定该规则允许还是拒绝访问。","A brainpoolP384r1 named curve.":"Brainpoolp384R1名为Curve。"," parameter determines how many components are returned.\n\n ":"参数确定返回多少个组件。","The delegate. The default is ":"代表。 默认值为","The encrypted data.":"加密数据。","The type of child object that can inherit the ":"可以继承的子对象的类型","A brainpoolP384t1 named curve.":"Brainpoolp384T1名为曲线。","\n\n For example, if you create ":"例如，如果您创建","The current claims principal.":"当前的索赔本金。","The plain text to be encrypted.":"要加密的纯文本。"," specifies that the ":"指定"," returns \"1.3\" and ":"返回“ 1.3”和","A brainpoolP512r1 named curve.":"BrainPoolp512R1命名为曲线。","The resulting encryption of the ":"由此产生的加密"," property contains a valid value. ":"属性包含一个有效的值。","The collection of claims identities.":"索赔身份的收集。"," parameter as cipher text.":"参数为密码文本。","A brainpoolP512t1 named curve.":"BrainPoolp512T1名为曲线。"," throws an exception.":"引发例外。","The primary claims identity associated with this claims principal.":"与本索赔本金相关的主要索赔身份。"," property contains a valid value. These values can be combined with a logical OR.":"属性包含一个有效的值。 这些值可以与逻辑或。","A byte array containing the PKCS#1 RSAPrivateKey representation of this key.":"包含该键的PKCS＃1 rsaprivateKey表示的字节数组。","When this method returns, the formatted version in the span of characters.":"当此方法返回时，字符跨度中的格式化版本。","A nistP256 named curve.":"NISTP256名为Curve。","The object from which to construct the new instance of ":"构造新实例的对象","The type of object to which the ":"对象的类型","The number of components to return. This value ranges from 0 to 4.":"要返回的组件数量。 该值范围从0到4。","A byte array containing the PKCS#1 RSAPublicKey representation of this key.":"包含此密钥的PKCS＃1 rsapublickey表示的字节数组。","A nistP384 named curve.":"Nistp384名为Curve。"," equivalent of the number that is contained in ":"等效于包含在","The inheritance, inheritance propagation, and auditing conditions for the new Access Control Entry (ACE).":"新访问控制条目（ACE）的继承，继承传播和审计条件。","A collection of claims for this ":"为此索赔的集合","The XML string containing ":"XML字符串包含","A nistP521 named curve.":"NISTP521名为Curve。",", if the conversion succeeded. If ":"，如果转换成功。 如果"," if the user was has been authenticated; otherwise, ":"如果用户已被认证； 否则，"," key information.":"关键信息。","Whether the ":"是否","A new instance of the default implementation of this class.":"此类默认实现的新实例。",", or if the conversion fails, ":"，或者如果转换失败，"," parameters contain valid object GUIDs.":"参数包含有效的对象指南。","The algorithm to use in hash the data.":"用于哈希数据的算法。","The build number, or -1 if the build number is undefined.":"构建号，或-1如果构建号不确定。","The name of the user on whose behalf the code is being run.":"代表代码正在运行的用户名称。","A GUID that identifies the object type to which the new ACE applies.":"标识新ACE应用的对象类型的GUID。","A 16-bit signed integer.":"一个16位签名的整数。","A basic implementation of ":"一个基本实施","A GUID that identifies the object type that can inherit the new ACE.":"标识可以继承新ACE的对象类型的GUID。","The curve to use to generate a new public/private key-pair.":"用于生成新的公钥/私钥对的曲线。","The hash algorithm.":"的哈希算法。","The revision number, or -1 if the revision number is undefined.":"修订号，或-1如果修订号不确定。"," if the new ACE is a callback type ACE.":"如果新ACE是回调类型ACE。"," that represents any user.":"代表任何用户。","A new instance of the default implementation of the Elliptic Curve Diffie-Hellman (ECDH) algorithm.":"椭圆曲线Diffie-Hellman（ECDH）算法的默认实现的新实例。","The bytes of a PKCS#1 RSAPrivateKey structure in the ASN.1-BER encoding.":"pkcs＃1 rsaprivatekey结构的字节在ASN.1-Ber编码中。","An array of role names to which the user represented by the ":"用户代表的角色名称数组","The object to track or ":"跟踪的对象或","Opaque data associated with the new ACE. This is allowed only for callback ACE types. The length of this array must not be greater than the return value of the ":"与新ACE相关的不透明数据。 仅适用于回调ACE类型。 此数组的长度不得大于","The parameters  for the elliptic curve cryptography (ECC) algorithm.":"椭圆曲线加密（ECC）算法的参数。"," parameter belongs.":"参数属于。","The bytes of a PKCS#1 RSAPublicKey structure in the ASN.1-BER encoding.":"ASN.1-Ber编码中的PKCS＃1 rsapublickey结构的字节。","True if the ":"如果是，则为","The name of an implementation of the ECDH algorithm.":"ECDH算法实现的名称。"," is a member of the specified role; otherwise, ":"是指定角色的成员； 否则，"," is a callback ACE type.":"是一种回调ACE类型。","The input data to hash and sign.":"输入数据到哈希和签名。"," of the user represented by the ":"用户代表的用户","A new instance of the specified implementation of this class. If the specified algorithm name does not map to an ECDH implementation, this method returns ":"此类指定实现的新实例。 如果指定的算法名称未映射到ECDH实现，则此方法返回","The maximum allowed length, in bytes, of an opaque data BLOB for callback Access Control Entries (ACEs).":"用于回调访问控制条目（ACE）的不透明数据BLOB的最大允许长度。","The RSA signature for the specified data.":"指定数据的RSA签名。","The other party's public key.":"另一方的公钥。","A cryptographic object that is used to perform the symmetric algorithm.":"用于执行对称算法的加密对象。","The input stream to hash and sign.":"输入流到哈希和签名。","The GUID of the object type that can inherit the Access Control Entry (ACE) that this ":"可以继承访问控制条目（ACE）的对象类型的GUID","The hash algorithm to use to derive the key material.":"用于得出关键材料的哈希算法。","The name of the specific implementation of AES to use.":"AE的特定实现的名称要使用。","The hash value of the data to be signed.":"要签名的数据的哈希值。"," object represents.":"对象表示。","The secret key to use for this instance.":"用于此实例的秘密键。","The hash of the shared secret.":"共同秘密的哈希。","On or more members of the ":"在或更多成员","The padding.":"填充。","The nonce associated with this message, which must match the value provided during encryption.":"与此消息关联的非CE，必须匹配加密过程中提供的值。","A value to prepend to the derived secret before hashing.":"在哈希之前，要预先派出派生的秘密的价值。","The GUID of the object type associated with this ":"与此关联的对象类型的GUID","The encrypted content to decrypt.":"加密内容解密。","The RSA signature for the specified hash value.":"指定哈希值的RSA签名。","A value to append to the derived secret before hashing.":"在哈希之前，要附加到派生的秘密的价值。","The audit conditions.":"审计条件。"," to include a public and private RSA key; ":"包括公共和私人RSA密钥；","The authentication tag produced for this message during encryption.":"加密过程中为此消息产生的身份验证标签。","True if the new ":"如果是新的","The hash of the shared secret after prepending or appending data as requested.":"根据要求进行准备或附加数据后共享秘密的哈希。","The byte array to receive the decrypted contents.":"字节阵列接收解密的内容。"," to include only the public key.":"仅包括公钥。"," object is a directory object.":"对象是目录对象。","The key for the HMAC.":"HMAC的关键。","The HMAC of the shared secret.":"共享秘密的HMAC。","An XML string containing the key of the current ":"一个包含当前键的XML字符串","The owner for which to get the primary group.":"所有者要获得小组的所有者。","Extra data associated with this message, which must match the value provided during encryption.":"与此消息相关的额外数据，必须匹配加密过程中提供的值。","The buffer to receive the decrypted data.":"接收解密数据的缓冲区。","The primary group associated with the specified owner.":"与指定所有者关联的主要组。","The HMAC of the shared secret after prepending or appending data as requested.":"根据要求进行准备或附加数据后共享秘密的HMAC。","The byte span to receive the decrypted contents.":"字节跨接收解密内容。","The result of the key derivation function, using the shared secret as an input.":"密钥推导函数的结果，使用共享秘密作为输入。"," is long enough to receive the decrypted data; otherwise, ":"足够长的时间接收解密的数据； 否则，","The primary group for which to get the owner.":"获得所有者的主要小组。","The ASCII-encoded PRF label.":"ASCII编码的PRF标签。","The nonce associated with this message, which should be a unique value for every operation with the same key.":"与此消息相关联的NONCE，这应该是每个操作具有相同键的唯一值。","The buffer to receive the encrypted data.":"缓冲区接收加密数据。","The owner associated with the specified group.":"与指定组相关联的所有者。"," is long enough to receive the encrypted data; otherwise, ":"足够长的时间接收加密数据； 否则，","The 64-byte PRF seed.":"64字节PRF种子。","The content to encrypt.":"加密的内容。","An array of byte values that represents the security descriptor for this ":"代表此安全性描述符的字节值数组","The byte span to receive the PKCS#1 RSAPrivateKey data.":"接收PKCS＃1 rsaprivatekey数据的字节跨度。","The first 48 bytes from the TLS 1.1 PRF, using the shared secret as the key.":"使用共享秘密作为密钥，来自TLS 1.1 PRF的前48个字节。","The byte array to receive the encrypted contents.":"字节阵列接收加密内容。"," object. This method returns ":"目的。 此方法返回","The byte span to receive the PKCS#1 RSAPublicKey data.":"接收PKCS＃1 rsapublickey数据的字节跨度。","A byte array containing the ECPrivateKey representation of this key.":"包含此键的EcprivateKey表示的字节阵列。","The byte array to receive the generated authentication tag.":"字节阵列接收生成的身份验证标签。"," if there is no security information in this ":"如果此中没有安全信息"," is long enough to receive the hash value; otherwise, ":"足够长以获得哈希价值； 否则，"," if the DACL is actually modified; otherwise, ":"如果DACL实际修改； 否则，","An object that represents the point on the curve for this key, using the explicit curve format.":"使用显式曲线格式代表该键曲线上点的对象。","Extra data associated with this message, which must also be provided during decryption.":"与此消息相关的额外数据，在解密过程中也必须提供。","The buffer to receive the RSA signature.":"缓冲区接收RSA签名。"," to include public parameters only.":"仅包括公共参数。","The byte span to receive the encrypted contents.":"接收加密内容的字节跨度。"," if the SACL is actually modified; otherwise, ":"如果SACL实际修改； 否则，","An object that represents the point on the curve for this key. It can be passed to the ":"代表此键曲线上点的对象。 它可以传递给"," is long enough to receive the RSA signature; otherwise, ":"足够长的时间可以接收RSA签名； 否则，"," to enable the privilege that allows the caller to take ownership of the object.":"为了启用允许呼叫者拥有对象所有权的特权。","The byte span to receive the generated authentication tag.":"接收生成的身份验证标签的字节跨度。","The name used to retrieve the persisted information.":"用于检索持续信息的名称。","The curve used to generate an ephemeral public/private key pair.":"用于生成短暂的公共/私钥对的曲线。","The hash value of the signed data.":"签名数据的哈希值。"," if the algorithm is supported; otherwise, ":"如果支持该算法； 否则，","The hash algorithm used to create the hash value.":"哈希算法用于创建哈希值。","The handle used to retrieve the persisted information.":"用于检索持续信息的手柄。","The bytes of an ECPrivateKey structure in the ASN.1-BER encoding.":"ASN.1-ber编码中的EcprivateKey结构的字节。","The nonce sizes supported by this instance: 7, 8, 9, 10, 11, 12, or 13 bytes (56, 64, 72, 80, 88, 96, or 104 bits).":"该实例支持的非CE大小：7、8、9、10、11、12或13个字节（56、64、72、80、88、96或104位）。","Returns \"RSA\".":"返回“ RSA”。"," for which to remove all access rules.":"为此删除所有访问规则。","The tag sizes supported by this instance: 4, 6, 8, 10, 12, 14, or 16 bytes (32, 48, 64, 80, 96, 112, or 128 bits).":"该实例支持的标签大小：4、6、8、10、12、14或16字节（32、48、64、80、96、112或128位）。","An object whose mode is ":"一个模式为","The curve's parameters to import.":"曲线的参数要导入。","The nonce sizes supported by this instance: 12 bytes (96 bits).":"此实例支持的非CE大小：12个字节（96位）。"," with the hash algorithm specified by ":"使用哈希算法指定"," for which to remove all audit rules.":"为此删除所有审核规则。","This method does not return a value.":"此方法不返回值。","The tag sizes supported by this instance: 12, 13, 14, 15, or 16 bytes (96, 104, 112, 120, or 128 bits).":"该实例支持的标签大小：12、13、14、15或16字节（96、104、112、120或128位）。","The byte span to receive the ":"字节跨接收","The hash code of this instance.":"此实例的哈希代码。"," to protect the access rules associated with this ":"保护与此相关的访问规则","A symmetric decryptor object.":"对称解密对象。"," data.":"数据。"," object from inheritance; ":"继承的对象；","The string representation of the current object.":"当前对象的字符串表示。","The name of the key exchange algorithm.":"密钥交换算法的名称。"," to allow inheritance.":"允许继承。","The secret key to use for the symmetric algorithm.":"用于对称算法的秘密键。","A padding mode.":"填充模式。","The public part of the ECDH key pair that is being used by this ":"ECDH密钥对的公共部分正在使用","The initialization vector to use for the symmetric algorithm.":"用于对称算法的初始化矢量。"," to preserve inherited access rules; ":"保留继承的访问规则；","An object that represents the OAEP encryption standard with a SHA1 hash algorithm.":"用SHA1哈希算法代表OAEP加密标准的对象。","A symmetric encryptor object.":"对称的加密对象。","A byte array that represents an ":"代表一个字节数组"," to remove inherited access rules. This parameter is ignored if ":"删除继承的访问规则。 如果此参数被忽略","The block size, in bits, of the cryptographic operation. The default is 128 bits.":"加密操作的块大小。 默认值为128位。","An object that represents the OAEP encryption standard with a SHA256 hash algorithm.":"用SHA256哈希算法代表OAEP加密标准的对象。","An object that represents the point on the curve for this key.":"表示此键的曲线上的点的对象。","The feedback size, in bits.":"反馈尺寸，位。"," to protect the audit rules associated with this ":"保护与此相关的审计规则","A byte array containing the X.509 SubjectPublicKeyInfo representation of this key.":"包含该键的X.509主题publicKeyInfo表示的字节阵列。","An object that represents the OAEP encryption standard with a SHA384 hash algorithm.":"用SHA384哈希算法代表OAEP加密标准的对象。","The key for the symmetric algorithm.":"对称算法的关键。"," to preserve inherited audit rules; ":"保留继承的审计规则；","A byte array that contains the serialized Elliptic Curve Diffie-Hellman (ECDH) public key.":"包含串行的椭圆曲线Diffie-Hellman（ECDH）公钥的字节阵列。","An object that represents the OAEP encryption standard with a SHA512 hash algorithm.":"用SHA512哈希算法代表OAEP加密标准的对象。","The size, in bits, of the key used by the symmetric algorithm.":"对称算法使用的密钥的大小。"," to remove inherited audit rules. This parameter is ignored if ":"删除继承的审计规则。 如果此参数被忽略","An object that represents the PKCS #1 encryption standard.":"代表PKCS＃1加密标准的对象。","An XML string that contains the serialized Elliptic Curve Diffie-Hellman (ECDH) public key.":"XML字符串，其中包含串行的椭圆曲线Diffie-Hellman（ECDH）公钥。","The primary group to set.":"要设置的主要组。","The owner to set.":"所有者要设置。","The block sizes, in bits, that are supported by the symmetric algorithm.":"对称算法支持的块大小（以位为单位）。","The instance of the ":"实例",".\n            This parameter is treated as uninitialized.":".\n            此参数被视为未初始化。","The array of bytes from which to set the security descriptor.":"从其中设置安全描述符的字节数组。"," algorithm that holds the private key.":"拥有私钥的算法。","The key sizes, in bits, that are supported by the symmetric algorithm.":"对称算法支持的关键大小，位于位。","A new instance of the default implementation (":"默认实现的新实例（","The sections (access rules, audit rules, owner, primary group) of the security descriptor to set.":"安全描述符的部分（访问规则，审计规则，所有者，主要组）要设置。","One of the enumeration values that specifies the block cipher mode to use for encryption. The default is ":"指定用于加密的块密码模式的枚举值之一。 默认值为","An XML string containing the parameters of the OAEP key exchange operation.":"一个包含OAEP密钥交换操作参数的XML字符串。",") of this class.":"）。","One of the enumeration values that specifies the type of padding to apply. The default is ":"指定要应用的填充类型的枚举值之一。 默认值为","The SDDL string from which to set the security descriptor.":"从中设置安全描述符的SDDL字符串。"," algorithm that holds the public key.":"具有公共密钥的算法。","The curve to use for key generation.":"用于密钥生成的曲线。","The key exchange data within which the secret information is hidden.":"隐藏秘密信息的关键交换数据。","The type of the securable object associated with this ":"与此关联的可靠对象的类型","The parameter value.":"参数值。","The parameters representing the key to use.":"代表要使用的密钥的参数。","The secret information derived from the key exchange data.":"从关键交换数据得出的秘密信息。"," if the access rules associated with this ":"如果访问规则与此相关联","The instance of a random number generator algorithm to use.":"要使用的随机数生成器算法的实例。","The name of an ECDSA implementation. The following strings all refer to the same implementation, which is the only implementation currently supported in the .NET Framework:  \n  \n- \"ECDsa\"  \n  \n- \"ECDsaCng\"  \n  \n- \"System.Security.Cryptography.ECDsaCng\"  \n  \n You can also provide the name of a custom ECDSA implementation.":"ECDSA实施的名称。 以下字符串全部涉及相同的实现，这是.NET框架中当前支持的唯一实现： \n  \n  - “ ECDA” \n  \n  - “ ecdsacng” \n  \n  - “ system.security.cryptography.ecdasacng” \n  \n  您还可以提供自定义ECDSA实施的名称。","The instance of the implementation of ":"实施实例","A new instance of the specified implementation of this class. If the specified algorithm name does not map to an ECDSA implementation, this method returns ":"此类指定实现的新实例。 如果指定的算法名称未映射到ECDSA实现，则此方法返回","An XML string containing the parameters of the PKCS #1 key exchange operation.":"一个包含PKCS＃1键交换操作参数的XML字符串。"," object have been modified; otherwise, ":" 对象已被修改；否则, "," that holds the private key.":"那是私钥。","The parameters representing the point on the curve for this key, using the explicit curve format.":"使用显式曲线格式，代表该键曲线上的点的参数。","The digital signature for ":"数字签名","The type of the object associated with the access rules of this ":"与访问规则关联的对象的类型","A string in XML format containing the parameters of the asymmetric key exchange operation.":"XML格式的字符串，其中包含非对称键交换操作的参数。","The padding mode (either ":"填充模式（要么"," if the access rules are in canonical order; otherwise, ":"如果访问规则按规范顺序进行； 否则，","The parameters representing the point on the curve for this key.":"代表此键曲线上点的参数。",") of this instance.":"）。","An object that uses the ":"使用的对象"," if the DACL is protected; otherwise, ":" 如果DACL被保护；否则, ","The secret information to be passed in the key exchange.":"密钥交换中要传递的秘密信息。","The curve to use to generate the key.":"用于生成密钥的曲线。"," padding mode.":"填充模式。"," if the audit rules are in canonical order; otherwise, ":"如果审计规则按规范顺序进行； 否则，"," to be hashed.":"被哈希。"," padding mode with the number of salt bytes equal to the size of the hash.":"填充模式的盐数量等于哈希的大小。"," if the SACL is protected; otherwise, ":"如果SACL受到保护； 否则，","The curve parameters.":"的曲线参数。","The encrypted key exchange data to be sent to the intended recipient.":"将发送给预期收件人的加密密钥交换数据。"," using the specified implementation.":"使用指定的实现。"," if the audit rules associated with this ":"如果审核规则与此相关联","This parameter is not used in the current version.":"此参数在当前版本中不使用。",". On the .NET Framework, this method creates an instance of the ":"。 在.NET框架上，此方法创建了一个实例","The ECDSA signature for the specified data.":"指定数据的ECDSA签名。","The type of the object associated with the audit rules of this ":"与此的审核规则关联的对象的类型"," that holds the public key.":"这是公共钥匙。"," class if FIPS mode is not active; if FIPS mode is active, it creates an instance of the ":"类，如果FIPS模式不活跃； 如果FIPS模式处于活动状态，它将创建一个实例","The hash value of the data that is being signed.":"正在签名的数据的哈希值。","The name of the hash algorithm to use for verifying the signature.":"用于验证签名的哈希算法的名称。"," if the group associated with the securable object has been modified; otherwise, ":"如果已修改了与可靠对象关联的组； 否则，"," class. On .NET Core, it returns an instance of a private class derived from ":"班级。 在.NET核心上，它返回了从"," if the owner of the securable object has been modified; otherwise, ":"如果已修改了可靠对象的所有者； 否则，","A digital signature for the specified hash value.":"指定哈希值的数字签名。","The instance of an implementation of ":"实施的实例"," from which to get the algorithms for the signature description.":"从中获得签名描述的算法。","The byte span to receive the ECPrivateKey data.":"接收EcprivateKey数据的字节跨度。","The security descriptor for this instance.":"此实例的安全描述符。","The data signed with ":"与","Indicates when to stop tracking the object. If ":"指示何时停止跟踪对象。 如果","The key to use in the ":"在","The buffer to receive the hash value.":"接收哈希值的缓冲区。","The type of resource.":"资源的类型。","When this method returns, the total number of bytes written into ":"当此方法返回时，将字节的总数写入",", the object is tracked after finalization; if ":"，最终确定后对象进行跟踪； 如果","The signature to be verified for ":"要验证的签名","A handle.":"一个手柄。","The deformatter algorithm for the signature description.":"签名描述的变形算法。"," is not long enough to receive the hash value.":"不足以获得哈希值。","The digest algorithm for the signature description.":"签名描述的消化算法。"," matches the signature computed using the specified hash algorithm and key on ":"匹配使用指定的哈希算法计算的签名和键",", the object is only tracked until finalization.":"，对象只被跟踪直到最终确定。","The sections to include.":"包括的部分。","The algorithm to use to hash the data for signing.":"用于哈希数据签名的算法。","The formatter algorithm for the signature description.":"签名描述的格式算法。","Represents a user account.":"代表一个用户帐户。","An object that holds all the data needed to serialize or deserialize the current ":"保存序列化或应对当前所需的所有数据的对象","The hash algorithm to use to verify the signature.":"用于验证签名的哈希算法。"," is not long enough to receive the signature.":"不足以接收签名。","The key algorithm for the signature description.":"签名描述的关键算法。","The access type.":"访问类型。","The signature to be verified.":"要验证的签名。"," if the signature is valid; otherwise, ":"如果签名有效； 否则，","(Reserved) Describes the source and destination of the serialized stream specified by ":"（保留）描述了由","The pre-existing handle to use. Using ":"预先使用的手柄。 使用","Specifies how to propagate access masks to child objects.":"指定如何传播访问对子对象的访问掩码。"," if the signature is valid for the hash; otherwise, ":"如果签名对哈希有效； 否则，","The hash value of the data to be verified.":"要验证的数据的哈希值。","Specifies how to propagate Access Control Entries (ACEs) to child objects.":"指定如何将访问控制条目（ACE）传播到子对象。"," if the object referenced by the current ":"如果当前引用的对象","The data to be signed.":"要签名的数据。"," returns an invalid handle.":"返回无效的手柄。","The digital signature of the data to be verified against the hash value.":"数据的数字签名将根据哈希值进行验证。","Specifies whether access is allowed or denied.":"指定允许还是拒绝访问。"," object has not been garbage collected and is still accessible; otherwise, ":"物体尚未收集垃圾，仍然可以使用； 否则，","The string \"ECDsa\".":"字符串“ ECDSA”。","The parent handle of this ":"父母的手柄","The digital signature for the ":"数字签名"," object has been garbage collected; otherwise, a reference to the object referenced by the current ":"物体已被收集到垃圾； 否则，对当前引用的对象的引用","Represents a new access control rule for the specified user, with the specified access rights, access control, and flags.":"代表指定用户的新访问控制规则，并带有指定的访问权限，访问控制和标志。"," if the handle is released successfully; otherwise, ":"如果手柄成功释放； 否则，","The hash algorithm used for HMAC operations.":"用于HMAC操作的哈希算法。","The hash algorithm to use to create the signature.":"用于创建签名的哈希算法。","The name of the key.":"钥匙的名称。"," if the object the current ":"如果对象电流","The signature for the specified hash value.":"指定的哈希值的签名。","The input keying material.":"输入键盘材料。","The rule to add.":"要添加的规则。","The KSP that contains the key.":"包含密钥的KSP。"," object refers to is tracked after finalization; or ":"对象是指结束后跟踪； 或者","The name of the hash algorithm to use for creating the signature.":"用于创建签名的哈希算法的名称。","The length of the output keying material.":"输出键合材料的长度。","Describes the type of auditing to perform.":"描述要执行的审计类型。"," if the object is only tracked until finalization.":"如果仅跟踪对象直到完成为止。","A bitwise combination of the enumeration values that specify options for opening the key, such as where the key is opened from (machine or user storage) and whether to suppress UI prompting.":"枚举值的位组合，该值指定了打开键的选项，例如从（机器或用户存储）打开键的位置以及是否抑制UI提示。"," to use to create the signature.":"用于创建签名。","A symmetric AES decryptor object.":"对称AES解密对象。","The optional salt value (a non-secret random value). If not provided, it defaults to a byte array of the same length as the output of the specified hash algorithm.":"可选的盐值（非代理随机值）。 如果未提供，则默认为与指定哈希算法的输出相同长度的字节数组。","The algorithm to map to.":"要映射到的算法。","The specified audit rule for the specified user.":"指定用户的指定审核规则。","The object to reference, or ":"引用的对象，或","The optional context and application specific information.":"可选的上下文和应用程序特定信息。","The secret key to use for the AES algorithm. The key size must be 128, 192, or 256 bits.":"用于AES算法的秘密键。 关键大小必须为128、192或256位。","The handle of the securable object with which this ObjectSecurity`1 object is associated.":"与此对象苏格利式对象关联的可靠对象的句柄。"," to track the object after finalization; ":"在最终确定后跟踪对象；","An array of names to map to the algorithm.":"一系列名称映射到算法。","The output keying material.":"输出键合材料。","The name of the securable object with which this ObjectSecurity`1 object is associated.":"与此对象苏格利式对象相关的可靠对象的名称是关联的。","The object identifier (OID) to map to.":"对象标识符（OID）要映射到。","The initialization vector to use for the AES algorithm.":"用于AES算法的初始化向量。"," to track the object only until finalization.":" 只跟踪对象直到最终确定。","The output buffer that represents output keying material.":"表示输出键控材料的输出缓冲器。","A symmetric AES encryptor object.":"对称AES eNcryptor对象。","An array of names to map to the OID.":"一系列名称映射到OID。","An object that holds all the data necessary to serialize or deserialize the current ":"一个对象，该对象保留了序列化或应对当前的所有必要数据","The rule to remove.":"删除的规则。","The salt value (a non-secret random value).":"盐值（非秘密随机值）。","The key for the ":"关键","The simple name of the cryptographic object of which to create an instance.":"加密对象的简单名称，其创建实例。","The location where serialized data is stored and retrieved.":"串行数据存储和检索的位置。"," if the object was removed; otherwise, ":"如果对象被删除； 否则，","The context and application specific information (can be an empty span).":"上下文和应用程序特定信息（可以是空跨度）。","A new instance of the specified cryptographic object.":"指定的加密对象的新实例。","The size, in bits, of the secret key used by the ":"大小，位于秘密密钥的大小","The new target object.":"新目标对象。","The type of the securable object associated with the current instance.":"与当前实例关联的可靠对象的类型。","The pseudorandom key that is at least as long as the output byte array of the specified hash algorithm (usually the output from the Extract step).":"至少与指定哈希算法的输出字节阵列（通常是从提取器步骤的输出）相比，其伪随机键。","The name of the algorithm to initialize.":"初始化算法的名称。","The arguments used to create the specified cryptographic object.":"用于创建指定加密对象的参数。","When this method returns, contains the target object, if it is available. This parameter is treated as uninitialized.":"当此方法返回时，如果可用，则包含目标对象。 该参数被视为非初始化。","The Type of the object associated with the access rules of the current instance.":"与当前实例的访问规则关联的对象的类型。","The pseudorandom key that is at least as long as as the output byte array of the specified hash algorithm (usually the output from the Extract step).":"伪随机密钥至少高于指定的哈希算法的输出字节阵列（通常是从提取器步骤中的输出）。","An object to be compared to the current ":"比较当前的对象","The Type object associated with the audit rules of the current instance.":"与当前实例的审核规则关联的类型对象。","The OID to encode.":"编码的OID。"," that specifies the same algorithm as the current object; otherwise, ":"该指定与当前对象相同的算法； 否则，","The destination buffer to receive the output keying material.":"目标缓冲区以接收输出键合材料。"," if the target was retrieved; otherwise, ":"如果检索目标； 否则，","The privilege that is not enabled.":"未启用的特权。"," parameter specifies the same algorithm as the current object; otherwise, ":"参数指定与当前对象相同的算法； 否则，","A byte array containing the encoded OID.":"包含编码OID的字节阵列。","The identity to which the access rule applies. This parameter must be an object that can be cast as a ":"访问规则适用的身份。 该参数必须是一个可以施放为一个的对象","The optional salt value (a non-secret random value). If not provided it defaults to a byte array of the same length as the output of the specified hash algorithm.":"可选的盐值（非秘密随机值）。 如果未提供，则默认为与指定哈希算法输出相同长度的字节数组。","The name of the privilege that the method failed to enable.":"该方法无法启用的特权名称。","The inheritance properties of the access rule.":"访问规则的继承属性。","The simple name of the algorithm for which to get the OID.":"要获得OID的算法的简单名称。","The hash value of the embedded algorithm name.":"嵌入式算法名称的哈希值。","The pseudorandom key (prk).":"的伪随机密钥(prk)。","Whether inherited access rules are automatically propagated. The propagation flags are ignored if ":"继承的访问规则是否会自动传播。 如果","The OID of the specified algorithm.":"指定算法的OID。","An object that specifies an algorithm name.":"指定算法名称的对象。","An array of byte values that represents the opaque callback data associated with this ":"一个字节值数组，表示与此关联的不透明回调数据 ","The valid access control type.":"有效的访问控制类型。","The destination buffer to receive the pseudorandom key (prk).":"接收伪随机密钥（PRK）的目标缓冲区。"," to enforce the policy; otherwise, ":"执行该政策； 否则，","A second object, to be compared to the object that is identified by the ":"第二个对象，将其与由该对象进行比较","A value that specifies whether the ACE allows access, denies access, causes system audits, or causes system alarms.":"指定ACE是否允许访问，拒绝访问，引起系统审核或引起系统警报的值。"," value associated with this ":"与此相关的价值","The number of pseudo-random key bytes to generate.":"要生成的伪随机键字节的数量。"," object contains callback data; otherwise, false.":"对象包含回调数据； 否则，错误。","The number of bytes written to the ":"写入的字节数","The identity to which the access rule applies.":"访问规则适用的身份。"," if the two objects specify the same algorithm name; otherwise, ":"如果两个对象指定相同的算法名称； 否则，","A byte array filled with pseudo-random key bytes.":"一个包含伪随机键字节的字节阵列。","The rights of the access rule.":"访问规则的权利。","The revision level of the new Access Control List (ACL).":"新访问控制列表（ACL）的修订级别。"," buffer.":"缓冲。","A cryptographic object.":"一个加密对象。","An array of byte values that represent an Access Control List (ACL).":"代表访问控制列表（ACL）的字节值数组。"," if the two objects do not specify the same algorithm name; otherwise, ":"如果两个对象未指定相同的算法名称； 否则，","The rights, cast as type <T>, of the current instance.":"当前实例的权利，以类型<t>的形式。","The embedded algorithm name.":"嵌入式算法名称。"," parameter at which to begin unmarshaling data.":"开始删除数据的参数。","The secret key for ":"秘密钥匙","The name of the specific implementation of ":"特定实现的名称","The current element in the ":"当前元素","The position at which to add the new ACE. Specify the value of the ":"添加新王牌的位置。 指定值"," encryption. The key can be any length, but if it is more than 64 bytes long it will be hashed (using SHA-1) to derive a 64-byte key. Therefore, the recommended size of the secret key is 64 bytes.":"加密。 键可以是任何长度，但是如果它长64个字节，则将被哈希（使用SHA-1）衍生为64字节键。 因此，秘密键的建议大小为64个字节。","An object that specifies an ECDH key exchange algorithm whose curve is described via a key property.":"指定通过键属性描述其曲线的ECDH密钥交换算法的对象。","The secret key to test for semi-weakness.":"测试半湿度的秘密钥匙。","The identity to which the audit rule applies. It must be an object that can be cast as a ":"审计规则适用的身份。 它必须是一个可以施放为一个的对象"," property to insert an ACE at the end of the ":"财产以插入王牌在","The input to compute the HMAC for.":"计算HMAC的输入。"," if the key is semi-weak; otherwise, ":"如果钥匙是半湿的； 否则，"," to inherit this rule from a parent container.":"从父容器继承此规则。","An object that specifies an ECDH algorithm that uses the P-256 curve.":"指定使用P-256曲线的ECDH算法的对象。","The offset into the byte array from which to begin using data.":"从该字节数组开始使用数据的偏移量。","The ACE to insert.":"要插入的王牌。","The secret key to test for weakness.":"测试弱点的秘密钥匙。","An object that specifies an ECDH algorithm that uses the P-384 curve.":"指定使用P-384曲线的ECDH算法的对象。","The zero-based index of the ACE to remove.":"ACE的基于零的索引要删除。","The inheritance properties of the audit rule.":"审核规则的继承属性。","The number of bytes in the byte array to use as data.":"字节数组中的字节数用于数据。","An object that specifies an ECDH algorithm that uses the P-521 curve.":"指定使用P-521曲线的ECDH算法的对象。"," if the key is weak; otherwise, ":"如果钥匙很弱； 否则，","The HMAC key.":"HMAC键。","The zero-based index of the ACE to get or set.":"ACE的基于零的索引要获得或设置。","Whether inherited audit rules are automatically propagated. The propagation flags are ignored if ":"继承的审计规则是否会自动传播。 如果","The secret key for the ":"秘密钥匙","An object that specifies an ECDSA whose curve is described via a key property.":"指定通过关键属性描述其曲线的ECDA的对象。","The conditions for which the rule is audited.":"规则审核的条件。","The data to HMAC.":"数据到HMAC。","The ACE at the specified index.":"指定索引处的王牌。","An object that specifies an ECDSA algorithm that uses the P-256 curve.":"指定使用P-256曲线的ECDSA算法的对象。","The HMAC of the data.":"数据的HMAC。","A bitwise combination of the enumeration values. This combination specifies the audit conditions for this audit rule.":"枚举值的比重组合。 此组合指定了此审核规则的审计条件。"," algorithm.":"算法。","The offset in the  ":"偏移","An object that specifies an ECDSA algorithm that uses the P-384 curve.":"指定使用P-384曲线的ECDSA算法的对象。","A cryptographic object used to perform the asymmetric algorithm.":"用于执行不对称算法的加密对象。","The identity to which this audit rule applies.":"该审核规则适用的身份。","The buffer to receive the HMAC value.":"接收HMAC值的缓冲器。","An object that specifies an ECDSA algorithm that uses the P-521 curve.":"指定使用P-521曲线的ECDSA算法的对象。","The key size, in bits.":"关键大小，位。","A byte value that represents the resource manager control bits associated with this ":"表示与此相关联的资源管理器控制位的字节值 ","The rights of the audit rule.":"审计规则的权利。","The total number of bytes written to ":"写入的字节总数","An object that specifies the MD5 algorithm.":"指定MD5算法的对象。","The identity to which the audit rule applies.":"审计规则适用的身份。","A new ephemeral DSA key with the specified key size.":"具有指定键大小的新临时DSA键。","Whether inherited audit rules are automatically propagated.":"继承的审计规则是否自动传播。","The type of audit rule to add.":"要添加的审核规则的类型。","The computed HMAC value in a byte array.":"字节阵列中计算的HMAC值。"," for which to add an audit rule.":"为此添加审核规则。","An object that specifies the RSA algorithm.":"指定RSA算法的对象。","The parameters for the ":"的参数","The properties of the audit rule.":"审计规则的属性。","When this method returns, contains the total number of bytes written into ":"当此方法返回时，包含写入的字节总数","A new ephemeral DSA key.":"新的短暂DSA键。","The access mask for the new audit rule.":"新审核规则的访问掩码。","An object that specifies the SHA-1 algorithm.":"指定SHA-1算法的对象。"," is too small to hold the calculated hash, ":"太小了，无法容纳计算的哈希，","The access mask for this rule.":"此规则的访问掩码。","Flags that specify the inheritance properties of the new audit rule.":"标志着指定新审计规则的继承属性的标志。","An object that specifies the SHA-256 algorithm.":"指定SHA-256算法的对象。"," to which this rule applies.":"该规则适用的。","An object that specifies the SHA-384 algorithm.":"指定SHA-384算法的对象。"," is long enough to receive the HMAC value; otherwise, ":" 是否足够长以接收HMAC值；否则, ","Flags that specify the inheritance propagation properties for the new audit rule.":"标记为新审核规则指定继承传播属性的标志。","An object that specifies the SHA-512 algorithm.":"指定SHA-512算法的对象。","The key to use in the HMAC calculation.":"在HMAC计算中使用的关键。"," if this rule is not explicitly set but is instead inherited from a parent container.":"如果此规则未明确设置，而是从父容器继承。","An array to which to copy the contents of the collection.":"复制集合内容的数组。"," for the new audit rule.":" 为新的审核规则。","The name of the algorithm group to initialize.":"算法组的名称要初始化。"," encryption. The key can be any length, but if it is more than 64 bytes long it is hashed (using SHA-1) to derive a 64-byte key. Therefore, the recommended size of the secret key is 64 bytes.":"加密。 钥匙可以是任何长度，但是如果它长度超过64个字节，则将其悬浮（使用sha-1）来得出64个字节键。 因此，秘密键的建议大小为64个字节。","The zero-based index from which to begin copying.":"基于零的索引开始复制。"," that specifies the same algorithm group as the current object; otherwise, ":"该指定与当前对象相同的算法组； 否则，"," encryption. The key can be any length, but if it is more than 64 bytes long, it is hashed (using SHA-1) to derive a 64-byte key. Therefore, the recommended size of the secret key is 64 bytes.":"加密。 钥匙可以是任何长度，但是如果它长64个字节，则将其哈希（使用SHA-1）衍生为64字节键。 因此，秘密键的建议大小为64个字节。","The type of audit rule to remove.":"要删除的审计规则的类型。"," object to get.":"要获得的对象。"," parameter specifies the same algorithm group as the current object; otherwise, ":"参数指定与当前对象相同的算法组； 否则，"," for which to remove an audit rule.":"为此删除审计规则。"," to use the managed implementation of the SHA1 algorithm (the ":"使用SHA1算法的托管实现（","Flags that specify information about the inheritance, inheritance propagation, and auditing conditions for the new access control entry (ACE).":"标志着指定有关新访问控制条目（ACE）的继承，继承传播和审核条件的信息。","The hash value of the embedded algorithm group name.":"嵌入式算法组名称的哈希值。"," class); ":"班级）;"," if this method successfully removes the specified audit rule; otherwise, ":"如果此方法成功删除了指定的审核规则； 否则，","The use of the new ACE.":"新王牌的使用。","An object that specifies an algorithm group.":"指定算法组的对象。"," to use the unmanaged implementation (the ":"使用非托管实现（","The identity of the class of objects to which the removed audit control rule applies.":"删除审计控制规则的对象类的身份。","The access mask for the ACE.":"ACE的访问面具。"," if the two objects specify the same algorithm group; otherwise, ":"如果两个对象指定相同的算法组； 否则，"," class).":"班级）。","The identity of the class of child objects which can inherit the removed audit rule.":"可以继承删除的审核规则的子对象类的标识。"," associated with the new ACE.":"与新王牌相关联。"," if the two objects do not specify the same algorithm group; otherwise, ":"如果两个对象未指定相同的算法组； 否则，"," to release both managed and unmanaged resources; false to release only unmanaged resources.":"释放托管和不受管理的资源； 错误以仅发布非管理资源。"," for the rule to be removed.":"为了删除规则。","The input data.":"输入数据。","The embedded algorithm group name.":"嵌入式算法组名称。"," to specify that the new ACE is a callback type ACE.":"指定新ACE是回调类型ACE。","The audit condition to set.":"要设置的审核条件。","An object that specifies the Diffie-Hellman family of algorithms.":"一个指定算法的差异家族的对象。","The key to use in the hash algorithm.":"在哈希算法中使用的关键。","Opaque data associated with the new ACE. Opaque data is allowed only for callback ACE types. The length of this array must not be greater than the return value of the ":"与新ACE相关的不透明数据。 不透明数据仅用于回调ACE类型。 此数组的长度不得大于"," for which to set an audit rule.":"为此设置审核规则。","An object that specifies the DSA family of algorithms.":"指定DSA算法家族的对象。"," encryption. The key can be any length. However, the recommended size is 64 bytes. If the key is more than 64 bytes long, it is hashed (using SHA-256) to derive a 64-byte key. If it is less than 64 bytes long, it is padded to 64 bytes.":"加密。 钥匙可以是任何长度。 但是，建议的大小为64个字节。 如果键长度超过64个字节，则将其哈希（使用SHA-256）伸出来得出64个字节键。 如果它长于64个字节，则将其填充到64个字节。","The byte array into which the contents of the ":"字节阵列中的内容"," encryption. The key can be any length. However, the recommended size is 128 bytes. If the key is more than 128 bytes long, it is hashed (using SHA-384) to derive a 128-byte key. If it is less than 128 bytes long, it is padded to 128 bytes.":"加密。 钥匙可以是任何长度。 但是，建议的尺寸为128个字节。 如果键长度超过128个字节，则将其哈希（使用SHA-384）伸出来得出128字节键。 如果它长于128个字节，则将其填充到128个字节。","The host evidence from which to create the new instance.":"创建新实例的主机证据。","An object that specifies the ECDH family of algorithms.":"指定ECDH算法家族的对象。"," object is marshaled.":"物体被填写。"," to enable .NET Framework 2.0 Service Pack 1 applications to interact with .NET Framework 2.0 applications; otherwise, ":"启用.NET Framework 2.0 Service Pack 1应用程序以与.NET Framework 2.0应用程序交互； 否则，","The assembly evidence from which to create the new instance.":"从中创建新实例的组装证据。","An object that specifies the ECDSA family of algorithms.":"指定ECDSA算法家族的对象。","The offset at which to start marshaling.":"开始封送处理的偏移量。"," encryption. The key can be any length. However, the recommended size is 128 bytes. If the key is more than 128 bytes long, it is hashed (using SHA-512) to derive a 128-byte key. If it is less than 128 bytes long, it is padded to 128 bytes.":"加密。 钥匙可以是任何长度。 但是，建议的尺寸为128个字节。 如果键长度超过128个字节，则将其哈希（使用SHA-512）伸出来得出128字节键。 如果它长于128个字节，则将其填充到128个字节。"," instance from which to create the new instance. This instance is not deep-copied.":"创建新实例的实例。 此实例没有被深入。","An object that specifies the RSA family of algorithms.":"指定RSA算法家族的对象。","The data to process.":"要处理的数据。"," to specify that the ":"指定","Any evidence object.":"任何证据对象。","The algorithm that the key will be used with.":"将使用键的算法。","The number of bytes to use from ":"从中使用的字节数"," object is a callback ACE type.":"对象是回调ACE类型。","An ephemeral key.":"短暂的钥匙。","The assembly evidence to add.":"大会证据要添加。","The name of the hash algorithm to perform.":"哈希算法的名称要执行。","The allowed length of an opaque data BLOB.":"不透明数据斑点的允许长度。","The host evidence to add.":"主机证据要添加。","The key name. If a name is not provided, the key will not be persisted.":"关键名称。 如果未提供名称，则不会持续键。"," instance ready to compute the hash algorithm specified by ":"实例准备计算指定的哈希算法","A duplicate copy of this evidence object.":"该证据对象的重复副本。","A persisted or ephemeral key that provides the specified algorithm.":"提供指定算法的持续或短暂键。","The name of the hash algorithm to perform within the HMAC.":"HASH算法的名称在HMAC中执行。","The length, in bytes, of the binary representation of the current ":"电流的二进制表示的长度，字节","An object that specifies advanced parameters for the method, including the ":"指定该方法的高级参数的对象，包括","The target array to which to copy evidence objects.":"要复制证据对象的目标阵列。"," is marshaled.":"被安排了。","The key name.":"关键名称。","The zero-based position in the array to which to begin copying evidence objects.":"在数组中基于零的位置开始复制证据对象。","The secret key for the HMAC. The key can be of any length, but a key longer than the output size of the specified hash algorithm will be hashed to derive a correctly-sized key. Therefore, the recommended size of the secret key is the output size of the specified hash algorithm.":"HMAC的秘密钥匙。 键可以具有任何长度，但是将键比指定的哈希算法的输出大小更长，以得出正确尺寸的键。 因此，秘密密钥的建议大小是指定的哈希算法的输出大小。"," object to check for.":"对象要检查。"," if the named key exists in the default KSP; otherwise, ":"如果默认ksp中存在命名键； 否则，"," class ready to compute the specified hash algorithm.":"类准备计算指定的哈希算法。","An enumerator for evidence added by the ":"枚举者，以添加证据","The number of ACEs in the current ":"电流中的ACE数量","The KSP to check for the key.":"KSP检查钥匙。"," if the ACEs in the current ":"如果电流中的ace","The secret key for the HMAC. The key can be any length, but a key longer than the output size of the hash algorithm specified by ":"HMAC的秘密钥匙。 键可以是任何长度，但密钥比由哈希算法的输出大小长。","Evidence of type ":"类型的证据"," in the assembly evidence collection.":"在集会证据收集中。"," if the named key exists in the specified provider; otherwise, ":"如果指定的提供商中存在命名密钥； 否则，"," object are in canonical order; otherwise, ":"对象按规范顺序； 否则，"," will be hashed (using the algorithm specified by ":"将进行哈希（使用由","An enumerator for evidence added by both the ":"枚举者以添加的证据",") to derive a correctly-sized key. Therefore, the recommended size of the secret key is the output size of the hash specified by ":"）得出正确尺寸的键。 因此，秘密密钥的建议大小是指定的哈希的输出大小","The KSP to search for the key.":"KSP搜索密钥。"," object is a container.":"对象是一个容器。","A hash instance to compute the hash algorithm specified by ":"一个哈希实例来计算由"," object is a directory object ACL.":"对象是目录对象ACL。"," method and the ":"方法和","A bitwise combination of the enumeration values that specify options for opening a key.":"枚举值的位组合，该值指定了打开键的选项。","A byte value that specifies the revision level of the ":"一个字节值指定了修订级别的修订级","The computed hash or HMAC.":"计算的哈希或HMAC。"," in the host evidence collection.":"在主机证据收集中。","An object that specifies the format of the key BLOB.":"指定密钥斑点格式的对象。"," if the new object is a container object.":"如果新对象是容器对象。","The evidence set to be merged into the current evidence set.":"证据将合并为当前的证据集。","The buffer to receive the hash or HMAC value.":"接收哈希或HMAC值的缓冲区。","A BLOB that contains the key material in the specified format.":"包含指定格式的关键材料的斑点。","Specifies whether the security identifier for which to retrieve access rules is of type ":"指定是否要检索访问规则的安全标识符是类型","The type of the evidence to be removed.":"要删除的证据类型。","The name of the desired property.":"所需属性的名称。"," is long enough to receive the hash or HMAC value; otherwise, ":"足够长的时间获得了哈希族或HMAC值； 否则，"," or type ":"或类型","The number of evidence objects in the evidence set.":"证据集中的证据对象数量。","The buffer to receive the hash or Hash-Based Message Authentication Code (HMAC) value.":"接收基于哈希或哈希的消息身份验证代码（HMAC）值的缓冲区。","A bitwise combination of the enumeration values that specify options for the named property.":"枚举值的位组合，该值指定了指定属性的选项。",". The value of this parameter must be a type that can be translated to  the ":"。 此参数的值必须是可以翻译成的类型",", because read-only evidence sets are not supported.":"，因为不支持仅阅读证据集。","An object that contains the raw value of the specified property.":"包含指定属性的原始值的对象。","The name of the algorithm being performed.":"执行算法的名称。","The output size of this hash or HMAC algorithm, in bytes.":"该哈希或HMAC算法的输出大小在字节中。"," because thread-safe evidence sets are not supported.":"因为不支持线程安全证据集。"," if the new security descriptor is associated with a container object.":"如果新的安全描述符与容器对象关联。","The property name to check.":"要检查的属性名称。"," if the evidence is locked; otherwise, ":"如果证据被锁定； 否则，","The random seed to use to compute the mask.":"用于计算口罩的随机种子。"," if the new security descriptor is associated with a directory object.":"如果新的安全描述符与目录对象关联。"," if the specified property is found; otherwise, ":"如果找到指定的属性； 否则，"," in Visual Basic), because synchronization of evidence sets is not supported.":"在Visual Basic中），因为不支持证据集的同步。","An array that contains the key information.":"包含关键信息的数组。","The array of byte values from which to create the new ":"从中创建新的字节值数组","The length of the generated mask in bytes.":"字节中生成的蒙版的长度。"," pointing to a ":"指向","The offset in the ":"偏移","An object that specifies the format of the ":"指定格式的对象","A randomly generated mask whose length is equal to the ":"一个随机生成的面具，其长度等于"," array at which to begin copying.":"开始复制的数组。","The binary reader.":"二进制读者。","A new key.":"一个新钥匙。"," hash algorithm.":"哈希算法。","The subject that this claim describes.":"该主张描述的主题。","Flags that specify behavior of the new ":"指定新行为的标志","A new instance of the specified implementation of ":"指定实现的新实例","The KSP.":"KSP。","The security claim.":"安全要求。","The owner for the new ":"新的主人","The data to hash.":"哈希的数据。","The claim type.":"索赔类型。","A handle to an existing key.":"现有密钥的手柄。","The primary group for the new ":"新的主要小组","The hash of the data.":"数据哈希。","The System Access Control List (SACL) for the new ":"新的系统访问控制列表（SACL）","The claim value.":"索赔价值。","The random seed to use for computing the mask.":"用于计算掩模的随机种子。"," represents an ephemeral key or a named key.":"代表短暂的键或命名键。","An existing key.":"现有键。","The claim value type. If this parameter is ":"索赔价值类型。 如果此参数为","The Discretionary Access Control List (DACL) for the new ":"新的委托访问控制列表（DACL）","The name of the type that implements the hash algorithm to use for computing the mask.":"实现用于计算掩码的哈希算法的类型的名称。"," object from which to create the new ":"从中创建新的对象","The claim issuer. If this parameter is empty or ":"索赔发行人。 如果此参数为空或","A new instance of a cryptographic random number generator.":"加密随机数生成器的新实例。","The key property to set.":"要设置的关键属性。","The name of the random number generator implementation to use.":"随机数生成器实现的名称。","The SDDL string from which to create the new ":"从中创建新的SDDL字符串","The original issuer of the claim. If this parameter is empty or ":"索赔的原始发行人。 如果此参数为空或"," property is set to the value of the ":"属性设置为","The span to fill with cryptographically strong random bytes.":"用密码强的随机字节填充的跨度。","An object that specifies the name of an encryption algorithm.":"指定加密算法名称的对象。","The revision level of the new ":"新的修订级","An object that specifies the name of an encryption algorithm group.":"指定加密算法组名称的对象。","The new claim object.":"新的索赔对象。","The array to fill with cryptographically strong random bytes.":"用密码强的随机字节填充的阵列。","The number of Access Control Entries (ACEs) this ":"访问控制条目（ACE）的数量","The intended subject of the new claim.":"新主张的预期主题。","An object that specifies the export policy for the key.":"指定密钥的导出策略的对象。","The index of the array to start the fill operation.":"数组的索引开始填充操作。"," object can contain. This number is to be used only as a hint.":"对象可以包含。 此数字仅作为提示。","The writer to use for data storage.":"用于数据存储的作者。","The number of bytes to fill.":"要填充的字节数。"," object can contain. This number should only be used as a hint.":"对象可以包含。 该数字仅应用作提示。","A safe handle that represents the key.":"一个代表钥匙的安全手柄。","The writer to write this claim.":"作者写这一说法。","The number of bytes of random values to create.":"要创建的随机值的字节数。"," if the key is ephemeral; otherwise, ":"如果钥匙是短暂的； 否则，","The security identifier for which to remove access rules.":"为删除访问规则的安全标识符。","The user data to claim.":"要声明的用户数据。","An array populated with cryptographically strong random values.":"一个带有密码强的随机值的阵列。"," if the key is available on a machine-wide basis; ":"如果钥匙在机器范围内可用；","The security identifier for which to remove audit rules.":"为删除审核规则的安全标识符。"," array representing the additional serialized data.":"代表其他序列化数据的数组。","The exclusive upper bound of the random range.":"随机范围的独家上限。"," if the key is only for the current user.":"如果密钥仅适用于当前用户。"," to protect the DACL from inheritance.":"保护DACL免受继承。","A random integer between 0 (inclusive) and ":"0（包含）和","A name that refers to the issuer of the claim.":"指称索赔的发行人的名称。"," to keep inherited access rules in the DACL; ":"在DACL中保留继承的访问规则；","The name of the key. If the key is ephemeral, the value is ":"钥匙的名称。 如果密钥是短暂的，则值为"," (exclusive).":"（独家的）。","A name that refers to the original issuer of the claim.":"指称索赔的原始发行人的名称。","The key size in bits.":"位的关键大小。"," to remove inherited access rules from the DACL.":"从DACL删除继承的访问规则。","A dictionary that contains additional properties associated with the claim. The properties are represented as name-value pairs.":"包含与索赔相关的其他属性的字典。 这些属性表示为名称值对。","The inclusive lower bound of the random range.":"随机范围的包含下限。"," to protect the SACL from inheritance.":"保护SACL免受继承。","A random integer between ":"一个随机整数","The subject of the claim.":"索赔的主题。","A bitwise combination of the enumeration values that specify the usages allowed for the key.":"枚举值的位组合，以指定键的用法。"," to keep inherited audit rules in the SACL; ":"在SACL中保留继承的审计规则；","The claim value type.":"索赔价值类型。"," (inclusive) and ":"（包括）和"," to remove inherited audit rules from the SACL.":"从SACL中删除继承的审计规则。","The parent window handle for the key.":"键的父窗口。","The hash value to sign.":"哈希值要签名。","One or more values of the ":"一个或多个值的值","The digital signature for the specified hash value.":"指定哈希值的数字签名。","The encoding format to use for the signature.":"用于签名的编码格式。","The array to fill with cryptographically strong random nonzero bytes.":"用密码强的随机非零字节填充的阵列。","The KSP that manages the key.":"管理钥匙的KSP。"," enumeration combined with a logical OR operation.":"枚举结合逻辑或操作。","The bytes of a PKCS#8 EncryptedPrivateKeyInfo structure in the ASN.1-BER encoding.":"pkcs＃8的字节在asn.1-ber编码中concryptedPrivateKeyInfo结构。","The DSA signature for the specified data.":"指定数据的DSA签名。","A handle to the KSP.":"KSP的手柄。","The span to fill with cryptographically strong random nonzero bytes.":"用密码强的随机非零字节填充的跨度。","The DACL for this ":"为此的DACL"," to include private parameters; otherwise, ":"包括私人参数； 否则，","When this method returns, contains a value that indicates the number of bytes read from ":"当此方法返回时，包含一个指示从中读取的字节数的值","An instance of a cryptographic object.":"加密对象的实例。","An object that contains configuration parameters for displaying the UI.":"包含用于显示UI的配置参数的对象。","The primary group for this ":"主要小组",". This parameter is treated as uninitialized.":"。 该参数被视为非初始化。","The parameters for ":"参数","The password to use for decrypting the key material.":"用于解密关键材料的密码。","The effective key size used by the ":"有效的密钥大小","An alternate name for the key. If the key is ephemeral, the value is ":"密钥的替代名称。 如果密钥是短暂的，则值为"," if the object associated with this ":"如果对象与此关联","The XML string to use to reconstruct the ":"用于重建的XML字符串","The key BLOB format to initialize.":"键blob格式要初始化。","The size of the secret key used by the ":"秘密键的大小"," object is a container object; otherwise, ":"对象是容器对象； 否则，","The PEM text of the encrypted key to import.":"加密键的PEM文本。","The encoding format for a signature.":"签名的编码格式。","The password used to derive the key.":"用于得出密钥的密码。"," if the DACL associated with this ":"如果DACL与此关联","The PEM text of the key to import.":"导入的钥匙的PEM文本。"," object is in canonical order; otherwise, ":"对象处于规范顺序；否则，"," object that specifies the same key BLOB format as the current object; otherwise, ":"指定与当前对象相同的密钥斑点格式的对象； 否则，"," if the SACL associated with this ":"如果SACL与此关联"," object is a directory object; otherwise, ":"对象是目录对象； 否则，","The largest size, in bytes, for a signature produced by this key in the indicated format.":"最大尺寸为字节，用于该键以指示格式产生的签名。","The bytes of a PKCS#8 PrivateKeyInfo structure in the ASN.1-BER encoding.":"ASN.1-BER编码中的PKCS＃8 privateKeyinfo结构的字节。"," parameter specifies the same key BLOB format as the current object; otherwise, ":"参数指定与当前对象相同的键BLOB格式。 否则，"," object. Specify ":"目的。 指定","The owner of the object associated with this ":"与此关联的对象的所有者","Flags that specify the inheritance propagation properties for the rule to be removed.":"指定要删除规则的继承传播属性的标志。","The data to be hashed.":"要进行哈希的数据。","The bytes of an X.509 SubjectPublicKeyInfo structure in the ASN.1-DER encoding.":"ASN.1-der编码中的X.509主题publicKeyInfo结构的字节。","The SACL for this ":"SACL为此"," to create an empty ACL.":"创建一个空的ACL。"," if this method successfully removes the specified access; otherwise, ":"如果此方法成功地删除了指定的访问； 否则，","The index of the first byte in ":"第一个字节的索引","The input data for which to compute the hash.":"用于计算哈希的输入数据。","Contains flags that specify information about the inheritance, inheritance propagation, and auditing conditions for the new Access Control Entry (ACE).":"包含指定有关新访问控制条目（ACE）的继承，继承传播和审核条件的信息。","The type of access control (allow or deny) to add.":"要添加的访问控制类型（允许或拒绝）。","The offset into the array at which to begin using data.":"偏移到开始使用数据的数组中。"," that is to be hashed.":"那应该被哈希。","The type of this ":"这种类型","The access mask for the access control rule to be removed.":"访问控制规则的访问掩码将被删除。"," for which to add an ACE.":"为此添加ACE。","Type of the new Access Control Entry (ACE). This value must be greater than ":"新访问控制条目（ACE）的类型。 该值必须大于","The number of bytes to hash.":"哈希的字节数。","Flags that specify the inheritance properties of the access control rule to be removed.":"指定要删除的访问控制规则的继承属性的标志。","The number of bytes in the array to use as data.":"数组中要用作数据的字节数。","The access rule for the new ACE.":"新王牌的访问规则。","Flags that specify information about the inheritance, inheritance propagation, and auditing conditions for the new ACE.":"标志着指定有关新ACE的继承，继承传播和审计条件的信息。","Flags that specify the inheritance propagation properties for the access control rule to be removed.":"为要删除的访问控制规则指定继承传播属性的标志。","The hash algorithm to use to create the hash value.":"用于创建哈希值的哈希算法。","The algorithm to use to hash the data.":"用于哈希数据的算法。","Flags that specify the inheritance properties of the new ACE.":"指定新ACE的继承属性的标志。","The identity of the class of objects to which the removed access control rule applies.":"删除访问控制规则的对象类别的身份。","The hashed data.":"哈希数据。","An array of byte values that contains the data for the new ACE. This value can be ":"包含新ACE数据的字节值数组。 这个值可以是","The data to sign.":"签名的数据。","Flags that specify the inheritance propagation properties for the new ACE.":"指定新ACE的继承传播属性的标志。","The binary stream to hash.":"二进制流到哈希。",". The length of this array must not be greater than the value of the ":"。 该数组的长度不得大于","The identity of the class of child objects which can inherit the removed access control rule.":"可以继承删除的访问控制规则的子对象类别的身份。","The offset into ":"偏移到","Flags that specify if the ":"标记是否指定是否"," at which to begin hashing.":"开始哈希。","The bytes to use as a password when decrypting the key material.":"解密关键材料时，要用作密码的字节。"," field, and must be a multiple of four.":"字段，必须是四个的倍数。"," for which to remove access.":"为此删除访问。"," parameters contain non-":"参数包含非 - ","An array of byte values that represents the opaque data associated with this ":"代表与此关联的不透明数据的一系列字节值","An XML string encoding of the current ":"当前编码的XML字符串","The input stream for which to compute the hash.":"用于计算哈希的输入流。","The identity of the class of objects to which the new ACE applies.":"新ACE应用的对象类别的身份。"," for which to remove an ACE.":"为此删除ACE。","An array of byte values that represents the opaque callback data for this ":"代表此的不透明回调数据的一系列字节值","The hash to sign.":"哈希签名。","The data to hash and sign.":"哈希和签名的数据。","The identity of the class of child objects which can inherit the new ACE.":"可以继承新王牌的子对象类别的身份。","The length of the opaque callback data.":"不透明回调数据的长度。","The byte span to receive the signature.":"字节跨接收签名。"," is big enough to receive the signature; otherwise, ":"足够大，可以接收签名； 否则，"," for the new access.":"用于新访问。"," if the new ":"如果是新的","When this method returns, contains a value that indicates the number of bytes written to ":"当此方法返回时，包含一个表示字节数的值","The type of access control (allow or deny) to remove.":"访问控制（允许或拒绝）的类型要删除。","The signed data.":"签名的数据。"," object is a directory object Access Control List (ACL).":"对象是目录对象访问控制列表（ACL）。"," is large enough to receive the result; otherwise, ":"足够大以接收结果； 否则，"," for which to remove an access control rule.":"为此删除访问控制规则。"," object for the new ":"新对象","The signature data to be verified.":"要验证的签名数据。","The buffer to receive the signature.":"缓冲区接收签名。","The access mask for the rule to be removed.":"删除规则的访问掩码。"," is large enough to receive the signature; otherwise, ":"足够大，可以接收签名； 否则，","The hash algorithm used to create the hash value of the data.":"哈希算法用于创建数据的哈希值。","Flags that specify the inheritance properties of the rule to be removed.":"指定要删除规则的继承属性的标志。"," if the digital signature is valid; otherwise, ":"如果数字签名有效； 否则，","The bytes to use as a password when encrypting the key material.":"加密关键材料时，要用作密码的字节。","The signature to verify.":"签名验证。","The password-based encryption (PBE) parameters to use when encrypting the key material.":"加密关键材料时要使用的基于密码的加密（PBE）参数。","The byte span to receive the PKCS#8 EncryptedPrivateKeyInfo data.":"接收PKCS＃8 EncryptedPrivateKeyInfo数据的字节跨度。","The hash algorithm used to hash the data for the verification process.":"哈希算法用于哈希数据进行验证过程。"," is big enough to receive the output; otherwise, ":"足够大，可以接收输出； 否则，","The encoding format for ":"编码格式","The password to use when encrypting the key material.":"加密关键材料时使用的密码。","The byte span to receive the PKCS#8 PrivateKeyInfo data.":"接收PKCS＃8 PrivateKeyInfo数据的字节跨度。","The byte span to receive the X.509 SubjectPublicKeyInfo data.":"接收X.509主题PublicKeyInfo数据的字节跨度。","The byte span to receive the hash value.":"接收哈希值的字节跨度。","The name of the hash algorithm to use.":"哈希算法的名称要使用。"," from other ":"从其他地方","The raw data of the certificate as a byte array.":"证书的原始数据作为字节数组。","The KeyValuePair structure representing the property name and value to add to the ":"KeyValuepair结构代表属性名称和值，以添加到","When the method returns, the group whose name is ":"当方法返回时，名称为","A cancellation token that may be used to cancel the ":"取消令牌，可用于取消","The Supplemental Mathematical Operators Unicode block (U+2A00-U+2AFF).":"补充数学运算符Unicode块（U+2A00-U+2AFF）。","The property name of the element to add.":"要添加的元素的属性名称。","An object or array of objects representing the input or output buffer for the operation. Each object represents a buffer, for example an array of bytes.  Can be ":"代表操作的输入或输出缓冲区的对象或对象数组。 每个对象代表一个缓冲区，例如一个字节数组。 可"," to execute.":"执行。",", if it is found; otherwise, ":"，如果找到了； 否则，","An object that holds the bound operating system handle.":"保存界限操作系统手柄的对象。","The Supplemental Punctuation Unicode block (U+2E00-U+2E7F).":"补充标点符号Unicode块（U+2e00-U+2e7f）。"," if not found.":"如果找不到。","An array of actions to execute.":"一系列要执行的动作。","The property name to locate in the ":"要定位的属性名称","The Syloti Nagri Unicode block (U+A800-U+A82F).":"Syloti Nagri Unicode块（U+A800-U+A82F）。"," if a group identified by the provided name key exists; ":"如果存在由提供名称密钥确定的组；"," if the loop ran to completion; otherwise, ":"如果循环运行到完成； 否则，","The action to invoke with each data element received.":"调用每个数据元素的动作。"," contains an element with the specified property name; otherwise, ":"包含带有指定属性名称的元素； 否则，","The number of groups in the collection.":"集合中的组数。","The Syriac Unicode block (U+0700-U+074F).":"叙利亚Unicode块（U+0700-U+074F）。","Returns an integer that represents the lowest iteration from which the Break statement was called.":"返回一个整数，代表了从中调用断裂语句的最低迭代。","The options with which to configure this ":"配置此的选项","The item being offered to the target.":"提供给目标的项目。"," class that contains properties from the specified ":"包含指定属性的类"," if an unhandled exception was thrown; otherwise, ":"如果抛出了未经治疗的例外； 否则，","The Tagalog Unicode block (U+1700-U+171F).":"他加禄语Unicode块（U+1700-U+171F）。","The zero-based index of the collection member to be retrieved.":"要检索的收集成员的基于零的索引。","The property name of the element to remove.":"要删除的元素的属性名称。"," if the item is posted to the dataflow block; otherwise, ":"如果该项目已发布到数据流块； 否则，"," if any iteration has stopped the loop by calling the ":"如果有任何迭代通过调用","The Tagbanwa Unicode block (U+1760-U+177F).":"TAGBANWA UNICODE块（U+1760-U+177F）。"," contains an element with the property name; otherwise, ":"包含带有属性名称的元素； 否则，","The member of the collection specified by ":"由","The Tai Le Unicode block (U+1950-U+197F).":"Tai Le Unicode块（U+1950-U+197F）。","The exception that caused the faulting.":"导致断层的例外。","The lowest iteration from which ":"最低的迭代","The KeyValuePair structure representing the property name and value to remove from the ":"KeyValuepair结构代表属性名称和值，要从","The name of a capturing group.":"捕获小组的名称。","The Tai Tham Unicode block (U+1A20-U+1AAF).":"Tai Tham Unicode块（U+1A20-U+1AAF）。"," was called. In the case of a ":"被称为。 如果是","The header of the message being offered.":"提供的消息的标题。","The property name of the value to get.":"要获得的值的属性名称。","The name keys of the group collection.":"组集合的名称键。"," loop, the value is based on an internally-generated index.":"循环，该值基于内部生成的索引。","The value of the message being offered.":"提供的消息的价值。","The Tai Viet Unicode block (U+AA80-U+AADF).":"领带越野码（U+O-O+ADIFF）。","The zero-based index of the group in the group collection.":"组集合中的组基于零索引。","When this method returns, contains the value associated with the specified property name, if the property name is found; otherwise, ":"当此方法返回时，如果找到属性名称，则包含与指定属性名称关联的值； 否则，","The dataflow block that is offering the message. This may be ":"提供消息的数据流块。 这可能是"," if the current iteration should exit; otherwise, ":"如果当前的迭代应退出； 否则，","The Tamil Unicode block (U+0B82-U+0BFA).":"泰米尔大学Unicode块（U+0B82-U+0BFA）。"," to instruct the target to call ":"指示目标打电话","The JSON value of the property with the specified name.":"带有指定名称的属性的JSON值。","The group in the desired position.":"该小组处于所需位置。","The token that is associated with this instance.":"与此实例关联的令牌。"," synchronously during the call to ":"在打电话期间同步","The Telugu Unicode block (U+0C00-U+0C7F).":"Telugu Unicode块（U+0C00-U+0C7F）。"," if a property with the specified name was found; otherwise, ":"如果找到了指定名称的属性； 否则，","The zero-index position of the group in the group collection.":"组在组集合中的零索引位置。","An integer that represents the maximum degree of parallelism.":"代表最大并行度的整数。","The Thaana Unicode block (U+0780-U+07BF).":"Thaana Unicode块（U+0780-U+07BF）。",", prior to returning ":"，在返回之前","The underlying value of the new ":"新的基本价值","A group enumeration.":"集体枚举。","The task scheduler that is associated with this instance.":"与此实例关联的任务调度程序。","The next regular expression match.":"下一个正则表达式匹配。",", in order to consume the message; otherwise, ":"，为了消耗消息； 否则，","The Thai Unicode block (U+0E00-U+0E7F).":"泰国Unicode块（U+0E00-U+0E7F）。"," class that contains the specified value.":"包含指定值的类。"," object representing the current compressed stack.":"代表当前压缩堆栈的对象。","The Tibetan Unicode block (U+0F00-U+0FFF).":"藏族Unicode块（U+0F00-U+0FFF）。"," for the current thread.":"对于当前线程。","The status of the offered message.  If the message was accepted by the target, ":"提供的消息的状态。 如果消息被目标接受，","The replacement pattern to use.":"使用的替换模式。","The value to create.":"要创建的值。","The Tifinagh Unicode block (U+2D30-U+2D7F).":"Tifinagh Unicode块（U+2D30-U+2D7F）。"," structure representing the destination context of the serialization.":"代表序列化目的地上下文的结构。"," is returned, and the source should no longer use the offered message, because it is now owned by the target. If the message was postponed by the target, ":"返回，源不应再使用所提供的消息，因为它现在归目标。 如果消息是由目标推迟的","The expanded version of the ":"扩展的版本","The Unified Canadian Aboriginal Syllabics Unicode block (U+1400-U+167F).":"统一的加拿大原住民音节Unicode块（U+1400-U+167F）。"," that will be used to serialize the value.":"这将用于序列化值。"," to set.":"设置。"," is returned as a notification that the target may later attempt to consume or reserve the message; in the meantime, the source still owns the message and may offer it to other blocks.  \n  \n If the target would have otherwise postponed message, but source was ":"作为通知返回，即目标稍后可能会尝试消费或保留消息； 同时，源仍然拥有该消息，并可能将其提供给其他块。 \n  \n  如果目标本来可以推迟消息，但是来源是","The Unified Canadian Aboriginal Syllabics Extended Unicode block (U+18B0-U+18FF).":"统一的加拿大原住民音节扩展了Unicode块（U+18B0-U+18FF）。","A regular expression match equivalent to the one expected.":"正则表达式匹配等于预期。","When this method returns, contains the parsed value.":"当此方法返回时，包含解析值。"," that represents the method to be run in the specified security context.":"这表示要在指定的安全上下文中运行的方法。"," is returned.  \n  \n If the target tried to accept the message but missed it due to the source delivering the message to another target or simply discarding it, ":"退回。 \n  \n  如果目标试图接受该消息，但由于源将消息传递给另一个目标或简单地将消息传递给消息而错过了，","The Vai Unicode block (U+A500-U+A63F).":"VAI Unicode块（U+A500-U+A63F）。","A regular expression match that is suitable to share between multiple threads.":"适合在多个线程之间共享的正则表达匹配。"," if the value can be successfully obtained; otherwise, ":"如果可以成功获得该值； 否则，","The object to be passed to the callback method.":"要传递到回调方法的对象。"," is returned.  \n  \n If the target chose not to accept the message, ":"退回。 \n  \n  如果目标选择不接受消息，","An empty match.":"一个空的比赛。","The type of the object to check whether it can be converted by this converter instance.":"该对象的类型检查是否可以通过此转换器实例转换。","An object that contains data for the thread procedure.":"包含线程过程数据的对象。","The Variation Selectors Unicode block (U+FE00-U+FE0F).":"变体选择器Unicode块（U+Fe00-U+Fe0f）。","The character groups matched by the pattern.":"角色组与模式匹配。"," is returned. If the target chose not to accept the message and will never accept another message from this source, ":"退回。 如果目标选择不接受该消息，并且永远不会接受此源的其他消息，"," if the instance can convert the specified object type; otherwise, ":"如果实例可以转换指定的对象类型； 否则，","The position in the array where copying is to begin.":"阵列中要开始复制的位置。","A delegate that represents the methods to be invoked when this thread begins executing.":"代表该线程开始执行时要调用的方法的委托。","The Vedic Extensions Unicode block (U+1CD0-U+1CFF).":"吠陀扩展Unicode块（U+1CD0-U+1CFF）。"," delegate that represents the methods to be invoked when this thread begins executing.":"代表该线程开始执行时要调用的方法的委托。","A string that represents the formatted name of this ":"表示此格式名称的字符串","The type to compare against.":"比较的类型。","The number of matches.":"比赛数。","The maximum stack size, in bytes, to be used by the thread, or 0 to use the default maximum stack size specified in the header for the executable.  \n  \n Important   For partially trusted code, ":"线程中要使用的最大堆栈大小，或者0用于使用可执行文件中指定的默认最大堆栈大小。 \n  \n  对于部分信任的代码很重要，","The completed task.":"完成的任务。","The Vertical Forms Unicode block (U+FE10-U+FE1F).":"垂直形成Unicode块（U+Fe10-U+Fe1f）。"," if the type can be converted; otherwise, ":"如果可以转换类型； 否则，","Index into the ":"索引到","The number of input items waiting to be processed by this block.":"等待该块处理的输入项数量。"," is ignored if it is greater than the default stack size. No exception is thrown.":"如果它大于默认堆栈大小，则将忽略。 没有例外。","The Yijing Hexagram Symbols Unicode block (U+4DC0-U+4DFF).":"Yijing Hexagram符号Unicode块（U+4DC0-U+4DFF）。","The reader.":"读者。","The number of items to group into a batch.":"分组的项目数。","An object that can be used to synchronize access to the collection. This property always returns the object itself.":"可用于同步访问集合的对象。 此属性总是返回对象本身。","An object that contains application-specific information, such as state, which can be used by the thread being aborted.":"包含特定于应用程序信息的对象，例如状态，该线程可以通过中止该线程使用。","The Yi Radicals Unicode block (U+A490-U+A4CF).":"YI激进分子Unicode块（U+A490-U+A4CF）。","The  ":"这","An object that specifies serialization options to use.":"指定使用序列化选项的对象。","The allocated named data slot on all threads.":"所有线程上分配的命名数据插槽。","The Yi Syllables Unicode block (U+A000-U+A48F).":"YI音节Unicode块（U+A000-U+A48F）。"," object that represents a single regular expression match during a ":"代表单个正则表达式匹配的对象"," to which to connect this source.":"要连接此源。","The name of the data slot to be allocated.":"要分配的数据插槽的名称。"," method operation.":"方法操作。","The JSON text to parse.":"JSON文本解析。"," to read from.":"从中阅读。"," instance that configures the link.":"配置链接的实例。","A string returned by the method that is represented by the ":"由该方法返回的字符串","The name of the data slot to be freed.":"要释放的数据插槽的名称。","An IDisposable that, upon calling Dispose, will unlink the source from the target.":"一个可以在呼叫处置后将将源与目标链接起来的IDisposable。","The options to use when reading the value.":"阅读值时要使用的选项。","Options to control the reader behavior during parsing.":"在解析过程中控制读者行为的选项。","The object that contains a serialized pattern and ":"包含序列化模式的对象和","The value that was converted.":"转换的值。"," values indicating the apartment state of the managed thread. The default is ":"表示托管线程的公寓状态的值。 默认值为"," that caused the faulting.":"这导致了断层。","A JsonDocument representation of the JSON value.":"JSON值的jsondocument表示。","The writer to write to.":"作者写信。","An integer representing the cached processor ID.":"代表缓存处理器ID的整数。","The regular expression pattern to match.":"匹配的正则表达方式。"," of the message being consumed.":"被消耗的消息。","The JSON data to parse.":"JSON数据解析。","The value to convert to JSON.":"转换为JSON的价值。"," consuming the message.":"消耗消息。"," from which to get the value.":"从中获得值。","A bitwise combination of the enumeration values that modify the regular expression.":"修改正则表达式的枚举值的位组合。","A task to produce a JsonDocument representation of the JSON value.":"产生JSON值的JSondocument表示的任务。","The value to convert. The value of ":"要转换的值。 的价值","A time-out interval, or ":"超时间隔，或"," if the message was successfully consumed; otherwise, ":"如果消息成功消耗； 否则，","The reader to read.":"读者阅读。","The retrieved value.":"检索值。"," determines if the converter handles ":"确定转换器是否处理","The value of the consumed message. This may correspond to a different ":"消耗消息的价值。 这可能对应于不同的"," to indicate that the method should not time out.":"表明该方法不应该超时。"," representing the current application domain of the running thread.":"表示运行线程的当前应用程序域。","A JsonDocument representing the value (and nested values) read from the reader.":"代表值（和嵌套值）的jsondocument从读者读取。","The options to use when writing the value.":"编写值时要使用的选项。"," instance than was previously reserved and passed as the ":"实例比以前保留并通过","When the method returns, contains the parsed document.":"当方法返回时，包含解析的文档。","The type of the converter.":"转换器的类型。","An array that describes the regular expressions to compile.":"描述要编译的正则表达式的数组。","A 32-bit signed integer uniquely identifying the application domain.":"一个32位签名的整数唯一识别应用程序域。",". The consuming ":"。 消费"," if a value was read and parsed into a JsonDocument; ":"如果读取值并将其解析为jsondocument；","The custom converter.":"自定义转换器。","The file name of the assembly.":"汇编的文件名。","An integer hash code value.":"整数哈希代码值。"," if the reader ran out of data while parsing. All other situations result in an exception being thrown.":"如果读者在解析时用光了数据。 所有其他情况都会导致例外。","The name of the local data slot.":"本地数据插槽的名称。","An array that defines the attributes to apply to the assembly.":"定义适用于程序集的属性的数组。"," if it was created without a type.":"如果没有类型的创建。"," must use the returned value instead of the value passed as messageValue through ":"必须使用返回的值，而不是传递的值作为messageValue通过","The writer to which to write the document.":"写文档的作者。","The name of the Win32 resource file to include in the assembly.":"WIN32资源文件的名称将包含在汇编中。","The type handled by the converter.":"转换器处理的类型。"," allocated for this thread.":"为此线程分配。",".  \n  \n If the message requested is not available, the return value will be ":"。 \n  \n  如果未请求的消息可用，则返回值将为","The input string that contains the text to convert.":"输入字符串包含要转换的文本。","The serialization options to use.":"使用的序列化选项。"," representing the value of the document.":"表示文档的价值。","The number of milliseconds to wait for the thread to terminate.":"等待线程终止的毫秒数。"," of the reserved message being released.":"保留消息正在发布。","A string of characters with metacharacters converted to their escaped form.":"一连串的字符，带有metacharacters的字符转换为逃脱的形式。","A converter for which ":"转换器"," if the thread has terminated; ":"如果线程终止；"," releasing the message it previously reserved.":"释放先前保留的消息。"," if an extra comma at the end of a list of JSON values in an object or array is allowed; otherwise, ":"如果允许在对象或数组中的JSON值列表的末尾进行额外的逗号； 否则，"," is compatible with ":"与","A string array of group names.":"组名称的字符串数组。"," if the thread has not terminated after the amount of time specified by the ":"如果线程在指定的时间之后尚未终止"," of the message being reserved.":"保留的消息。","One of the enumeration values that indicates how comments are handled.":"指示如何处理评论的枚举值之一。","An integer array of group numbers.":"组编号的整数数组。","A bitwise combination of the enumeration values that specify how number types should be handled when serializing or deserializing.":"枚举值的位组合，该值指定了在序列化或进行序列化时应如何处理数字类型的比较组合。"," reserving the message.":"保留消息。"," parameter has elapsed.":"参数已过去。","The maximum depth allowed when parsing JSON data.":"解析JSON数据时允许的最大深度。","The group number to convert to the corresponding group name.":"要转换为相应组名称的组号。","An object that determines the number serialization and deserialization settings.":"确定数字序列化和避免设置的对象。"," if the message was successfully reserved; otherwise, ":"如果消息成功保留； 否则，"," set to the amount of time to wait for the thread to terminate.":"设置为等待线程终止的时间。","A string that contains the group name associated with the specified group number. If there is no group name that corresponds to ":"一个包含与指定组号关联的组名称的字符串。 如果没有组名与","The order of the property.":"财产的顺序。"," instance that represents the header of the message being offered.":"代表正在提供的消息的标题。","A JsonElement that can be safely stored beyond the lifetime of the original ":"可以安全地存储原始生命周期的jsonelement"," if the thread terminated; ":"如果线终止；","The group name to convert to the corresponding group number.":"要转换为相应组号的组名称。","An enumerator to enumerate the values in the JSON array represented by this JsonElement.":"枚举以此JSONELEMENT代表的JSON数组中的值枚举。","The type to generate source code for.":"生成源代码的类型。"," offering the message. This may be null.":"提供消息。 这可能是无效的。","The new apartment state.":"新公寓国家。","The group number that corresponds to the specified group name, or -1 if ":"与指定组名称相对应的组号，或-1",", in order to consume the message.":"，为了消耗消息。","The run-time provided options for the context instance.":"运行时为上下文实例提供了选项。","An enumerator to enumerate the properties in the JSON object represented by this JsonElement.":"枚举以列举此JSONELEMENT代表的JSON对象中的属性。","The status of the offered message. If the message was accepted by the target, ":"提供的消息的状态。 如果消息被目标接受，"," object to be applied to the current thread.":"对象要应用于当前线程。"," is not a valid group name.":"不是有效的组名称。","The default run-time options for the context. Its values are defined at design time via ":"上下文的默认运行时选项。 它的值在设计时通过","The number of values contained within the current array value.":"当前数组值中包含的值数量。","The value of the element as a ":"该元素的价值为","The string to search for a match.":"搜索比赛的字符串。","The type to fetch metadata about.":"获取元数据的类型。"," in which to set the value.":"在其中设置值。"," is returned as a notification that the target may later attempt to consume or reserve the message; in the meantime, the source still owns the message and may offer it to other blocks.  \n  \n If the target would have otherwise postponed message, but ":"作为通知返回，即目标稍后可能会尝试消费或保留消息； 同时，源仍然拥有该消息，并可能将其提供给其他块。 \n  \n  如果目标会推迟消息，但是","The current JSON number as a ":"当前的JSON编号为"," was ":"曾是","The value to be set.":"要设置的值。","The metadata for the specified type, or ":"指定类型的元数据或"," is instead returned.  \n  \n If the target tried to accept the message but missed it due to the source delivering the message to another target or simply discarding it, ":"而是返回。 \n  \n  如果目标试图接受该消息，但由于源将消息传递给另一个目标或简单地将消息传递给消息而错过了，"," if the regular expression finds a match; otherwise, ":"如果正则表达式找到匹配； 否则，"," if the context has no metadata for the type.":"如果上下文没有类型的元数据。","A string that represents the formatted name of this  ":"表示此格式名称的字符串","The number of milliseconds for which the thread is suspended. If the value of the ":"线悬挂的毫秒数。 如果价值","The character position at which to start the search.":"开始搜索的角色位置。","The value decoded as a byte array.":"值解码为字节数组。","The optional naming policy for writing enum values.":"编写枚举值的可选命名策略。","The predicate a value must successfully pass in order for it to be received.  ":"谓词值必须成功通过才能接收它。","A bitwise combination of the enumeration values that provide options for matching.":"枚举值的位组合，可提供匹配的选项。"," argument is zero, the thread relinquishes the remainder of its time slice to any thread of equal priority that is ready to run. If there are no other threads of equal priority that are ready to run, execution of the current thread is not suspended.":"参数为零，线程将其剩余时间切片放在准备运行的任何相等优先级的线程中。 如果没有其他相等优先级的线程准备运行，则不会暂停当前线程的执行。","The current JSON number as an ":"当前的JSON编号是"," to allow undefined enum values; otherwise, ":"允许未定义的枚举值； 否则，"," may be ":"或许","An object that contains information about the match.":"包含有关比赛信息的对象。",". When ":"。 什么时候","The amount of time for which the thread is suspended. If the value of the ":"线程悬挂的时间。 如果价值","The UTF-8 representation (with no Byte-Order-Mark (BOM)) of the name of the property to return.":"UTF-8表示（没有字节订单 - 标记（BOM））的属性名称返回。",", in which case all items will pass.":"，在这种情况下，所有项目都将通过。","The zero-based character position at which to start the search.":"零基于零的角色位置，以开始搜索。",", if an enum value isn't defined, it will output as a number rather than a string.":"，如果未定义枚举值，它将输出为数字而不是字符串。"," argument is ":"论点是"," representing the value of the requested property.":"表示请求的属性的价值。","The item received from the source.":"从来源收到的项目。","The type to be checked.":"要检查的类型。","The zero-based character position in the input string that defines the leftmost position to be searched.":"输入字符串中基于零的字符位置，该位置定义要搜索的最左端位置。",", the thread relinquishes the remainder of its time slice to any thread of equal priority that is ready to run. If there are no other threads of equal priority that are ready to run, execution of the current thread is not suspended.":"，该线程将其剩余时间切片放在准备运行的任何相等优先级的线程中。 如果没有其他相等优先级的线程准备运行，则不会暂停当前线程的执行。"," if an item could be received; otherwise, ":"如果可以收到一个物品； 否则，","The name of the property whose value is to be returned.":"属性的名称将返回其价值。"," instance representing the element type.":"代表元素类型的实例。","A 32-bit signed integer that defines how long a thread is to wait.":"一个32位签名的整数，定义线程需要等待多长时间。","The number of characters in the substring to include in the search.":"搜索中包含的子字符中的字符数。","The original input data backing this value.":"原始输入数据支持此值。","The items received from the source.":"从来源收到的项目。","An object that contains data to be used by the method the thread executes.":"线程执行的方法包含要使用的数据的对象。"," option to apply to number collection elements.":"适用于数字收集元素的选项。"," objects found by the search. If no matches are found, the method returns an empty collection object.":"搜索发现的对象。 如果找不到匹配项，则该方法将返回一个空收集对象。"," if the apartment state is set; otherwise, ":"如果设定了公寓状态； 否则，"," if one or more items could be received; otherwise, ":"如果可以收到一个或多个项目； 否则，","A JsonElement representing the value (and nested values) read from the reader.":"代表值（和嵌套值）的jsonelement从读者读取。","An optimized serialization implementation assuming pre-determined ":"假设预先确定的优化序列化实现","The field to be read.":"要阅读的字段。","The batch size.":"批量大小。","The character position in the input string at which to start the search.":"输入字符串中的字符位置以启动搜索。","A string representation for the current value appropriate to the value type.":"适用于值类型的当前值的字符串表示。","A bitwise combination of the enumeration values that specify options for matching.":"指定匹配选项的枚举值的位组合。","The field to which the value is to be written.":"值得写的字段。"," defaults.":"默认。","The number of output items.":"输出项目的数量。","When the method returns, contains the byte equivalent of the current JSON number if the conversion succeeded.":"当方法返回时，如果转换成功，则包含当前JSON号的字节等效。","The replacement string.":"替换字符串。"," of the message that is to be consumed.":"要消耗的信息。"," if the number can be represented as a ":"如果数字可以表示为"," if the operating system switched execution to another thread; otherwise, ":"如果操作系统将执行切换到另一个线程； 否则，"," to create an instance of the list when deserializing.":"在避免时创建列表的实例。","If the method succeeds, contains the decoded binary representation of the Base64 text.":"如果该方法成功，则包含基本64文本的解码二进制表示。","A new string that is identical to the input string, except that the replacement string takes the place of each matched string. If the regular expression pattern is not matched in the current instance, the method returns the current instance unchanged.":"一个与输入字符串相同的新字符串，除了替换字符串占据每个匹配的字符串的位置。 如果在当前实例中不匹配正则表达模式，则该方法将返回当前实例不变。"," values. The initial value is ":"值。 初始值是"," for which the message is to be consumed.":"该消息要消耗。"," instance representing the key type.":"代表密钥类型的实例。"," if the entire token value is encoded as valid Base64 text and can be successfully decoded to bytes; otherwise, ":"如果将整个令牌值编码为有效的base64文本，并且可以成功解码为字节； 否则，","The maximum number of times the replacement can occur.":"最多可以发生更换的次数。"," instance representing the value type.":"代表值类型的实例。"," if the message was successfully consumed. ":"如果消息成功消耗。","An object that represents the culture for the current thread.":"代表当前线程文化的对象。"," instance representing ":"实例表示","When this method returns, contains the date and time value equivalent to the current JSON string.":"当此方法返回时，包含与当前JSON字符串等效的日期和时间值。","Maximum number of times the replacement can occur.":"最多可以发生更换的次数。"," to this method. The consuming ":"对此方法。 消费"," value representing the security context.":"代表安全上下文的值。","A method to create an immutable dictionary instance.":"创建不变的词典实例的方法。"," must use the returned value instead of the value passed as ":"必须使用返回的值，而不是传递的值","The character position in the input string where the search begins.":"搜索开始的输入字符串中的字符位置。"," if the string can be represented as a ":"如果字符串可以表示为","A new string that is identical to the input string, except that the replacement string takes the place of each matched string. If ":"一个与输入字符串相同的新字符串，除了替换字符串占据每个匹配的字符串的位置。 如果"," to initialize the metadata with.":"用。"," that is the representation of the currently running thread.":"那就是当前运行线程的表示形式。",". If the message requested is not available, the return value is ":"。 如果请求的消息不可用，则返回值为","Provides serialization metadata about an object type with constructors, properties, and fields.":"提供有关具有构造函数，属性和字段的对象类型的序列化元数据。","When this method returns, contains the date and time equivalent to the current JSON string.":"当此方法返回时，包含与当前JSON字符串等效的日期和时间。"," is not matched in the current instance, the method returns the current instance unchanged.":"在当前实例中不匹配，该方法返回当前实例不变。","An object that represents the current culture.":"代表当前文化的对象。"," of the reserved message.":"保留的消息。","When this method returns, contains the decimal equivalent of the current JSON number.":"当此方法返回时，包含当前JSON号的小数等效。"," object that consolidates context information for the current thread.":"对象合并当前线程的上下文信息。"," instance representing the class or struct.":"代表类或结构的实例。"," that currently holds the reservation.":"目前拥有预订。","Whether the CLR member is a property or field.":"CLR成员是属性还是字段。"," of the message that is to be reserved.":"保留的消息。"," if this thread has been started and has not terminated normally or aborted; otherwise, ":"如果该线程已经启动并且尚未正常终止或流产； 否则，","When this method returns, contains a double-precision floating point value equivalent to the current JSON number.":"当此方法返回时，包含一个相当于当前JSON数字的双精度浮点值。","A custom method that examines each match and returns either the original matched string or a replacement string.":"检查每个匹配项并返回原始匹配字符串或替换字符串的自定义方法。","Whether the CLR member is public.":"CLR成员是否是公开的。"," if this thread is or is to become a background thread; otherwise, ":"如果此线程是或成为背景线程； 否则，","When this method returns, contains the GUID equivalent to the current JSON string.":"当此方法返回时，包含等同于当前JSON字符串的GUID。"," for which the message is to be reserved.":" 要为其保留消息。","Whether the CLR member is a virtual property.":"CLR成员是否是虚拟属性。","A new string that is identical to the input string, except that a replacement string takes the place of each matched string. If ":"一个与输入字符串相同的新字符串，除了替换字符串占每个匹配的字符串的位置。 如果","When the method returns, contains the 16-bit integer equivalent of the current JSON number if the conversion succeeded.":"当方法返回时，如果转换成功，则包含当前JSON号的16位整数。"," if this thread belongs to the managed thread pool; otherwise, ":"如果此线程属于托管线程池； 否则，","The target.":"目标。","A bitwise combination of enumeration values that provide options for matching.":"枚举值的位组合，可提供匹配的选项。","The declaring type of the property or field.":"属性或字段的声明类型。","The options with which to configure this  ":"配置此的选项"," if the number can be represented as an ":"如果数字可以表示为","A new string that is identical to the input string, except that a replacement string takes the place of each matched string. If the regular expression pattern is not matched in the current instance, the method returns the current instance unchanged.":"一个与输入字符串相同的新字符串，除了替换字符串占每个匹配的字符串的位置。 如果在当前实例中不匹配正则表达模式，则该方法将返回当前实例不变。"," info for the property or field's type.":"属性或字段类型的信息。","An integer that represents a unique identifier for this managed thread.":"代表此托管线程的唯一标识符的整数。"," if the source should unlink from the target after successfully propagating a single message; ":"如果源成功传播一条消息后，源应与目标链接。"," for the property or field, specified by ":"对于属性或字段，由","The maximum number of times the replacement will occur.":"最多替换的次数。","When this method returns, contains the 32-bit integer value equivalent to the current JSON number.":"当此方法返回时，包含相当于当前JSON数字的32位整数值。"," to remain connected even after a single message has been propagated.":"即使在一条消息传播后，保持连接。","A string containing the name of the thread, or ":"包含线程名称的字符串，或","When this method returns, contains the 64-bit integer value equivalent to the current JSON number.":"当此方法返回时，包含64位整数值等效于当前JSON号。","The string to split.":"拆分的字符串。","Provides a mechanism to get the property or field's value.":"提供了获取属性或字段价值的机制。"," if no name was set.":"如果没有设置名称。"," in which case all items will pass.":"在这种情况下，所有项目都将通过。","The UTF-8 (with no Byte-Order-Mark (BOM)) representation of the name of the property to return.":"UTF-8（没有字节订单 - 标记（BOM））表示要返回的属性名称。","An array of strings.":"一系列字符串。"," values indicating the state of the current thread. The initial value is ":"表示当前线程状态的值。 初始值是","Provides a mechanism to set the property or field's value.":"提供设置属性或字段值的机制。","The string to be split.":"要拆分的字符串。","Receives the value of the located property.":"接收位置属性的值。","The function to use to clone the data when offered to other blocks.":"当提供数据时，用于克隆数据的功能。","An object containing application-specific information.":"包含特定应用程序的对象。","The value of the consumed message. This may correspond to a different  ":"消耗消息的价值。 这可能对应于不同的","Specifies a condition for the property to be ignored.":"指定属性忽略的条件。"," if the property was found; otherwise, ":"如果发现该物业； 否则，"," that occurred.":"发生了。"," through ":"通过","The maximum number of times the split can occur.":"拆分可以发生的最大次数。","Whether the property was annotated with ":"该物业是否已注释"," to be signaled.":"要发出信号。","When this method returns, contains the value of the specified property.":"当此方法返回时，包含指定属性的值。"," to  ":" 到  ","The character position in the input string where the search will begin.":"搜索将开始的输入字符串中的字符位置。","If the property or field is a number, specifies how it should processed when serializing and deserializing.":"如果属性或字段是一个数字，则指定在序列化和应对序列化时应如何处理。"," that holds the handle. The handle must have been opened for overlapped I/O on the unmanaged side.":"握住手柄。 必须在未托管的一侧打开手柄对重叠的I/O打开。"," offering the message. This may be ":"提供消息。 这可能是"," if the handle is bound; otherwise, ":"如果手柄是绑定的； 否则，","Set to true to instruct the target to call ":"设置为true以指示目标打电话","When the method returns, contains the signed byte equivalent of the current JSON number if the conversion succeeded.":"当方法返回时，如果转换成功，则包含当前JSON号的签名字节等效。","The CLR name of the property or field.":"属性或字段的CLR名称。","A string array.":"字符串数组。"," that holds the operating system handle. The handle must have been opened for overlapped I/O on the unmanaged side.":"该操作系统的手柄。 必须在未托管的一侧打开手柄对重叠的I/O打开。","The place to store and retrieve serialized data. This parameter is reserved for future use.":"存储和检索序列化数据的地方。 此参数保留供将来使用。","When this method returns, contains the single-precision floating point value equivalent to the current JSON number.":"当此方法返回时，包含与当前JSON号相当的单精度浮点值。","The name to be used when processing the property or field, specified by ":"处理属性或字段时要使用的名称，由","The predicate value must successfully pass in order for it to be received. ":"谓词值必须成功通过才能接收。"," instance intialized with the provided metadata.":"实例用提供的元数据初始化。"," parameter that was passed into the ":"传递到","When the method returns, contains the unsigned 16-bit integer equivalent of the current JSON number if the conversion succeeded.":"当该方法返回时，如果转换成功，则包含当前JSON号的未签名16位整数。","The number of available worker threads.":"可用的工作线程数。","The source to wrap.":"包装的来源。","The number of available asynchronous I/O threads.":"可用的异步I/O线程的数量。","When this method returns, contains unsigned 32-bit integer value equivalent to the current JSON number.":"当此方法返回时，包含的无符号32位整数值等于当前的JSON号。","The input string containing the text to convert.":"输入字符串包含要转换的文本。","A method for adding elements to the collection when using the serializer's code-paths.":"使用串行器的代码路径时，将元素添加到集合中的方法。"," that enables observers to be subscribed to the source.":"这使观察者可以订阅源。","When this method returns, contains unsigned 64-bit integer value equivalent to the current JSON number.":"当此方法返回时，包含的无符号64位整数值等于当前的JSON号。","The maximum number of worker threads in the thread pool.":"线程池中最大的工作线数量。"," instance representing the type.":"代表类型的实例。","A string of characters with any escaped characters converted to their unescaped form.":"一连串的字符串，其中任何逃脱的字符转换为其未排列的形式。","The target to wrap.":"包裹的目标。"," to use for serialization and deserialization.":"用于序列化和避难所化。","Receives the parsed element.":"接收解析元素。","The maximum number of asynchronous I/O threads in the thread pool.":"线程池中的异步I/O线程的最大数量。","An observer that wraps the target block.":"包裹目标块的观察者。"," property contains the ":" 属性包含 ","Serialization metadata for the underlying nullable type.":"基础无效类型的序列化元数据。","When this method returns, contains the minimum number of worker threads that the thread pool creates on demand.":"当此方法返回时，包含线程池按需创建的最小工作线程数。"," if a value was read and parsed into a JsonElement; ":" 如果一个值被读取并解析为JsonElement; ","The first source.":"第一个来源。"," option; otherwise, ":"选项; 否则，"," if the reader ran out of data while parsing.\n               All other situations result in an exception being thrown.":"如果读者在解析时用光了数据。 \n                所有其他情况都会导致例外。","The handler to execute on data from the first source.":"处理程序可以从第一个来源执行数据。","When this method returns, contains the minimum number of asynchronous I/O threads that the thread pool creates on demand.":"当此方法返回时，包含线程池按需创建的异步I/O线程的最小数量。","The resolver to use for serialization and deserialization.":"用于序列化和避免化的解析器。","The time-out interval to check.":"的超时间隔进行检查。","The UTF-8 encoded text to compare against.":"UTF-8编码文本要与之相比。","The second source.":"第二个来源。"," that represents the method to be executed.":"这代表要执行的方法。","The new resolver to use for serialization and deserialization.":"新的解析器用于序列化和避免。","The maximum number of entries in the static cache.":"静态缓存中的最大条目数。"," if the string value of this element has the same UTF-8 encoding as\n              ":"如果此元素的字符串值具有相同的UTF-8编码"," if the method is successfully queued; ":"如果该方法成功排队；","The handler to execute on data from the second source.":"处理程序要从第二个来源执行数据。","A dictionary that maps named capturing groups to their index values.":"词典将捕获组命名为索引值的词典。","The text to compare against.":"比较的文字。","The identifier of the JSON object or array.":"JSON对象或数组的标识符。"," is thrown if the work item could not be queued.":"如果无法排队的工作项目，则会抛弃。"," that represents the asynchronous choice. If both sources are completed prior to the choice completing, the resulting task will be canceled. When one of the sources has data available and successfully propagates it to the choice, the resulting task will complete when the handler completes; if the handler throws an exception, the task will end in the ":" 这代表了异步选择。 如果两个源都在选择完成之前完成，则生成的任务将被取消。 当其中一个源具有可用数据并成功将其传播到选择时，结果任务将在处理程序完成时完成;如果处理程序引发异常，则任务将在 "," if the string value of this element matches ":"如果此元素的字符串值匹配","The value of the CLR reference type object that results from parsing the JSON object.":"由解析JSON对象引起的CLR参考类型对象的值。","A dictionary that maps numbered capturing groups to their index values.":"将编号捕获组映射到其索引值的字典。"," representing the method to execute.":" 表示要执行的方法。"," state and will contain the unhandled exception. Otherwise, the task will end with its ":"状态并将包含未经治疗的例外。 否则，任务将以其结束","The maximum time interval that can elapse in a pattern-matching operation before a ":"在图案匹配操作中可以在图案匹配操作中恢复的最大时间间隔","The writer to which to write the element.":"写元素的作者。","The value of the CLR reference type object to get an id for.":"CLR参考类型对象的值要获得ID。"," set to either 0 or 1 to represent the first or second source, respectively.  \n  \n This method will only consume an element from one of the two data sources, never both.":"设置为0或1分别表示第一个或第二个源。 \n  \n  此方法只会从两个数据源之一中消耗一个元素，从不同时消耗。","An object containing data to be used by the method.":"包含该方法使用的数据的对象。"," is thrown, or ":"被扔了，或","The type of the current JSON value.":"当前JSON值的类型。"," if a reference to value already exists; otherwise, ":" 如果已经存在对value的引用；否则, "," to prefer queueing the work item in a queue close to the current thread; ":"更喜欢在靠近当前线程的队列中排队工作项；","The options with which to configure this choice.":"配置此选择的选项。"," if time-outs are disabled.":"如果禁用超时。","An enumerator for an array of ":"一个枚举者"," that represents the asynchronous choice. If both sources are completed prior to the choice completing, or if the ":"这代表了异步选择。 如果两个来源在选择完成之前都完成，或者","The reference id for the specified object.":"指定对象的参考ID。","One or more members of the ":"一个或多个成员"," to prefer queueing the work item to the thread pool's shared queue.":" 优先将工作项排队到线程池的共享队列。","An enumerator that can be used to iterate through the object.":"可以用来通过对象迭代的枚举器。"," enumeration that represent options that were passed to the ":"代表传递给的选项的枚举"," provided as part of ":"作为一部分提供","The reference id related to the returned object.":"返回的对象相关的引用id。"," to register. Use a ":"注册。 用一个","An enumerator for ":"枚举者"," other than ":"以外"," if the regular expression searches from right to left; otherwise, ":"如果正则表达式从右到左进行搜索； 否则，"," is canceled prior to the choice completing, the resulting task will be canceled. When one of the sources has data available and successfully propagates it to the choice, the resulting task will complete when the handler completes; if the handler throws an exception, the task will end in the ":"在选择完成之前已取消，将取消结果任务。 当其中一个来源具有可用的数据并成功地传播到选择时，当处理程序完成时，将完成的任务将完成； 如果处理程序抛出异常，任务将在","The reference type object related to the specified reference id.":"与指定参考ID相关的参考类型对象。"," objects that can be used to iterate through the collection.":"可以用来通过集合迭代的对象。"," set to either 0 or 1 to represent the first or second source, respectively.":"设置为0或1分别表示第一个或第二个源。"," delegate to call when the ":"当","The regular expression to compile.":"正则表达式编译。","The UTF-8 encoded JSON text to process.":"UTF-8编码的JSON文本要处理。","The UTF-8 encoded text to convert to JSON encoded text.":"要转换为JSON编码文本的UTF-8编码文本。"," parameter is signaled.":"参数发出信号。"," to indicate that the input sequence contains the entire data to process; ":"为了表明输入序列包含要处理的整个数据；","The third source.":"第三个来源。","The object that is passed to the delegate.":"传递给代表的对象。","The handler to execute on data from the third source.":"处理程序可以从第三源执行数据。","The encoder to use when escaping the string, or ":"转义字符串时要使用的编码器，或 "," to indicate that the input span contains partial data with more data to follow.":"为了表明输入跨度包含部分数据，其中包含更多数据。","The time-out in milliseconds. If the ":"超时的毫秒。 如果是"," to use the default encoder.":"使用默认编码器。"," that represents the asynchronous choice. If all sources are completed prior to the choice completing, the resulting task will be canceled. When one of the sources has data available and successfully propagates it to the choice, the resulting task will complete when the handler completes; if the handler throws an exception, the task will end in the ":"这代表了异步选择。 如果所有资源在选择完成之前都完成，则将取消结果任务。 当其中一个来源具有可用的数据并成功地传播到选择时，当处理程序完成时，将完成的任务将完成； 如果处理程序抛出异常，任务将在","An object that contains the reader state. If this is the first call to the constructor, pass the default state; otherwise, pass the value of the ":"包含读取器状态的对象。 如果这是对构造函数的第一个调用，请通过默认状态； 否则，通过"," parameter is 0 (zero), the function tests the object's state and returns immediately. If ":" 参数为0（零），该函数测试对象的状态并立即返回。 如果 "," property from the previous instance of the ":"来自上一个实例的属性","The encoded JSON text.":"编码的JSON文本。"," is -1, the function's time-out interval never elapses.":"IS -1，该函数的超时间隔永远不会消失。"," set to the 0-based index of the source.  \n  \n This method will only consume an element from one of the data sources, never more than one.":" 置为源的基于0的索引。  \n  \n 此方法只会使用来自其中一个数据源的元素，绝不会超过一个。","Defines customized behavior of the ":"定义了定制行为"," that represents the asynchronous choice. If all sources are completed prior to the choice completing, or if the ":"这代表了异步选择。 如果所有来源在选择完成之前完成，或者"," to indicate that the thread will no longer wait on the ":"表示线程将不再等待","The value to convert to JSON encoded text.":"转换为JSON编码文本的值。"," that differs from the JSON RFC (for example how to handle comments or maximum depth allowed when reading). By default, the ":"这与JSON RFC有所不同（例如，在阅读时如何处理评论或最大深度）。 默认情况下，"," parameter after the delegate has been called; ":"委托后的参数被调用；","The underlying UTF-16 encoded string.":"基础UTF-16编码字符串。"," set to the 0-based index of the source.  \n  \n This method will only consume an element from one of the data sources, never more than one. If cancellation is requested after an element has been received, the cancellation request will be ignored, and the relevant handler will be allowed to execute.":"设置为源的基于0的索引。 \n  \n  该方法只会从其中一个数据源中消耗一个元素，永远不会超过一个。 如果在收到元素后请求取消，则将忽略取消请求，并允许相关处理程序执行。"," follows the JSON RFC strictly; comments within the JSON are invalid, and the maximum depth is 64.":"严格遵循JSON RFC； JSON中的评论无效，最大深度为64。","The UTF-8 encoded representation of the pre-encoded JSON text.":"预编码JSON文本的UTF-8编码表示。"," to indicate that the timer is reset every time the wait operation completes until the wait is unregistered.":"为了指出每次等待操作完成时，直到等待未注册时，计时器已重置。","The target to encapsulate.":"封装的目标。"," that encapsulates the native handle.":"这封装了本机手柄。","The serialized object data about the exception being thrown.":"有关抛出的异常的序列化对象数据。","The value of the UTF-8 encoded token.":"UTF-8编码令牌的值。","The source to encapsulate.":"封装的源。","The object passed to the delegate.":"对象传递给代表。","The byte array that represents the current JSON token value.":"代表当前JSON令牌值的字节数组。","The context-specific error message.":"特定于上下文的错误消息。","The exception that caused the current exception.":"导致当前异常的例外。","The time-out represented by a ":"超时代表","The encapsulated target and source.":"封装的目标和源。","The comment that represents the current JSON token value.":"表示当前JSON令牌值的评论。"," is 0 (zero), the function tests the object's state and returns immediately. If ":"为0（零），该函数测试对象的状态并立即返回。 如果","The source from which to link.":"链接的来源。","The path where the invalid JSON was encountered.":"遇到无效JSON的路径。","The date and time value, if the entire UTF-8 encoded token value can be successfully parsed.":"日期和时间值，如果整个UTF-8编码的令牌值可以成功解析。"," to which to connect the source.":"要连接源。","The line number (starting at 0) at which the invalid JSON was encountered when deserializing.":"避免时遇到无效的JSON的行号（从0开始）。"," that can be used to cancel the registered wait operation.":"可以用来取消注册的等待操作。"," that, upon calling ":"呼叫"," if the change is successful; otherwise, ":"如果更改成功； 否则，","The date and time offset, if the entire UTF-8 encoded token value can be successfully parsed.":"日期和时间偏移，如果整个UTF-8编码的令牌值可以成功解析。",", will unlink the source from the target.":"，将将源与目标联系起来。","The byte count within the current line (starting at 0) where the invalid JSON was encountered.":"当前行中的字节计数（从0开始）遇到了无效的JSON。","The minimum number of worker threads that the thread pool creates on demand.":"线程池按需创建的最小工作线程数。","The UTF-8 encoded token value parsed to a ":"UTF-8编码令牌值解析为 ","The filter a message must pass in order for it to propagate from the source to the target.":"滤波器必须传递，以使其从源传播到目标。","The byte count (starting at 0) within the current line where the invalid JSON was encountered.":"在遇到无效的JSON的当前行中的字节计数（从0开始）。","The GUID value, if the entire UTF-8 encoded token value can be successfully parsed.":"GUID值，如果可以成功解析整个UTF-8编码的令牌值。","The minimum number of asynchronous I/O threads that the thread pool creates on demand.":"线池按需创建的异步I/O线程的最小数量。","The zero-based number of bytes read within the current line before the exception.":"基于零的字节数在当前行中读取异常。","One of the enumeration values that specifies how to configure a link between dataflow blocks.":"指定如何在数据流块之间配置链接的枚举值之一。"," structure to queue.":"排队的结构。","The UTF-8 encoded token value parsed to an ":"UTF-8编码令牌值解析为","The zero-based number of lines read before the exception.":"基于零的行数在异常之前读取。"," that accepts and subsequently drops all offered messages.":"这接受并随后删除所有提供的消息。","The token value parsed to a string, or ":"代币值分析为字符串或"," if the operation was successfully queued to an I/O completion port; otherwise, ":"如果操作成功排队到I/O完成端口； 否则，","The source to monitor.":"监视的源。","The error message that describes the current exception.":"描述当前异常的错误消息。","The work item to invoke when a thread in the thread pool picks up the work item.":"当线程池中的线程拾取工作项时，要调用的工作项。"," if the token was read successfully; otherwise, ":"如果代币成功阅读； 否则，"," that informs of whether and when more output is available. If, when the task completes, its ":"这会告知是否以及何时有更多输出。 如果，当任务完成时","The path within the JSON where the exception was encountered.":"JSON中遇到例外的路径。"," if the entire UTF-8 encoded token value can be successfully parsed to a ":"如果整个UTF-8编码的令牌值可以成功解析为"," if the method succeeds; ":"如果该方法成功；",", more output is available in the source (though another consumer of the source may retrieve the data).  \n  \n If it returns ":"，源中有更多输出可用（尽管源的另一个消费者可以检索数据）。 \n  \n  如果返回","The name to convert.":"要转换的名称。"," that represents the delegate to invoke when a thread in the thread pool picks up the work item.":"这表示当线程池中的线程拾取工作项时，要调用的代表。","When this method returns, contains the decoded binary representation of the Base64 text.":"当此方法返回时，包含基本64文本的解码二进制表示。","The converted name.":"转换的名称。",", more output is not and will never be available, due to the source completing prior to output being available.":"，由于源在输出之前完成的源完成，因此不会，也将永远不会可用。"," if the entire UTF-8 encoded token value can be successfully parsed to an ":"如果整个UTF-8编码的令牌值可以成功解析为","The object that is passed to the delegate when serviced from the thread pool.":"从线程池维修时传递给委托的对象。","The cancellation token with which to cancel the asynchronous operation.":"取消异步操作的取消令牌。"," if there was enough data for the children to be skipped successfully; otherwise, ":"如果有足够的数据供孩子成功跳过； 否则，","A delegate representing the method to execute.":"代表执行方法的委托。","The naming policy for camel-casing.":"骆驼评估的命名政策。",", more output is available in the source (though another consumer of the source may retrieve the data). If it returns ":"，源中有更多输出可用（尽管源的另一个消费者可以检索数据）。 如果返回"," if the name of this property has the same UTF-8 encoding as ":"如果此属性的名称具有相同的UTF-8编码","The delegate to call when the ":"当"," if the JSON token value in the source matches the UTF-8 encoded lookup text; otherwise, ":"如果源中的JSON令牌值匹配UTF-8编码的查找文本； 否则，","The target block.":"目标块。"," if the name of this property matches ":"如果此属性的名称匹配"," object that can be used to cancel the registered wait operation.":"可用于取消注册的等待操作的对象。"," if the JSON token value in the source matches the lookup text; otherwise, ":"如果源中的JSON令牌值与查找文本匹配； 否则，"," if the item was accepted by the target block; otherwise, ":"如果该项目被目标块接受； 否则，","A string containing the uninterpreted value of the property, beginning at the declaring open-quote and ending at the last character that is part of the value.":"一个包含属性未解释值的字符串，从声明的开放引号开始，并以该值的一部分结束。","The total number of bytes consumed so far.":"到目前为止，字节的总数消耗了。","The source from which to receive the value.":"接收值的来源。","The number of work items that have been processed so far.":"到目前为止已经处理的工作项目数量。","The writer to which to write the property.":"写属性的作者。","The depth of the current token.":"当前令牌的深度。","The received value.":"收到的值。","The number of work items that are currently queued to be processed.":"当前排队处理的工作项目数量。","The name of this property.":"此属性的名称。","The current reader state.":"当前的读者状态。","The number of thread pool threads that currently exist.":"当前存在的线程池螺纹的数量。","The token to use to cancel the receive operation.":"用于取消接收操作的代币。"," should be used to get the token value; ":"应用来获取令牌值；","The value of this property.":"该属性的价值。","An object containing information to be used by the callback method.":"一个包含回调方法使用的信息的对象。","The maximum time interval, in milliseconds, to wait for the synchronous operation to complete, or an interval that represents -1 milliseconds to wait indefinitely.":"以毫秒为单位的最大时间间隔等待同步操作完成，或者无限期地等待-1毫秒的间隔。"," should be used instead.":"应该使用。"," if an extra comma is allowed; otherwise, ":"如果允许额外的逗号； 否则，","The source from which to asynchronously receive.":"从那里获得异步的来源。","An object containing information to be used by the callback method each time it executes.":"每次执行回调方法都包含要通过回调方法使用的对象。"," if the reader was constructed with the input span or sequence containing the entire JSON data to process; ":"如果读者是用包含整个JSON数据处理的输入跨度或序列构造的；","The maximum depth allowed when reading JSON.":"阅读JSON时允许的最大深度。"," timed out; ":"时间到;"," that can be used to cancel the receive operation.":"可以用来取消接收操作。"," if the reader was constructed with an input span or sequence that may contain partial JSON data with more data to follow.":"如果读取器是用输入跨度或序列构造的，该输入跨度或序列可能包含部分JSON数据，并遵循更多数据。","Defines the customized behavior of the ":"定义了自定义行为","A task that represents the asynchronous receive operation. When an item value is successfully received from the source, the returned task is completed and its ":"代表异步接收操作的任务。 当从源成功收到项目值时，返回的任务已完成，其"," if it was signaled.":"如果发出信号。"," that is different from the JSON RFC (for example how to handle comments, or the maximum depth allowed when reading). By default, the ":"这与JSON RFC不同（例如，如何处理评论或阅读时允许的最大深度）。 默认情况下，"," within the provided UTF-8 encoded input ReadOnlySequence<byte> or a default ":"在提供的UTF-8编码输入readOnlySequence <byte>或默认","The index of the abandoned mutex in the array of wait handles if the exception is thrown for the ":"如果对此，则在等待手柄中被废弃的静音的索引"," returns the received value. If an item value cannot be retrieved because the source is empty and completed , an ":"返回接收值。 如果由于源为空和完成，无法检索项目值，则"," struct was constructed with a ReadOnlySpan<byte>.":"结构是用ReadOnlySpan <byte>构建的。"," follows the JSON RFC strictly (comments within the JSON are invalid) and reads up to a maximum depth of 64.":"严格遵循JSON RFC（JSON中的评论无效），最大深度为64。"," exception is thrown in the returned task.":"返回的任务中抛出了例外。"," method, or -1 if the exception is thrown for the ":"方法，或-1，如果为此抛出了异常","The starting index of the last processed JSON token within the given UTF-8 encoded input text.":"给定的UTF-8编码输入文本中最后一个处理的JSON令牌的启动索引。","The custom behavior to use when reading JSON data.":"读取JSON数据时要使用的自定义行为。"," object that represents the abandoned mutex.":"代表废弃的静音的对象。","A task that represents the asynchronous receive operation. When a value is successfully received from the source, the returned task is completed and its ":"代表异步接收操作的任务。 当从源成功收到一个值时，返回的任务已完成及其","The type of the last processed JSON token.":"最后处理的JSON令牌的类型。","An error message that explains the reason for the exception.":"一个错误消息，解释了异常的原因。"," returns the value. If a value cannot be retrieved because cancellation was requested, the returned task is canceled. If the value cannot be retrieved because the source is empty and completed , an ":"返回值。 如果由于请求取消而无法检索值，则返回的任务将被取消。 如果由于源为空和完成，无法检索该值","JSON data to parse.":"JSON数据解析。","A byte read-only sequence.":"一个字节读取序列。"," object that represents the abandoned mutex, or ":"代表废弃的静音的对象，或"," returns the value. If a value cannot be retrieved because the time-out expired, the returned task is canceled. If the value cannot be retrieved because the source is empty and completed , an ":"返回值。 如果由于超时到期而无法检索值，则返回的任务将被取消。 如果由于源为空和完成，无法检索该值","The type of the object to convert to and return.":"要转换和返回的对象的类型。","The destination for writing JSON text.":"编写JSON文本的目的地。","The token which may be used to cancel the receive operation.":"可用于取消接收操作的令牌。"," if the abandoned mutex could not be identified.":"如果无法确定废弃的静音。","Options to control the behavior during reading.":"在阅读过程中控制行为的选项。"," returns the value. If a value cannot be retrieved because the time-out expired or cancellation was requested, the returned task is canceled. If the value cannot be retrieved because the source is empty and completed, an ":"返回值。 如果由于要求超时或取消的时间而无法检索值，则将取消返回的任务。 如果由于源为空和完成，无法检索该值",". By default, it writes minimized JSON (with no extra white space) and validates that the JSON being written is structurally valid according to the JSON RFC.":"。 默认情况下，它写下了最小的JSON（没有额外的空白），并验证了根据JSON RFC在结构上编写的JSON在结构上是有效的。","The index, in the array of wait handles passed to the ":"索引，在一系列等待手柄中传递给","The target to which to post the data.":"发布数据的目标。"," representation of the JSON value.":"JSON值的表示。","A task representing the asynchronous dispose operation.":"代表异步处置操作的任务。","A task representing the asynchronous flush operation.":"代表异步冲洗操作的任务。"," method, of the ":"方法，"," that represents the asynchronous send. If the target accepts and consumes the offered element during the call to ":"这代表异步发送。 如果目标接受并消耗在呼叫期间所提供的元素","A metadata provider for serializable types.":"可序列化类型的元数据提供商。","Options to control the behavior during parsing.":"在解析过程中控制行为的选项。"," object that represents the abandoned mutex, or -1 if the index of the abandoned mutex could not be determined.":"代表废弃的静音的对象，如果无法确定被废弃的静音的索引，则为-1。",", upon return from the call the resulting ":"，从呼叫后返回结果","The UTF-8 encoded name of the property to write.":"要写的属性的UTF-8编码名称。","The binary data to write as Base64 encoded text.":"二进制数据以基本64编码文本写入。","JSON text to parse.":"JSON文本解析。","An object to compare with the current structure.":"与当前结构进行比较的对象。","The property name of the JSON object to be transcoded and written as UTF-8.":"JSON对象的属性名称要转码并写为UTF-8。"," will be completed and its ":"将完成及其","The reader to read the JSON from.":"读者阅读JSON。"," structure and is equal to the current ":"结构，等于电流","Options to control the serializer behavior during reading.":"在阅读过程中控制串行器行为的选项。","The JSON-encoded name of the property to write.":"JSON编码的属性名称要编写。"," property will return ":"属性将返回"," structure to compare with the current structure.":"与当前结构进行比较的结构。","Metadata about the type to convert.":"关于要转换类型的元数据。","The binary data to be written as a Base64 encoded JSON string element of a JSON array.":"二进制数据写为JSON数组的base64编码JSON字符串元素。",". If the target declines the offered element during the call, upon return from the call the resulting ":"。 如果目标在呼叫期间拒绝所提供的元素，则从呼叫返回后，"," if the two structures are equal; otherwise, ":"如果两个结构相等； 否则，","The UTF-8 encoded property name of the JSON object to be written.":"要编写的JSON对象的UTF-8编码属性名称。",". If the target postpones the offered element, the element will be buffered until such time that the target consumes or releases it, at which point the task will complete, with its ":"。 如果目标推迟所提供的元素，则该元素将被缓冲到目标消耗或释放它的时间，此时任务将完成，以便及时完成。","Options to control serializer behavior during reading.":"在阅读过程中控制串行器行为的选项。"," if the structures are not equal; otherwise, ":"如果结构不相等； 否则，","The delegate that is called whenever the current value changes on any thread.":"每当当前值在任何线程上更改时调用的委托。"," indicating whether the message was consumed. If the target never attempts to consume or release the message, the returned task will never complete.":"指示该消息是否被消耗。 如果目标从未尝试消耗或发布消息，则返回的任务将永远不会完成。","The value to be written as a JSON literal true or false as part of the name/value pair.":"作为名称/值对的一部分，将其写入JSON字面的真实或错误。","A cancellation token that may be used to cancel the read operation.":"可以用来取消读取操作的取消令牌。","The value of the ambient data. If no value has been set, the returned value is ":"环境数据的值。 如果未设置值，则返回的值为","The UTF-16 encoded property name of the JSON object to be transcoded and written as UTF-8.":"JSON对象的UTF-16编码属性名称要转码并编写为UTF-8。","The cancellation token with which to request cancellation of the send operation.":"取消代币要求取消发送操作。","The data's current value.":"数据的当前值。"," that can be used to cancel the read operation.":"可以用来取消读取操作。"," that represents the asynchronous send.  If the target accepts and consumes the offered element during the call to SendAsync, upon return from the call the resulting ":"这代表异步发送。 如果目标在呼叫sendAsync期间接受并消耗了所提供的元素，则从呼叫返回后，","The JSON encoded property name of the JSON object to be transcoded and written as UTF-8.":"JSON编码的JSON对象的属性名称要转码并编写为UTF-8。","The data's previous value.":"数据的先前值。","A token that may be used to cancel the read operation.":"可以用来取消读取操作的令牌。"," property will return true.  If the target declines the offered element during the call, upon return from the call the resulting ":"属性将返回true。 如果目标在呼叫期间拒绝所提供的元素，则从呼叫返回后，","The value to be written as a JSON literal true or false as an element of a JSON array.":"将其写入JSON的真实或错误作为JSON数组的元素。"," if the value changed because of a change of execution context; otherwise, ":"如果由于执行上下文的变化而变化了值； 否则，","The UTF-8 encoded value to be written as a JSON comment within ":"UTF-8编码值将写为JSON评论"," property will return false. If the target postpones the offered element, the element will be buffered until such time that the target consumes or releases it, at which point the Task will complete, with its ":"属性将返回false。 如果目标推迟所提供的元素，则该元素将被缓冲到目标消耗或释放它的时间，此时任务将完成，以便及时完成。"," which may be used to cancel the read operation.":"可以用来取消读取操作。"," to set the initial state to signaled; ":"将初始状态设置为信号；"," representation of the provided JSON array.":"提供的JSON数组的表示。"," indicating whether the message was consumed. If the target never attempts to consume or release the message, the returned task will never complete.  \n  \n If cancellation is requested before the target has successfully consumed the sent data, the returned task will complete in the Canceled state and the data will no longer be available to the target.":"指示该消息是否被消耗。 如果目标从未尝试消耗或发布消息，则返回的任务将永远不会完成。 \n  \n  如果在目标成功消费已发送数据之前请求取消，则返回的任务将在已取消的状态下完成，并且数据将不再可用于目标。","The UTF-16 encoded value to be written as a UTF-8 transcoded JSON comment within ":"UTF-16编码值将以UTF-8的transcodode transcoded json注释编写","The source from which to receive.":"接收的来源。","The UTF-8 ":"UTF-8"," to set the initial state to non-signaled.":"将初始状态设置为无标记。","The value to be written as a JSON number as part of the name/value pair.":"作为名称/值对的一部分，要写入JSON编号的值。","The maximum number of messages. The default is -1, which indicates an unlimited number of messages.":"最大消息数。 默认值为-1，表示无限数量的消息。","Options to control the conversion behavior.":"控制转换行为的选项。","The number of participating threads.":"参与线程的数量。","The value to be written as a JSON number as an element of a JSON array.":"将其写入JSON编号为JSON数组的元素。","The JSON string representation of the value.":"值的JSON字符串表示。","The token.":"令牌。"," to be executed after each phase. null (Nothing in Visual Basic) may be passed to indicate no action is taken.":"在每个阶段之后执行。 无效（视觉基本中的任何内容）可以传递以表明不采取任何措施。","The raw JSON content to write.":"原始的JSON内容要写。"," representation of the value.":"值的表示。"," if ordered processing should be enforced; otherwise, ":"如果订购的处理应执行； 否则，","The phase number of the barrier in which the new participants will first participate.":"新参与者将首先参与的障碍的阶段数。"," to validate if the input is an RFC 8259-compliant JSON payload; ":"验证输入是否为RFC 8259符合的JSON有效载荷；","The JSON writer to write to.":"JSON作家写信。","The format string to use when a block is queried for its name.":"查询块的名称时要使用的格式字符串。","The task scheduler.":"任务调度程序。","The UTF-8 encoded property name of the JSON array to be written.":"要编写的JSON数组的UTF-8编码属性名称。","The number of additional participants to add to the barrier.":"增加障碍的其他参与者的数量。","The value to convert and write.":"转换和写入的值。","Returns  ":"返回","The name of the type that represents the compiled regular expression.":"代表编译正则表达式的类型的名称。","true to release both managed and unmanaged resources; false to release only unmanaged resources.":"确实释放托管和不受管理的资源； 错误以仅发布非管理资源。","The UTF-16 encoded property name of the JSON array to be transcoded and written as UTF-8.":"json数组的UTF-16编码属性名称将被转码并编写为UTF-8。","The ID of the message. Must be unique within the originating source block. It does not need to be globally unique.":"消息的ID。 在原始源块中必须是唯一的。 它不需要在全球范围内独一无二。","The namespace to which the new type belongs.":"新类型所属的名称空间。","Options to control serialization behavior.":"控制序列化行为的选项。","The JSON encoded property name of the JSON array to be transcoded and written as UTF-8.":"JSON编码的JSON数组的属性名称将被转码并编写为UTF-8。","The number of additional participants to remove from the barrier.":"从障碍物中删除的其他参与者的数量。","A JSON writer to write to.":"JSON作家要写。","A boxed ":"一个盒子"," to make the compiled regular expression publicly visible; otherwise, ":"使汇编的正则表达式公开可见； 否则，","(-1) to wait indefinitely.":"（-1）无限期地等待。","Another  ":"其他","The value to be written as a JSON string as part of the name/value pair.":"作为名称/值对的一部分，要写入JSON字符串的值。","The default time-out interval for the regular expression.":"正则表达式的默认超时间隔。","A JSON string representation of the value.":"值的JSON字符串表示。","The ID contained in the  ":"ID包含在"," if all participants reached the barrier within the specified time; otherwise ":"如果所有参与者在指定的时间内都达到了障碍； 否则"," if the regular expression has public visibility; otherwise, ":"如果正则表达式具有公众知名度； 否则，","The UTF-8 encoded value to be written as a JSON string as part of the name/value pair.":"UTF-8编码值将作为JSON字符串写为名称/值对的一部分。"," if the ID of the message is different from 0. ":"如果消息的ID与0不同。","The writer to write.":"作家写的。"," to observe.":"观察。","The UTF-16 encoded value to be written as a UTF-8 transcoded JSON string as part of the name/value pair.":"UTF-16编码值将作为名称/值对的一部分编写为UTF-8转码JSON字符串。"," if all participants reached the barrier within the specified time; otherwise, ":"如果所有参与者在指定的时间内都达到了障碍； 否则，"," if the ID of the message is 0.":"如果消息的ID为0。","The default maximum time interval that can elapse in a pattern-matching operation before a ":"默认的最大时间间隔，可以在模式匹配操作中复活","The UTF-8 stream to write to.":"UTF-8流写入。","The JSON encoded value to be written as a UTF-8 transcoded JSON string as part of the name/value pair.":"JSON编码值将作为名称/值对的一部分写成UTF-8转码JSON字符串。","The maximum number of messages.":"最大消息数。","The name of the new type.":"新类型的名称。"," if all other participants reached the barrier; otherwise, ":"如果所有其他参与者都达到了障碍； 否则，","The value to be written as a UTF-8 transcoded JSON string as part of the name/value pair.":"作为名称/值对的一部分，将以UTF-8转码JSON字符串写入的值。"," to greedily consume offered messages; otherwise, ":"贪婪地消费提供的消息； 否则，","A token that may be used to cancel the write operation.":"可以用来取消写操作的令牌。","The namespace of the new type.":"新类型的名称空间。","Returns the number of the barrier's current phase.":"返回屏障当前阶段的数量。"," that can be used to cancel the write operation.":"可以用来取消写操作。","The value to be written as a JSON string as an element of a JSON array.":"将其写入JSON字符串作为JSON数组的元素。","The maximum number of groups.":"最大组数。","A JSON string representation of the value, encoded as UTF-8 bytes.":"该值的JSON字符串表示形式，编码为UTF-8字节。","The predicate value must successfully pass in order for it to be received.  ":"谓词值必须成功通过才能接收。","The input text processed by the regular expression engine when the time-out occurred.":"定时出现时正则表达引擎处理的输入文本。","Returns the total number of participants in the barrier.":"返回障碍物中的参与者总数。","The UTF-8 encoded value to be written as a JSON string element of a JSON array.":"UTF-8编码值写为JSON数组的JSON字符串元素。","A UTF-8 representation of the value.":"值的UTF-8表示。","Returns the number of participants in the barrier that haven't yet signaled in the current phase.":"返回障碍物中尚未在当前阶段发出信号的参与者数量。",".  \n  \n If the message requested is not available, the return value will be null.":"。 \n  \n  如果请求的消息不可用，则返回值将为null。","The pattern used by the regular expression engine when the time-out occurred.":"定时出现时正则表达引擎使用的图案。","The UTF-16 encoded value to be written as a UTF-8 transcoded JSON string element of a JSON array.":"UTF-16编码值将写为JSON数组的UTF-8转码JSON字符串元素。","General-purpose option values. These are the same settings that are applied if a ":"通用选项值。 这些是相同的设置，如果","Links the  ":"链接","The number of signals initially required to set the ":"最初设置的信号数量","The time-out interval.":"超时间隔。"," member isn't specified.":"成员未指定。","The value by which to increase ":"增加的价值","The JSON encoded value to be written as a UTF-8 transcoded JSON string element of a JSON array.":"JSON编码值将写为JSON数组的UTF-8转码JSON字符串元素。"," to the specified  ":"到指定的","The serialization information object to populate with data.":"序列化信息对象用数据填充。","Option values appropriate to Web-based scenarios.":"选项值适用于基于Web的方案。","The total number of bytes committed to the output by the ":"通过","The destination for this serialization.":"此序列化的目的地。","The number of signals required to set the ":"设置所需的信号数","The target block to which to connect this source.":"连接此源的目标块。"," so far.":"至今。"," to reason about.":"推理。","The regular expression input text.":"正则表达输入文本。","An object that configures the link.":"配置链接的对象。"," if the signal caused the count to reach zero and the event was set; otherwise, ":"如果信号导致计数达到零，并设置了事件； 否则，","The regular expression pattern.":"正则表达方式。","The options instance to copy options from.":"从中复制选项的选项实例。","The number of bytes written so far by the ":"到目前为止写的字节数","The number of signals to register.":"要注册的信号数。","A disposable object that unlinks the source from the target when its ":"一个一次性对象，该对象将源与目标相关时，"," that have not yet been flushed to the output and committed.":"尚未冲洗到输出并承诺。","The error that occured during parsing.":"解析过程中发生的错误。","The type to return a converter for.":"返回转换器的类型。"," if the signals caused the count to reach zero and the event was set; otherwise, ":"如果信号导致计数达到零，并设置了事件； 否则，","The function to invoke with each data element received.":"调用每个数据元素的功能。","The custom behavior of this instance of the writer for formatting, validating, and escaping.":"作者的这一实例的自定义行为用于格式化，验证和逃脱。"," if the increment succeeded; otherwise, false. If ":"如果增量成功； 否则，错误。 如果","The offset at which the parse error occurs.":"解析错误发生的偏移。"," if the target must call ":"如果目标必须打电话","The first converter that supports the given type, or ":"支持给定类型的第一个转换器或"," is already at zero, this method will return ":"已经处于零，此方法将返回","The substring that was captured by the match.":"比赛捕获的子字符串。","A capture number.":"捕获号码。"," is returned as a notification that the target may later attempt to consume or reserve the message; in the meantime, the source still owns the message and may offer it to other blocks.  \n  \n If the target would have otherwise postponed but source was ":"作为通知返回，即目标稍后可能会尝试消费或保留消息； 同时，源仍然拥有该消息，并可能将其提供给其他块。 \n  \n  如果目标本来可以推迟但来源是"," if there is no converter.":"如果没有转换器。"," is already at zero this will return ":"已经在零处，这将返回","The zero-based starting position in the original string where the captured substring is found.":"在发现捕获的子字符串的原始字符串中基于零的起始位置。"," if an extra comma at the end of a list of JSON values in an object or array is allowed (and ignored); ":"如果在对象或数组中的JSON值列表的末尾进行额外的逗号，则允许（并忽略）；","The number of input items.":"输入项目的数量。","The starting position of the capture.":"捕获的起始位置。"," was set; otherwise, ":"被设定了； 否则，","The function to invoke with each data element received. All of the data from the returned ":"调用每个数据元素的功能。 来自返回的所有数据","The ending position of the capture.":"捕获的结局位置。","The length of the captured substring.":"捕获的子弦的长度。","The list of custom converters.":"自定义转换器列表。","The number of remaining signals required to set the event.":"设置事件所需的剩余信号数。"," will be made available as output from this ":"将作为输出提供","A character to test.":"测试角色。","The default buffer size in bytes.":"字节中的默认缓冲区大小。","The substring that is captured by the match.":"比赛捕获的子字符串。","The function to invoke with each data element received. All of the data from the returned in the ":"调用每个数据元素的功能。 来自返回的所有数据","The number of signals initially required to set the event.":"最初设置事件所需的信号数。","The internal name of a character class.":"字符类的内部名称。"," will be made available as output from this  ":"将作为输出提供","The policy used to convert a ":"用于转换的政策","The span that is captured by the match.":"比赛捕获的跨度。"," if the current count is zero; otherwise, ":"如果当前计数为零； 否则，","The function to invoke with each data element received. All of the data asynchronously returned in the ":"调用每个数据元素的功能。 所有数据都不同步返回"," parameter is in the character class specified by the ":"参数位于字符类中"," key's name to another format.":"钥匙的名称为另一种格式。","The array the collection is to be copied into.":"该系列将被复制成阵列。","The JavaScript character encoding.":"JavaScript字符编码。"," that is used to wait for the event to be set.":"用来等待设置事件。"," through OfferMessage ":"通过Offermessage","The position in the destination array where copying is to begin.":"目的地阵列中的位置要开始复制。"," to ignore null values during serialization and deserialization; otherwise, ":"在序列化和避免时忽略零值； 否则，","A character.":"一个人物。","  \n  \n If the message requested is not available, the return value will be ":"如果未请求的消息可用，则返回值将为"," to set it to nonsignaled.":"将其设置为非信号。","An object that contains all ":"一个包含全部的对象"," if read-only fields should be ignored during serialization; ":"如果在序列化过程中应忽略仅阅读字段；","The character category.":"角色类别。"," is returned, and the source should no longer use the offered message, as it is now owned by the target. If the message was postponed by the target, ":"返回，源不应再使用所提供的消息，因为它现在归目标。 如果消息是由目标推迟的"," objects within the ":"中的对象"," values that determines whether the event resets automatically or manually.":"确定事件是自动重置还是手动重置的值。"," to ignore read-only properties during serialization; otherwise, ":"忽略序列化过程中仅阅读属性； 否则，","The maximum depth allowed when serializing or deserializing JSON.":"序列化或应对JSON时允许的最大深度。","A number to save.":"一个要保存的数字。","The start index, inclusive.":"开始索引，包括。"," to set the initial state to signaled if the named event is created as a result of this call; ":"将初始状态设置为信号，如果该呼叫的结果创建了命名事件；","Calling this method always throws ":"打电话总是抛出"," to compare property names using case-insensitive comparison; otherwise, ":"使用对案例不敏感的比较比较属性名称； 否则，","The end index, exclusive.":"最终索引，独家。","The possible boundary position.":"可能的边界位置。","The object to insert into the collection.":"插入集合中的对象。","The name, if the synchronization object is to be shared with other processes; otherwise, ":"该名称，如果要与其他进程共享同步对象； 否则，","A property naming policy, or ":"财产命名政策，或"," or an empty string. The name is case-sensitive.":"或一个空字符串。 该名称对大小写。","The delegate that is invoked once per iteration.":"每次迭代一次被调用的代表。","The starting position.":"起始位置。","Index into the capture collection.":"索引捕获集合。"," to leave property names unchanged.":"保持财产名称不变。","The ending position.":"结束位置。","The captured substring at position ":"位置捕获的子字符串","A  structure that contains information about which portion of the loop completed.":"一个结构，其中包含有关循环的哪些部分完成的信息。"," if a local event was created (that is, if ":"如果创建了本地事件（也就是说","A value that indicates whether comments are allowed, disallowed, or skipped.":"表示是否允许，禁止或跳过评论的值。","The possible ECMA boundary position.":"可能的ECMA边界位置。",", since the collection has a fixed size.":"，由于该系列的尺寸固定。","A structure that contains information about which portion of the loop completed.":"一个结构，其中包含有关循环的哪些部分完成的信息。"," or an empty string) or if the specified named system event was created; ":"或一个空字符串）或如果创建了指定的命名系统事件；","The capture number.":"捕获号码。"," if JSON should pretty print on serialization; otherwise, ":"如果JSON应该在序列化上打印出漂亮的印刷； 否则，","An object that configures the behavior of this operation.":"配置此操作行为的对象。","A regular expression ":"正则表达式","An instance of the regular expression engine.":"正则表达引擎的实例。"," if the specified named system event already existed. This parameter is passed uninitialized.":"如果指定的命名系统事件已经存在。 该参数通过非初始化。","The JavaScript character encoder used to override the escaping behavior.":"JavaScript字符编码器用于覆盖逃脱的行为。","The collection of substrings matched by the group.":"小组匹配的子字符串的集合。"," structure that contains information on what portion of the loop completed.":"结构包含有关循环的哪些部分完成的信息。","The text to scan for a pattern match.":"要扫描图案匹配的文本。","The name of the capturing group represented by the current instance.":"由当前实例表示的捕获组的名称。","The name of the synchronization object to be opened and shared with other processes. The name is case-sensitive.":"要打开并与其他进程共享的同步对象的名称。 该名称对大小写。"," to format the JSON output; ":"格式化JSON输出；","The zero-based starting position in ":"基于零的起始位置"," if the match is successful; otherwise, ":"如果比赛成功； 否则，"," to write without any extra white space. The default is ":"写信而没有任何额外的空白。 默认值为","The function delegate that returns the initial state of the local data for each task.":"返回每个任务本地数据的初始状态的函数委托。"," to skip structural validation and allow invalid JSON; ":"跳过结构验证并允许无效的JSON；","An  object that represents the named system event.":"代表命名系统事件的对象。"," at which the regular expression engine scans for a match.":"正则表达引擎扫描匹配。","A string with the name of the captured group to locate.":"一个带有捕获组名称的字符串。","The delegate that performs a final action on the local state of each task.":"对每个任务的本地状态执行最终行动的代表。"," to throw an ":"扔一个"," if the operation succeeds; otherwise, ":"如果操作成功； 否则，"," if the group collection contains a captured group identified by ":"如果组集合包含一个确定的捕获组","The function delegate that returns the initial state of the local data for each thread.":"返回每个线程的本地数据的初始状态的函数委托。"," on any attempt to write invalid JSON.":"任何尝试编写无效的JSON的尝试。","The zero-based ending position in ":"基于零的结局位置"," object that represents the named synchronization event if the call succeeded, or ":"如果呼叫成功，则表示指定同步事件的对象，或","The zero-based starting position to scan for this match.":"基于零的起始位置扫描这场比赛。","The position in the destination array where the copying is to begin.":"在目标数组中的位置要开始复制。"," if the call failed. This parameter is treated as uninitialized.":"如果呼叫失败。 该参数被视为非初始化。","The delegate that performs a final action on the local state of each thread.":"对每个线程的本地状态执行最终动作的代表。","Options to control the behavior.":"控制行为的选项。","The number of characters in the previous match.":"上一场比赛中的字符数。","The one-dimensional array that is the destination of the elements copied from the group collection. The array must have zero-based indexing.":"一维数组是从组集合复制的元素的目的地。 该数组必须具有零基索引。","The orderable partitioner that contains the original data source.":"包含原始数据源的订购分区器。","The items to add to the new ":"要添加到新的项目"," if the named synchronization event was opened successfully; otherwise, ":"如果成功打开了命名的同步事件； 否则，","The new instance of the ":"新实例","The partitioner that contains the original data source.":"包含原始数据源的分区器。","An enumerator that contains all ":"一个包含全部的枚举者"," to search for a match in quick mode; otherwise, ":"在快速模式下搜索比赛； 否则，",". In some cases, ":"。 在某些情况下，"," class that contains items from the specified ":"包含指定项目的项目","An enumerable data source.":"枚举数据源。","A match.":"比赛。"," may be returned for invalid names.":"可以返回以获取无效的名称。","The group to add to the collection.":"小组添加到集合中。","The group to locate in the group collection.":"该小组位于组集合中。","The index of item if found in the list; otherwise, -1.":"如果在列表中找到了项目索引； 否则，-1。","An asynchronous delegate that is invoked once per element in the data source.":"数据源中每个元素一次调用一次异步委托。"," object representing the execution context for the current thread.":"代表当前线程的执行上下文的对象。","The timeout interval.":"超时间隔。","A task that represents the entire ":"代表整个的任务"," if the group item is found in the group collection; ":"如果在组集合中找到了组项目；","Options to control the serialization behavior.":"控制序列化行为的选项。"," object representing the current execution context.":"代表当前执行上下文的对象。","A saved capture number.":"保存的捕获号码。","The JSON Path value.":"JSON路径值。"," to implicitly convert.":"隐式转换。"," if the flow is suppressed; otherwise, ":"如果流动被抑制； 否则，"," object designed to execute a specific compiled regular expression.":"旨在执行特定编译的正则表达式的对象。","A value converted from the ":"从","The group to remove.":"的基团除去。","The ExecutionContext to set.":"executionContext设置。"," instance converted from the ":"实例从","The exception that is the cause of this exception.":"例外情况的例外。","The maximum number of items the bounded channel may store.":"有限通道可能存储的最大项目数量。","An enumerator that contains all names and objects in the ":"一个包含所有名称和对象的枚举者"," delegate that represents the method to be run in the provided execution context.":"代表在提供的执行上下文中运行的方法的委托。","Options to control the node behavior after parsing.":"解析后控制节点行为的选项。","The cancellation token to use to cancel the enumeration. If data is immediately ready for reading, then that data may be yielded even after cancellation has been requested.":"取消令牌用于取消枚举。 如果数据立即准备好读取，那么即使已要求取消后，该数据也可以产生。","The maximum number of items the channel may store.":"频道可能存储的最大项目数量。"," objects in the group collection.":"组集合中的对象。","The object to pass to the callback method.":"传递到回调方法的对象。","The created async enumerable.":"创建的异步枚举。","Options to control the document behavior during parsing.":"在解析过程中控制文档行为的选项。","The created channel.":"创建的频道。"," structure for restoring the flow.":"恢复流量的结构。"," used to cancel the read operation.":"用于取消读取操作。"," if found; otherwise, -1.":" 如果找到；否则，-1。"," from the reader.":"来自读者。","Options that guide the behavior of the channel.":"指导频道行为的选项。","An object representing the host execution context state.":"表示主机执行上下文状态的对象。","The peeked item, or a default value if no item could be peeked.":"窥视物品，或默认值，如果无法窥视任何项目。","The position at which to insert the group.":"插入小组的位置。","JSON representation of current instance.":"当前实例的JSON表示。","The group to insert.":"小组插入。"," if an item was read; otherwise, ":"如果读取物品； 否则，"," object representing the host context for the current thread.":"代表当前线程的主机上下文的对象。","Delegate that will be called when item is being dropped from channel. See ":"当项目从通道中删除时将调用的委托. 见 ","A string representation for the current value appropriate to the node type.":"适用于节点类型的当前值的字符串表示。","The zero-based index of the group to remove.":"该组的基于零的索引要删除。","The read item, or a default value if no item could be read.":"读取项目或默认值如果无法读取项目。","The name of the property to return.":"返回的属性名称。"," being cast.":"被铸造。","The object to add to the group collection.":"要添加到组集合的对象。"," result when space is available to write an item\n            or with a ":" 当有空间写入项目时，结果\n            或与 ","The readable half.":"可读的一半。"," used to cancel the wait operation.":"用于取消等待操作。","The properties to be added.":"要添加的属性。"," if peeking is supported by this channel instance; ":"如果此频道实例支持窥视；","A string with the group name key to look for.":"一个带有组名称键的字符串。"," result when no further writing will be permitted.":"当不允许进一步写作时，结果。","The writable half.":"可写的一半。","Optional Exception indicating a failure that's causing the channel to complete.":"可选异常，表明导致通道完成的故障。"," instance from other ":"实例来自其他","The value to write to the channel.":"写入频道的值。"," indicating the failure causing no more data to be written, or null for success.":"表明故障导致不再写数据或成功的零数据。"," used to cancel the write operation.":"用于取消写操作。"," if this operation successfully completes the channel; otherwise, ":"如果此操作成功完成了频道； 否则，","An object or array of objects that represent the input or output buffer for the operation, or ":"表示操作的输入或输出缓冲区的对象或对象数组，或 "," if the channel could not be marked for completion,\n            for example due to having already been marked as such, or due to not supporting completion.\n          .":"如果无法将频道标记为完成， \n             例如，由于已经被标记为这样，或者由于不支持完成。 \n           。",". Each object represents a buffer, such an array of bytes.":"。 每个对象代表一个缓冲区，例如一个字节。"," that represents the asynchronous write operation.":" 即表示异步写操作。","The item to write.":"要写的项目。","An object from which to create the ":"从中创建的对象","The error code.":"错误代码。"," if the item was written; otherwise, ":"如果书写； 否则，"," that will complete with a ":"这将结合","An object that holds the operating system handle. The handle must have been opened for overlapped I/O in unmanaged code.":"容纳操作系统手柄的对象。 该手柄必须在不受管理的代码中为重叠的I/O打开。","The number of bytes that are transferred.":"传输的字节数。",", which is bound to the system thread pool.":"，它与系统线程池绑定。"," representing an unmanaged pointer to the native overlapped value type.":"代表非托管指针指向本机重叠的值类型。"," structure from which to return the associated user-provided object.":"从哪些结构返回关联的用户提供的对象。","The low word of the file position at which to start the transfer.":"启动传输的文件位置的低词。"," instances, or ":"实例，或","The high word of the file position at which to start the transfer.":"启动传输的文件位置的高词。"," if one was not specified when the instance was allocated by calling the ":"如果未指定当实例分配时通过调用","The handle to an event that is signaled when the I/O operation is complete.":"I/O操作完成时发出信号的事件的手柄。"," interface and provides status information on the I/O operation.":"接口并提供有关I/O操作的状态信息。"," structure to be freed.":"释放的结构。"," delegate that represents the callback method invoked when the asynchronous I/O operation completes.":"代表异步I/O操作完成时调用的回调方法的委托。","An unmanaged pointer to a ":"一个非托管的指针","An object or array of objects representing the input or output buffer for the operation. Each object represents a buffer, for example an array of bytes.":"表示操作的输入或输出缓冲区的对象或对象数组。 每个对象表示一个缓冲区，例如一个字节数组。"," value representing the handle of the synchronization event.":"代表同步事件的手柄的值。"," representing the handle of the event.":"代表事件的手柄。"," value representing the high word of the file position.":"代表文件位置的高词的值。"," value representing the low word of the file position.":"代表文件位置低字的值。","A delegate that represents the callback method to invoke when each asynchronous I/O operation completes.":"代表每个异步I/O操作完成时要调用的回调方法的委托。","A user-supplied object that distinguishes the ":"用户提供的对象区分"," instance produced from this object from other ":"从该对象产生的实例从其他对象产生"," instances. Its value can be ":"实例。 它的价值可以是","An object or array of objects that represent the input or output buffer for the operations. Each object represents a buffer, such as an array of bytes. Its value can be ":"代表操作的输入或输出缓冲区的对象或对象数组。 每个对象代表一个缓冲区，例如一个字节数组。 它的价值可以是"," delegate that represents the callback method invoked when each asynchronous I/O operation completes.":"代表每个异步I/O操作完成时调用的回调方法的委托。","A user-provided object that distinguishes ":"区分用户提供的对象"," instances. Can be ":"实例。 可","An object or array of objects representing the input or output buffer for the operations. Each object represents a buffer, for example an array of bytes.  Can be ":"代表操作的输入或输出缓冲区的对象或对象数组。 每个对象代表一个缓冲区，例如一个字节数组。 可","A delegate that represents the callback method to invoke when the asynchronous I/O operation completes.":"一个代表回调方法在异步I/O操作完成时调用的委托。","A user-provided object that distinguishes this ":"用户提供的对象，以区分此"}