{" value that represents the text run used for the text marker.":"代表用于文本标记的文本运行的值。","The x-coordinate of the transform center. The default is ":"转换中心的X坐标。 默认值为","Result of the union of ":"结合的结果","The index of the 3-D visual object in the collection.":"集合中的3-D视觉对象的索引。","The percentage of download progress for content located at a remote server represented by a value between 0 and 1. The default is 0.":"位于远程服务器的内容的下载进度百分比为0到1之间的值。默认值为0。","The child in the collection at the specified index.":"收藏中的孩子在指定的索引上。","The y-coordinate of the transform center. The default is ":"转换中心的Y坐标。 默认值为","The character index position where text retrieval stops.":"字符索引位置文本检索停止。","true if the media has audio output; otherwise, false.":"如果媒体有音频输出，则为是真的； 否则，错误。"," value that represents the result of the union of ":" 表示联合的结果的值 "," that contains child ":"其中包含孩子"," value that represents the text span immediately before ":"立即表示文本跨度的值","true if the media has video output; otherwise, false.":"如果媒体有视频输出，则为是真的； 否则，错误。"," is the empty rectangle; ":"是空的矩形；","The current skewing transformation value as a ":"当前的偏斜转换值作为一个"," character index to map.":"字符索引映射。"," that comprises the content of the ":"这包括","The color to apply to the fill.":"适用于填充物的颜色。"," character index.":"字符索引。","true if the media is buffering; otherwise, false.":"如果媒体正在缓冲，则是真的； 否则，错误。"," set on the ":"放在"," that represents the origin of the ":"代表了","The binary reader to read the ":"二进制读者阅读",", typically the back bottom left corner.  The default value is (0,0,0).":"，通常是左下角。 默认值为（0,0,0）。","Specifies the character index position in the ":"指定字符索引位置","true if the media is muted; otherwise, false.":"如果媒体被静音，则是真的； 否则，错误。","The number of child objects.":"子对象的数量。","The brush's color. The default value is ":"刷子的颜色。 默认值是"," that specifies the area of the ":"指定了","The natural duration of the media. The default is ":"媒体的自然持续时间。 默认值为"," that specifies the camera position.":"指定相机位置。"," is retrieved.":"检索。","The pixel height of the video.":"视频的像素高度。"," describes a geometry shape; otherwise, ":"描述几何形状； 否则，","Double that specifies the size of the ":"两倍指定大小","A value that represents a ":"代表一个的值"," that specifies the direction of the camera's projection.":"这指定了相机投影的方向。","Value of the X coordinate of the ":"x坐标的值"," object has a curved segment; otherwise, ":"对象具有弯曲段； 否则，","The pixel width of the video.":"视频的像素宽度。",", or an object derived from ":"，或从"," that specifies the upward direction according to the perspective of the onlooker.":"这根据旁观者的视角指定了向上的方向。","Value of the Y coordinate of the ":"y坐标的值","The width of the camera's viewing box, in world units.":"在世界单位中，摄像机的查看框的宽度。"," value that represents the number of characters in the text span.":"代表文本跨度字符数的值。"," that can be used to describe this ":"可以用来形容这个","The current position of the media.":"媒体的当前位置。"," object's contents.":"对象的内容。"," if scrubbing is enabled; otherwise, ":"如果启用了擦洗； 否则，","Value of the Z coordinate of the ":"z坐标的值","The object associated with the text span.":"与文本跨度关联的对象。","Width of the camera's viewing box, in world units.":"在世界单位中，相机查看框的宽度。","Object to convert to an instance of Rect3D.":"对象转换为rect3d的实例。","The current media ":"当前的媒体","The destination point for the end of the arc.":"弧线末端的目的点。","Point3D that specifies the camera's position.":"指定相机位置的Point3D。"," value that represents the length of the text span.":"代表文本跨度的长度。","Rect3D that was constructed.":"构造的rect3d。","The ratio of speed that media is played back represented by a value between 0 and the largest double value. The default is 1.0.":"播放媒体的速度比例为0到最大的双重值的值表示。 默认值为1.0。","The radii (half the width and half the height) of an oval whose perimeter is used to draw the angle. If the oval is very rounded in all directions, the arc will be rounded, if it is nearly flat, so will the arc. For example, a very large width and height would represent a very large oval, which would give a slight curvature for the angle.":"椭圆形的半径（宽度的一半和一半），其周长用于绘制角度。 如果椭圆形在各个方向都非常圆形，则弧线将被舍入圆形，如果几乎是平坦的，则弧线也将被绕。 例如，非常大的宽度和高度将代表一个非常大的椭圆形，这将使角度略有曲率。"," that represents the alignment of text at the tab location.":"这表示在选项卡位置的文本对齐。","The type to which the Rect3D instance will be converted.":"RECT3D实例将转换的类型。","The media's volume represented on a linear scale between 0 and 1. The default is 0.5.":"介质的音量在0到1之间表示为线性比例。默认值为0.5。","Vector3D that specifies the direction of the camera's projection.":"Vector3D指定相机投影的方向。","The rotation angle of the oval that specifies the curve. The curvature of the arc can be rotated with this parameter.":"指定曲线的椭圆形的旋转角。 弧的曲率可以使用此参数旋转。"," value that represents the tab location.":"代表标签位置的值。","The type of script command.":"脚本命令的类型。","Vector3D that specifies the upward direction according to the perspective of the onlooker.":"根据旁观者的角度指定向上方向的vector3d。","Rotation3D that specifies the rotation.":"旋转3D指定旋转。"," value that represents the tab leader.":"代表标签领导者的值。"," to draw the arc greater than 180 degrees; otherwise, ":"绘制大于180度的弧度； 否则，","The arguments associated with the script command type.":"与脚本命令类型关联的参数。","Width of the camera's angle of projection, specified in degrees.":"相机投影角的宽度，以度为单位。","Double that specifies the X value about which to rotate.":"双重指定要旋转的x值。","A value that indicates whether the arc is drawn in the ":"一个指示是否绘制弧的值"," value that represents the specific character in text that is aligned at tab location.":"代表在选项卡位置对齐的文本中特定字符的值。","Double that specifies the Y value about which to rotate.":"双倍指定y值旋转的值。","The time to begin the timeline.":"开始时间线的时间。","The camera's horizontal field of view, in degrees. The default value is ":"相机的水平视场，以度为单位。 默认值为 "," direction.":"方向。"," value representing the index.":"代表索引的值。","Double that specifies the Z value about which to rotate.":"双重指定Z值旋转的值。","The time to begin media playback.":"开始媒体播放的时间。"," value of the new ":"新价值"," to make the segment stroked when a ":"在"," that represents the alignment of the text at the tab location.":"这表示在选项卡位置的文本对齐。","The length of time for media playback.":"媒体播放的时间长度。","Center of the transformation's rotation.":"转换旋转的中心。"," value that represents the tab leader location.":"代表标签领导者位置的值。"," to treat the join between this segment and the previous segment as a corner when stroked with a ":"当用a抚摸"," structure and if it is also identical to this ":"结构以及与此相同的话","The repeat behavior to use when the playback duration has been reached.":"到达播放持续时间时要使用的重复行为。","Double that represents the X coordinate of the ":"代表x坐标的双坐标"," that represents the width for which the specified collapsed text range is constrained to.":"这代表了指定的折叠文本范围被限制为的宽度。"," where the figure begins.":"图开始的地方。"," values for ":"值","The media source for the timeline.":"时间轴的媒体来源。","Double that represents the Y coordinate of the ":"代表y坐标的双倍"," that represents the width.":"这代表宽度。"," structure to transform.":"结构转换。"," to use the area contained by this figure for hit-testing, rendering, and clipping; otherwise, ":"使用该图所包含的区域进行命中测试，渲染和剪辑； 否则，","Double that represents the Z coordinate of the ":"代表z坐标的双倍"," for this timeline.":"对于此时间表。","The output bounds of the ":"输出范围"," structure to use for the transformation.":"用于转换的结构。"," to close the figure; otherwise, ":"关闭数字； 否则，"," to check if the timeline can be frozen; ":"检查时间轴是否可以冷冻；","Rotation3D that specifies an angle of rotation about an axis.":"旋转3D指定围绕轴的旋转角度。","A value that specifies the horizontal position of ":"指定水平位置的值","A transformed ":"一个转变","Matrix3D that represents the rotation.":"代表旋转的matrix3d。"," to freeze the timeline.":"冻结时间表。",". For example, if two connecting lines are drawn, and ":"。 例如，如果绘制了两个连接线，并且"," structure, the result of transforming ":"结构，转化的结果"," content in its base tile. The default value is ":"内容在其基础瓷砖中。 默认值是","String that represents the current Object.":"表示当前对象的字符串。",", the drawing will just be of two lines but if ":"，图纸只有两行，但如果"," if it cannot be made unmodifiable, with the side effect of having made the actual change in frozen status to this object.":"如果无法使其无法解码，则具有对该对象进行冻结状态的实际更改的副作用。","A value that specifies the vertical position of ":"指定垂直位置的值","The amount to change the ":"更改的金额",", the two lines will be closed to create a triangle.":"，这两条线将被关闭以创建一个三角形。"," value of the ":"值的值","Formats the value of the current instance using the specified format.":"使用指定格式格式化当前实例的值。","A value that specifies how this ":"指定如何的值","The first control point used to specify the shape of the curve.":"用于指定曲线形状的第一个控制点。"," coordinate of this ":"坐标","Text as a series of Unicode characters.":"文本是一系列Unicode字符。","The string that represents the media source.":"表示媒体源的字符串。"," content is projected onto its base tile. The default value is ":"内容被投影到其基础瓷砖上。 默认值是","The second control point used to specify the shape of the curve.":"第二个控制点用于指定曲线的形状。","The point to add.":"要添加的要点。","The identity ":"身份","The media source associated with the timeline. The default is null.":"与时间轴关联的媒体来源。 默认值为null。","The vector to add.":"向量要添加。","The destination point for the end of the curve.":"曲线末端的目标点。","A value that specifies how the ":"一个指定如何","Factor by which to scale the X value.":"缩放x值的因素。","The base URI of the application context.":"应用程序上下文的基本URI。","The destination point for the end of the line.":"线路结束的目的点。"," tiles fill the output area when the base tile, which is specified by the ":"当基本瓷砖指定的基本瓷砖时，瓷砖填充了输出区域"," structure that is the sum of ":"结构是","The list of points that specify control points and destination points for one or more Bezier curves. The number of points in this list should be a multiple of three.":"指定一个或多个曲线的控制点和目标点的点列表。 此列表中的点数应为三个倍数。","Factor by which to scale the Y value.":"缩放y值的因素。","Identifies the source of the culture value that is used to determine number substitution.":"确定用于确定数字替代的培养价值的来源。"," property, is smaller than the output area. The default value is ":"属性，小于输出区域。 默认值是","The result of converting ":"转换的结果","Factor by which to scale the Z value.":"缩放z值的因素。","The position and dimensions of the ":"的位置和尺寸","The collection of points that specify destination points for one or more connected straight lines.":"指定一个或多个连接直线的目标点的点的集合。","Identifies which culture to use when the value of the ":"确定在价值的价值时使用的文化","The matrix that is used to transform ":"用于转换的矩阵","X coordinate of the center point from which to scale.":"x坐标的x坐标。"," content. The default value is a rectangle (":"内容。 默认值是矩形（","The collection of points that specify control points and destination points for one or more quadratic Bezier curves. The first point in the list specifies the curve's control point, the next point specifies the destination point, the next point specifies the control point of the next curve, and so on. The list must contain an even number of points.":"指定一个或多个二次曲线的控制点和目标点的点的集合。 列表中的第一个点指定了曲线的控制点，下一点指定目标点，下一点指定下一个曲线的控制点，依此类推。 该列表必须包含偶数点。","Identifies the substitution method that is used to determine number substitution.":"标识用于确定数字替代的替换方法。","Y coordinate of the center point from which to scale.":"y坐标的中心点坐标。"," by using ":"通过使用","Z coordinate of the center point from which to scale.":"z坐标的中心点坐标。",") that has a ":"）有一个","The control point used to specify the shape of the curve.":"用于指定曲线形状的控制点。","The element to return a ":"返回的元素"," structure on which to perform subtraction.":"进行减法的结构。","Vector3D along which the transformation scales.":"转换尺度的vector3d。"," that is applied to the ":"适用于"," value for.":"价值。"," of (0,0), and a ":"（0,0）和一个"," structure that represents the difference between ":"代表的结构","Center around which the transformation scales.":"转换尺度的中心。"," to apply to the content of the ":"适用于内容"," of 1.":"1。"," value that represents the culture that is used as an override.":"代表用作替代的文化的价值。"," structure from which to subtract vector.":"从中减去向量的结构。","A value that indicates whether the ":"一个指示是否是否","The clipping region of the ":"剪裁区域","The x-coordinate of the transform's center point. The default value is ":"转换中心点的X坐标。 默认值是","Element that is specifying a culture override.":"指定文化替代的元素。"," value is relative to the bounding box of the ":"值是相对于边界框的","The y-coordinate of the transform's center point. The default value is ":"转换中心点的y坐标。 默认值是","The starting position in the text that the ":"文本中的开始位置"," structure to subtract from point.":"从点减去的结构。","A culture override value of type ":"一种文化覆盖类型的价值","The number of positions in the text that the ":"文本中的位置数量","The changed ":"改变了","A culture source value of type ":"类型的文化源价值"," contents or whether it is an absolute value. The default value is ":"内容或它是否是绝对值。 默认值是","The z-coordinate of the transform's center point. The default value is ":"转换中心点的z坐标。 默认值是","The brush used to apply to the ":"用来涂在上面的刷子","Element that is specifying a substitution method.":"指定替代方法的元素。"," structure, the result of subtracting ":"结构，减法的结果","Scale factor in the x-direction. The default value is ":"x方向的比例因子。 默认值是","The position and dimensions of the base tile for a ":"基础瓷砖的位置和尺寸"," value representing the position in the text that the ":"代表文本中的位置的值",". The default value is a rectangle (":"。 默认值是矩形（","A substitution method value of type ":"类型的替代方法值","Scale factor in the y-direction. The default value is ":"y方向的比例因子。 默认值是"," representation of the 3-D point.":"3-D点的表示。","The polygonal approximation of this ":"此的多边形近似"," value representing the starting position in the text that the ":"代表文本中开始位置的值",") with a ":"）","Scale factor in the z-direction. The default value is ":"z方向的比例因子。 默认值是"," structure from which to subtract ":" 从中减去的结构 ","The number of elements that the new collection is initially capable of storing.":"新集合最初能够存储的元素数量。","Specifies how the error of tolerance is interpreted.":"指定如何解释公差错误。"," of (0,0) and a ":"（0,0）和"," representation of this transformation.":"这种转变的表示。","The z-coordinate of this ":"这个的z协调","The zero-based index at which the value ":"基于零的索引","Indicates whether the value of the ":"指示是否值","Culture-specific formatting information; otherwise, ":"特定于文化的格式信息； 否则，","The instance of Size3D to compare to this instance.":"size3d的实例与此实例进行比较。"," be inserted.":"被插入。",", which describes the size and position of the ":"，描述了","Collection with which to instantiate the Point3DCollection.":"收集可以实例化point3dcollection。"," to use the current culture and default formatting settings.":"使用当前文化和默认格式设置。","The size to convert.":"要转换的大小。","A formatted string representation of this ":"此格式的字符串表示","The zero-based index of the collection from which to get or set the item.":"从中获取或设置项目的集合的零索引。","Integer that specifies the capacity of the Point3DCollection.":"整数指定点3汇总的能力。"," tiles, is relative to the size of the whole output area. The default value is ":"瓷砖相对于整个输出区域的大小。 默认值是"," representation of the three-dimensional size structure.":"三维尺寸结构的表示。","An unmanaged pointer reference to a character string.":"非托管指针引用字符串。"," if this figure's first and last segments are connected; otherwise, ":"如果该图的第一个和最后一个段是连接的； 否则，",", the specified Point3D, is in this Point3DCollection; otherwise, ":"，指定的point3d在此Point3DCollection中； 否则，","Six comma-delimited ":"六个逗号限制","The character array.":"角色阵列。","An empty instance of a ":"一个空的实例","The array that is the destination of the items copied from this Point3DCollection.":"是从该点3DCollection复制的项目的目标。"," values that describe the new ":"描述新的值"," structure is empty; otherwise, ":"结构是空的； 否则，","Determines whether the contained area of this ":"确定是否包含此区域 ","The character buffer offset to the first character.":"字符缓冲区偏移到第一个字符。",". See also Remarks.":"。 另请参见评论。","The Point3D to search for.":"要搜索的Point3D。"," value of this ":"这一点的价值"," is to be used for hit-testing, rendering, and clipping.  The default value is ":"用于击球测试，渲染和剪辑。 默认值是","A new transform that is constructed from the specified string.":"由指定字符串构建的新变换。","The brush applied by the new ":"新的刷子","The character string.":"字符串。","The index position of the specified Point3D.":"指定点3D的索引位置。","The collection of segments that define the shape of this ":"定义此形状的细分市场的集合"," value representing the character buffer of a string.":"代表字符串的字符缓冲区的值。","The specular exponent.":"镜面指数。","The smallest axis-aligned bounding box that can contain the transformed ":"最小的轴线对齐边界框，可以包含转换的","The index position at which to insert the specified Point3D.":"插入指定点3D的索引位置。","An identity transform.":"身份变换。"," object. The default value is an empty collection.":" 对象。 默认值为空集合。","The brush to apply.":"刷子涂抹。"," is equal to 0.":"等于0。","The Point3D to insert.":"点3D插入。","The inverse of this transform, if it exists; otherwise, ":"如果存在这种转换的倒数； 否则，"," value that represents the total number of characters.":"代表字符总数的值。"," begins. The default value is ":"开始。 默认值是","The string representation of the collection of Point3D objects.":"点3D对象集合的字符串表示。","The color with which to filter the material.":"过滤材料的颜色。","The current matrix transformation.":"当前的矩阵变换。","Pointer to character string.":"指向字符串的指针。"," objects which collectively make up the geometry of the ":"集体构成几何形状的对象","The equivalent Point3DCollection.":"等效点3汇总。","Relative contribution, for a material applied as a 2-D brush to a 3-D model, of the specular component of the lighting model.":"相对贡献，用于照明模型的镜面分量的3-D模型的2-D刷子。","The length of ":"长度"," objects that define this ":"定义此的对象","Diffuse color of the new ":"新的颜色","The initial capacity of this ":"最初的能力","The Point3D to remove from this collection.":"从此集合中删除的Point3D。","The offset to the first character to use in ":"对第一个字符的偏移","Position of the new ":"新的位置","A composite of the ":"综合","The index position of the Point3D to remove.":"点3D的索引位置要删除。"," being queried for.":"被询问。","The displacement in the direction of the x-axis.":"X轴方向的位移。"," containing the text characters.":" 包含文本字符。","Direction of the new ":"新的方向 ","The zero-based index of the Point3D object to get or set.":"要获取或设置的Point3D对象的基于零的索引。","The array into which the collection's items are to be copied.":"要将集合的项复制到其中的数组。","The displacement in the direction of the y-axis.":"Y轴方向的位移。","Index of the first character that got hit.":"第一个受到打击的角色的索引。"," at the current position in the collection.":"在集合中的当前位置。","Angle that defines a cone outside which the light does not illuminate objects in the scene.":"定义外部圆锥体的角度，该圆锥形没有照亮场景中的物体。"," at which to start copying the contents of the ":"在其中开始复制内容","In the case of a leading edge, this value is 0. In the case of a trailing edge, this value is the number of code points until the next valid caret position.":"在前沿的情况下，该值为0。在后端的情况下，该值是代码点的数量，直到下一个有效的插入位置为止。","A matrix that represents this ":"代表这个的矩阵","The distance to translate (move) an object along the x-axis. The default value is 0.":"沿x轴翻译（移动）对象的距离。 默认值为0。","The type descriptor context for this call.":"此调用的类型描述符上下文。"," when the values of ":"当值","The string that is converted to a ":"转换为一个的字符串","The distance to translate (move) an object along the y-axis. The default value is 0.":"沿y轴翻译（移动）对象的距离。 默认值为0。"," properties are equal for both objects; otherwise, ":"两个对象的属性都是相等的。 否则，","The number of path figures contained in the ":"在","Angle that defines a cone within which the light fully illuminates objects in the scene.":"角度，定义一个圆锥体，光线在其中完全照亮场景中的物体。","The type being queried for support.":"该类型被询问支持。"," value that represents the index.":"代表索引的值。","The typeface name for the specified font family.":"指定字体系列的字体名称。"," if the converter can convert from the provided type; otherwise, ":"如果转换器可以从提供的类型转换； 否则，"," which describes the contents of the ":" 其中描述了 "," that specifies the direction of the Spotlight's projection. The default value is ":"这指定了聚光灯投影的方向。 默认值是","The font family of the typeface.":"字体的字体家族。"," value that represents the trailing length.":"代表尾随长度的值。"," if the converter can convert to the provided type; otherwise, ":"如果转换器可以转换为提供的类型； 否则，","The angle in degrees that specifies the proportion of a ":"指定A比例的程度的角度","A value of ":"一个值"," which specifies the transform applied.":" 它指定应用的转换。","The style of the typeface.":"字体的样式。","The culture information that is respected when converting.":"转换时尊重的文化信息。"," that represents the culture of the containing range of characters.":"这代表了包含字符范围的文化。","'s cone-shaped projection in which the light fully illuminates objects in the scene. The default value is ":"圆锥形的投影，其中光完全照亮了场景中的物体。 默认值是","The geometry to add to the path.":"几何形状添加到路径中。"," that was constructed.":"那是构建的。","The relative weight of the typeface.":"字体的相对重量。","'s cone-shaped projection outside which the light does not illuminate objects in the scene. The default value is ":"光不会照射场景中的物体的锥形投影。 默认值为 "," that represents the range of characters.":" 表示字符的范围。","Type to which this method will convert the ":"此方法将转换为","The geometry from which to create a ":"要从中创建一个 ","The degree to which the typeface is stretched.":"字体拉伸的程度。"," value that represents the text source character index.":"代表文本源字符索引的值。","Transformed Point3D.":"转换点3D。","The font family that is used when a character is encountered that the primary font family (specified by the ":"遇到字符时使用的字体族，该字体是主要字体系列（由","The object that was constructed.":"构造的对象。"," created from the current values of the specified ":" 从指定的当前值创建 ","Array of Point3D objects to transform.":"点3D对象的数组要转换。"," value that represents the length of the text source character.":"代表文本源字符的长度的值。","Indicates whether the type can be converted to a ":"指示该类型是否可以转换为"," parameter) cannot display.":"参数）无法显示。","The fraction of the length of this ":"长度的比例"," structure.  \n  \n ":"结构体。"," that represents the largest paragraph width possible.":"这代表了可能的最大段落宽度。","Point4D to transform.":"点4d进行变换。"," object that corresponds to this typeface, or ":"对应于此字体的对象，或","The desired type that this ":"所需的类型","When this method returns, contains the location on this ":"当此方法返回时，包含此方法上的位置 "," that represents the smallest paragraph width possible.":"这代表了可能的最小段落宽度。","Transformed Point4D.":"转换点4D。"," if the typeface was constructed from a composite font.":"如果字体是从复合字体构造的。","Array of Point4D objects to transform.":"要转换的点4D对象的数组。"," at the specified fraction of its length. This parameter is passed uninitialized.":"在其长度的指定分数处。 该参数通过非初始化。"," value that represents the bounding rectangle of a range of characters.":"代表一系列字符的边界矩形的值。"," structure is being evaluated for conversion.":"正在评估结构进行转换。"," if the out parameter is set to a ":"如果将OUT参数设置为","Vector3D to transform.":"向量3D转换。","When this method returns, contains the tangent vector. This parameter is passed uninitialized.":"当此方法返回时，包含切线向量。 该参数通过非初始化。","Indicates whether this ":"指示这是否","The length of the characters to use in ":"在"," value that represents the culture-specific names for the typeface.":"代表字体的特定文化名称的值。"," objects that describe the path's contents. Each individual ":"描述路径内容的对象。 每个人","Transformed Vector3D.":"转换矢量3D。"," structure can be converted to ":"结构可以转换为"," value to use for the characters in ":"在字符中使用的价值"," from which the typeface was constructed.":"从中构造了字体。"," describes a shape.":"描述形状。"," structure created from the converted ":"由转换的结构创建的结构","Array of Vector3D objects to transform.":"向量3D对象的数组要转换。"," that represents the text characters.":"代表文本字符。","Indicates how the intersecting areas of this ":"表示如何相交的区域","The type this ":"类型"," if bold simulation is used for glyphs; otherwise, ":"如果将粗体模拟用于字形； 否则，","Identity transformation.":"身份转换。"," object that represents the length of the text characters.":"代表文本字符长度的对象。"," are combined.  The default value is ":"合并。 默认值是"," structure is converted to.":"结构被转换为。"," if the matrix is affine; otherwise, ":"如果矩阵是仿制的； 否则，"," if the join between this ":"如果在这之间加入"," if italic simulation is used for glyphs; otherwise, ":"如果将斜体模拟用于字形； 否则，"," value that represents the properties shared by every text character.":"代表每个文本字符共享的属性的值。","The z-coordinate of the new ":"新的z坐标","Matrix3D that represents the value of the current transformation.":"Matrix3d表示当前转换的值。"," and the previous ":"和以前的"," value that represents the stretch value for the typeface.":"代表字体的拉伸值的值。"," value that represents the number of collapsed text characters.":"代表折叠文本字符数的值。","Collection with which to instantiate the Transform3DCollection.":"收集来实例化转换3汇总。","The w-coordinate of the new ":"新的W坐标"," is not to be treated as a corner; otherwise, ":"不要被视为角落； 否则，","Integer that specifies the capacity of the Transform3DCollection.":"整数指定转换3汇总的能力。"," that indicates the strikethrough position, measured from the baseline and expressed as a fraction of the font em size.":"这表明从基线测量并表示为字体EM大小的一小部分。"," value that represents the index of the first collapsed text character.":" 表示第一个折叠文本字符的索引的值。"," (the passed ":"（通过"," if the segment is stroked when a ":"如果在",", the specified Transform3D, is in this Transform3DCollection; otherwise, ":"，指定的转换3D在此转换3DCollection中； 否则，"," value that represents the width of the collapsed text characters.":"代表折叠文本字符的宽度的值。",") is a ":"）是"," value that represents the style value for the typeface.":" 表示字体样式值的值。"," is used to render the segment; otherwise, the segment is not stroked. The default is ":"用于渲染该细分市场； 否则，该细分市场不会触及。 默认值为"," that indicates the underline position, measured from the baseline and expressed as a fraction of the font em size.":"这表明从基线测量并表示为字体EM大小的一小部分。","The array that is the destination of the items copied from this Transform3DCollection.":"是从此transform3dcollection复制的项目的目标。"," value that represents the collapsed text symbol.":"代表折叠的文本符号的值。"," structure and is identical with this ":"结构，与此相同","The segment to add to the collection.":"添加到集合中的细分市场。","The Transform3D to search for.":"转换3D搜索。"," structure; ":"结构体;"," that represents the width of the range of collapsed text.":" 表示折叠文本范围的宽度。"," that indicates the underline thickness, expressed as a fraction of the font em size.":" 表示下划线粗细，表示为字体em大小的一小部分。"," is contained within the collection; otherwise, ":"集合中包含； 否则，","The instance of Point4D to compare to this instance.":"Point4D的实例与此实例进行比较。","The index position of the specified Transform3D.":"指定转换3D的索引位置。"," value that determines if the text object is drawn from right to left.":"确定是否从右到左绘制文本对象的值。"," is removed from the collection; otherwise, ":"从收藏中删除； 否则，"," value that represents the relative weight of the typeface.":"代表字体相对权重的值。"," are equal; ":"相等；","The index position at which to insert the specified Transform3D.":"插入指定转换3D的索引位置。"," value that determines if the text object is drawn with its side parallel to the baseline.":"确定是否绘制文本对象的侧面与基线平行的值。","The number of path segments contained in the ":"路径段的数量","Returns a hash code for this ":"为此返回哈希代码","The Transform3D to insert.":"转换3D插入。"," that indicates the distance from the baseline to the top of an English lowercase letter (excluding ascenders), expressed as a fraction of the font em size.":"这表示从基线到英语小写字母顶部的距离（不包括上升器），表示为字体大小的一小部分。"," object to get or set.":"要获得或设置的对象。"," value that represents the bounding box size of the text object.":"代表文本对象的边界框大小的值。"," if the enumerator successfully advanced to the next element; ":"如果枚举者成功地将其推进到下一个元素；","The Transform3D to remove from this collection.":"转换3D从此集合中删除。","The transformation ":"转换"," to use for rendering the text object.":"用于渲染文本对象。"," was removed fro the collection; otherwise, ":"被从收藏中删除； 否则，","Returns the result of transforming ":"返回转换的结果","The current item in the ":"当前项目","The index position of the Transform3D to remove.":"转换3D的索引位置要删除。"," representation of the collection of vectors.":"代表矢量的收集。"," value that represents the origin where the text object is drawn.":"代表绘制文本对象的原点的值。","The amount to offset the ":"抵消了","The Brush for this Pen.":"这支笔的刷子。","The number of Transform3D objects contained in the Transform3DCollection.":"转换3DCollection中包含的转换3D对象的数量。"," that represents the remaining paragraph width.":"这代表其余段落宽度。","The type of the source to evaluate for conversion.":"要评估转换的源的类型。","The thickness of the Pen.":"笔的厚度。","Returns the difference between ":"返回"," value that represents the text object metrics.":"代表文本对象指标的值。","The zero-based index of the Transform3D object to get or set.":"要获取或设置的转换3D对象的零索引。"," if you can convert the type to a ":"如果您可以将类型转换为"," if the text object has a fixed size; otherwise, ":"如果文本对象的大小固定； 否则，"," representation of the point4D structure.":"点4D结构的表示。","The fill of the outline produced by this ":"此产生的轮廓的填充","The media player associated with the drawing.":"与图纸关联的媒体播放器。","The rectangle in which the video is drawn.":"绘制视频的矩形。"," width.":"宽度。","Specifies how the ends of each dash are drawn.  \n  \n This setting applies to both ends of each dash. The default value is ":"指定如何绘制每个破折号的末端。 \n  \n  此设置适用于每个破折号的两端。 默认值是","The child visual object to add to parent visual.":"儿童视觉对象添加到父录像带中。"," height.":"高度。"," objects. The default value is an empty collection.":"对象。 默认值是一个空集合。","A value that describes the pattern of dashes generated by this ":"描述了该的破折号图案的值","A visual object of type ":"类型的视觉对象","True if the transformation is affine; false otherwise.":"如果转换是仿制的，则为真实； 否则为错误。",", which indicates that there should be no dashes.":"，这表明不应该有破折号。"," baseline relative to ":" 基线相对于 ","Matrix3D that indicates the current transform value.":"表示当前变换值的matrix3d。","The common ancestor of the visual object and ":"视觉对象的共同祖先和 ","The type of shape that ends the stroke. The default value is ":"末尾的形状类型。 默认值是"," that represents the text object baseline relative to its height.":"这代表文本对象基线相对于其高度。"," component of this ":"这的组成部分","Double that specifies the X value of the Vector3D that specifies the translation offset.":"指定vector3d的x值的双倍指定翻译偏移。"," that represents the text object height.":"这代表文本对象高度。","The type of joint used at the vertices of a shape's outline. The default value is ":"形状轮廓顶点的关节类型。 默认值是"," if one exists; otherwise, ":"如果存在； 否则，","Double that specifies the Y value of the Vector3D that specifies the translation offset.":"指定vector3d的y值指定偏移量的Y值。"," that represents the text object width.":"这代表文本对象宽度。","The diffuse color.":"弥漫性颜色。","The limit on the ratio of the miter length to half the pen's ":"斜切长度与笔的一半的比率的极限","Double that specifies the Z value of the Vector3D that specifies the translation offset.":"指定vector3d的z值的双倍指定翻译偏移。","The position.":"位置。","The index of the visual object in the ":"视觉对象的索引","The number of characters in the ":"字符数量",". This value is always a positive number greater than or equal to 1.  The default value is 10.0.":"。 该值始终是大于或等于1的正数。默认值为10.0。"," by which to offset the model.":"通过哪个来抵消模型。","Double by which the intensity of the light diminishes over distance.":"双重强度在距离上减小的双重强度。","The child in the ":"孩子","The type of shape that starts the stroke. The default value is ":"开始中风的形状类型。 默认值是","Double that represents the X-axis value of the translation's offset.":"代表翻译偏移的X轴值的双倍。"," value to use for the characters in the ":" 用于字符的值 ","The thickness of the stroke produced by this ":"这产生的中风的厚度"," object that specifies the ":"指定的对象","Double that specifies the linear diminution of the light's intensity over distance.":"两倍指定光线强度在距离上的线性降低。","Double that represents the Y-axis value of the translation's offset.":"代表翻译偏移的Y轴值的双倍。"," object that represents the length of the character buffer.":"代表字符缓冲区长度的对象。"," that specifies the light's position in world space.":"这指定了光在世界空间中的位置。","The Object to compare with the current Object.":"与当前对象进行比较的对象。"," that represents the result of the hit test.":"这代表了命中测试的结果。","Double that represents the Z-axis value of the translation's offset.":"代表翻译偏移的Z轴值的双倍。","Double that specifies the diminution of the light's effect over distance, calculated by a quadratic operation.":"双倍指定距离操作计算的距离效果的减小。","The pixel format to compare.":"比较格式进行比较。"," that specifies the text layout for the ":"这为文本布局指定了"," that is returned from a hit test.":"从热门测试中返回。"," that represents the value of the translation.":"这代表翻译的价值。","Double that specifies the distance beyond which the light has no effect.":"双倍指定距离超出光无效的距离。"," value that represents the text source for the line.":"代表该行的文本源的值。","The previous DPI scale setting.":"先前的DPI秤设置。"," if the pixel formats are equal; otherwise, ":"如果像素格式相等； 否则，","Double that specifies the distance from the camera of the camera's far clip plane.":"两倍指定距相机远夹平面相机的距离。"," structure used to translate the specified ":"用于翻译指定的结构","The new DPI scale setting.":"新的DPI量表设置。"," value that specifies the character index of the starting character in the line.":" 指定行中起始字符的字符索引的值。"," objects to compare for equality.":"对象比较平等。","Vector3D that represents the direction of the camera's field of view.":"代表摄像机视场的方向的vector3d。"," that was added to the collection":"被添加到集合中"," structure to be translated.":"结构要翻译。"," value that specifies the width of the paragraph that the line fills.":"指定线路填充段落的宽度的值。"," if the two parameters are equal; otherwise, ":"如果两个参数相等； 否则，","Double that specifies the distance from the camera of the camera's near clip plane.":"两倍指定距摄像机靠近夹子平面相机的距离。"," structure to evaluate.":"评估的结构。","The pixel format's hash code.":"像素格式的哈希代码。"," that was removed from the collection":"从收藏中删除了"," that specifies the position of the camera.":"指定相机的位置。"," value that represents paragraph properties, such as flow direction, alignment, or indentation.":" 表示段落属性的值，例如流向、对齐或缩进。","The angle in degrees needed to rotate ":"旋转需要的角度"," value in screen coordinates.":"在屏幕坐标中值。","The number of bits-per-pixel (bpp) for this ":"每个像素的数量（BPP）数量"," value that specifies the text formatter state, in terms of where the previous line in the paragraph was broken by the text formatting process.":"用文本格式过程中的上一行中的上一行中的以下行，指定文本格式状态的值。","Vector3D that represents the upward direction in the scene projection.":"代表场景投影中向上方向的vector3d。"," value that represents the current coordinate system of the ":"代表当前坐标系的值"," structure to be divided.":"结构要分割。"," value that represents a line of text that can be displayed.":"代表可以显示的文本行的值。","The collection of bit masks and shifts associated with the ":"与该掩码的集合和与","Value of the new ":"新价值","The child visual object to remove from the parent visual.":"子视觉对象从父录像中删除。","The scalar to divide ":"分裂标量"," to compare with the current mask.":"与当前面具进行比较。"," object that represents the text source for the line.":" 表示行的文本源的对象。","'s X coordinate.":"的X坐标。","The dot product of ":"点乘积","The first mask to compare.":"第一个比较的掩码。","A transform that can be used to transform coordinates from the ":"可用于转换坐标的转换"," object that represents paragraph properties, such as flow direction, alignment, or indentation.":"代表段落属性的对象，例如流动方向，对齐或凹痕。","The second mask to compare.":"第二个要比较的掩码。","The instance of Vector to compare against this instance.":"向量与此实例进行比较的实例。","'s Y coordinate.":"y坐标。"," to the specified ":"到指定的"," object that specifies the text formatter state, in terms of where the previous line in the paragraph was broken by the text formatting process.":"指定文本格式状态的对象，就文本格式过程中的段落中的上一行打破了段落中的前行。","'s Z coordinate.":"的z坐标。","The transformation to apply to the ":"适用于"," if the masks are equal; otherwise, ":"如果口罩相等； 否则，"," ancestor of the visual object.":" 视觉对象的祖先。","'s W coordinate.":"的w坐标。"," object that represents the caching mechanism for the layout of text.":" 表示文本布局的缓存机制的对象。","A mask's hash code.":"面具的哈希代码。"," are different; ":"是不同的;","The clip region value of the visual as a ":"视觉的剪辑区域值为"," that represents the axis of rotation.":"这代表旋转轴。"," value that represents the smallest and largest possible paragraph width that can fully contain the specified text content.":"代表可以完全包含指定文本内容的最小和最大段落宽度的值。"," if the two masks are equal; otherwise, ":"如果两个口罩相等； 否则，"," structure to negate.":"否定的结构。"," value of the visual.":"视觉的值。","Angle to rotate around the specified axis, in degrees.":"角度以围绕指定轴旋转，以度为单位。","The bitmask for a color channel.":"颜色通道的位掩码。"," should be set to the TextSource's PixelsPerDip value.":"应设置为TextSource的PixelSperDip值。"," structure with ":"结构","First quaternion to add.":"第一个四个添加。"," that specifies the offset value.":"指定偏移值。"," objects that represent the collapsed text properties.":"表示折叠的文本属性的对象。"," pixel format.":"像素格式。","Second quaternion to add.":"第二季度要添加。"," representation of the 3-D vector.":"3-D矢量的表示。","The opacity value of the visual.":"视觉的不透明度值。"," pixel format":"像素格式"," value that represents a collapsed line that can be displayed.":"代表可以显示的折叠线的值。","Quaternion that is the result of addition.":"四元组是添加的结果。","The length of this ":"这个长度","The object onto which the ":"对象"," that represents the opacity mask value of the visual.":"这代表视觉的不透明度掩模值。","The pixel format Black-and-White.":"像素格式黑白。","Object with which to compare.":"与之比较的对象。","The square of the length of this ":"长度的正方形"," is rendered.":"被渲染。"," structure. The default value is ":"结构体。 默认值是"," parent.":"父母。","The CMYK32 pixel format.":"CMYK32像素格式。"," instances are exactly equal, ":"实例完全相等，","A value that represents the drawing origin.":"代表图形来源的值。","Collection with which to instantiate the Vector3DCollection.":"收集的，以实例化vector3dcollection。"," that represents the scrollable clipping area, or ":"代表可滚动的剪裁区域，或"," best suited for the particular operation.":"最适合特定操作。","An enumerated ":"枚举"," if no clipping area is assigned.":"如果未分配剪辑区域。","Integer that specifies the capacity of the collection.":"整数指定收集的能力。","Quaternion with which to compare.":"与之比较的四元数。","The pixel format which specifying a paletted bitmap with 2 colors.":"像素格式，指定带有2种颜色的切片位图。","An integer type that represents the hash code for the ":"代表哈希代码的整数类型","Vector3D to be added to the collection.":"vector3d将添加到集合中。"," value that indicates the inversion of the horizontal and vertical axes of the drawing surface.":"表示图表的水平和垂直轴的反转值。","The transform value of the visual.":"视的变换值。","The pixel format which specifying a paletted bitmap with 4 colors.":"像素格式，指定带有4种颜色的切片位图。","Vector3D to be found in the collection.":"vector3d在集合中找到。","First quaternion to multiply.":"第一个四个繁殖。"," object after backspacing.":"回速后的对象。","The x-coordinate guideline collection of the visual.":"视觉的X坐标指南集合。","Array into which to copy.":"复制的数组。","The pixel format which specifying a paletted bitmap with 16 colors.":"像素格式，指定带有16种颜色的切片的位图。","The y-coordinate guideline collection of the visual.":"视觉的Y坐标指南集合。","Second quaternion to multiply.":"第二季度繁殖。"," value that represents the distance from the beginning of the line.":"代表从行开头的距离的值。","The pixel format which specifying a paletted bitmap with 256 colors.":"像素格式，指定带有256种颜色的切片位图。","Position into which to copy.":"要复制的位置。","The contents of the new ":"新的内容"," from the beginning of the line.":"从线的开头。","Quaternion that is the result of multiplication.":"乘以乘法的结果。","The index position of the specified Vector3D.":"指定vector3d的索引位置。"," that can be used to iterate through the ":"可以用来通过"," if this Brush should run layout on its ":"如果此刷子在其上运行的布局"," object whose distance you want to query.":"您要查询的距离。","Quaternion that is the sum of the two specified  ":"Quaternion是指定的两个总和",", the specified Vector3D.":"，指定的vector3d。"," representation of the collection of points.":"积分的代表。"," that represents the distance from the beginning of the line.":"这代表了从线路开头的距离。","The brush's content. The default is ":"刷子的内容。 默认值为","First Quaternion to compare.":"比较的第一个季节。","The string representation of the collection of Vector3D objects.":"Vector3D对象集合的字符串表示。"," values of the ":"值的值","Second Quaternion to compare.":"第二季度比较。","An enumerator that allows you to enumerate each ":"一个枚举者，使您可以枚举每个","The parent visual object whose ":"父的视觉对象的对象"," structures in this ":"其中的结构","Returns the equivalent Vector3DCollection.":"返回等效vector3DCollection。"," to append to the ":"附加到"," object based on caret navigation.":"基于CARET导航的对象。","First quaternion to compare.":"比较的第一个季节。","The object that is created from converting this ":"转换为此创建的对象","The Vector3D to remove from this collection.":"向Vector3D从此集合中删除。","The index of first character of specified range.":"指定范围的第一个字符的索引。","The index in the collection at which ":"集合中的索引","Second quaternion to compare.":"第二季度比较。","The zero-based index of the Vector3D object to get or set.":"vector3D对象的基于零的索引要获取或设置。","The parameter that is specified as the ":"指定为"," is contained in the collection; otherwise, ":"集合中包含； 否则，","The number of characters of the specified range.":"指定范围的字符数量。","First quaternion.":"第一个季节。"," against which to hit test.":"对此进行测试。","The object to convert to an instance of Vector3DCollection.":"转换为vector3DCollection实例的对象。"," objects representing the bounding rectangle.":"代表边界矩形的对象。","Second quaternion.":"第二季节。"," that is the destination of the elements that are copied from the ":"那是从","The collection of points that specify the geometry of the cubic Bezier curve segments.":"指定立方Bezier曲线段的几何形状的点的集合。","Vector3DCollection that was constructed.":"构建的vector3DCollection。"," objects that represent the collapsed text.":"表示折叠文本的对象。","Quaternion that is the product of multiplication.":"四元基因是乘法的乘积。","Value specifying whether the segments are stroked.":"值指定段是否触及的值。"," objects (which must have zero-based indexing).":"对象（必须具有基于零的索引）。"," value that represents the line break.":"代表线路断路的值。","Quaternion from which to subtract.":"从中减去的四元。","The object which was constructed.":"构造的对象。","Collection that define this ":"定义这个的集合","The index to start copying from within ":"从内部开始复制的索引","Quaternion to subtract from the first quaternion.":"从第一个季节中减去的四元。","The required ":"所需","Gets a list of ":"获取一个清单","A collection of points that determine the line segments of the ":"确定线段的点集合","The zero-based index at which the value should be inserted.":"应插入值的基于零的索引。"," objects contained within a text span.":"文本跨度中包含的对象。","The 3-D geometry for this ":"为此的3D几何形状","Quaternion that is the result of subtraction.":"季节是减法的结果。"," to make the segment stroked; otherwise, ":"使段抚摸； 否则，"," that represents the baseline distance.":"这代表基线距离。","The zero-based index of the visual to remove.":"视觉删除的视觉索引零索引。","The material for the 3-D object.":"3-D对象的材料。"," represented by the string.":"由字符串表示。","The shape of this ":"这个形状","The zero-based index of the range of elements to remove.":"要删除的元素范围的基于零的索引。"," value that represents the number of characters.":"代表字符数的值。","The collection of points that specify the geometry of the Bezier curve segments.":"指定Bezier曲线段几何形状的点的集合。","The visual to be placed on the 3-D object.":"将视觉放置在3-D对象上。"," that represents the starting orientation.":"这代表起始方向。","The value that indicates whether the ":"指示是否是否","A value that represents the extent distance.":"代表距离距离的值。"," to stroke the segments; otherwise, ":"抚摸细分市场； 否则，","Value of type HitTestFilterCallback.":"类型HittestFilterCallback的值。"," is synchronized (thread-safe).":"已同步（线程安全）。"," that represents the ending orientation.":"这代表了最终方向。",", if the line is collapsed; otherwise, ":"，如果线崩溃； 否则，","A collection that defines the shape of this ":"定义形状的集合","Value of type HitTestResultCallback.":"类型HittestResultCallback的值。"," that is stored at ":"存储在",", it the line overflows the specified paragraph width; otherwise, ":"，该行溢出了指定的段落宽度； 否则，","Interpolation coefficient.":"插值系数。","The control point of this ":"控制点","Value of type ":"类型的值"," that contains the bitmap effect.":"其中包含位图效果。","The text line height.":"文本线高。"," is to be stroked; otherwise, ":"被抚摸； 否则，","Point against which to hit test.":"要进行测试的点。"," that represents the orientation resulting from the interpolation.":"这代表了插值产生的方向。"," that contains the bitmap effect input value.":"其中包含位图效应输入值。","BitmapEffect applied to the Viewport3DVisual.":"bitmapeffect应用于viewport3dvisual。","Color value at the focus (":"焦点的颜色值（"," if the text line is truncated in the middle of a word; otherwise, ":"如果文本线在单词的中间被截断； 否则，","Boolean that indicates whether to compute quaternions that constitute the shortest possible arc on a four-dimensional unit sphere.":"布尔值表示是否计算构成四维单位球体最短弧的四元组。","BitmapEffectInput applied to the Viewport3DVisual.":"bitmapeffectInput应用于viewport3dvisual。"," to get the ":"得到"," positions of the current line.":"当前线的位置。","Double that represents the quaternion's angle, in degrees.":"双重代表四个角度的角度。",") of the radial gradient.":"）径向梯度。","Camera used by the ":"使用的相机 ","The parent visual, referenced as a ":"父母视觉，被称为","The baseline distance of the marker.":"标记的基线距离。"," that represents the quaternion's axis.":"这代表了四个轴的轴。","Color value at the outer edge of the radial gradient.":"径向梯度的外边缘的颜色值。","Collection of the objects contained by the ":"收集的对象","The height of the marker.":"标记的高度。","The gradient stops to set on this brush.":"梯度停止在此刷子上设置。","The index that represents the child visual that is contained by ":"代表儿童视觉的索引所包含的索引","The Identity quaternion.":"的身份四元数。","The number of newline characters.":"Newline字符的数量。"," that defines the clipping area.":"这定义了裁剪区域。","The two-dimensional point located at the center of the radial gradient.":"二维点位于径向梯度的中心。"," if the quaternion is the ":"如果四元里是","The index value of the child visual object.":"儿童视觉对象的索引值。"," that defines the bounding box.":"这定义了边界框。","The overhang after distance.":"距离后的悬垂。","The location of the two-dimensional focal point of the gradient. The default is (0.5, 0.5).":"梯度的二维焦点的位置。 默认值为（0.5，0.5）。","The parent visual that is referenced as a ":"父母视觉被称为"," quaternion, ":"季节，"," that defines the union.":"这定义了联盟。","The overhang leading distance.":"悬垂的领先距离。","The horizontal radius of the outermost circle of the radial gradient. The default is 0.5.":"径向梯度最外面圆的水平半径。 默认值为0.5。"," if the quaternion is normalized, ":"如果四合一标准化，","The number of child visuals that the parent visual contains.":"父母视觉包含的儿童视觉量的数量。"," that represents the offset value of the Viewport3DVisual.":"这代表了viewport3dvisual的偏移值。","The overhang trailing distance.":"悬垂的距离。","The vertical radius of the outermost circle of a radial gradient. The default is 0.5.":"径向梯度的最外面圆的垂直半径。 默认值为0.5。"," whose clip region value is returned.":"返回其剪辑区域值。","The W component of the quaternion.":"四元组的W部分。","The distance from the start of a paragraph to the starting point of a line.":"从段落开始到线路的起点的距离。","The value of the Opacity property is expressed as a value between 0 and 1, specifying a range from fully transparent to fully opaque. A value of 0 indicates that the Opacity is completely transparent, while a value of 1 indicates that the Opacity is completely opaque. A value 0.5 would indicate the Opacity is 50% opaque, a value of 0.725 would indicate the Opacity is 72.5% opaque, and so on. Values less than 0 are treated as 0, while values greater than 1 are treated as 1.":"Opacity属性的值表示为介于0和1之间的值，指定从完全透明到完全不透明的范围。 值为0表示不透明度完全透明，而值为1表示不透明度完全不透明。 值0.5表示不透明度为50%不透明，值0.725表示不透明度为72.5%不透明，依此类推。 小于0的值被视为0，而大于1的值被视为1。"," structure with the rectangle's dimensions.":"矩形尺寸的结构。","The clip region value of the ":"剪辑区域值","The X component of the quaternion.":"四元组的X组件。","The text baseline distance.":"文本基线距离。"," that represents the opacity mask value of the Viewport3DVisual.":"这代表了viewport3dvisual的不透明掩模值。"," returned as a ":"返回为","The Y component of the quaternion.":"四元组的Y组成部分。","The radius of the rounded corner where it connects with the upper and lower edges of the rectangle.":"圆角的半径与矩形的上和下边缘连接。","The height of the text and any other content in the line.":"文本的高度和行中的任何其他内容。","Visual parent of the Viewport3DVisual.":"视图3DVisual的视觉父母。","The Z component of the quaternion.":"四元组的Z组成部分。","The 3D visual whose bounding box value is computed.":"计算其边界框值的3D视觉。","The radius of the rounded corner where it connects with the left and right edges of the rectangle.":"圆角的半径与矩形的左右边缘连接。","The number of whitespace code points beyond the last non-blank character in a line.":"空格代码的数量超出了一条线中的最后一个非空白字符。"," if this converter can convert from the provided type, false otherwise.":"如果此转换器可以从提供的类型转换，则否则为false。","The bounding box 3D rectangle for the ":"边界框3D矩形"," applied to the Viewport3DVisual.":" 应用于Viewport3DVisual。","The transformation to apply to the geometry.":"适用于几何形状的转换。"," if this converter can convert to the provided type, false otherwise.":"如果此转换器可以转换为提供的类型，则否则为false。","The text line width, excluding trailing whitespace characters.":"文本线宽度，不包括落后的空格字符。","Rectangle in which the contents of the Viewport3D will be rendered.":"将呈现fiewport3d内容的矩形。","A value greater than or equal to zero and less than or equal to half the rectangle's width that describes the x-radius of the ellipse use to round the corners of the rectangle. Values greater than half the rectangle's width are treated as though equal to half the rectangle's width. Negative values are treated as positive values. The default is ":"一个大于或等于零，小于或等于或等于矩形宽度的一半的值，该矩形的宽度描述了椭圆形的X-Radius用来绕矩形的角落绕的角。 矩形的宽度大于一半的值被视为等于矩形宽度的一半。 负值被视为正值。 默认值为"," whose bounding box value is computed.":"计算其边界框值。","The text line width, including trailing whitespace characters.":"文本线宽度，包括尾随的空格字符。","CultureInfo to be respected when converting.":"conutionInfo在转换时要受到尊重。","The child 3-D visual object to add to the parent 3-D visual object.":"子3-D视觉对象添加到父3-D视觉对象。","A value greater than or equal to zero and less than or equal to half the rectangle's width that describes the y-radius of the ellipse use to round the corners of the rectangle. Values greater than half the rectangle's width are treated as though equal to half the rectangle's width. Negative values are treated as positive values. The default is ":"一个大于或等于零且小于或等于矩形宽度的一半的值，用于描述椭圆的y半径，用于圆矩形的角。 大于矩形宽度一半的值被视为等于矩形宽度的一半。 负值视为正值。 默认值为 "," that represents the offset of the marker symbol from the beginning of the line.":"这代表了从线的开头偏移标记符号。","The bounding box rectangle for the ":"边界盒矩形","Object to convert to an instance of Quaternion.":"对象转换为四个季度实例。","The object that specifies how to interact with all relevant animation sequences.":"指定如何与所有相关动画序列交互的对象。","The position and size of the rectangle. The default is ":"矩形的位置和大小。 默认值为"," object to animate.":"对象动画。"," that represents the text marker.":" 表示文本标记。","The 3D visual whose bounding box value for all descendants is computed.":"计算所有后代的边界框值的3D视觉框。","Quaternion that was constructed.":"构造的四元组。","The timeline that has the necessary functionality to animate the property.":"具有必要功能来使属性动画的时间轴。","The major version of the pixel shader.":"像素着色器的主要版本。"," for a text run, or the return value of ":"对于文本运行或返回值","Quaternion that specifies the rotation to which to interpolate.":"四个指定旋转插入的旋转。"," for a nested text modifier.":"用于嵌套文本修饰符。","The minor version of the pixel shader.":"像素着色器的次要版本。","Returns the bounding box 3D rectangle for the 3D visual.":"返回边界框3D矩形以进行3D视觉效果。","The timeline that has the necessary functionality to customize the new animation.":"具有自定义新动画所需功能的时间线。","The actual ":"实际上","Quaternion that defines the destination rotation.":"定义目的地旋转的四元基因。"," whose bounding box value for all descendants is computed.":"计算其所有后代的边界框价值。"," if the pixel shader version is supported by the current version of WPF; otherwise, ":"如果Pixel Shinder版本由WPF的当前版本支持； 否则，","The visual object with which to find a common ancestor.":"找到共同祖先的视觉对象。","The common ancestor of the current visual object and ":"当前视觉对象的共同祖先和",", subject to further modification by ":"，如果通过","Point3D at which the ray originates.":"射线起源的Point3d。"," if the pixel shader can be rendered in software on the current system; otherwise, ":" 如果像素着色器可以在当前系统上的软件中渲染;否则, ","The bounding box rectangle for the specified ":"指定的边界框矩形 ","Vector3D that indicates the direction of the ray.":"向Vector3D表示射线的方向。"," objects at outer scopes.":"外部范围的对象。","96 for Pixel Shader 2.0, 512 or greater for Pixel Shader 3.0, or 0 for any other version of Pixel Shader.":"96对于像素着色器2.0、512或更高的像素着色器3.0，或其他任何其他版本的像素着色器。"," if no common ancestor is found.":" 如果没有找到共同的祖先。"," for the current scope of text; otherwise, ":"对于当前文本范围； 否则，","The Visual target object.":"的视觉目标对象。"," if the system can render bitmap effects in software; otherwise, ":"如果系统可以在软件中呈现位图效果； 否则，","Vector3D that indicates the direction of the ray along which to hit test.":"向Vector3D指示沿射线的方向进行测试的方向。","The object that represents the base value of ":"代表基本值的对象","Origin of the ray along which to hit test.":"射线的起源沿着测试。"," that represents the maximum width and height for hardware bitmap creation.":"这代表了硬件位图创建的最大宽度和高度。"," if the formatted line can always be collapsed; otherwise, ":"如果格式化的线路总是可以崩溃； 否则，","A DPIScale value.":"dpiscale值。","The child in the collection at the specified ":"指定的收藏中的孩子",", which indicates that only formatted lines that overflow the paragraph width are collapsed. The default value is ":"，这表明只有溢出段落宽度的格式线折叠。 默认值是"," value whose high-order word corresponds to the rendering tier for the current thread.":"高阶单词的值对应于当前线程的渲染层。","Double that indicates the distance between the hit intersection and the inner coordinate space of the ":"双重指示命中相交与内部坐标空间之间的距离"," whose drawing content is returned.":"返回其绘图内容。","A visual object that is a possible descendant.":"视觉对象是可能的后代。"," which initiated the hit test.":"启动了热门测试。","The drawing content of the ":"绘图内容"," value that represents the default incremental tab distance.":"表示默认增量选项卡距离的值。","The estimated target time at which the next frame of an animation will be rendered.":"动画将呈现下一个动画的估计目标时间。","Model3D intersected by the ray.":"模型3D由射线相交。"," whose edge mode value is returned.":"返回其边缘模式值。"," if the visual object is an ancestor of ":" 如果视觉对象是 ",", if the text run is the first line of the paragraph; otherwise, ":"，如果文本运行是段落的第一行； 否则，","The dependency object from which to retrieve the value of the ":"要从中检索的值的依赖项对象 ","A visual object that is a possible ancestor.":"视觉对象是可能的祖先。"," to get the bitmap effect for.":"为了获得位图效果。"," that represents the amount of line indentation.":"这代表了线压痕的量。","Point3D at which the hit object was intersected by the ray.":"被击中物体与射线相交的点3d。","The current value of the ":"当前值"," if the visual object is a descendant of ":"如果视觉对象是"," that represents the height of a line of text.":"这代表了文本线的高度。"," whose offset is returned.":"返回的偏移。","Visual3D intersected by the ray.":"Visual3D由射线相交。"," attached property on the specified dependency object.":"在指定的依赖项对象上附加了属性。"," that was removed from the collection.":"那是从收藏中删除的。"," whose opacity value is returned.":"返回其不透明度值。"," that represents the amount of the paragraph indentation.":"这代表了段落压痕的数量。","Double that indicates the distance between the point of intersection and the ray's origin in the coordinate space of ":"两倍表示交叉点与射线的坐标空间中的距离之间的距离"," that represents the previous parent of the ":"这代表了以前的父母"," attached property for.":"附件的财产。"," that represents the opacity value of the ":"这代表了不透明的价值"," object. If the ":"目的。 如果是"," intersected by the ray.":"由射线相交。"," value representing the characters in the text run.":"代表文本运行中字符的值。"," whose opacity mask value is returned.":"返回其不透明度掩码值。"," attached property for ":" 附属物业 "," value that represents the set of shared text properties.":"代表共享文本属性集的值。"," object did not have a previous parent, the value of the parameter is ":"对象没有以前的父，参数的值为","Point3D at which the mesh was intersected.":"点3D网格相交。"," value that represents the character length.":"代表字符长度的值。","The visual whose parent is returned.":"返回父母的视觉效果。"," descendant on which to set the value of the ":"为了设置该价值的后代","The child 3-D visual object to remove from the parent visual.":"孩子3-D视觉对象从父录像中删除。","The index of the first vertex.":"第一个顶点的索引。","The new value to set the property to.":"将属性设置为的新值。"," whose transform value is returned.":"其转换值返回。"," value that represents the bounding rectangle of the text run.":"代表文本运行的边界矩形的值。"," to which the coordinates are transformed.":"坐标转换为其。","The index of the second vertex.":"第二个顶点的索引。"," object; or ":"目的; 或者","The dependency object on which to set the value of the ":"依赖关系对象设置的值","The transform value of the ":"转换值","The index of the third vertex.":"第三顶点的索引。"," property":"财产"," value that represents the text run.":"代表文本运行的值。",", if the transform cannot be created.":"，如果无法创建转换。","The index representing the first character of the bounded text run.":"代表有限文本运行的第一个字符的索引。","The weighting of the first vertex.":"第一个顶点的加权。"," does not have a transform defined.":" 没有定义转换。"," attached property on.":"附有财产。",", if the transform from ":"，如果从"," character index position of the start of the change.":"变更开始的角色索引位置。"," whose X-coordinate guideline collection is returned.":"返回其X坐标指南收集。"," preference for the current process.":"偏爱当前过程。"," to this object is non-invertible.":"对此对象是不可变的。","The weighting of the second vertex.":"第二顶点的加权。","Indicates the number of ":"表示的数量 ","The format context.":"格式上下文。","The weighting of the third vertex.":"第三顶点的加权。"," if this element has animations; otherwise, ":"如果此元素有动画； 否则，","The X-coordinate guideline collection of the ":"X坐标指南集合","The transformation to apply to the 3-D object. The default is the ":"适用于3-D对象的转换。 默认值是"," characters to be added.":"要添加的字符。","The type to convert from.":"要转换的类型。","X-axis coordinate of the new ":"新的X轴坐标"," whose Y-coordinate guideline collection is returned.":"返回其Y坐标指南收集。"," characters to be removed.":"字符要删除。","The current culture.":"当前的文化。","The number of child elements.":"子元素的数量。","The Y-coordinate guideline collection of the ":"Y坐标指南集合","Y-axis coordinate of the new ":"Y轴坐标"," value that represents the background color.":"代表背景颜色的值。","The policy to convert.":"转换的政策。"," object to render.":"渲染的对象。"," that represents the culture of the text run.":"这代表了文本的文化。","Z-axis coordinate of the new ":"新的Z轴坐标","The method that represents the hit test filter callback value.":"表示热门测试过滤器回调值的方法。","The object that is constructed from the conversion.":"由转换构建的对象。","The Visual3D to add to this Visual3DCollection.":"Visual3D添加到此Visual3DCollection中。"," that represents the text size in points. The default is 12 pt.":"这代表点数中的文本大小。 默认值为12分。","Size of the new ":"新的大小","The clockwise rotation angle, in degrees.":"顺时针旋转角度，程度。","Visual3D to locate in this Visual3Dcollection.":"Visual3D位于此Visual3DCollection中。","The method that represents the hit test result callback value.":"表示热门测试结果回调值的方法。"," that represents the text size in DIPs (Device Independent Pixels). The default is 12 DIP.":"这代表倾角中的文本大小（设备独立像素）。 默认值为12次。",", the specified Visual3D, is in this Visual3DCollection; otherwise, ":"，指定的Visual3d在此Visual3DCollection中； 否则，","The 3D parameter value to hit test against.":"3D参数值要击中测试。"," in the X dimension.":"在x维度中。","The clockwise rotation angle, in degrees. For more information, see the ":"顺时针旋转角度，程度。 有关更多信息，请参阅"," value that represents the foreground color.":"代表前景颜色的值。"," in the Y dimension.":"在y维度。","Array that is the destination of the items copied from this Visual3DCollection.":"数组是从此Visual3Dcollection复制的项目的目的地。","The x-coordinate of the center point for the ":"中心点的X坐标","The parameter value to hit test against.":"要命中测试的参数值。","The index of the alternate annotation form. The default is 0 (zero).":"替代注释表的索引。 默认值为0（零）。"," in the Z dimension.":"在z维度中。"," for which to search.":"为此搜索。","The point value to hit test against.":"点测试的点值。"," if spacing is adjusted; otherwise, ":"如果调整间距； 否则，",". For more information, see the ":". 有关更多信息，请参阅 ","The hit test result of the ":"命中测试结果"," or has a different visual parent.":"或有不同的视觉父母。","Location of the new ":"新位置"," if the vertical position is adjusted; otherwise, ":"如果调整垂直位置； 否则，","The y-coordinate of the center point for the ":"中心点的y坐标",", returned as a ":"，返回","The index at which to insert the Visual3D.":"插入Visual3D的索引。","X-axis coordinate of the ":"的X轴坐标 "," if custom glyph forms can be used; otherwise, ":"如果可以使用自定义字形表格； 否则，","The angle, in degrees, of clockwise rotation. The default is 0.":"以顺时针旋转为单位的角度。 默认值为0。","Visual3D to insert.":"Visual3D插入。"," to be tested.":"要测试。","A Visual object target.":"视觉对象目标。"," if contextual ligatures are enabled; otherwise, ":"如果启用了上下文连接； 否则，","Y-axis coordinate of the ":"y轴坐标","Visual3D to remove.":"Visual3D删除。","DPI information for the target Visual.":"目标视觉视觉的DPI信息。","The x-coordinate of the center of rotation. The default is ":"旋转中心的X坐标。 默认值为","The index of the standard swashes form. The default is 0 (zero).":"标准折纸形式的索引。 默认值为0（零）。","Z-coordinate of the ":"z坐标","Index of the Visual3D to remove.":"Visual3D的索引要删除。","The base URI of a given element.":"给定元素的基本URI。","The y-coordinate of the center of rotation. The default is ":"旋转中心的Y坐标。 默认值为"," if discretionary ligatures are enabled; otherwise, ":"如果启用了酌情连接； 否则，"," if the specified point or rectangle is within the ":"如果指定的点或矩形在","The current rotation transformation as a ":"当前的旋转转换为"," if standard Japanese font forms have been replaced with the corresponding preferred typographic forms; otherwise, ":"如果标准的日语字体表格已被相应的首选印刷形式替换； 否则，","The element to add the handler to.":"将处理程序添加到的元素。","The number of items contained in the Visual3Dcollection.":"Visual3Dcollection中包含的项目数。","The x-axis scale factor. For more information, see the ":"X轴量表因子。 有关更多信息，请参阅",", including its edges; ":"，包括其边缘；","The handler implementation to add.":"处理程序实现要添加。","The zero-based index of the Visual3D to get or set.":"Visual3D的基于零的索引要获得或设置。"," if historical forms are enabled; otherwise, ":"如果启用了历史表格； 否则，","The y-axis scale factor. For more information, see the ":"Y轴量表因子。 有关更多信息，请参阅","The Visual3D at the specified index.":"指定索引处的Visual3D。","Point to be tested.":"要测试的点。"," to find the source for.":"找到来源。","The x-coordinate of the center of this ":"该中心的X坐标"," if historical ligatures are enabled; otherwise, ":"如果启用了历史连接； 否则，",", including its edges; false otherwise.":"，包括其边缘； 否则为错误。","The y-coordinate of the center of this ":"该中心的y坐标","The timeline to use as a template for the media clock.":"要用作媒体时钟模板的时间线。"," if kerning is enabled; otherwise, ":"如果启用了Kerning； 否则，"," in which the dependency object is being presented.":"依赖对象正在呈现。"," instances are exactly equal; ":"实例完全相等；","The x-coordinate of the center point of this ":"中心点的X坐标"," if the media clock can slip; otherwise ":"如果媒体时钟可以滑倒； 否则"," if mathematical Greek forms are enabled; otherwise, ":"如果启用了数学希腊形式； 否则，"," in which the visual is being presented, or ":"在其中展示视觉的地方，或者","The y-coordinate of the center point of this ":"该中心点的y坐标"," instance to compare with the current instance.":"实例与当前实例进行比较。","The actual media time.":"实际媒体时间。"," if slashed zero forms are enabled; otherwise, ":"如果启用了较重的零表格； 否则，","The scale factor along the x-axis. The default is 1.":"沿X轴的比例因子。 默认值为1。"," that is target for rendering the visual.":"这是渲染视觉的目标。","Result of the intersection of ":"交集的结果"," that describes the controlling behavior of the clock.":"描述了时钟的控制行为。","The element to remove the handler from.":"从中删除处理程序的元素。"," if standard ligatures are enabled; otherwise, ":"如果启用了标准的连接； 否则，","The scale factor along the y-axis. The default is 1.":"沿y轴的比例因子。 默认值为1。","Rectangle to evaluate.":"矩形要评估。","The current scaling transformation returned as a ":"当前的缩放转换返回","The media source ":"媒体来源","The handler implementation to remove.":"处理程序实现要删除。","The index of the stylistic alternates form. The default is 0 (zero).":"风格替代形式的索引。 默认值为0（零）。"," intersects with this ":"与此相交","The x-axis skew angle, which is measured in degrees counterclockwise from the y-axis. For more information, see the ":"X轴偏斜角，从Y轴逆时针以逆时针度测量。 有关更多信息，请参阅","The old root ":"旧根","The ratio of volume across the left and right speakers in a range between -1 and 1. The default is 0.":"左右扬声器的音量比在-1到1之间。默认值为0。"," if the stylistic set of the font form is enabled; otherwise, ":"如果启用了字体表单的风格集； 否则，","Offset along the X axis.":"沿X轴偏移。","The percentage of buffering completed for streaming content represented in a value between 0 and 1.":"在0到1之间表示的流媒体内容完成的缓冲百分比。","The y-axis skew angle, which is measured in degrees counterclockwise from the x-axis. For more information, see the ":"Y轴偏斜角，以X轴逆时针旋转以度为单位。 有关更多信息，请参阅","The x-coordinate of the transform center. For more information, see the ":"转换中心的X坐标。 有关更多信息，请参阅"," that represents the distance from the start of the line to the end of the text marker symbol.":"这表示从线的开头到文本标记符号末端的距离。","The new root ":"新的根","true if the media can be paused; otherwise, false.":"如果可以暂停媒体，则是真的； 否则，错误。","Offset along the Y axis.":"沿Y轴抵消。","The y-coordinate of the transform center. For more information, see the ":"转换中心的Y坐标。 有关更多信息，请参阅"," value that represents the auto-numbering counter of counter-style text marker.":"代表反风格文本标记的自动数量计数器的值。","The clock associated with the ":"与","The skew angle, which is measured in degrees counterclockwise from the y-axis. The default is 0.":"偏斜角，从y轴逆时针以逆时针测量。 默认值为0。","Offset along the Z axis.":"沿Z轴抵消。","A visual target (instance of a ":"一个视觉目标（一个实例 "," to be played. The default is null.":"要玩。 默认值为null。"," value that represents the properties shared by every text character of the text marker.":"代表文本标记每个文本字符共享的属性的值。","Rect3D to be translated.":"rect3d要翻译。"," derived class).":"派生类）。","The skew angle, which is measured in degrees counterclockwise from the x-axis. The default is 0.":"偏斜角，以x轴逆时针方向的度数测量。 默认值为0。","A list of weak references.":"弱参考列表。"," object that represents the offset of the text marker symbol.":" 表示文本标记符号的偏移量的对象。"," value that represents the result of the offset.":"代表偏移结果的值。"," if the object is disposed; otherwise, ":"如果物体被处置； 否则，"," to be translated.":"要翻译。","The root visual.":"根视觉。"," that specifies the offset translation.":"这指定了偏移翻译。"," enumeration indicating the current status of the associated drag-and-drop operation.":"枚举表示关联的拖放操作的当前状态。"," instances are unequal, false otherwise.":"实例不平等，否则是错误的。","A Boolean value indicating whether the ESC key has been pressed. ":"布尔值表示是否已按下ESC键。","String that represents a ":"代表一个的字符串"," if the ESC was pressed; otherwise, ":"如果施加了ESC； 否则，"," whose union with the specified ":"与指定的联合"," is to be evaluated.":"要评估。","The path to the associated content.":"相关内容的路径。"," whose union with the current ":"其与电流的结合","The path, as declared in the attribute.":"该路径，如属性中所声明。","The type where the routed event is added.":"添加路由事件的类型。"}