{"The object containing the permissions to perform the intersection with.":"包含执行交点的权限的对象。"," constructor string.":"构造函数字符串。","The query used to select the events to export.  Only the events returned from the query will be exported.":"用于选择要导出的事件的查询。 只有从查询返回的事件才会出口。","the authentication scheme that was responsible for this ticket.":"负责此票的身份验证方案。","A value that specifies whether to use Optimal Asymmetric Encryption Padding (OAEP).":"指定是否使用最佳不对称加密填充（OAEP）的值。","The path to the log file (ends in .evtx) in which the exported events will be stored after this method is executed.":"在执行此方法后，将存储导出事件的日志文件（以.EVTX结束）的路径。","The identity associated with the given key, or if not found.":"与给定密钥相关的身份，或者如果找不到的话。","The logical intersection between the ":"逻辑交集","A string containing the URI connection controlled by the current ":"一个包含由电流控制的URI连接的字符串","A byte array that contains the plain text key.":"包含纯文本键的字节数组。","The query used to select the events to export. Only the events returned from the query will be exported.":"用于选择要导出的事件的查询。 只有从查询返回的事件才会出口。","The optional list of claim values, which, if present, \n            the claim must match.":"索赔值的可选列表，如果存在， \n             索赔必须匹配。"," and a given object that implements ":"和一个实现的给定对象","The XML element to encrypt.":"XML元素加密。","A string containing a regular expression pattern that describes the URI connection controlled by this ":"一个包含正则表达式模式的字符串，描述了由此控制的URI连接"," indicates that the method will continue exporting events even if the specified query fails for some logs, and ":"指示该方法将继续导出事件，即使指定的查询因某些日志失败，并且","The object to compare to.":"比较的对象。","\n            A flag indicating whether authorization has succeeded.\n            Returns a flag indicating whether the user, and optional resource has fulfilled the policy.    \n            ":"指示授权是否成功的标志。 \n             返回指示用户和可选资源是否符合策略的标志。","A string representation of the current permission object.":"当前权限对象的字符串表示。"," indicates that this method will not continue to export events when the specified query fails.":"指示当指定查询失败时，此方法将不会继续导出事件。","The X.509 certificate to use for encryption.":"用于加密的X.509证书。"," if the permission state is equal; otherwise, ":"如果许可状态相等； 否则，","The parameters for the component.":"组件的参数。","Contextual information about the source or destination.":"有关源或目的地的上下文信息。","The culture that specifies which language that the exported event messages will be in.":"指定导出事件消息将使用哪种语言的文化。"," if the permission state for the ":"如果许可状态"," element that represents the encrypted XML data.":"代表加密XML数据的元素。","\n            An optional format to use when converting values. \n            ":"转换值时使用的可选格式。","A bitwise combination of the enumeration values that specify the host resources that are inaccessible to partially trusted code.":"枚举值的比重组合指定了部分信任的代码无法访问的主机资源。","The name of the event log to get information about, or the path to the event log file to get information about.":"事件日志的名称以获取有关事件日志文件的信息，以获取有关信息。"," with attribute values based on the current ":"基于当前的属性值","A key name that can be found in the key mapping table.":"可以在密钥映射表中找到的关键名称。","with the initial parameters to use for rendering.":"最初的参数用于渲染。","A bitwise combination of the enumeration values that specify the demanded host resources.":"指定所需的主机资源的枚举值的位组合。"," object that represents the encrypted XML data.":"代表加密XML数据的对象。","An object that contains information about the specified log.":"包含有关指定日志的信息的对象。","The object to perform the union with.":"与联合进行联合的对象。","String representation of the constraint":"限制的字符串表示"," values identifying the protection resources causing the exception to be thrown. The default is ":"识别导致例外的保护资源的值。 默认值为","The logical union of the ":"逻辑联盟","Type-specific RouteConstraint object":"特定于类型的路由对象","An enumerable collection of strings that contain the event log names.":"包含事件日志名称的字符串集合。","The symmetric algorithm to use for encryption.":"用于加密的对称算法。"," values identifying the inaccessible host protection categories. The default is ":"识别无法访问的主机保护类别的值。 默认值为","A byte array of encrypted data.":"一个字节阵列的加密数据。"," and an object that implements ":"和一个实现的对象","A predefined session object that is connected to the Event Log service on the local computer.":"在本地计算机上连接到事件日志服务的预定义的会话对象。","The urls the hosted application will listen on.":"URL托管应用程序将继续听。","The evidence for the application to be activated.":"应用程序被激活的证据。","The element or its contents to encrypt.":"要加密的元素或其内容。","The security action represented by an enumeration member of ":"由枚举成员代表的安全行动","The HTTP status code to associate with this exception.":"HTTP状态代码与此例外相关联。","The name of the event log for which the status code is obtained.":"获得状态代码的事件日志的名称。","Optionally, the evidence for the activating application domain.":"可选地，激活应用程序域的证据。"," to encrypt only the contents of the element; ":"仅加密元素的内容；","The status code or error code for the event log.":"事件日志的状态代码或错误代码。","The trust context.":"信任上下文。"," if the ssquery strings are equal.":"如果ssquery弦相等。",". Determines the permission state of the attribute.":"。 确定属性的权限状态。"," to encrypt the entire element.":"加密整个元素。","Specifies a query for the event subscription. When an event is logged that matches the criteria expressed in the query, then the ":"指定事件订阅的查询。 记录了与查询中表达的标准匹配的事件时，","The metadata items.":"元数据项目。","An object that contains trust information about the application.":"包含有关应用程序的信任信息的对象。","An existing ":"现有","A byte array that contains the encrypted data.":"包含加密数据的字节数组。","The evidence type.":"证据类型。"," event is raised.":"事件已提高。","A function that handles the request or calls the given next function.":"处理请求或调用给定的下一个功能的函数。"," used to create a new ":"用于创建新的","The key to encrypt.":"加密的关键。","The requested application domain evidence.":"请求的应用域证据。","A Boolean value that determines whether to read the events that already exist in the event log. If this value is ":"一个布尔值，该值决定是否读取事件日志中已经存在的事件。 如果此值为","\n                This method is obsolete and will be removed in a future version.\n                The recommended alternative is ":"此方法已过时，将在未来版本中删除。 \n                 推荐的替代方法是","The asymmetric key used to encrypt ":"用于加密的不对称键","A security action associated with a custom security attribute.":"与自定义安全属性关联的安全操作。",", then the existing events are read and if this value is ":"，然后读取现有事件，如果此值为","The target assembly.":"目标组件。","\n                The key of the value to get.\n            ":"值得获得的关键。","A byte array that represents the encrypted value of the ":"一个字节阵列，代表该字节的加密值",", then the existing events are not read.":"，然后没有阅读现有事件。","Options to set when instantianting the HTTP context object.":"固定HTTP上下文对象时要设置的选项。"," to indicate that a blank password is allowed; otherwise, ":"表示允许使用空白密码； 否则，","The requested assembly evidence.":"要求的大会证据。","An array of evidence types.":"一系列证据类型。","The path or name of the event log monitor for events. If any event is logged in this event log, then the ":"事件日志监视器的路径或名称。 如果在此事件日志中记录了任何事件，则","A permitted connection string.":"允许的连接字符串。","The symmetric key used to encrypt ":"用于加密的对称键","Factory object used to create the service scope for the HTTP context.":"用于创建HTTP上下文的服务范围的工厂对象。","Additional evidence to add to the ":"其他证据要添加到","String that identifies connection string parameters that are allowed or disallowed.":"标识允许或不允许的连接字符串参数的字符串。"," object that contains the initialization vector (IV) to retrieve.":"包含要检索的初始化向量（IV）的对象。","Object to be used to access the HTTP context instance.":"用于访问HTTP上下文实例的对象。"," when this object can deliver events to the event delegate; ":"当此对象可以将事件传递给事件委托时；"," when this object has stopped delivery.":"当此对象停止交付时。","Options to set when instantianting the Default HTTP context object.":"固定默认HTTP上下文对象时要设置的选项。","The Uniform Resource Identifier (URI) that describes the cryptographic algorithm associated with the ":"描述与该密码算法的统一资源标识符（URI）","A copy of the current permission object.":"当前权限对象的副本。"," evidence.":"证据。","HTTP context to dispose.":"HTTP上下文处置。","A string that contains the description template associated with the event.":"包含与事件关联的描述模板的字符串。","A byte array that contains the decryption initialization vector (IV).":"包含解密初始化矢量（IV）的字节阵列。","A permission object to intersect with the current permission object. It must be of the same type as the current permission object.":"与当前权限对象相交的权限对象。 它必须与当前权限对象相同。","The evidence to be used for the ":"用于使用的证据","\n            if the stamp matches the persisted value, otherwise it will return false.":"如果邮票匹配持续的值，否则它将返回false。","An enumerable collection of the keywords associated with the event.":"与事件关联的关键字的枚举集合。"," object that contains the decryption key to retrieve.":"包含要检索的解密密钥的对象。","A new permission object that represents the intersection of the current permission object and the specified permission object. This new permission object is a null reference (":"一个新的权限对象，代表当前权限对象和指定权限对象的交点。 这个新的权限对象是一个null引用（","Additional evidence to add to the assembly evidence.":"其他证据要添加到大会证据中。","Flag indicating whether the current browser should be remember, suppressing all further \n            two factor authentication prompts.":"标志指示当前浏览器是否应记住，进一步抑制 \n             两个因素身份验证提示。","The level associated with the event.":"与事件相关的级别。","The evidence to be used for the assembly.":"用于大会的证据。"," in Visual Basic) if the intersection is empty.":"在Visual Basic中）如果交叉点为空。","The size of the decryption key to retrieve.":"取回的解密密钥的大小。","A link to the event log.":"事件日志的链接。","Flag indicating whether to bypass two factor authentication.":"指示是否绕过两个因素身份验证的标志。","The evidence set used to evaluate policy.":"用于评估政策的证据集。"," object associated with the decryption key.":"与解密密钥关联的对象。","A permission object that is to be tested for the subset relationship. This object must be of the same type as the current permission object.":"将测试子集关系的权限对象。 此对象必须与当前权限对象相同。","The opcode associated with this event.":"与此事件关联的OpCode。","The permission set that can be granted by the security system.":"安全系统可以授予的权限集。","The services available in the application.":"应用程序中可用的服务。"," if the current permission object is a subset of the specified permission object, otherwise ":"如果当前权限对象是指定权限对象的子集，则"," object that contains an element with an ID value.":"包含具有ID值的元素的对象。","The task associated with the event.":"与事件关联的任务。","The implementation of ":"实施","The security policy for the current application domain. The default is ":"当前应用程序域的安全策略。 默认值为"," if the permission can be represented as unrestricted.":"如果可以将许可表示为无限制。","A string that represents the ID value.":"表示ID值的字符串。","A string that contains the template for the event.":"包含事件模板的字符串。","A set of ":"一套","One of the enumeration values that specifies security policy components. The default is ":"指定安全策略组件的枚举值之一。 默认值为"," object that contains an ID indicating how internal Uniform Resource Identifiers (URIs) are to be resolved.":"包含ID的对象，该ID表示如何解决内部统一资源标识符（URI）。","A permission object to combine with the current permission object. It must be of the same type as the current permission object.":"与当前权限对象结合的权限对象。 它必须与当前权限对象相同。","A byte value that contains the version of the event.":"包含事件版本的字节值。"," of the current object's identity.":"当前对象的身份。","A new permission object that represents the union of the current permission object and the specified permission object.":"代表当前权限对象和指定权限对象的联合的新许可对象。",") \n            of the root node is ":"） \n             根节点是"," element to replace.":"要替换的元素。"," if a blank password is allowed, otherwise, ":"如果允许使用空白密码，否则，","The policy-level context to resolve named permission set references.":"解决命名权限集引用的策略级别上下文。","The localized name for an event opcode.":"事件opcode的本地名称。","The location at which the status of requested content can be monitored\n            It is an optional parameter and may be null":"可以监视请求内容状态的位置 \n             这是一个可选参数，可能为null","The decrypted data to replace ":"解密的数据替换","One of the security action values representing an action that can be performed by declarative security.":"代表可以通过声明性安全性执行的操作的安全操作值之一。","The non-localized name for an event opcode.":"事件opcode的非定位名称。","The root element of the XML representation of the policy object.":"策略对象的XML表示的根元素。","\n            API conventions are used to influence the output of ApiExplorer. \n            Conventions must be static types. Methods in a convention are\n            matched to an action method using rules specified by ":"API约定用于影响APIEXPLORER的输出。 \n             约定必须是静态类型。 大会中的方法是 \n             使用由规则指定的规则与操作方法匹配"," if the attribute should serialize the connection string; otherwise ":"如果属性应序列化连接字符串； 否则","The element to replace with an ":"替换为","The numeric value associated with the event opcode.":"与事件OPODE关联的数字值。"," of the convention. \n            ":"公约。","The named permission set from which to create the new instance.":"从中创建新实例的命名权限集。"," object to replace the ":"替换的对象"," if the attribute should serialize the set of key restrictions; otherwise ":"如果属性应序列化键限制集； 否则","The value of the event property.":"事件属性的价值。","The name for the new named permission set.":"新命名权限集的名称。","\n            Casing is used to delineate words in a given name. For instance, with this behavior \n            the convention name \"Get\" will match \"Get\", \"GetPerson\" or \"GetById\", but not \"getById\", \"Getaway\".\n            ":"套管用于用给定名称描绘单词。 例如，这种行为 \n             会议名称“ GET”将匹配“ GET”，“ GetPerson”或“ GetByid”，而不是“ GetByid”，“ Getaway”。"," to replace only the contents of the element; ":"仅替换元素的内容；"," if a blank password is allowed; otherwise ":"如果允许使用空白密码； 否则","\n            Casing is used to delineate words in a given name. For instance, with this behavior \n            the convention name \"id\" will match \"id\", or \"personId\" but not \"grid\" or \"personid\".\n            ":"套管用于用给定名称描绘单词。 例如，这种行为 \n             公约名称“ ID”将匹配“ ID”或“ persyid”，但不能匹配“网格”或“ persyid”。","The exception that occurred when the event subscription failed.":"事件订阅失败时发生的例外。","One or more connection string parameters that are allowed or disallowed.":"一个或多个连接字符串参数允许或不允许。","The name for the named permission set.":"指定权限集的名称。"," to replace the entire element.":"替换整个元素。","The event record.":"事件记录。","Determines if the method throws if a related assembly could not be located.":"确定该方法是否抛出了是否无法找到相关的组件。","Indicates whether a blank password is allowed.":"指示是否允许使用空白密码。","The permission set from which to take the value of the new named permission set.":"获取新命名权限集值的权限集。"," values that specifies the type of padding used for encryption.":"指定用于加密的填充类型的值。","The localized name for the event task.":"事件任务的本地名称。",". \n            When ":"。 \n             什么时候"," values representing an action that can be performed by using declarative security.":"代表可以使用声明性安全性执行的操作的值。","The recipient of the encrypted key information.":"加密密钥信息的接收者。","A permission set that is a copy of the permissions in the named permission set.":"权限集，是指定权限集中权限的副本。","The event GUID associated with the task.":"与任务相关的事件指南。"," is a subset of ":"是","A copy of the named permission set with the new name.":"带有新名称的命名权限集的副本。","This property has been marked as obsolete. Setting this property will have no effect.":"该属性已被标记为过时。 设置此属性将无效。","The Uniform Resource Identifier (URI) that describes the algorithm represented by an instance of the ":"描述以该算法为代表的算法的统一资源标识符（URI）","The non-localized name of the event task.":"事件任务的非定位名称。","A security element containing the XML representation of the named permission set.":"包含命名权限集的XML表示的安全元素。"," was not found in the original \n            ":"在原始中没有发现"," object that encapsulates an instance of the ":"封装一个实例的对象","A comma-delimited list of providers allowed by the security policy.":"安全策略允许的提供者列表。","The numeric value associated with the task.":"与任务关联的数字值。","ContentType set on the action result":"contentType设置了动作结果","The XML representation of the named permission set.":"命名权限集的XML表示。"," object to parse.":"对象解析。","The key restrictions.":"关键限制。"," property set\n            on ":"属性集 \n             上","The name of the event provider that you want to retrieve information about.":"您要检索有关信息的活动提供商的名称。","A Uniform Resource Identifier (URI) that describes the algorithm to use for XML encryption.":"描述用于XML加密的算法的统一资源标识符（URI）。"," enumerations.":"枚举。","A text description of the named permission set.":"命名权限集的文本描述。"," object that specifies whether to get the provider information from a provider on the local computer or a provider on a remote computer.":"指定是否从本地计算机上的提供商或远程计算机上提供商获取提供商信息的对象。","The default content type of the action result.":"操作结果的默认内容类型。","The algorithm key size, in bits, used for XML encryption.":"算法密钥大小，用于XML加密。"," if a blank password is allowed, otherwise ":"如果允许使用空白密码，则","The name of the named permission set.":"命名权限集的名称。","The culture that specifies the language that the information should be returned in.":"指定信息应返回的语言的文化。","The content type to be used for the response content type header":"用于响应内容类型标头的内容类型"," that contains the XML encoding used to reconstruct the permission.":"其中包含用于重建权限的XML编码。"," values representing an action that can be performed using declarative security.":"代表可以使用声明性安全性执行的操作的值。"," object to use for initialization.":"用于初始化的对象。","Returns a string that contains the localized name of the event provider.":"返回一个包含事件提供商本地名称的字符串。","Encoding to be used for writing the response":"编码用于编写响应"," if the attribute should serialize the set of key restrictions, otherwise ":"如果属性应序列化键限制集，则","A permission to intersect with the current permission. It must be the same type as the current permission.":"与当前许可相交的许可。 它必须与当前权限相同。","The ID of the current ":"电流的ID","Returns an enumerable collection of ":"返回枚举的集合","The set of actions that satisfy all constraints.":"满足所有约束的一组动作。"," object that represents an ":"代表一个的对象","A permission to test for the subset relationship. This permission must be the same type as the current permission.":"测试子集关系的许可。 此权限必须与当前许可相同。","Returns the GUID value for the event provider.":"返回事件提供商的GUID值。","One of the enumeration values that specifies an access level.":"指定访问级别的枚举值之一。","A list of the best matching actions.":"最佳匹配动作的列表。","The target of the ":"目标","Returns a string that contains the path of the provider message file.":"返回一个包含提供商消息文件路径的字符串。","The name of the computer on which to read or write events.":"要读取或编写事件的计算机名称。"," if the model property can be bound, otherwise ":"如果模型属性可以约束，否则","An XML encoding of the permission, including state information.":"XML对许可的编码，包括状态信息。","The position at which the new element is inserted.":"插入新元素的位置。"," that corresponds to the attribute.":"这与属性相对应。","An array of  objects that represent permission entries. The ":"代表权限条目的一系列对象。 这","Returns a string that contains the unique name of the event provider.":"返回一个包含事件提供商的唯一名称的字符串。"," or \n            anything assignable to the given ":"或者 \n             任何可分配给给定的"," property is set to this value.":"属性设置为此值。"," object to locate in the ":"对象要定位在",". \n            ":"。"," if data can be encrypted; otherwise, ":"如果数据可以加密； 否则，","Returns a string that contains the path of the file that contains the message table resource that has the strings used for parameter substitutions in event descriptions.":"返回一个包含文件路径的字符串，该路径包含消息表资源，该字符串在事件描述中用于参数替换的字符串。"," object is found in the ":"对象在","If set to true, makes the redirect permanent (301). Otherwise a temporary redirect is used (302).":"如果设置为真，则使重定向永久（301）。 否则使用临时重定向（302）。","One of the enumeration values that specifies the permission state (full access or no access to resources).":"指定权限状态的枚举值之一（完全访问或不访问资源）。"," if memory can be encrypted; otherwise, ":"如果内存可以加密； 否则，","Returns a string that contains the path to the file that contains the metadata associated with the provider.":"返回一个包含文件的路径的字符串，其中包含与提供商关联的元数据。"," object that is the destination of the elements copied from the ":"是从","\n            The endpoints that were chosen as a result of lookup based on the route values returned by\n            ":"根据查找而根据返回的路由值选择的端点"," if data can be unencrypted; otherwise, ":"如果数据未加密； 否则，","A collection that contains the permission entries for this permissions request.":"包含此权限请求的权限条目的集合。","A resource identifier that corresponds to a string defined in the message resource file of the event source.":"与事件源的消息资源文件中定义的字符串相对应的资源标识符。","The one-dimensional array of  ":"一维的阵列"," if memory can be unencrypted; otherwise, ":"如果记忆未加密； 否则，"," that represents the created permission.":"这代表创建的权限。","A resource identifier that corresponds to a string defined in the category resource file of the event source, or zero to specify no category for the event.":"与事件源的类别资源文件中定义的字符串相对应的资源标识符，或零以指定事件的类别。","\n            A metadata interface which specifies a route value which is required for the action selector to\n            choose an action. When applied to an action using attribute routing, the route value will be added\n            to the ":"一个指定操作选择器所需的路由值的元数据接口 \n             选择一个动作。 当使用属性路由应用于操作时，将添加路由值 \n             到"," object that can be used to iterate through an ":"可以用来通过一个迭代的对象","A list of environment variables (semicolon-separated) to which access is granted.":"授予访问权限的环境变量（半分隔）的列表。"," when the action is selected.\n            ":"选择动作时。"," value that indicates the event type.":"表示事件类型的值。","The name of the computer on which events might be read. The default is \".\".":"可能会读取事件的计算机名称。 默认值为“。”。","A list of environment variables (semicolon-separated).":"环境变量列表（半分离）。"," if found in the collection; otherwise, -1.":"如果在收藏中发现； 否则，-1。","The authentication schemes to use when signing in the user.":"在用户签名时要使用的身份验证方案。","A numeric category value or resource identifier that corresponds to a string defined in the category resource file of the event source. The default is zero, which signifies that no category will be displayed for the event entry.":"数字类别值或资源标识符对应于事件源的类别资源文件中定义的字符串。 默认值为零，这表示事件条目将不显示任何类别。"," values. The ":"值。 这"," values that represents a single type of environment variable access.":"代表单一类型的环境变量访问的值。"," contain a single valid \n            range request. A ":"包含一个有效的 \n             范围请求。 一个","The name of the computer on which to read or write events. The ":"要读取或编写事件的计算机名称。 这"," object that encapsulates the algorithm used for XML encryption.":"封装用于XML加密的算法的对象。","A list of environment variables (semicolon-separated) for the selected flag.":"所选标志的环境变量列表（半分隔）。"," value that indicates the event entry type. The default value is ":"表示事件输入类型的值。 默认值是"," object that contains an asymmetric key to use for decryption.":"包含用于解密的不对称键的对象。","The zero-based index of the added ":"添加的基于零的索引"," which represents the normalized form of the \n            range parsed from the ":"代表标准化形式的形式 \n             从","A list of environment variables for full access.":"环境变量列表，用于完整访问。","The name of the log on the local computer.":"本地计算机上的日志名称。","A stream object that contains an ":"一个包含一个的流对象"," objects that contains the permission entries to add.":"包含要添加的权限条目的对象。","A list of environment variables for read access.":"读取访问的环境变量列表。","An action to configure \n            the ":"配置的动作 \n             这","The name of the log on the specified computer.":"指定计算机上的日志名称。"," that contains the permission entries to add.":"其中包含要添加的权限条目。","A list of environment variables for write access.":"用于写入访问的环境变量列表。"," used to create tag helper instances.\n            ":"用于创建标签助手实例。"," for the current executing action.":"对于当前执行操作。","The computer on which the log exists.":"日志存在的计算机。"," belongs to this collection; otherwise, ":"属于此集合； 否则，"," values (":"值（","The name of the log on the specified computer":"指定计算机上的日志名称","The application relative path of the page.":"页面的申请相对路径。"," that receives this collection's permission entries.":"收到此集合的权限条目。","The XML encoding used to reconstruct the permission.":"用于重建权限的XML编码。"," element to decrypt.":" 元进行解密。","The deserialized content, ":"挑剔的内容，","The zero-based index at which to begin copying the permission entries.":"基于零的索引开始复制权限条目。","The source of event log entries.":"事件日志条目的来源。","A permission that is to be tested for the subset relationship. This permission must be the same type as the current permission.":"要测试子集关系的许可。 此权限必须与当前许可相同。"," object that contains a decrypted ":"包含解密的对象"," that is backed by a unbuffered writer (over the Response stream) and/or a \n            ":"这是由一个未封闭的作家（在响应流）和/或","The permission entry to search for.":"搜索许可条目。","The configuration properties for the event source and its target event log.":"事件源的配置属性及其目标事件日志。","The permitted access to files.":"允许对文件的访问。","The type of object to enumerate.":"枚举的对象类型。","The URL where the form-data should be submitted.":"应提交表单数据的URL。","The zero-based index of the specified permission entry, or -1 if the permission entry was not found in the collection.":"指定权限条目的基于零的索引，或-1，如果在集合中找不到权限条目。","The source name by which the application is registered on the local computer.":"该应用程序在本地计算机上注册的源名称。"," if permission to open files through the file dialog is declared; otherwise, ":"如果声明通过“文件”对话框打开文件的权限； 否则，","The XML element from which to load the ":"从中加载的XML元素","The zero-based index of the collection at which to insert the permission entry.":"插入权限条目的集合的零索引。"," containing the select list for the given\n            ":"包含给定的选择列表","The name of the log the source's entries are written to. Possible values include Application, System, or a custom event log.":"日志的名称写入源条目。 可能的值包括应用程序，系统或自定义事件日志。"," if permission to save files through the file dialog is declared; otherwise, ":"如果声明通过“文件”对话框保存文件的权限； 否则，"," state.":"状态。"," \n            An ":"一个","The source by which the application is registered on the specified computer.":"应用程序在指定计算机上注册的来源。","The permission entry to insert into this collection.":"插入此集合的权限条目。"," objects contained in the ":"包含在","The absolute path of the file or directory.":"文件或目录的绝对路径。","The new value of the permission entry at ":"许可条目的新价值"," \n            against which ":"对此","The name of the log the source's entries are written to. Possible values include Application, System, or a custom event log. If you do not specify a value, ":"日志的名称写入源条目。 可能的值包括应用程序，系统或自定义事件日志。 如果您不指定值，","The key information identity.":"关键信息身份。","An array containing the absolute paths of the files and directories.":"包含文件和目录的绝对路径的数组。"," defaults to Application.":"默认为应用程序。","The permission entry to remove from ":"删除的权限条目","\n            Value of named ":"命名的值"," if the\n            ":"如果是","The absolute path of a file or directory.":"文件或目录的绝对路径。","An XML representation of the ":"XML表示","The permission entry to remove.":"许可条目删除。","The name of the computer to register this event source with, or \".\" for the local computer.":"注册此事件源的计算机名称或“”。 对于本地计算机。"," that specifies the state of the ":"指定了"," values that represents a single type of file access.":"代表单一类型的文件访问的值。","The HTML tag name that the scope is associated with.":"范围与之关联的HTML标签名称。","The zero-based index into the collection.":"基于零的索引到集合中。","The name of the log to delete. Possible values include: Application, Security, System, and any custom event logs on the computer.":"删除日志的名称。 可能的值包括：应用程序，安全性，系统和计算机上的任何自定义事件日志。","An array containing the paths of the files and directories to which access specified by the ":"一个包含文件和目录的路径的数组"," object that encapsulates an encrypted key.":" 封装加密密钥的对象。"," with the parsed values if parsing is successful; \n            otherwise ":"如果解析成功，则解析值； \n             否则"," that exists at the specified index.":"在指定的索引中存在。","The name of the log to delete. Possible values include: Application, Security, System, and any custom event logs on the specified computer.":"要删除的日志的名称。 可能的值包括：应用程序、安全性、系统和指定计算机上的任何自定义事件日志。","An XML representation of a ":"XML表示"," parameter is granted.":"授予参数。"," is considered valid\n            for the current request, otherwise ":"被认为有效 \n             对于当前请求，否则"," object that specifies the state of the ":"指定状态的对象","The server on which the performance counter and its associate category reside.":"性能计数器及其关联类别所在的服务器。","The name of the computer to delete the log from, or \".\" for the local computer.":"将日志从或“”删除的计算机名称。 对于本地计算机。","A permission to combine with the current permission. It must be the same type as the current permission.":"与当前许可结合的权限。 它必须与当前权限相同。","\n            then it will be tranformed into an instance of ":"然后将其转换为","The string identifier that is the value of the ":"字符串标识符是","The name of the performance counter category (performance object) with which the performance counter is associated.":"与性能计数器相关的性能计数器类别（性能对象）的名称。","The name by which the application is registered in the event log system.":"在事件日志系统中注册应用程序的名称。","The set of file I/O flags for all files.":"所有文件的文件I/O标志集。","The route name. Can be null.":"路线名称。 可以是零的。","The set of file I/O flags for all local files.":"所有本地文件的文件I/O标志集。","The name of the computer to remove the registration from, or \".\" for the local computer.":"计算机的名称以从或“”中删除注册。 对于本地计算机。"," objects. The ":" 物体。 该 ","An XML element from which to take the content used to create the new instance of ":"XML元素，从中获取用于创建新实例的内容","Access to the information in the path itself. This helps protect sensitive information in the path, such as user names, as well as information about the directory structure revealed in the path. This value does not grant access to files or folders represented by the path.":"访问路径本身中的信息。 这有助于保护路径中的敏感信息，例如用户名，以及有关路径中揭示的目录结构的信息。 此值不授予对路径代表的文件或文件夹的访问。"," to compute precendence for.":" 来计算precendence for。"," that contains the permission entries for this permissions request.":"其中包含此权限请求的权限条目。","The XML content of the current ":"当前的XML内容","The name of the log to search for. Possible values include: Application, Security, System, other application-specific logs (such as those associated with Active Directory), or any custom log on the computer.":"搜索日志的名称。 可能的值包括：应用程序，安全性，系统，其他特定于应用程序的日志（例如与Active Directory关联的日志）或计算机上的任何自定义日志。","The absolute path of the file or directory for full access.":"完整访问的文件或目录的绝对路径。"," representing the route's precendence.":"代表路线优先。","The name of the performance counter category (performance object).":"性能计数类别的名称（性能对象）。"," values that represents the permissions for all files. The default is ":"代表所有文件的权限的值。 默认值为","The Uniform Resource Identifier (URI) of the information to be referenced by the new instance of ":"新实例所引用的信息的统一资源标识符（URI）"," if the log exists on the local computer; otherwise, ":" 如果日志存在于本地计算机上；否则, ",") pairs to evalute when producing a URI.\n            ":"）成对以评估产生URI时。","The server on which the category of the performance counter resides.":"性能计数器类别所在的服务器所在的服务器。","The URI that describes the type of data to retrieve.":"描述要检索数据类型的URI。"," values that represents the permissions for all local files. The default is ":" 表示所有本地文件的权限的值。 默认值为 ","The log for which to search. Possible values include: Application, Security, System, other application-specific logs (such as those associated with Active Directory), or any custom log on the computer.":"搜索的日志。 可能的值包括：应用程序，安全性，系统，其他特定于应用程序的日志（例如与Active Directory关联的日志）或计算机上的任何自定义日志。","The block that is reserved for the called. It must be passed to Return when it is no longer being used.":"为调用保留的块。 它必须通过不再使用时返回。","The XML element that specifies the state of the ":"指定该状态的XML元素","The name of the performance counter category (performance object) with which this performance counter is associated.":"与此性能计数器相关的性能计数器类别（性能对象）的名称。","The absolute path of the file or directory for append access.":"用于附加访问的文件或目录的绝对路径。","The Task to be marshaled.":"要安装的任务。","A Uniform Resource Identifier (URI) that describes the type of data to be retrieved.":"描述要检索的数据类型的统一资源标识符（URI）。","The name of the computer on which to search for the log, or \".\" for the local computer.":"要在其上搜索日志的计算机的名称，或\"。\"对于本地计算机。","The name of the server on which the category resides.":"类别居住的服务器的名称。","The ASN.1 DER encoding of an ":"ASN.1 der编码"," if the log exists on the specified computer; otherwise, ":"如果该日志存在于指定的计算机上； 否则，","The absolute path of the file or directory in which access control information can be changed.":"可以更改访问控制信息的文件或目录的绝对路径。"," object belongs to this collection; otherwise, ":"对象属于此集合； 否则，","\n            Value must be greater than 0, defaults to 100\n            ":"值必须大于0，默认为100"," object to initialize the new instance of ":"对象初始化新实例"," that represents the logs on the local computer.":"这代表本地计算机上的日志。","The permission entry for which to search.":"搜索的权限条目。","\n            Value must be greater than or equal to 0, defaults to 4096\n            ":"值必须大于或等于0，默认为4096"," values that specifies how much of the certificate chain to include.":"指定证书链中的多少值。","The absolute path of the file or directory for read access.":"读取访问的文件或目录的绝对路径。","\n            Value must be between 2^14 and 2^24, defaults to 2^14 (16,384)\n            ":"值必须在2^14到2^24之间，默认为2^14（16,384）","The computer on which to search for event logs.":"搜索事件日志的计算机。"," object that exists at the specified index.":"在指定索引上存在的对象。","The absolute path of the file or directory in which access control information can be viewed.":"可以查看访问控制信息的文件或目录的绝对路径。","The issuer name portion of the pair to add to the ":"该对的发行人名称部分添加到","\n            Value must be greater than 0, defaults to 2^14 (16,384)\n            ":"值必须大于0，默认值为2^14（16,384）"," that represents the logs on the given computer.":"这代表给定计算机上的日志。","The absolute path of the file or directory in which file data can be viewed and modified.":"可以查看和修改文件数据的文件或目录的绝对路径。","The serial number portion of the pair to add to the ":"该对的序列号部分要添加到","A permission object of the same type as the current permission object.":"与当前权限对象类型相同的权限对象。","The absolute path of the file or directory for write access.":"用于写入访问的文件或目录的绝对路径。","The name of the computer on which to look, or \".\" for the local computer.":"要看的计算机名称或“”。 对于本地计算机。","\n            Value must be greater than 0, defaults to 4096\n            ":"值必须大于0，默认为4096","A new permission object that represents the intersection of the current object and the specified target. This object is ":"一个代表当前对象和指定目标的相交的新权限对象。 这个对象是"," that contains the XML encoding to use to create the permission.":"其中包含用于创建权限的XML编码。","A byte array that represents the subject key identifier (SKI) to add to the ":"代表主题密钥标识符（SKI）的字节数组以添加到","The name of the log associated with the specified source in the registry.":"与注册表中指定源关联的日志名称。","\n            Value must be greater than 0, defaults to 8192\n            ":"\n            值必须大于0，默认值为8192\n            ","A string that represents the subject key identifier (SKI) to add to the ":"代表主题密钥标识符（SKI）的字符串以添加到"," if the current permission object is a subset of ":"如果当前权限对象是","The overflow behavior for writing new entries to the event log.":"编写事件日志的新条目的溢出行为。","A new permission that represents the intersection of the current permission and the specified permission. The new permission is ":"代表当前许可和指定许可的交集的新许可。 新的权限是","A reference to the known scheme, if the input matches any":"对已知方案的引用，如果输入匹配任何"," if permission is unrestricted; otherwise, ":"如果许可不受限制； 否则，","The name of the entity that was issued an X.509 certificate to add to the ":"签发X.509证书的实体的名称以添加到","The minimum number of days each event log entry is retained. This parameter is used only if ":"每个事件日志输入的最小天数。 仅在","A permission object to test for the subset relationship. The permission must be of the same type as the current permission.":"测试子集关系的权限对象。 许可必须与当前许可相同。","The fully specified path to a localized resource file.":"局部资源文件的完全指定路径。","A list of the X.509 certificates contained in the ":"X.509证书的列表","\n            A callback that will be invoked to dynamically select a server certificate. This is higher priority than ServerCertificate.\n            If SNI is not available then the name parameter will be null.\n            ":"将调用以动态选择服务器证书的回调。 这比ServerCertifutate更高。 \n             如果SNI不可用，则名称参数将为null。"," class that is an identical copy of the current instance.":"类是当前实例的相同副本。"," that represents the XML encoding of the permission, including any state information.":" 表示权限的XML编码，包括任何状态信息。","The XML encoding to use to reconstruct the ":"XML编码用于重建","The Certificate Revocation List (CRL) contained within the ":"包含的证书撤销列表（CRL）","A 32-bit word containing a Huffman encoded symbol.":"一个32位单词，其中包含霍夫曼编码的符号。","The resource identifier that indexes a localized string within the resource file.":"索引资源文件内的本地化字符串的资源标识符。"," that corresponds to the current attribute.":"这对应于当前属性。"," instance to intersect with the current instance.":"实例与当前实例相交。"," structures that represent an issuer name and serial number pair.":"代表发行人名称和序列号对的结构。","\n            The number of bits in ":"位中的数量"," if the event source is registered on the local computer; otherwise, ":"如果事件源在本地计算机上注册； 否则，"," if external process management is exposed; otherwise, ":"如果外部流程管理暴露； 否则，","A list of the subject key identifiers (SKIs) contained in the ":"主题密钥标识符（SKIS）列表"," instance that represents the intersection of the current ":" 表示当前交集的实例 ","The name the computer on which to look, or \".\" for the local computer.":"名称要查看的计算机或“”。 对于本地计算机。"," if external threading is exposed; otherwise, ":"如果外部螺纹暴露； 否则，"," that may contain an encoded symbol.\n            This is not the exact number of bits that encode the symbol. Instead, it prevents\n            decoding the lower bits of ":"这可能包含一个编码的符号。 \n             这不是编码符号的确切数量。 相反，它可以防止 \n             解码下部"," if the event source is registered on the given computer; otherwise, ":"如果事件源在给定的计算机上注册； 否则，"," instance with the specified ":"带有指定的实例","A list of the subject names of the entities contained in the ":"一个包含的实体的主题名称列表"," if resources might leak memory on termination; otherwise, ":"如果资源在终止时可能会泄漏内存； 否则，"," if they don't contain any\n            encoded data.\n            ":"如果他们不包含任何 \n             编码数据。","The string to write to the event log.":"要写入事件日志的字符串。"," instance, or ":"实例，或"," if the security infrastructure is exposed; otherwise, ":"如果公开安全基础架构； 否则，","A Uniform Resource Identifier (URI) that points to the encrypted key.":"指向加密键的统一资源标识符（URI）。","The number of bits decoded from ":"从","The application-specific identifier for the event.":"事件的特定应用程序标识符。","The decoded symbol.":"解码的符号。"," object that describes transforms to do on the encrypted key.":"描述在加密键上进行转换要执行的对象。"," if the intersection is empty. If both the current instance and ":"如果交叉点为空。 如果当前实例和"," if self-affecting process management is exposed; otherwise, ":"如果暴露了自我影响过程管理； 否则，","The application-specific subcategory associated with the message.":"消息相关联的应用程序特定子类别。"," are unrestricted, this method returns a new ":"不受限制，此方法返回了新的"," with which to initialize the new instance of ":"用它来初始化的新实例","The arguments provided by the client.":"客户提供的论点。"," if self-affecting threading is exposed; otherwise, ":"如果暴露了自我影响的螺纹； 否则，","An array of bytes that holds the binary data associated with the entry.":"包含与条目关联的二进制数据的一系列字节。"," instance that is unrestricted; otherwise, it returns ":"实例不受限制； 否则，它返回"," if shared state is exposed; otherwise, ":"如果公开共享状态； 否则，","The name of the Hub method being invoked.":"引用集线器方法的名称。","The transform to be added to the list of transforms.":"要添加到变换列表中的变换。","A string identifying the requested calue.":"识别请求值的字符串。"," instance to be tested for the subset relationship.":"实例要测试子集关系。"," instance that represents a localized event log entry.":"代表本地化事件日志条目的实例。"," if synchronization is exposed; otherwise, ":"如果暴露了同步； 否则，","The digest method URI of the current ":"电流的摘要方法URI","\n            A predicate that can be used to include health checks based on user-defined criteria.\n            ":"一个可用于根据用户定义的标准包含健康检查的谓词。","An array of strings to merge into the message text of the event log entry.":"一系列字符串合并到事件日志条目的消息文本中。","The digest value of the current ":"电流的摘要值"," if the current instance is unrestricted and ":"如果当前实例不受限制，并且"," if the user interface is exposed; otherwise, ":"如果用户界面暴露了； 否则，","The name of the event source registered for the application on the specified computer.":"事件源的名称在指定的计算机上注册了该应用程序。"," is either ":"或者是","The transform chain of the current ":"电流的变换链","The path to the matched file":"匹配文件的路径","A permission to intersect with the current permission object. It must be of the same type as the current permission.":"与当前权限对象相交的权限。 它必须与当前许可相同。"," or unrestricted; otherwise, ":"或无限制； 否则，","The type of the object being signed.":"要签名的对象的类型。"," receives notification when an entry is written to the log; otherwise, ":"将条目写入日志时收到通知； 否则，","The stem":"茎","The size, in bytes, of the resource allocated to the user.":"分配给用户的资源的大小，字节。","The position at which the new element was inserted.":"插入新元素的位置。"," instance was created with ":"实例是用"," holding the entries in the event log. Each entry is associated with an instance of the ":"在事件日志中持有条目。 每个条目都与一个实例相关联"," that represents the asynchronous operation, containing a flag indicating whether the specified \n            ":"代表异步操作，包含一个标志，指示指定是否已指定"," collection; otherwise, ":"收藏; 否则，"," instance that contains an XML-encoded representation of the security object, including state information.":"包含安全对象的XML编码表示的实例，包括状态信息。","The maximum user storage quota size in bytes.":"字节中的最大用户存储配额大小。","\n            True if a newly created user can be locked out, otherwise false.  \n            ":"如果可以将新创建的用户锁定，则为FALSE。","The name of the log. This can be Application, System, Security, or a custom log name. The default is an empty string (\"\").":"日志的名称。 这可以是应用程序，系统，安全性或自定义日志名称。 默认值是一个空字符串（“”）。"," instance to combine with the current instance.":"实例与当前实例结合。"," that represents the asynchronous operation, containing the role \n            associated with the specified ":"代表异步操作，包含角色 \n             与指定的"," object that can be used to iterate through a ":"可以用来通过一个迭代的对象"," if unrestricted use of the resource protected by the permission is allowed; otherwise, ":"如果不受限制地使用受许可保护的资源； 否则，","A name that represents the event log in the system's event viewer.":"代表系统事件查看器中事件日志的名称。"," instance that represents the union of the current ":"代表当前联合的实例"," key clause.":"关键条款。"," objects identifying specific key container access rights.":"识别特定关键容器访问权限的对象。"," that represents the asynchronous operation, containing the name of the \n            specified ":" 它表示异步操作，包含 \n            指定 ","The name of the server on which the event log resides. The default is the local computer (\".\").":"事件日志所在的服务器的名称。 默认值是本地计算机（“。”）。"," instance. If ":"实例。 如果"," that contains an XML encoding of the permission, including state information.":"其中包含XML权限的编码，包括状态信息。","The maximum event log size in kilobytes. The default is 512, indicating a maximum file size of 512 kilobytes.":"最大事件日志大小为千字节。 默认值为512，表示最大文件大小为512千元。"," to be added to the list of objects to be signed.":"要添加到要签名的对象列表中。"," that represents the asynchronous operation, containing the ID of the \n            specified ":"代表异步操作，包含 \n             指定的",", this method returns a copy of the current instance. If the current instance or ":"，此方法返回当前实例的副本。 如果当前实例或","The number of days that entries in the event log are retained. The default value is 7.":"事件日志中的条目保留的天数。 默认值为7。","A list of objects to be signed.":"要签名的对象列表。"," objects for this ":"为此的对象","The sasociated login.":"Sassodied登录。"," is unrestricted, this method returns a ":"不受限制，此方法返回"," value that specifies the configured behavior for storing new entries when the event log reaches its maximum log size. The default is ":"当事件日志达到其最大日志大小时，指定为存储新条目的配置行为的值。 默认值为","A byte array that contains the value of the digital signature.":"包含数字签名值的字节数组。"," object that contains the cryptographic service provider (CSP) parameters.":"包含加密服务提供商（CSP）参数的对象。"," instance that is unrestricted; otherwise, it returns a ":"实例不受限制； 否则，它将返回"," containing a flag indicating if the specified user has a password. If the \n            user has a password the returned value with be true, otherwise it will be false.":"包含指示指定用户是否有密码的标志。 如果是 \n             用户拥有一个密码，返回的值是真实的，否则将是错误的。","The name registered with the event log as a source of entries. The default is an empty string (\"\").":"用事件日志注册的名称为条目源。 默认值是一个空字符串（“”）。","The reference to add to the list of references.":"引用添加到引用列表中。","The name of the key container.":"密钥容器的名称。"," contains a list of users, if any, that contain the specified claim. \n            ":"包含包含指定索赔的用户列表（如果有）。"," instance that is restricted.":"实例受到限制。"," used to marshal event-handler calls issued as a result of an ":"用于通过"," object that holds the collection's elements.":"包含集合元素的对象。"," that corresponds to the security declaration.":"这与安全声明相对应。","The name of the key store.":"钥匙店的名称。"," contains a list of users, if any, that are in the specified role. \n            ":"包含在指定角色中的用户列表（如果有）。","The beginning index in the array where the elements are copied.":"复制元素的数组中的开始索引。"," event on the event log.":"事件日志上的事件。","A string that contains the DNS host name or IP address of the server.":"包含服务器的DNS主机名或IP地址的字符串。","The name of the provider.":"提供商的名称。"," containing a flag indicating if the specified user is a member of the given group. If the \n            user is a member of the group the returned value with be true, otherwise it will be false.":"包含一个标志，指示指定的用户是否是给定组的成员。 如果是 \n             用户是组的成员，返回的值是真实的，否则将是错误的。","An enumerator that iterates through the collection of references.":"通过参考的收集来迭代的枚举者。","The network port number that is associated with this request, or ":"与此请求关联的网络端口号，或"," objects are identical; otherwise, ":"物体是相同的； 否则，","The type code for the provider. See the ":"提供商的类型代码。 看到"," contains a single null string or empty array; otherwise, false.":"包含单个空字符串或空数组； 否则，错误。"," if the new permission is unrestricted; otherwise, ":"如果新许可不受限制； 否则，","The canonicalization algorithm used before signing for the current ":"签署电流之前使用的规范化算法"," that represents the entry that was written.":"这代表了写的条目。"," property for values.":"值的属性。","The application-specific category text.":"特定于应用程序的类别文本。"," that is identical to the current permission.":"这与当前许可相同。"," object used for canonicalization.":"用于规范化的对象。"," that represents the entry that was written to the event log.":"这表示写入事件日志的条目。","The key specification. See the ":"关键规范。 看到","The application-specific category number for this entry.":"此条目的特定于应用程序类别号。","The XML encoding to use to set the state of the current permission.":"用于设置当前权限的状态的XML编码。"," object to compare with the current instance.":"对象与当前实例进行比较。","The event type that is associated with the entry in the event log.":"与事件日志中条目关联的事件类型。","The number of references in the current ":"当前引用的数量 "," to intersect with the current permission. It must be of the same type as the current permission.":"与当前许可相交。 它必须与当前许可相同。","A string that contains a localized name for this keyword.":"一个包含此关键字的本地名称的字符串。","A list of the ":"列表","The application-specific identifier for the event message.":"事件消息的专用标识符。","One of the AT_ values defined in the Wincrypt.h header file.":"wincrypt.h头文件中定义的AT_值之一。"," that represents the intersection of the current permission and the specified permission. Returns ":"这代表当前许可和指定许可的交集。 返回","A string that contains the non-localized name of this keyword.":"包含此关键字的非定位名称的字符串。"," if the intersection is empty or ":"如果交叉路为空或","The index of this entry in the event log.":"事件日志中此条目的索引。"," elements of the current ":"电流的元素","One of the PROV_ values defined in the Wincrypt.h header file.":"wincrypt.h头文件中定义的prov_值之一。","The numeric value associated with the keyword.":"与关键字关联的数字值。"," that is to be tested for the subset relationship. This permission must be of the same type as the current permission.":"该子集关系将进行测试。 此权限必须与当前许可相同。","The index at which the new element was inserted.":"插入新元素的索引。","The length of the signature for the current ":"电流的签名长度","A resource identifier that corresponds to a string definition in the message resource file of the event source.":"与事件源的消息资源文件中的字符串定义相对应的资源标识符。","A string that contains the localized name for the event level.":"一个包含事件级别的本地名称的字符串。","The name of the computer that contains the event log.":"包含事件日志的计算机名称。"," if the current permission is unrestricted; otherwise, ":"如果当前的许可不受限制； 否则，","The one-dimensional array as the destination for the elements copied from ":"一维数组作为复制元素的目的地","The name of the algorithm used for signature generation and validation for the current ":"用于签名生成和验证当前的算法的名称","A string that contains the non-localized name of the event level.":"一个包含事件级别非定位名称的字符串。","The formatted, localized text for the message. This includes associated replacement strings.":"该消息的格式化本地化文本。 这包括相关的替换字符串。"," array that is the destination of the elements copied from the current collection.":"数组是从当前集合复制的元素的目的地。","An object to use for synchronization.":"用于同步的对象。"," that contains an XML encoding of the current permission.":"其中包含当前权限的XML编码。","The numeric value of the event level.":"事件级别的数值。","An array that holds the replacement strings stored in the event entry.":"一个存放事件条目中存储的替换字符串的数组。"," object to use to initialize the new instance of ":"用于初始化新实例的对象"," object in the collection, or -1 if no match is found.":"集合中的对象或-1如果找不到匹配。","The name of the local event log for which to get information and configuration settings.":"为获取信息和配置设置的本地事件日志的名称。"," to combine with the current permission.":" 以与当前权限相结合。","The name registered with the event log as the source of this event.":"以事件日志注册为此事件的来源的名称。","The zero-based index of the element to access.":"元素的基于零的索引。"," object to add to the list of objects to be signed.":"对象要添加到要签名的对象列表中。","The name of the event log for which to get information and configuration settings.":"为获取信息和配置设置的事件日志的名称。","The local time at which this event was generated.":"生成此事件的当地时间。"," permission that represents the union of the current permission and the specified permission.":"代表当前许可和指定许可的联合的许可。","The current object in the collection.":"集合中的当前对象。","The event log session used to determine the event log service that the specified log belongs to. The session is either connected to the event log service on the local computer or a remote computer.":"事件日志会话用于确定指定日志所属的事件日志服务。 会话要么连接到本地计算机上的事件日志服务，要么连接到远程计算机。"," object that describes a digest method, digest value, and transform to use for creating an XML digital signature.":"描述摘要方法，消化值和转换的对象，用于创建XML数字签名。","The name of the key store. The default is \"*\".":"钥匙店的名称。 默认值为“*”。"," values that specifies the permission behavior.":"指定权限行为的值。","The local time at which this event was written to the log.":"本事件写入日志的当地时间。","The security identifier (SID) that uniquely identifies a user or group.":"唯一标识用户或组的安全标识符（SID）。"," if the event log is a classic log; otherwise, ":" 如果事件日志是经典日志；否则, "," property verifies; otherwise, ":" 属性验证；否则, ","Create a key container.":"创建密钥容器。"," value. Valid values are \"Connect\" and \"None\".":" 价值。 有效值为\"Connect\"和\"None\"。"," instances that is the destination of the elements copied from the collection. The array must have zero-based indexing.":"实例是从集合中复制的元素的目的地。 该数组必须具有零基索引。"," if the log is enabled; otherwise, ":"如果启用日志； 否则，"," property that holds the key to be used to verify the ":"拥有用于验证的钥匙的属性"," that is identical to the current permission":"这与当前许可相同","Decrypt a key container.":"解密一个钥匙容器。","An object that can be used to iterate over the collection.":"可以用来迭代集合的对象。","A string that contains the path to the event log file.":"一个包含事件日志文件路径的字符串。"," property verifies for the specified key; otherwise, ":"属性验证指定的密钥； 否则，","Delete a key container.":"删除钥匙容器。"," that contains the XML encoding to use to set the state of the current permission":"其中包含用于设置当前权限状态的XML编码"," that is the destination of the elements that are copied from the collection. The ":"那是从集合中复制的元素的目的地。 这","The name of the event log.":"事件日志的名称。"," that holds the MAC to be used to verify the ":"将Mac用于验证Mac","Export a key from a key container.":"从钥匙容器中导出键。","The number of entries currently in the event log.":"事件日志中当前的条目数。"," that represents the intersection of the current permission and the specified permission. This new permission is ":"这代表当前许可和指定许可的交集。 这个新的许可是"," property verifies for the specified MAC; otherwise, ":"属性验证指定的Mac； 否则，","The maximum size, in bytes, that the event log file is allowed to be.":"允许事件日志文件的最大大小（以字节为单位）。","The zero-based index that is associated with the event log entry.":"与事件日志条目关联的基于零的索引。"," object to use to verify the ":"用于验证的对象","Import a key into a key container.":"将密钥导入密钥容器。"," that is to be tested for the subset relationship. This permission must be of the same type as the current permission":"该子集关系将进行测试。 此权限必须与当前许可相同","The name of the event provider that created this event log.":"创建此事件日志的事件提供商的名称。","The event log entry at the location that is specified by the ":"事件日志条目在由"," to verify the signature only; ":"仅验证签名；"," that contains the XML encoding of the current permission.":"其中包含当前权限的XML编码。","Open a key container and use the public key.":"打开密钥容器并使用公钥。"," if access to the collection is not synchronized (thread-safe).":"如果对集合的访问不同步（线程安全）。","The size of the buffer that the event provider uses for publishing events to the log. It can be ":"事件提供商用于将事件发布到日志的缓冲区的大小。 有可能"," to verify both the signature and certificate.":"验证签名和证书。","Sign a file using a key.":"使用密钥签署文件。"," permission to combine with the current permission.":"允许与当前许可结合使用。","A GUID value, or ":"GUID值，或","The event log to write to.":"事件日志要写入。"," if the signature and certificate are valid; otherwise, ":" 如果签名和证书有效；否则, "," value that specifies the permission behavior.":"指定权限行为的价值。","An enumerated value of ":"列举的价值"," if the log is not a debug log.":"如果日志不是调试日志。","The name of an existing event log source.":"现有事件日志源的名称。","A string that specifies the access level.":"指定访问级别的字符串。","When this method returns, contains the implementation of ":"当此方法返回时，包含","The keyword mask used by the event provider, or ":"事件提供商使用的关键字蒙版或","The intersection of two permissions is a permission that describes the state that they both describe in common. Only a demand that passes both original permissions will be valid for the intersected permission.":"两个权限的交集是描述他们俩共同描述的状态的许可。 只有通过两个原始权限的需求才能有效。","One of the values in the ":"一个值之一","An object that contains the current process ID, thread ID, and stack trace information.":"包含当前进程ID，线程ID和堆栈跟踪信息的对象。"," that holds the public key in the signature. This parameter is passed uninitialized.":"这在签名中拥有公共密钥。 该参数通过非初始化。"," if the audio, image, and video permissions are all unrestricted; otherwise, ":"如果音频，图像和视频许可都是不受限制的； 否则，"," if the event provider did not define any keywords.":"如果事件提供商没有定义任何关键字。"," that contains a copy of the current instance of ":" 它包含当前实例的副本 "," property verifies using the public key in the signature; otherwise, ":"属性在签名中使用公共密钥验证； 否则，","A name used to identify the output; typically the name of the application that generated the trace event.":"用于识别输出的名称； 通常，生成跟踪事件的应用程序名称。","The audio permission level.":"音频权限级别。","The maximum latency time used by the event provider when publishing events to the log, or ":"事件提供商将事件发布到日志或","One of the enumeration values that specifies the type of event that has caused the trace.":"指定导致迹线的事件类型的枚举值之一。","The XML encoding to use to reconstruct the permission.":"用于重建权限的XML编码。"," object that holds the MAC to be used to compute the value of the ":" 用于计算MAC的值的对象 ","The image permission level.":"图像权限级别。"," if no latency time was specified by the event provider.":" 如果事件提供程序未指定延迟时间。","Permission to ":"许可"," object to retrieve the ":"对象检索","A numeric identifier for the event. The combination of ":"事件的数字标识符。 组合","The maximum event level that is allowed to be logged in the event log, or ":"在事件日志中登录的最大事件级别，或","The media permission level.":"媒体权限级别。"," object to retrieve from the ":"从"," with the current permission. It must be of the same type as the current permission.":"遵循当前的许可。 它必须与当前许可相同。"," uniquely identifies an event.":"独特地识别事件。"," if the maximum event level was not defined in the event provider.":"如果事件提供商未定义最大事件级别。","The state of the ":"状态","A new permission that represents the intersection of the current ":"代表当前交集的新许可"," object with the specified ID from the specified ":"具有指定ID的对象"," permission. This new permission is a ":"允许。 这个新的权限是","One of the enumeration values that specifies a security action.":"指定安全操作的枚举值之一。","An array of data objects.":"数据对象数组。","The maximum number of buffers used by the event provider to publish events to the event log. This value can be ":"事件提供商用于将事件发布到事件日志的最大缓冲区数。 这个值可以是"," object that contains the public key of the signature, or ":"包含签名的公钥的对象，或","The trace message.":"跟踪消息。","A new permission set.":"新的权限集。","The minimum number of buffers used by the event provider to publish events to the event log. This value can be ":"事件提供商用于将事件发布到事件日志的最小缓冲区数量。 这个值可以是"," is a subset of the specified permission; otherwise, ":"是指定许可的子集； 否则，"," if the key cannot be found.":"如果找不到钥匙。","The name of this trace listener.":"这个跟踪侦听器的名称。","An XML encoding of the permission, including any state information.":"XML对许可的编码，包括任何状态信息。"," object that defines the XML encryption processing rules.":"定义XML加密处理规则的对象。","The physical path to the file containing the XML representation of the permission set.":"包含权限集的XML表示的文件的物理路径。","An enumerable collection of strings that contain the event provider names.":"包含事件提供商名称的字符串集合。","A new permission that represents the ":"代表的新许可"," object of the current ":"电流的对象","The hexadecimal representation of the XML encoded permission set.":"XML编码权限集的十六进制表示。","The name to register with the event log as a source of entries.":"将事件日志注册的名称作为条目源。","A string that contains the security descriptor for the event log.":"包含事件日志的安全描述符的字符串。"," and the specified permission.":"和指定的许可。","The name of the log to which entries from the source are written.":"编写来自源的条目的日志名称。","The name of an immutable ":"不变的名称"," object. The defaults is a ":"目的。 默认值是","The error code for the error that occurred while reading or configuring event log related information. For more information and a list of event log related error codes, see https://go.microsoft.com/fwlink/?LinkId=82629.":"读取或配置事件日志相关信息时发生的错误的错误代码。 有关更多信息和事件日志相关错误代码列表，请参见https://go.microsoft.com/fwlink/?linkid=82629。","A collection of the names of methods that safely produce canonical XML.":"安全生成规范XML的方法名称的集合。","Specifies a ":"指定a"," (one of several permission sets that are contained in the default policy and cannot be altered).":"（默认策略中包含的几个权限集之一，无法更改）。","The number of categories in the category resource file. The default value is zero.":"类别资源文件中的类别数。 默认值为零。","The Exception instance that caused the current exception.":"引起当前异常的异常实例。"," if the format is acceptable; otherwise, ":"如果格式可以接受； 否则，"," if the file is Unicode encoded; otherwise, ":"如果文件是Unicode编码的； 否则，","An object with an IPermission interface, whose instance contains a copy of the current instance of ":"具有IPermission接口的对象，其实例包含 ","The path of the category resource file. The default is an empty string (\"\").":"类别资源文件的路径。 默认值是一个空字符串（“”）。"," object that holds the serialized object data about the exception thrown.":"持有有关抛出异常的序列化对象数据的对象。","A permission to ":"许可","The signature method of the current ":"电流的签名方法","The XML representation of a permission set.":"权限集的XML表示。","The name of the event log. This can be Application, System, or a custom log name. The default value is \"Application.\"":"事件日志的名称。 这可以是应用程序，系统或自定义日志名称。 默认值是“应用程序”。"," and the specified permission. This new permission is a ":"和指定的许可。 这个新的权限是"," object's user.":"对象的用户。","Returns a string that contains the error message that describes the current exception.":"返回一个包含描述当前异常的错误消息的字符串。","A byte array that contains the signature value of the current ":"一个字节数组，包含当前的签名值","The name of the system on which to register the event source. The default is the local computer (\".\").":"注册事件源的系统名称。 默认值是本地计算机（“。”）。"," object that contains an XML encoding of the permission, including any state information.":"包含权限的XML编码的对象，包括任何状态信息。","The asymmetric algorithm key used for signing the ":"用于签名的不对称算法密钥","Returns an integer value. This value can be null.":"返回整数值。 此值可以为null。","The role of the ":"的作用 "," object. This value can be null.":"目的。 此值可以为null。","The host name for the transport address.":"运输地址的主机名。","The path of the message resource file. The default is an empty string (\"\").":"消息资源文件的路径。 默认值是一个空字符串（“”）。","The name of the installed key to be used for signing the ":"用于签名的已安装键的名称"," object's user (for example, Administrator).":"对象的用户（例如，管理员）。","The port number for the transport address.":"运输地址的端口号。","Returns a long value.":"返回长期价值。"," object used to create a digest.":"用于创建摘要的对象。","The path of the parameter resource file. The default is an empty string (\"\").":"参数资源文件的路径。 默认值为空字符串(\"\")。"," to signify that the user is authenticated; otherwise, ":"表示用户已进行身份验证； 否则，"," class that is a copy of the current instance.":"类是当前实例的副本。","The name to register with the event log as a source of entries. The default is an empty string (\"\").":"将事件日志注册的名称作为条目源。 默认值是一个空字符串（“”）。","The digest associated with a ":"与"," if the log is full, and returns ":"如果日志已满，并且返回","A new permission that represents the intersection of the current permission and the specified permission. This new permission will be ":"代表当前许可和指定许可的交集的新许可。 这个新的许可将是","The XML encoding used to reconstruct the ":"用于重建的XML编码"," operation was canceled; otherwise, ":"操作被取消； 否则，","A list of the XML nodes that represent the transform-specific content needed to describe the current ":"表示描述当前所需的特定特定内容的XML节点列表","A representation of the current permission.":"当前许可的代表。"," if the log is not full.":"如果日志不满。","The audit rule to remove":"删除的审计规则"," instance that represents the intersection of two ":"代表两个相交的实例","The encrypted data to use for the ":"用于使用的加密数据"," object in an XMLDSIG ":" XMLDSIG中的对象 ","Returns a long value that represents the number of the oldest event record in the event log. This value can be null.":"返回一个长的值，代表事件日志中最古老的事件记录的数量。 此值可以为null。"," if the current principal has been authenticated; otherwise, ":" 如果当前主体已通过身份验证；否则, "," instances. If the intersection is empty, the method returns ":"实例。 如果交叉点为空，则该方法返回"," object that represents the XML information for the ":"代表XML信息的对象","Returns a long value that represents the number of event records in the event log. This value can be null.":"返回一个长的值，代表事件日志中事件记录的数量。 此值可以为null。","The output of the current ":"电流的输出"," that represents the XML data to load.":"这代表要加载的XML数据。","A name to match against that provided by the underlying role-based security provider.":"要与基础基于角色的安全提供程序提供的名称匹配的名称。"," parameter is a null reference, the method returns ":"参数是一个null引用，方法返回","The type of the output to return. This must be one of the types in the ":"要返回的输出的类型。 这必须是","Returns a string that contains the localized name of the event log.":"返回包含事件日志的本地化名称的字符串。","A byte array that represents the ":"一个代表的字节数组","The name of a role from the underlying role-based security provider.":"基于角色的安全提供商的角色名称。"," that is to be tested for the subset relationship.":"该子集关系将进行测试。"," object as an object of the specified type.":"对象作为指定类型的对象。"," if the event log is imported by the event provider, and returns ":"如果事件提供商导入事件日志，并返回","An X.509 certificate representing the software publisher's identity.":"X.509证书，代表软件发布者的身份。","A Uniform Resource Identifier (URI) pointing to the encrypted data.":"指向加密数据的统一资源标识符（URI）。"," if the current instance defines no permissions; otherwise, ":"如果当前实例未定义任何权限； 否则，","The XML representation of the current ":"电流的XML表示"," if the event log is not imported by the event provider.":"如果事件提供商未导入事件日志。","An X.509 certificate representing the identity of the software publisher.":"代表软件发布者身份的X.509证书。"," if the current instance defines a subset of ":"如果当前实例定义了一个子集"," object that describes transforms to do on the encrypted data.":"描述在加密数据上进行转换要执行的对象。"," object that specifies transform-specific content for the current ":"指定当前转换特定内容的对象","Returns a string that contains the non-localized name of the event log associated with this object.":"返回一个包含与此对象关联的事件日志的非定位名称的字符串。","The input to load into the current ":"加载到当前的输入","The file path of an X.509 certificate file (usually has the extension.cer).":"X.509证书文件的文件路径（通常具有扩展名。cer)。"," permissions; otherwise, ":"许可； 否则，"," element in XML encryption.":"XML加密中的元素。","The URI that identifies the algorithm performed by the current ":"识别电流执行的算法的URI"," instance is created with the ":"实例是用","XPath queries used to extract values from the XML representation of the event.":"XPath查询用于从事件的XML表示中提取值。","The file path of a file signed with the Authenticode signature.":"带有AuthenTicode签名的文件的文件路径。"," object that represents an XML element to use as the reference.":"代表要用作参考的XML元素的对象。","The name of the event log to query, or the path to the event log file to query.":"事件日志的名称查询或事件日志文件到查询的路径。"," value from ":"来自","The identification to initialize the new instance of ":"初始化新实例的标识"," object that represents the document context under which the current ":"表示当前的文档上下文的对象","A hexadecimal representation of the X.509 certificate.":"X.509证书的十六进制表示。","Specifies whether the string used in the path parameter specifies the name of an event log, or the path to an event log file.":"指定路径参数中使用的字符串指定事件日志的名称，还是事件日志文件的路径。"," instance that contains an XML-encoded representation of the ":"实例包含XML编码的表示","The MIME type of the data used to initialize the new instance of ":"用于初始化新实例的数据的MIME类型","The set flags for the current permission.":"当前权限的设置标志。"," object is running.":"对象正在运行。"," instance, including state information.":"实例，包括状态信息。","The event query used to retrieve events that match the query conditions.":"事件查询用于检索与查询条件相匹配的事件。","The encoding of the data used to initialize the new instance of ":"用于初始化新实例的数据的编码"," if invocation of operations on non-public members is allowed; otherwise, ":"如果允许对非公共成员进行操作； 否则，","An array of valid input types for the current ":"当前的有效输入类型数组","The data to initialize the new instance of ":"初始化新实例的数据"," instance that represents the union of two ":"代表两个联合的实例"," if events are read from the newest event in the log to the oldest event, and returns ":"如果从日志中的最新事件读取事件到最古老的事件，然后返回"," instances. If ":"实例。 如果"," if use of the affected features is allowed; otherwise, ":"如果允许使用受影响的功能； 否则，"," object; you can pass only objects of one of these types to the ":"目的; 您只能将这些类型之一的对象传递给","The XML representation of the ":"XML表示"," if restricted invocation of non-public members is allowed; otherwise, ":"如果允许非公共成员的限制调用； 否则，"," method of the current ":"电流的方法",", it returns a copy of the current instance.":"，它返回当前实例的副本。"," if events are read from the oldest event in the log to the newest event.":"如果事件是从日志中最古老的事件读取到最新事件的。","The XML element to load the ":"XML元素加载"," if reflection on members that are not visible is allowed; otherwise, ":"如果允许对不可见的成员进行反思； 否则，","An array of valid output types for the current ":"当前的有效输出类型数组"," indicates that the query will continue to retrieve events even if the query fails for some logs, and ":"指示查询将继续检索事件，即使查询因某些日志失败，并且"," interface that contains ":"包含的接口"," state from.":"从。"," object; only objects of one of these types are returned from the ":"目的; 仅此类型之一的对象是从","A list of registry variables (semicolon-separated) to which access is granted.":"授予访问权限的注册表变量列表（半分隔）。"," indicates that this query will not continue to retrieve events when the query fails.":"指示当查询失败时，此查询将不会继续检索事件。"," class that corresponds to the security declaration.":"与安全声明相对应的类。","A list of registry variables (separated by semicolons).":"注册表变量列表（由半殖民者隔开）。","The data of the current ":"电流的数据 ","The event query used to retrieve events.":"事件查询用于检索事件。"," methods of the current ":"电流的方法","A string that contains the network access method that is allowed by this instance of ":"一个包含该实例的网络访问方法的字符串","The type of encoding of the current ":"电流的编码类型","A list of registry variables (semicolon-separated).":"注册表变量列表（半分离）。","The bookmark (placeholder) used as a starting position in the event log or stream of events. Only events logged after the bookmark event will be returned by the query.":"书签（占位符）用作事件日志或事件流中的起始位置。 在书签活动之后只有记录的活动才会由查询返回。",". Valid values are \"Accept\" and \"Connect.\"":"。 有效值是“接受”和“连接”。"," object that contains the namespaces that are propagated into the signature.":"包含传播到签名的名称空间的对象。"," values that represents a single type of registry variable access.":"代表单一类型的注册表变量访问的值。","The name of the element that contains data to be used.":"包含要使用的数据的元素的名称。","The name of the event log to retrieve events from.":"事件日志的名称从中检索事件。","A string that contains the DNS host name or IP address that is associated with this instance of ":"包含与此实例关联的DNS主机名或IP地址的字符串","The MIME type of the current ":"电流的哑剧类型","A list of the registry variables (semicolon-separated) with the specified ":"指定的注册表变量列表（半分隔）"," object. The default is ":"目的。 默认值为","The name of the event log to retrieve events from, or the path to the event log file to retrieve events from.":"事件日志的名称从事件中检索事件或事件日志文件的路径以检索事件。"," object. This property defaults to an ":" 对象。 此属性默认为 ","A string that contains the port number that is associated with this instance of ":"一个包含与此实例关联的端口号的字符串","The transform to add to the list of transforms.":"变换添加到变换列表中。","The maximum time to allow the read operation to run before canceling the operation.":"允许读取操作在取消操作之前运行的最大时间。","A semicolon-separated list of registry key paths, for full access.":"半分离的注册表密钥路径列表，以供完整访问。","A Uniform Resource Identifier (URI) that points to the encrypted data.":"指向加密数据的统一资源标识符（URI）。"," that is associated with this ":"与此有关","A semicolon-separated list of registry key paths, for change access control. .":"半分隔的注册表密钥路径列表，用于更改访问控制。 。","An enumerator of the transforms in the ":"枚举转换的人","The bookmark (placeholder) used as a starting position in the event log or stream of events. Only events that have been logged after the bookmark event will be returned by the query.":"书签（占位符）用作事件日志或事件流中的起始位置。 查询之后只有在书签活动之后记录的事件才会返回。","A NetworkAccess value that indicates what kind of access to grant to the specified URI. ":"一个网络访问值，该值指示获得指定URI的授予授予。","The instance of an implementation of the ":"实施的实例","A semicolon-separated list of registry key paths, for create-level access.":"半分隔的注册表密钥路径列表，用于创建级别访问。","The number of transforms in the ":"转换数量","The offset number of events to change the position of the bookmark.":"更改书签位置的事件数量。"," indicates that the application is allowed to accept connections from the Internet on a local resource. ":"指示该应用程序可以在本地资源上接受Internet的连接。"," class that holds the public key.":"拥有公钥的课程。","A semicolon-separated list of registry key paths, for read access.":"半分隔的注册表密钥路径列表，用于阅读访问。"," enumeration defines where in the stream of events to start querying for events.":"枚举定义在事件流中开始查询事件的位置。"," indicates that the application is allowed to connect to specific Internet resources.":"表明该应用程序可以连接到特定的Internet资源。","The index into the ":"索引到","The public key represented by a ":"由","A semicolon-separated list of registry key paths, for view access control.":"注册表密钥路径的半分隔列表，用于查看访问控制。","The offset number of events to add to the origin.":"要添加到原点的事件的偏移数量。"," object that specifies which transform to return.":"指定转换要返回的对象。"," object representing an XML element to use for the ":"代表XML元素的对象","A URI string to which access rights are granted.":"授予访问权限的URI字符串。","Returns an integer value.":"返回整数值。","A semicolon-separated list of registry key paths, for create, read, and write access.":"半分离的注册表密钥路径列表，以创建，读取和写入访问。"," value that indicates what kind of access to grant to the specified URI. ":"值指示获得指定URI的授予授予的访问权限。","The transform at the specified index in the ":"在指定索引中的转换"," representing an XML element to use for the ":"代表用于使用的XML元素","A semicolon-separated list of registry key paths, for write access.":"注册表密钥路径的半分隔列表，用于写入访问。","Returns a list of ":"返回一个清单","A regular expression that describes the URI to which access is to be granted.":"一个正则表达式，描述了要授予访问权限的URI。","A Uniform Resource Identifier (URI) to exclude from processing":"统一的资源标识符（URI），将排除在处理之外","A string that represents a name for the key value.":"代表键值名称的字符串。"," objects that were added to this permission.":"已添加到此权限的对象。"," objects that each contain status information about an event log associated with the event query in this object.":"每个包含有关与此对象中事件查询关联的事件日志的状态信息的对象。"," that specifies the access rights that are granted to the URI.":"这指定了授予URI的访问权限。","The type of the output to return. ":"要返回的输出的类型。","A permission object that is to be tested for the subset relationship.":"将测试子集关系的权限对象。","A string representing the value of the ":"一个表示值的字符串","Returns a string that contains the event message in the current locale.":"返回一个字符串，该字符串包含当前语言环境中的事件消息。","A string that describes the URI to which access rights are granted.":"描述授予访问权限的URI的字符串。"," if the current permission object is a subset of the specified permission object; otherwise, ":"如果当前权限对象是指定权限对象的子集； 否则，"," is the only valid type for this parameter.":" 是此参数的唯一有效类型。","The Uniform Resource Identifier (URI) that points to the data to encrypt.":"指向加密数据的统一资源标识符（URI）。","The values used to replace variables in the event message. Variables are represented by %n, where n is a number.":"用于替换事件消息中变量的值。 变量由％n表示，其中n为一个数字。","A NetworkAccess that specifies the access rights that are granted to the URI.":"指定授予URI的访问权限的网络访问。","An enumeration value that is derived from ":"从"," object with an ID attribute to compare with ":"具有与ID属性相比的对象"," object that describes transforms to be done on the data to encrypt.":"描述要在数据上进行加密的转换的对象。","Selects the property values to return.":"选择要返回的属性值。","The value to compare with the ID attribute of ":"与ID属性进行比较的值","A regular expression that describes the set of URIs to which access rights are granted.":"一个正则表达式，描述了授予访问权限的乌里斯集。"," and describes the types of access that you are giving the resource.":"并描述您提供资源的访问类型。"," object to add to the transform chain.":"对象添加到变换链中。"," class that has the same values as the original.":"具有与原始值相同的值。"," if the ID attribute of the ":"如果ID属性","Returns a list of objects.":"返回对象列表。"," object that represents the values of the ":"代表值的对象","An array of strings that identify the resource you are trying to protect.":"一系列识别您要保护的资源的字符串。","The XML encoding from which to reconstruct the ":"XML编码从哪些编码重建"," parameter matches the ":"参数匹配","Returns a string that contains the XML representation of the event.":"返回一个包含事件的XML表示形式的字符串。"," object that represents an XML element.":"代表XML元素的对象。","Returns a GUID value.":"返回一个GUID值。","The integer representation of the permission access level enumeration value. The ":"权限访问级枚举值的整数表示。 这"," that represents the intersection of the current instance and the ":"代表当前实例和"," object that contains information about the keys necessary to decrypt an XML document.":"包含有关解密XML文档所需密钥的信息的对象。"," if the cache is valid; otherwise, ":"如果缓存有效； 否则，"," object of type ":"类型的对象","The array of strings that identify the resource you are protecting. The ":"标识您要保护的资源的一系列字符串。 这"," parameter. If the intersection is empty, the method returns ":"范围。 如果交叉点为空，则该方法返回","Returns a string that contains the name of the event log or the event log file in which the event is stored.":"返回一个包含事件日志名称或事件日志文件的字符串。","Returns a long value. This value can be null.":"返回长期价值。 此值可以为null。","The reference type of the encrypted data.":"加密数据的参考类型。"," object to load into the current ":"对象加载到当前","The access level enumeration value.":"访问级枚举值。"," if the current instance is a subset of the ":"如果当前实例是","The digest associated with an ":"与","An array of strings that identify the resource you are protecting.":"一系列识别您要保护的资源的字符串。","Returns an enumerable collection of strings that contain the display names of the keywords used in the keyword mask for this event.":"返回枚举的字符串集合，其中包含此事件的关键字蒙版中使用的关键字的显示名称。"," object that describes transforms used on the encrypted data.":" 描述在加密数据上使用的变换的对象。"," object; the ":"目的; 这",". If the target is ":"。 如果目标是","The Uniform Resource Identifier (URI) of the ":"统一资源标识符（URI）","Returns a byte value. This value can be null.":"返回字节值。 此值可以为null。"," object return only objects of one of these types.":"对象仅返回这些类型之一的对象。","The initial state of the permission, represented by a bitwise OR combination of any permission bits defined by ":"许可的初始状态，由位于一定的或组合的任何权限位的组合表示"," for an empty current permission that is not unrestricted and ":"对于没有不受限制的空的当前权限，"," to load into the current ":"加载到电流中"," object representing an XML element to use in the ":"代表要在","A new permission object that represents the intersection of the current permission and the specified permission. This new permission is ":"一个新的权限对象，代表当前权限和指定权限的交集。 这个新的许可是","Returns a string that contains the display name of the level for this event.":"返回一个包含此事件级别的显示名称的字符串。"," was created with the ":"是用","The state of the current permission, represented by a bitwise OR combination of any permission bits defined by ":"当前权限的状态，由一定的或组合由任何权限位的组合表示","A string that describes the encoding of the encrypted data.":"描述加密数据编码的字符串。","The namespace prefixes to canonicalize using the standard canonicalization algorithm.":"使用标准规范化算法的名称空间前缀可以使用规范化。","Returns a string that contains a name of the event log that contains this event.":"返回一个包含事件日志的名称的字符串，其中包含此事件。"," that contains an XML-encoded representation of the ":"其中包含XML编码的表示","A string of the ":"一串","The site name or wildcard expression.":"站点名称或通配符表达式。","Returns a string that contains the name of the computer on which this event was logged.":"返回一个包含该事件已记录的计算机名称的字符串。","A string that contains namespace prefixes to canonicalize using the standard canonicalization algorithm.":"包含使用标准规范化算法进行规范化的命名空间前缀的字符串。",", including state information.":"，包括状态信息。"," attribute of the ":"属性","Returns an enumerable collection of integer values.":"返回枚举的整数值集合。"," object that encapsulates an XSLT style sheet to load into the current ":"封装XSLT样式表以加载到当前的对象","The current site.":"当前站点。"," to combine with the current ":"与电流结合","Returns a short value. This value can be null.":"返回一个短价值。 此值可以为null。","A string that describes the media type of the encrypted data.":"描述加密数据的介质类型的字符串。"," object. This style sheet is applied to the document loaded by the ":"目的。 此样式表应用于由"," that represents the union of the current instance and the ":"代表当前实例的联合和","The site name to compare against the site name specified by the security provider.":"要与安全提供程序指定的站点名称进行比较的站点名称。","Returns a string that contains the display name of the opcode for this event.":"返回一个包含此事件的OpCode的显示名称的字符串。","The output of the ":"输出"," parameter. If either ":"范围。 如果是","A string that describes the text form of the encrypted data.":"描述加密数据的文本形式的字符串。","Returns a GUID value. This value can be null.":"返回一个GUID值。 此值可以为null。"," that contains the XML encoding to use to reconstruct the permission.":"其中包含用于重建权限的XML编码。"," object that encapsulates the transform to load into the current ":"封装转换以加载到当前的对象"," object used to initialize the ":"用于初始化的对象",", the method returns a ":"，该方法返回","Returns a string that contains the name of the event provider that published this event.":"返回一个包含发布此事件的事件提供商名称的字符串。","A permission to test for the subset relationship. This permission must be of the same type as the current permission.":"测试子集关系的许可。 此权限必须与当前许可相同。"," object. The type of the input object must be ":"目的。 输入对象的类型必须为","Returns a string that contains the display name of the task for the event.":"返回一个包含事件任务的显示名称的字符串。",", the method returns a copy of the current ":"，该方法返回当前的副本"," object associated with the ":"与"," that contains an XML encoding of the permission, including any state information.":"其中包含权限的XML编码，包括任何状态信息。","The decryptor of the current ":"当前的解密者"," value. The value can be null.":"价值。 值可以为null。"," interface that contains accept permissions.":"包含接受权限的接口。"," if the ability to add to a store is allowed; otherwise, ":"如果允许将添加到商店的能力； 否则，","The name to map to ":"要映射到的名称","An array of types that are valid inputs to the ":"一系列有效输入的类型"," interface that contains connect permissions.":"包含连接权限的接口。","The symmetric key to map to ":"映射到的对称键"," if the ability to create a store is allowed; otherwise, ":"如果允许创建商店的能力； 否则，","The name of the computer on which to connect to the Event Log service.":"要连接到事件日志服务的计算机的名称。"," corresponding to the security declaration.":"对应于安全声明。","The symmetric key used to decrypt ":"用于解密的对称键","The full name of the application.":"应用程序的全名。"," if the ability to delete a store is allowed; otherwise, ":"如果允许删除商店的能力； 否则，","The domain of the specified user.":"指定用户的域。",") structure for the serialization.":"）序列化的结构。","A byte array that contains the raw decrypted plain text.":"包含原始解密的纯文本的字节阵列。","A string containing the URI accepted by the current ":"包含当前接受的URI的字符串 "," if the ability to enumerate certificates is allowed; otherwise, ":"如果允许枚举证书的能力； 否则，","The user name used to connect to the remote computer.":"用户名用于连接到远程计算机。"," object that contains the key to retrieve.":"包含要检索的键的对象。","The full name of the manifest-activated application.":"清单激活应用程序的全名。","A string containing a regular expression pattern that describes the URI accepted by the current ":"一个包含正则表达模式的字符串，描述了电流接受的URI","The password used to connect to the remote computer.":"用于连接到远程计算机的密码。"," if the ability to enumerate stores is allowed; otherwise, ":" 如果允许枚举存储的能力；否则, ",". This string must be escaped according to the rules for encoding a ":"。 该字符串必须根据编码的规则逃脱","A byte array that contains the key.":"包含密钥的字节数组。","The URL of the deployment manifest.":"部署清单的URL。"," if the ability to open a store is allowed; otherwise, ":"如果允许开设商店的能力； 否则，","The type of connection to use for the connection to the remote computer.":"用于与远程计算机的连接的连接类型。","An array of bytes that represents an encrypted ":"代表加密的字节数组","The full name of the application, also known as the display name.":"应用程序的全名，也称为显示名称。"," if the ability to remove a certificate from a store is allowed; otherwise, ":"如果允许从商店中删除证书的能力； 否则，","The asymmetric key used to decrypt ":"用于解密的不对称键","The name of the event log to clear all the events from.":"清除所有事件的事件日志的名称。","The permission level to grant.":"授予的许可级别。","The ability to add a certificate to a store.":"能够向商店添加证书的能力。"," with the same permission level.":"具有相同的权限级别。","The path to the file in which the cleared events will be saved. The file should end in .evtx.":"将保存清除事件的文件的路径。 该文件应以.EVTX结尾。","The ability to create a new store.":"创建新商店的能力。","The configuration element from which the permission state is read.":"读取权限状态的配置元素。","The name of the event log to export events from, or the path to the event log file to export events from.":"事件日志的名称将导出事件或事件日志文件的路径以导出事件。"}