{"User ID for a given application.":"给定应用程序的用户ID。","the locale type for this word. It should be one of\n  ":"该词的语言环境类型。 它应该是之一","A boolean indicating if the current discharge estimate is personalized based on\n            historical device usage or not.":"一个布尔值，指示当前放电估计是否基于\n            历史设备使用与否。","parent to verify against.":"父母要验证。","the context to use when updating the database":"更新数据库时要使用的上下文","First date to remove.  If -1, all dates before end.\n              Inclusive.":"首先要删除。 如果-1，所有日期都在结束前。 \n               包括的。","Whether the print job is cancelled.":"是否取消打印作业。","Optional text of the title of this fragment.":"此片段标题的可选文本。","The DatagramSocket whose FileDescriptor is used\n                          to create a new ParcelFileDescriptor.":"使用FileDescriptor的DatagramSocket\n                          创建一个新的ParcelFileDescriptor。","intent to ":"意图 ","The string key representing the restriction.":"表示限制的字符串键。","number of bytes to read.":"要读取的字节数。","used by the caller to signal if the request should be\n                       cancelled. May be null.":"被调用者用来发出信号，如果请求应该是\n                       取消。 可能为null。"," object containing the metrics for the requested\n            application. The keys for this HealthStats object will be from the ":"包含请求的指标的对象 \n             应用。 该健康状态对象的键将来自","The debug name to use for this SharedMemory instance. This can be null, however\n                        a debug name is recommended to help identify memory usage when using tools\n                        such as lsof or examining /proc/[pid]/maps":"用于此SharedMemory实例的调试名称。 但是，这可以为null\n                        建议使用调试名称来帮助识别使用工具时的内存使用情况\n                        如lsof或检查/proc/[pid]/maps","Callback for returning the icon to the system.":"用于将图标返回到系统的回调。",", indicating the desired dialog size,\n            when supported.":"，指示所需的对话框大小,\n            时支持。","A newly created ArrayList containing strings with the same data\n                    as those that were previously written.":"包含具有相同数据的字符串的新创建的ArrayList\n                    就像以前写的那样。","number of bytes read.":"字节数读取。"," initially showing the contents\n                    of this ":"最初显示内容 \n                     这个的"," if the current user has the given restriction, ":"如果当前用户具有给定的限制，"," that will be used to fetch the font contents.":" 这将用于获取字体内容。","the title resource":"标题资源","The start page index (zero based and inclusive).":"起始页索引（从零开始且包含在内）。","A string used by the ":"使用的字符串 ","The list of printers to validate first. Never null.":"首先验证打印机列表。 永不零。","The Preference that uses the given key.":"使用给定密钥的首选项。","The default value for this Preference. Only use this\n                       if <var>restorePersistedValue</var> is false.":"此首选项的默认值。 只用这个\n                       如果<var>restorePersistedValue</var>为false。","Depth of the region to update":"要更新的区域深度","original video id\n":"原始视频id\n","resource id to load the data from":"资源id从加载数据"," instance pointing to the file that contains the values of\n                    preferences that are managed by this PreferenceManager. If a\n                    ":" 指向包含以下值的文件的实例\n                    由此PreferenceManager管理的首选项。 如果一个\n                    ","The index into the timings array at which to repeat, or -1 if you you don't\n                          want to repeat.":"要重复的时序数组的索引，如果不重复，则为-1\n                          要重复。","Byte array to store read bytes.":"字节数组来存储读取字节。","The value whose index should be returned.":"应返回其索引的值。","optional shortcut spelling for this word. When the shortcut\n  is typed, the word may be suggested by applications that support it. May be null.":"此单词的可选快捷方式拼写。 当捷径\n  被键入，这个词可能会被支持它的应用程序建议。 可能为null。","Returns true if currently in active device idle mode, else false.  This is\n            when idle mode restrictions are being actively applied; it will return false if the\n            device is in a long-term idle mode but currently running a maintenance window where\n            restrictions have been lifted.":"如果当前处于活动设备空闲模式，则返回true，否则返回false。  这是\n            当空闲模式限制正在积极应用;它将返回false，如果\n            设备处于长期空闲模式，但目前正在运行一个维护窗口，其中\n            限制已经解除。","child to verify.":"子来验证。","the address to update":"要更新的地址","A new ParcelFileDescriptor with a duped copy of the\n            FileDescriptor of the specified Socket.":"一个新的ParcelFileDescriptor与欺骗的副本\n            指定套接字的FileDescriptor。","Last date to remove. If -1, all dates after begin.\n              Non-inclusive.\n":"删除的最后日期。 如果-1，则开始后的所有日期。\n              非包容性。\n","Optional fragment that result data should be sent to.\n            If non-null, resultTo.onActivityResult() will be called when this\n            preference panel is done.  The launched panel must use\n            ":"应结果数据发送到的可选片段。\n            如果非null，则resultTo。onactivityresult()将被调用时，这\n            首选项面板完成。  启动的面板必须使用\n            ","Whether the print job is completed.":"打印作业是否完成。","hint of the optimal thumbnail dimensions.":"提示最佳缩略图尺寸。","An array of User IDs to retrieve.":"要检索的用户Id数组。","The size of the shared memory to create. Must be greater than 0.":"要创建的共享内存的大小。 必须大于0。","A newly created array containing objects with the same data\n                    as those that were previously written.":"包含具有相同数据的对象的新创建的数组\n                    就像以前写的那样。","Optional list of ":"可选列表 ","A signal to cancel the operation in progress, or null if none. If\n                                      the operation is canceled, then ":"取消正在进行的操作的信号，如果没有，则为null。 如果\n                                      操作被取消，则 ","to retrieve the unlocked state for.":"来检索解锁状态。","directory where this volume is mounted, or ":"安装此卷的目录，或 ","byte array to write bytes from.":"字节数组从写入字节。","The layout resource ID to be inflated into the\n                       main layout.":"要膨胀到\n                       主要布局。","The end page index (zero based and inclusive).":"结束页索引（从零开始且包含在内）。","The class name of the fragment associated with this Preference.":"与此首选项关联的片段的类名。"," method for debugging,\n                         to see who has references.":" 调试的方法,\n                         看看谁有推荐人。","The printer to start tracking.":"打印机开始跟踪。","to be placed into the allocation":"要放入分配","The type of thumbnail to fetch. Should be either MINI_KIND or MICRO_KIND":"要获取的缩略图类型。 应该是MINI_KIND或MICRO_KIND","the order for this Preference. A lower value will be shown first. Use\n                         ":"此首选项的顺序。 将首先显示较低的值。 使用方法\n                         ","Allocation containing resource data":"包含资源数据的分配","The mode of the SharedPreferences file.":"SharedPreferences文件的模式。","The timing values, in milliseconds, of the timing / amplitude pairs. Timing\n                           values of 0 will cause the pair to be ignored.":"定时/幅度对的定时值（以毫秒为单位）。 时间安排\n                           值为0将导致该对被忽略。","The index of the value, or -1 if not found.":"值的索引，或-1如果没有找到。","the locale to insert the word for, or null to insert the word\n  for all locales.\n":"用于插入单词的区域设置，或用于插入单词的null\n  适用于所有地区。\n","Size of bytes returned by the function.":"函数返回的字节大小。","True if the device is in an interactive state.":"如果设备处于交互状态，则为True。","if given document is a descendant of the given parent.":"如果给定文档是给定父级的后代。","the latitude for the address":"地址的纬度","The native fd that the ParcelFileDescriptor should dup.":"ParcelFileDescriptor应该使用的原生fd。","Clause to be used to limit the query from the database.\n          Must be an allowable string to be passed into a database query.":"用于限制来自数据库的查询的子句。\n          必须是允许传入数据库查询的字符串。","Whether the print job is failed.":"打印作业是否失败。"," when done.":" 完成后。","Access mode for the file.  May be \"r\" for read-only access,\n \"rw\" for read and write access, or \"rwt\" for read and write access\n that truncates any existing file.":"文件的访问模式。  对于只读访问可能是\"r\",\n \"rw\"用于读写访问，或\"rwt\"用于读写访问\n 这会截断任何现有文件。"," objects containing the metrics for each of\n            the requested uids. The keys for this HealthStats object will be from the\n            ":" 包含每个指标的对象\n            请求的uids。 此HealthStats对象的键将来自\n            ","A SharedMemory instance of the requested size":"请求大小的SharedMemory实例","A newly created ArrayList containing objects with the same data\n                    as those that were previously written.":"包含具有相同数据的对象的新创建的ArrayList\n                    就像以前写的那样。"," MIME-types\n            to exclude when showing this dialog. For example, when\n            already viewing the contact details card, this can be used\n            to omit the details entry from the dialog.\n":" MIME类型\n            显示此对话框时排除。 例如，当\n            已经查看联系人详细信息卡，这可以使用\n            从对话框中省略详细信息条目。\n","whether the caller is a demo user.":"调用方是否为演示用户。"," to be used to create a Typeface.":" 用于创建字体。"," if the\n                    volume is not currently mounted.":" 如果\n                    卷当前未装入。","offset into the byte array buffer to write from.":"偏移到要写入的字节数组缓冲区中。","The changed Preference.":"改变的偏好。","The end page index.":"的结束页索引。","The fragment class name last set via ":"片段类名最后通过 ","The method name to appear in the trace.":"要显示在跟踪中的方法名称。","The printer to stop tracking.":"打印机停止跟踪。","Depth of the region to update.":"深度的区域来更新。"," to sort alphabetically or allow ordering from XML":" 按字母顺序排序或允许从XML排序","string to create the allocation from":"字符串创建分配从","The string as typed by the user.  This string will be displayed as\n            the suggestion, and if the user clicks on the suggestion, this string will be sent to your\n            searchable activity (as a new search query).":"用户键入的字符串。  此字符串将显示为\n            建议，如果用户点击建议，这个字符串将被发送到您的\n            可搜索活动（作为新的搜索查询）。","The mode that can be passed to ":"可以传递到的模式 ","The amplitude values of the timing / amplitude pairs. Amplitude values\n                              must be between 0 and 255, or equal to ":"定时/幅度对的幅度值。 振幅值\n                              必须介于0和255之间，或等于 ","The list as an array.":"列表作为数组。","ByteBuffer The ByteBuffer associated with raw data pointer of the Allocation.":"Bytebuffer与分配的原始数据指针相关联的ByteBuffer。","Returns true if currently in low power mode, else false.":"如果当前处于低功耗模式，则返回true，否则返回false。","Offset in bytes from the file head specifying where to write bytes. If a seek\n                operation is conducted on the file descriptor, then a write operation is requested, the\n                offset refrects the proper position of requested bytes.":"从指定写入字节的位置的文件头偏移以字节为单位。 如果寻求\n                对文件描述符进行操作，然后请求写操作，\n                偏移量会重新调整请求字节的正确位置。","parent document of the document to move.":"要移动的文档的父文档。","the longitude for the address":"地址的经度","Returns a new ParcelFileDescriptor holding a FileDescriptor\n            for a dup of the given fd.":"返回持有FileDescriptor的新ParcelFileDescriptor\n            对于给定fd的dup。","Whether the print job is queued.":"打印作业是否排队。","IconListener that gets the icons once they are\n          retrieved.\n":"IconListener，一旦他们得到的图标\n          检索到。\n","If resultTo is non-null, this is the caller's\n            request code to be received with the result.":"如果resultTo是非null，这是调用者的\n            请求将与结果一起接收的代码。","The count":"伯爵"," from your layout that this dialog\n            should be centered around. In particular, if the dialog\n            has a \"callout\" arrow, it will be pointed and centered\n            around this ":" 从你的布局，这个对话框\n            应为中心。 特别是，如果对话框\n            有一个\"标注\"箭头，它将被指向和居中\n            围绕这个 ","Access mode for the file. May be \"r\" for read-only access,\n            \"w\" for write-only access, \"rw\" for read and write access, or\n            \"rwt\" for read and write access that truncates any existing\n            file.":"文件的访问模式。 对于只读访问可能是\"r\",\n            \"w\"用于只写访问，\"rw\"用于读写访问，或\n            \"rwt\"用于截断任何现有的读写访问\n            档案。","A bitwise-or'd combination of PROT_READ, PROT_WRITE, PROT_EXEC, or PROT_NONE.":"PROT_READ、PROT_WRITE、PROT_EXEC或PROT_NONE的按位或按位组合。","whether the device is running in a headless system user mode.":"设备是否在无头系统用户模式下运行。","The creator to use when for instantiation.":"用于实例化时要使用的创建者。","the volume description":"卷说明","A Typeface object. Returns null if typeface creation fails.":"一个字体对象。 如果字体创建失败，则返回null。","Context used to launch the activity to add a bookmark.":"上下文用于启动活动以添加书签。","offset  into the memory file to write to.":"偏移到要写入的内存文件中。","The new value of the Preference.":"偏好的新值。","The start page index.":"起始页索引。","the status to get the icon for":"获得图标的状态","Unique identifier for distinguishing simultaneous events":"用于区分同时发生的事件的唯一标识符"," or XML.":" 或XML。","The printers to validate.":"要验证的打印机。","source allocation.":"源分配。","Title for the bookmark. Can be null or empty string.":"书签的标题。 可以为空字符串或空字符串。","the order of this Preference":"此首选项的顺序","bit field specifying how the allocaiton is\n                         utilized":"位字段指定allocaiton是如何\n                         利用的","If you have configured your recent suggestions provider with\n            ":"如果您已将最近的建议提供程序配置为\n            ","The name of the SharedPreferences file.":"SharedPreferences文件的名称。","The array of values.":"值的数组。",". An\n                              amplitude value of 0 implies the motor is off.":". 一个\n                              振幅值为0表示电机关闭.","size of the Allocation in bytes.":"以字节为单位的分配大小。","Returns True if the device supports it, false otherwise.":"如果设备支持，则返回True，否则返回false。","the parent PreferenceGroup or ":"父偏好组或","Size for write bytes.":"写入字节的大小。","document which will become a new parent of the source\n                    document.":"将成为源的新父级的文档\n                    文件。","the resolver to use":"要使用的解析器","The Socket whose FileDescriptor is used to create\n                          a new ParcelFileDescriptor.":"Filedescriptor用于创建的套接字\n                          一个新的ParcelFileDescriptor。","Whether the print job is started.":"打印作业是否启动。","Option fragment that should receive the result of\n            the activity launch.":"应接收结果的选项片段\n            活动启动。","The type of data the client desires.  May be\n a pattern, such as *&#47;*, if the caller does not have specific type\n requirements; in this case the content provider will pick its best\n type matching the pattern.":"客户端所需的数据类型。  可能是\n 一种模式，如*&#47;*，如果调用者没有特定类型\n 要求;在这种情况下，内容提供商将选择其最佳\n 型匹配的模式。"," if not attached to any":"如果不附带任何","The offset into the shared memory to begin mapping. Must be >= 0 and less than\n                    getSize().":"到共享内存中的偏移量开始映射。 必须为>=0且小于\n                    getSize()。","The time":"时间","whether the caller is in a managed profile.":"调用方是否在托管配置文件中。","is removable":"是可拆卸的","Additional options from the client.  The definitions of\n these are specific to the content provider being called.":"客户的其他选项。 定义 \n  这些特定于被调用的内容提供商。"," containing objects with the same data\n                    as those that were previously written.":" 包含具有相同数据的对象\n                    就像以前写的那样。"," to be used for fetching fonts.":" 用于获取字体。","number of bytes to write.":"要写入的字节数。","The Preference that was clicked.":"单击的首选项。","The color mode or zero if not set.":"颜色模式或零，如果不设置。","The user handle of the profile to be queried.":"要查询的配置文件的用户句柄。","The name of the code section to appear in the trace.  This may be at\n            most 127 Unicode code units long.":"要显示在跟踪中的代码段的名称。  这可能是在\n            大多数127个Unicode代码单元长。","the document to return children for, which must\n                       be a directory with MIME type of\n                       ":"返回儿童的文件，必须\n                       是MIME类型为\n                       ","The default value to return if either this\n                       Preference is not persistent or this Preference is not present.":"如果是这样，返回的默认值\n                       首选项不持久或此首选项不存在。","X offset of the region in the source Allocation":"源分配中区域的x偏移","The printers.":"打印机。","Context to which the Allocation will belong.":"分配将属于的上下文。","Url for the bookmark. Can be null or empty string.\n":"书签的Url。 可以是null或空字符串。\n",", you can\n            pass a second line of text here.  It will be shown in a smaller font, below the primary\n            suggestion.  When typing, matches in either line of text will be displayed in the list.\n            If you did not configure two-line mode, or if a given suggestion does not have any\n            additional text to display, you can pass null here.":"，你可以\n            在这里传递第二行文字。  它将显示在一个较小的字体，下面的主要\n            建议。  键入时，任何一行文本中的匹配项都将显示在列表中。\n            如果您没有配置双行模式，或者如果给定的建议没有任何\n            要显示的其他文本，您可以在此处传递null。","The entries.":"的条目。","The name that can be passed to ":"可以传递给的名称 ","Which effects to query for.":"要查询哪些效果。","The offset of the first element to be copied.":"要复制的第一个元素的偏移量。","The wake lock level to check.":"的唤醒锁电平进行检查。","the moved document, or ":"移动的文档，或 ","Byte array to be written to somewhere.":"要写入某处的字节数组。","the person to add to the group":"要添加到组中的人员","The file to be opened.":"要打开的文件。","If resultTo is non-null, this is the request\n            code in which to report the result.":"如果resultTo为非空，则这是请求\n            报告结果的代码。","The number of copies or zero if not set.":"份数或零，如果不设置。","The length of the region to map. Must be > 0 and offset + length must not\n                    exceed getSize().":"要映射的区域的长度。 必须>0，offset+length不能\n                    超过getSize()。","The value to persist.":"要持久化的值。","path to the OBB file the state change has happened on":"状态更改发生在OBB文件的路径","opaque volume name, or ":"不透明卷名称，或 ","Used to determine which exception class to throw.":"用于确定要抛出哪个异常类。","the MIME type filter for the requested format. May\n                       be *\\/*, which matches any MIME type.":"请求格式的MIME类型筛选器。 五月\n                       be*\\/*，它匹配任何MIME类型。"," will be thrown when the\n                                      query is executed.":" 当\n                                      查询被执行。","True if the message is asynchronous.":"如果消息是异步的，则为True。","true if the profile is in quiet mode, false otherwise.":"如果配置文件处于安静模式，则为true，否则为false。"," to query activities.":" 来查询活动。","The duplex mode or zero if not set.":"双工模式或零，如果不设置。","true if tracing is currently enabled, false otherwise":"如果当前启用跟踪，则为true，否则为false","the subtree to leverage to gain access to the target\n                       document. The target directory must be a descendant of this\n                       subtree.":"用于访问目标的子树\n                       文件。 目标目录必须是this的后代\n                       子树。","The value from the data store or the default return\n                    value.":"来自数据存储的值或默认返回值\n                    价值。","The ids of the removed printers.":"删除的打印机的id。","Y offset of the region in the source Allocation":"源分配中区域的y偏移","the context used to start the activity":"用于启动活动的上下文","Element to use in the Allocation":"要在分配中使用的元素","The entries array as a resource.":"条目数组作为资源。","Convenience copy of the content resolver.":"容解析器的方便副本。","The list view to attach to.":"要附加到的列表视图。","Whether all of the effects are supported.":"是否支持所有效果。","True if the specified wake lock level is supported.":"如果支持指定的唤醒锁定级别，则为True。","parent document of the document to remove.":"要删除的文档的父文档。","Size of bytes processed by the function.":"函数处理的字节大小。","The number of elements to be copied.":"要复制的元素数。","Resource ID of string to display for the title of\n            this set of preferences.":"要显示的字符串的资源ID\n            这组首选项。","the group to add the person to":"要将人员添加到的组","The desired access mode, must be one of\n                       ":"所需的访问模式，必须是\n                       ","A ByteBuffer mapping.":"一个ByteBuffer映射。","The creation time in milliseconds.":"创建时间以毫秒为单位。","True if this Preference is persistent. (This is not whether the\n                    value was persisted, since we may not necessarily commit if there\n                    will be a batch commit later.)":"如果此首选项是持久的，则为True。 （这不是\n                    价值是持久的，因为如果有，我们可能不一定承诺\n                    稍后将是批量提交。)"," if this volume is not indexed\n                    by ":" 如果此卷未编入索引\n                    由 ","A ClassLoader from which to instantiate the Parcelable\n            object, or null for the default class loader.":"用于实例化Parcelable的ClassLoader\n            对象，或默认类加载器的null。","extra options from the client. Specific to the content\n                       provider.":"来自客户端的额外选项。 具体到内容\n                       提供者。"," object that identifies the provider and query for the\n                           request.":" 标识提供程序和查询的对象\n                           请求。","the current state of the OBB":"OBB的当前状态","Handler to assign to the returned Message object's <em>target</em> member.":"处理程序分配给返回的消息对象的<em>目标</em>成员。","whether this process is running under the system user.":"此进程是否在系统用户下运行。","The XML resource ID to inflate.":"要膨胀的XML资源ID。","The counter name to appear in the trace.":"要显示在跟踪中的计数器名称。","The media size or <code>null</code> if not set.":"媒体大小或<code>null</code>如果未设置。","The old View to reuse, if possible. Note: You should\n                       check that this View is non-null and of an appropriate type\n                       before using. If it is not possible to convert this View to\n                       display the correct data, this method can create a new View.":"如果可能的话，要重用旧视图。 注意：你应该\n                       检查此视图是否为非空且具有适当的类型\n                       使用前。 如果无法将此视图转换为\n                       显示正确的数据，这种方法可以创建一个新的视图。","the document to return children for, which the\n                       caller may not have direct access to, and which must be a\n                       directory with MIME type of ":"返回儿童的文件，\n                       呼叫者可能无法直接访问，并且必须是\n                       MIME类型的目录 ","The human readable, short, and translated reason why the print job is blocked.":"打印作业被阻止的人类可读、简短和翻译的原因。","Z offset of the region in the source Allocation":"源分配中区域的z偏移","The array to be used as values to save for the preference.":"要用作为首选项保存的值的数组。","the number of Elements in the Allocation":"分配中的元素数","Max entries to leave in the table. 0 means remove all entries.":"最大条目留在表中。 0表示删除所有条目。","An adapter that provides the ":"提供 ","Which primitives to query for.":"查询哪些原语。","Combination of wake lock level and flag values defining\n the requested behavior of the WakeLock.":"唤醒锁定级别和标志值的组合。\n 唤醒锁的请求行为。","true if the document was removed successfully.":"如果成功删除文档，则为true。","the string to send":"要发送的字符串","the update package to install.  Must be on\n            a partition mountable by recovery.  (The set of partitions\n            known to recovery may vary from device to device.  Generally,\n            /cache and /data are safe.)":"要安装的更新包。  必须上\n            通过恢复可挂载的分区。  （分区集\n            已知的恢复可能因设备而异。  一般情况下,\n            /缓存和/数据是安全的。)","the source array":"源数组","Resource ID of string to display for the short title of\n            this set of preferences.":"要显示的字符串的资源ID\n            这组首选项。","the name of the group to add the contact to":"要将联系人添加到的组的名称","; may also be any combination of\n                       ":"；也可以是任意组合的\n                       ","A ByteBuffer mapping":"ByteBuffer映射","updated name for document":"文档的更新名称","The option key.":"的选项键。"," if it should store its value(s) into the storage.":" 如果它应该将其值存储到存储中。","the UUID for the volume or ":"卷的UUID或 ","Returns the newly created Parcelable, or null if a null\n            object has been written.":"返回新创建的Parcelable，如果为null，则返回null\n            对象已写入。","the directory to return children for.":"返回儿童的目录。","A Message object from the global pool.":"来自全局池的消息对象。","the existing or new document after the rename, or ":"重命名后的现有或新文档，或"," for \"portable\" storage devices which haven't\n            been adopted.":"对于没有的“便携式”存储设备 \n             被采用。","A context to be used for fetching from font provider.":"用于从字体提供程序获取的上下文。","the open file that you'd like to allocate disk space for.":"要为其分配磁盘空间的打开文件。","Returns whether the user making this call is a goat.":"返回进行此调用的用户是否是山羊。","True if it is persistent.":"如果是持久的，则为真实。","The key of the preference to retrieve.":"要检索的首选项的键。","The resolution or <code>null</code> if not set.":"分辨率或<code>null</code>如果未设置。","The counter value.":"的计数器值。","The parent that this View will eventually be attached to.":"此视图最终将附加到的父级。","the target document, which the caller may not have\n                       direct access to.":"调用方可能没有的目标文档\n                       直接进入。","Whether the job was blocked.":"作业是否被阻止。","the source bitmap":"源位图","The entry values array as a resource.":"条目值数组作为资源。","allocation":"分配","App context.":"应用上下文。"," contained in this\n                    ":" 载于此\n                    ","Your class name (or other tag) for debugging purposes.":"您的类名（或其他标记）用于调试目的。","Whether primitives effects are supported.":"是否支持原语效果。","document with ":"文档","the package to be verified":"要验证的包","The site being visited.":"正在访问的网站。","The new header to display.":"要显示的新标题。","the source array.":"源阵列。","the ContentResolver to use":"要使用的内容解析器",", and\n                       ":"，而\n                       ","code to pass to the kernel (e.g., \"recovery\") to\n                          request special boot modes, or null.":"代码将内核（例如，“恢复”）传递给 \n                           请求特殊的启动模式或null。","Any bitwise-or'ed combination of\n                             ":"任何按位或按位组合\n                             ","an object to receive periodic progress\n            updates as verification proceeds.  May be null.":"接收定期进度的对象 \n             随着验证的进行更新。 可能是无效的。","document which will become a parent of the source\n                    document's copy.":"文档将成为来源的父母 \n                     文档的副本。","The option value.":"的选项值。"," columns to put into the\n                       cursor. If ":" 列放入\n                       光标。 如果 ","Original message to copy.":"要复制的原始消息。","the source data allocation.":"源数据分配。"," if\n                    failed.":" 如果\n                    失败了。"," object that identifies the provider and query for the\n                           request. May not be null.":" 标识提供程序和查询的对象\n                           请求。 可能不是null。","the Parcelable array, or null if the array is null":"Parcelable数组，如果数组为null，则为null","The dialog, or null if a dialog is not being shown.":"对话框，如果未显示对话框，则为null。","the number of bytes to allocate. This is the desired final\n                       size of the open file. If the open file is smaller than this\n                       requested size, it will be extended without modifying any\n                       existing contents. If the open file is larger than this\n                       requested size, it will be truncated.":"要分配的字节数。 这是期望的决赛\n                       打开文件的大小。 如果打开的文件比这个小\n                       请求的大小，它将被扩展而不修改任何\n                       现有内容。 如果打开的文件大于此\n                       请求的大小，它将被截断。","whether the context user is running in the foreground.":"上下文用户是否在前台运行。","The values to persist.":"要坚持的价值观。"," with the key, or null.":" 与密钥，或null。","The Parcel containing the previously written UserHandle,\n            positioned at the location in the buffer where it was written.":"包含先前编写的UserHandle的包裹,\n            定位在写入缓冲区中的位置。","The margins or <code>null</code> if not set.":"如果未设置，则边距或<code>null</code>。","the document to copy.":"要复制的文档。","Returns the same Preference object, for chaining multiple calls\n                    into a single statement.":"返回相同的首选项对象，用于链接多个调用\n                    成单个语句。","The user to retrieve the running state for.":"用户可以检索运行状态。","Whether the job is canceled.":"作业是否被取消。","The icon, as a ":"图标，作为一个","the source allocation":"源分配"," to be used by this Preference.":"该偏好使用。","The index of the value to set.":"要设置的值的索引。","RenderScript Type describing data layout":"描述数据布局的RenderScript类型","true if the specified context can draw on top of other apps, false otherwise":"如果指定的上下文可以在其他应用程序之上绘制，则为true，否则为false","True if the key exists and is not a blank string, false otherwise.":"如果键存在并且不是空白的字符串，则为false，则为否。","Whether the job as completed.":"是否完成工作。","The old print attributes.":"旧的打印属性。","The ringtone picker intent that can be\n                       modified by putting extras.":"铃声选择器的意图，可以是\n                       通过放置额外的修改。","the target document to be copied into as a child.":"小时候要复制到的目标文件。","The layout resource ID to be inflated.":"布局资源ID将被夸大。","An array containing the systems current knowledge about whether the given effects\n            are supported or not.":"包含系统当前关于给定效果是否的知识的数组\n            是否支持。","If true, this is an actual visit, and should add to the\n              number of visits.  If false, the user entered it manually.\n":"如果属实，这是一个实际的访问，并应添加到\n              访问次数。  如果为false，则用户手动输入。\n","The value to set for the key.":"为密钥设置的值。","whether quiet mode should be enabled or disabled":"是否应启用或禁用安静模式","The preference to add.":"添加的首选项。","the values to use when creating the contact":"创建联系人时要使用的值","a new ParcelFileDescriptor pointing to the given file.":"指向给定文件的新ParcelFileDescriptor。",",\n                             ":",\n                             ","the copied document, or ":"复制的文件，或 ","listener to be removed":"要删除的侦听器","the parent directory to create the new document\n                       under.":"创建新文档的父目录 \n                        在下面。","The included pages or <code>null</code> if not set.":"包含的页面或<code>null</code>如果未设置。","the context.":"上下文。","to call listener from; must not be null.":"打电话给听众； 不能无效。","the zip file of certificates whose\n            public keys we will accept.  Verification succeeds if the\n            package is signed by the private key corresponding to any\n            public key in this file.  May be null to use the system default\n            file (currently \"/system/etc/security/otacerts.zip\").":"证书的zip文件\n            我们将接受公钥。  验证成功，如果\n            包由与任何对应的私钥签名\n            此文件中的公钥。  可能为null使用系统默认\n            文件（目前\"/system/etc/security/otacerts。zip\"）。"," all supported columns should be\n                       included.":" 所有支持的列应该是\n                       包括在内。","user handle of the profile":"个人资料的用户句柄","Runnable that will execute when the message is handled.":"处理消息时将执行的Runnable。","the concrete MIME type associated with the new document.\n                       If the MIME type is not supported, the provider must throw.":"与新文档关联的混凝土哑剧类型。 \n                        如果不支持MIME类型，则必须投掷。","off The offset of the first element in data to\n                     be copied.":"关闭数据中第一个元素的偏移量到\n                     被复制。","Whether the option is present.":"是否存在选项。","A handler to be processed the font fetching.":"要处理字体提取的处理程序。","The time of the user activity, in the ":"用户活动的时间，在","the id of the event to be viewed. Will be put into ":"要查看的事件的ID。 将被放入","A ClassLoader from which to instantiate the ":"一个类加载器，从中实例化 ","the UUID of the storage volume where you'd like to\n                       allocate disk space. The UUID for a specific path can be\n                       obtained using ":"您想要的存储卷的UUID\n                       分配磁盘空间。 特定路径的UUID可以是\n                       使用 ","The fragment that is asking to be finished.":"要求完成的片段。","A uid for an application running in a particular user.":"在特定用户中运行的应用程序的uid。","The source array":"源数组"," if user's credential is needed in order to turn off quiet mode,\n                    ":"如果需要用户的凭据才能关闭安静模式，","the display name of the new document. The provider may\n                       alter this name to meet any internal constraints, such as\n                       avoiding conflicting names.":"新文档的显示名称。 提供者可以 \n                        更改此名称以满足任何内部约束，例如 \n                        避免矛盾的名字。","Source array.":"源阵列。","\n            time base.  This timestamp is used to correctly order the user activity request with\n            other power management functions.  It should be set\n            to the timestamp of the input event that caused the user activity.":"时间基础。 此时间戳用于正确订购用户活动请求 \n             其他电源管理功能。 应该设置 \n             到导致用户活动的输入事件的时间戳。"," used by this Preference or ":" 使用此首选项或 ","renderscript type describing data layout":"描述数据布局的renderscript类型","The new print attributes.":"新的打印属性。","the optional icon for this Preference":"此首选项的可选图标"," for that user.":"对于该用户。","The ContentResolver to access.":"要访问的内容解析器。","The human readable, short, and translated reason\n            for the failure.":"人类可读的、简短的和翻译的原因\n            为了失败。","the document to create a web link intent for.":"为创建Web链接意图的文档。","The layout resource.":"的布局资源。","Whether the primitives are supported.":"图元是否被支持。","The bitmap to be set from the Allocation.":"从分配设置的位图。","If true, does not cause the keyboard backlight to turn on\n            because of this event.  This is set when the power key is pressed.\n            We want the device to stay on while the button is down, but we're about\n            to turn off the screen so we don't want the keyboard backlight to turn on again.\n            Otherwise the lights flash on and then off and it looks weird.":"如果为true，则不会导致键盘背光灯打开 \n             因为这个事件。 当按下电源键时，这是设置的。 \n             我们希望该设备在按钮关闭时继续使用，但是我们要 \n             要关闭屏幕，因此我们不希望键盘背光再次打开。 \n             否则，灯闪烁，然后关闭，看起来很奇怪。","The ringtone to be marked as the current ringtone.":"要标记为当前铃声的铃声。","The value of the key.":"键的值。","Whether the preference is now in this group.":"首选项现在是否在该组中。","bit field specifying how the allocation is\n                         utilized":"位指定分配方式的位字段 \n                          利用","the icon":"图标","the Context":"上下文",", and\n                             ":"，而\n                             ","additional information, such as list of recipients. Optional.":"其他信息，例如收件人列表。 可选的。"," if failed.":" 如果失败。","The message.":"消息。","The Parcel from which to read the UserHandle":"可以从中读取用户手的包裹","The time when the request to wake up was issued, in the\n            ":"发出唤醒请求的时间","to be invoked when the returned descriptor has been\n            closed; must not be null.":"当返回的描述符已被调用\n            closed;不能为null。","Bundle containing sorting information or other\n                       argument useful to the provider. If no sorting\n                       information is available, default sorting\n                       will be used, which may be unordered. See\n                       ":"Bundle包含排序信息或其他\n                       对提供者有用的参数。 如果没有排序\n                       信息可用，默认排序\n                       将被使用，这可能是无序的。 见\n                       ","the approximate percentage of the\n        verification that has been completed, ranging from 0\n        to 100 (inclusive).\n":"的大致百分比\n        已完成的验证，范围从0\n        至100(含)。\n","The chosen ringtone's ":"选定的铃声","Value to assign to the <em>target</em> member.":"要分配给<em>目标</em>成员的值。"," if the space for the icon view should be reserved":"如果应该保留图标视图的空间","\n            object, or null for the default class loader.":"\n            对象，或默认类加载器的null。","The target printer id.":"目标打印机id。"," for\n                       details.":"为了 \n                        细节。","A callback that will be triggered when results are obtained. May not be null.":"获得结果时将触发的回调。 可能不是null。","the person whose photo should be used":"应该使用照片的人","Returns a new UserHandle matching the previously written\n            object, or null if a null had been written.":"返回一个新的用户匹配以前编写的 \n             对象，如果编写了零，则无效。","True if the contained preferences should be shown on the same\n                    screen as this preference.":"如果应将包含的首选项显示在相同的 \n                     屏幕作为此偏好。","\n                           field of the intent.":"\n                           意图的领域。"," time base.  This timestamp is used to correctly\n            order the wake up request with other power management functions.  It should be set\n            to the timestamp of the input event that caused the request to wake up.":"时间基础。 此时间戳用于正确 \n             使用其他电源管理功能订购唤醒请求。 应该设置 \n             到导致请求唤醒的输入事件的时间戳。","Returns the number of callbacks in the broadcast, to be used\n            with ":"返回广播中的回调数，要使用 \n             和","The sound type(s) that are shown in the picker.":"挑选器中显示的声音类型。","Can be 0 or ":"可以是0或 ","the number of bytes to allocate.":"要分配的字节数。","Optional result code to send back to the original\n            launching fragment.":"可选的结果代码发送回原始\n            发射片段。","The dest array":"Dest阵列","how to order the rows, formatted as an SQL\n                       ":"如何订购行，格式为SQL","Whether to allow adding the preference (true), or not (false).":"是否允许添加偏好（true），（false）。","The Parcel in which the UserHandle will be placed.":"将放置用户手的包裹。"," if this preference view should be recycled":" 如果应该回收此首选项视图","Signal for observing cancel layout requests.":"用于观察取消布局请求的信号。","The name of the setting to retrieve.":"要检索的设置的名称。","Whether the job was failed.":"作业是否失败。","Whether to show the default or not.":"是否显示默认值。","The array to be set from the Allocation.":"要从分配中设置的数组。","Optional result data to send back to the original\n            launching fragment.":"可选的结果数据以发送回原始 \n             启动碎片。","The Bundle that holds the previously saved state.":"持有先前保存状态的捆绑包。","The duration of each primitive, with zeroes for primitives that are not supported.":"每个基元的持续时间，不支持的基元为零。","The values to set for the key.":"要为密钥设置的值。","Callback to inform the system for the layout result.":"回调以告知系统以获取布局结果。","The UserHandle to be written.":"用户手写。"," clause (excluding the ORDER BY itself).\n                       Passing ":"子句（单独排除订单）。 \n                        通过","bit field specifying how the Allocation is\n              utilized\n":"指定分配方式的位字段\n              利用的\n","; or\n                             ":"；或\n                             ","Whether to order according to the order added.":"是否根据添加的订单订购。","the document to delete.":"要删除的文档。","The Bundle in which to save the instance of this Preference.":"保存此偏好实例的捆绑包。","Value to return if the setting is not defined.":"如果未定义设置，则返回的值。","directory with ":"目录与 ","The text of the negative button.":"否定按钮的文本。","The string representation of the file mode. Can be \"r\", \"w\", \"wt\", \"wa\", \"rw\"\n                        or \"rwt\".":"文件模式的字符串表示。 可以是\"r\"，\"w\"，\"wt\"，\"wa\"，\"rw\"\n                        或\"rwt\"。","Value to assign to the <em>what</em> member.":"要分配给<em>what</em>成员的值。","RenderScript context":"Renderscript上下文","the previously written ":"以前写的 "," if the space of this preference icon view is reserved":" 如果保留了此首选项图标视图的空间","A non-negative integer representing the id of the vibrator controlled by this\n            service, or -1 this service is not attached to any physical vibrator.":"代表由此控制的振动器ID的非负整数 \n             服务或-1此服务未连接到任何物理振动器。","The job state.":"的作业状态。","the image resource to use if the person doesn't\n   have a photo":"如果此人不使用，则要使用的图像资源\n   有一张照片","the start time of the event in milliseconds since epoch.\n                           Will be put into ":"事件的开始时间，以毫秒为单位。\n                           将投入 ","The timeout after which to release the wake lock, in milliseconds.\n":"释放唤醒锁的超时，以毫秒为单位。\n","Context to use for performing the query.":"用于执行查询的上下文。",", or null if a null Creator was\n            written.":"，或无效的创建者 \n             书面。","The intent associated with this Preference.":"与此偏好相关的意图。","the PIN to use for challenge dialogs.":"用于挑战对话框的PIN。"," to determine the range of indices you\n            can supply.":" 要确定指数的范围，您\n            能供应。","the UUID of the storage volume where you're\n                       considering allocating disk space, since allocatable space can\n                       vary widely depending on the underlying storage device. The\n                       UUID for a specific path can be obtained using\n                       ":"您所在的存储卷的UUID\n                       考虑分配磁盘空间，由于可分配空间可以\n                       根据底层存储设备的不同而有很大的不同。 该\n                       特定路径的UUID可以使用\n                       ","X offset of the region to update in this Allocation":"在此分配中要更新的区域的x偏移","Whether to show an item for the default sound/ringtone.":"是否显示默认声音/铃声的项目。","the class name of the Fragment about to be attached to this activity.":"即将附加到此活动的片段的类名。","The Context in which to store Preference values.":"存储首选项值的上下文。","The artist or album name to convert":"艺术家或专辑名称转换","Returns true if the challenge PIN was set successfully.":"如果成功设置了挑战引脚，则返回真实。","Additional information about how to layout the content.":"有关如何布局内容的其他信息。","the Serializable object, or null if the Serializable name\n            wasn't found in the parcel.":"可序列化对象，或序列化的名称为null \n             在包裹中找不到。","The new progress":"新进展"," will use the default sort order, which\n                       may be unordered. This ordering is a hint that can be used to\n                       prioritize how data is fetched from the network, but UI may\n                       always enforce a specific ordering.":" 将使用默认的排序顺序，\n                       可能是无序的。 这个排序是一个提示，可以用来\n                       优先考虑如何从网络获取数据，但UI可能\n                       始终强制执行特定的顺序。","Y offset of the region to update in this Allocation":"y在此分配中更新该区域","Optional name to assign to the user.":"要分配给用户的可选名称。","the maximum number of new bytes that the calling app can allocate\n                    using ":"调用应用程序可以分配的最大新字节数 \n                     使用","Element":"元素","Whether this group orders based on the order the children are added.":"此组是否根据添加子项的顺序进行排序。","Whether or not the requested protection was applied. Returns true on success,\n            false if the requested protection was broader than the existing protection.":"是否适用了所要求的保护。 成功时返回true,\n            如果所要求的保护比现有的保护范围更广，则为错误。","The new status. If null the status will be empty.":"新状态。 如果无效，状态将为空。","the extra query arguments.":"额外的查询论点。","the name of the volume to get the URI for":"获得URI的卷的名称","The Context this is associated with, through which it can\n                       access the current theme, resources, ":"与之相关的上下文可以通过 \n                        访问当前主题，资源，"," to make it selectable":" 以使其可选择","MIME type of new document":"新文档的MIME类型","to access the database with":"要访问数据库，请使用","the Bitmap to be copied":"要复制的位图","the root to be ejected.":"要弹出的根。","The content View of the dialog, if it is custom.":"对话框的内容视图，如果它是自定义的。","A bitmask representing the given file mode.":"表示给定文件模式的位掩码。","The <em>target</em> value to set.":"要设置的<em>目标</em>值。","The number of preference children in this group.":"该小组的偏好儿童数量。","to look up in the table":"在桌子上抬头","RenderScript type describing data layout":"描述数据布局的RenderScript类型","A name for the new print job which is shown to the user.":"显示给用户的新打印作业的名称。","The number of milliseconds to vibrate.":"振动的毫秒数。","the decoding options, can be set to null":"解码选项，可以设置为null"," field of the intent.":" 意图的领域。","The <em>what</em> value to set.":"<em>要设置的</em>值。","True to make the wake lock reference counted, false to\n make the wake lock non-reference counted.\n":"True使唤醒锁引用计数，false为\n 使唤醒锁非引用计数。\n"," last set via ":" 最后一组通过 ","Which of the registered callbacks you would like to\n            retrieve.  Ranges from 0 to 1-":"您希望哪个注册回调\n            检索。  范围从0到1-","Whether to show 'Silent'.":"是否显示'沉默'。","the key of the restriction":"限制的关键","true if the fragment class name is valid for this Activity and false otherwise.":"如果片段类名对此活动有效，则为true，否则为false。","A newly created object of the type that was previously\n                    written.":"以前创建的类型的新创建对象\n                    写的。","The work source, or null if none.\n":"工作源，或无效的话。","The pages whose content to print - non-overlapping in ascending order.":"要打印内容的页面-按升序不重叠。","the UUID of the storage volume that you're interested\n                       in. The UUID for a specific path can be obtained using\n                       ":"您感兴趣的存储卷的UUID\n                       在。 特定路径的UUID可以使用\n                       ","Optional account name that will be used by the setup wizard to initialize\n                               the user.":"安装向导将用于初始化的可选帐户名\n                               的用户。","The new size of the allocation.":"分配的新大小。"," if it is selectable, ":" 如果是可选择的, ","The size of the SharedMemory region.":"SharedMemory区域的大小。","the value for the restriction":"限制的价值","the ID of the audio file for which to retrieve the genres":"要为其检索流派的音频文件的ID","The XML resource to load and parse.":"XML资源加载和解析。",",\n                       etc.":",\n                       等。","Returns the number of milliseconds this process has return.":"返回此过程返回的毫秒数。","The new capacity of the parcel, in bytes.  Can not be\n            less than ":"包裹的新容量，字节。 不可能是 \n             少于"," columns to put into the cursor. If\n                       ":" 要放入光标的列。 如果\n                       ","The new status as a String resource. If 0 the status will be empty.":"字符串资源的新状态。 如果为0，则状态为空。","name of new document":"新文件名称","Width of the region to update":"要更新的区域宽度","The content resolver to use":"内容解析器使用","the document from which the path starts if not null,\n                or null to indicate a path from the root is requested.":"路径从中启动的文档（如果不是null）,\n                或null指示从根请求的路径。","The already-opened file.":"已打开的文件。","The content View for the dialog.":"对话框的内容视图。","The name of the setting to modify.":"要修改的设置的名称。"," all supported columns should be included.":"所有支持的列都应包括在内。","newly created document, or ":"新创建的文档，或","The attributes of the XML tag that is inflating the\n                       preference.":"XML标签的属性正在充气 \n                        偏爱。","The preference to remove.":"移除的偏好。","bit field specifying how the Allocation is\n                         utilized":"指定分配方式的位字段\n                         利用的","An adapter that emits the document to print.":"发出要打印的文档的适配器。"," corresponding to the vibration. For example,\n                                specify ":" 对应的振动。 例如,\n                                指定 ","the end time of the event in milliseconds since epoch.\n                         Will be put into ":"自epoch以来以毫秒为单位的事件结束时间。\n                         将投入 ","The Context this is associated with, through which it can\n                       access the current theme, resources,\n                       ":"与之相关的上下文可以通过 \n                        访问当前主题，资源，","the person who was contacted":"被联系的人","The <em>object</em> method to set.":"要设置的<em>对象</em>方法。","Whether the preference was found and removed.":"是否找到和删除了偏好。","The key for the preference.":"首选项的关键。","Number of Allocations in the array.":"数组中的分配数量。","Returns the callback interface that you can call.  This will\n            always be non-null.":"返回可以调用的回调接口。  这将\n            始终为非空。",", etc.":"， ETC。","Whether to show an item for 'Silent'.":"是否显示\"无声\"的项目。","The destination file descriptor to which to write.":"要写入的目标文件描述符。","package name for the App for which manageSpaceActivity is to be launched":"要为其启动manageSpaceActivity的应用程序的包名称","Optional account type for the account to be created. This is required\n                               if the account name is specified.":"要创建的帐户的可选帐户类型。 这是必需的\n                               如果指定了帐户名。","True: enable AutoPadding; False: disable AutoPadding":"True：启用AutoPadding；False：禁用AutoPadding","the icon as a resource ID":"作为资源ID的图标","The Context that will style this preference":"将风格此偏好的上下文","the Bundle containing all the restrictions.":"包含所有限制的捆绑包。","The buffer to unmap":"取消映射的缓冲区","The list in which the parsed headers should be placed.":"应该在其中放置解析的标头的列表。","an array of integers, indicating the CPU cores exclusively\n            reserved for this process. The array will have length zero if no\n            CPU cores are exclusively reserved for this process at this point\n            in time.":"一个整数数组，专门指示CPU内核\n            保留用于此过程。 如果没有，数组的长度为零\n            此时，CPU内核仅为此进程保留\n            及时。","True if the tag was set, false otherwise.":"如果设置了标记，则为True，否则为false。"," -- that is, you can not drop existing data\n            with this method.":" --也就是说，您不能删除现有数据\n            用这种方法。","The numeric id of the playlist":"播放列表的数字id","Height of the region to update":"要更新的区域高度","the document which path is requested.":"请求路径的文档。","to call listener from.":"从调用侦听器。","Whether the positive button was clicked (true), or\n                       the negative button was clicked or the dialog was canceled (false).":"是否点击了正按钮（true），或\n                       单击\"否定\"按钮或取消对话框(false)。","The new value for the setting.":"置的新值。"," if failed":" 如果失败","The default print job attributes or <code>null</code>.":"默认打印作业属性或<code>null</code>。"," for alarm vibrations or\n                                ":" 用于报警振动或\n                                ","if the event is an all-day event. Will be put into\n                          ":"如果活动是全天活动。 将投入\n                          ","the path of the requested document. If parentDocumentId is null\n                returned root ID must not be null. If parentDocumentId is not null\n                returned root ID must be null.":"请求的文件的路径。 如果parentdocumentid为null \n                 返回的根ID不得无效。 如果parentdocumentid不为null \n                 返回的根ID必须为null。","the Uri of the person whose photo is to be updated":"要更新照片的人的Uri","The <em>arg1</em> value to set.":"要设置的<em>arg1</em>值。","the key of the preference to retrieve":"要检索的首选项的键","The layout resource ID to be inflated and returned as\n                       a ":"要膨胀并返回的布局资源ID为\n                       a ","An attribute in the current theme that contains a\n                       reference to a style resource that supplies default values for\n                       the view. Can be 0 to not look for defaults.":"当前主题中的属性，其中包含\n                       对提供默认值的样式资源的引用\n                       的视图。 可以为0以不查找默认值。","Allocation[]":"分配[]","Index of which registration cookie to return, from 0 to\n            ":"要返回的注册cookie的索引，从0到\n            ","for launching the activity":"启动活动"," for\n                                vibrations associated with incoming calls.":"为了 \n                                 与来电相关的振动。","the root to search under.":"下搜索的根。","Signal for observing cancel writing requests.":"用于观察取消写入请求的信号。","Optional bundle of data to be passed in during account creation in the\n                                  new user via ":"在帐户创建期间传递的可选数据包\n                                  新用户通过 ","fp":"fp","Style attributes that differ from the default":"与默认值不同的样式属性","A resource identifier of a style resource that\n                       supplies default values for the view, used only if\n                       defStyleAttr is 0 or can not be found in the theme. Can be 0\n                       to not look for defaults.":"样式资源的资源标识符 \n                        为视图提供默认值，仅在 \n                        Defstyleattr为0或在主题中找不到。 可以是0 \n                        不要寻找默认值。","the UserHandle of the user for whom to set the restrictions.":"为其设置限制的用户的UserHandle。","the summary as a resource":"摘要作为资源","path in the desired file system to stat.":"到stat的所需文件系统中的路径。","The identifier of the thread/process. If tid equals zero, the priority of the\n            calling process/thread will be returned.":"线程/进程的标识符。 如果tid等于零，优先级的\n            调用进程/线程将被返回。","The list in which to place the headers.":"要放置标题的列表。","Whether the job was started.":"这项工作是否开始了。","An attribute in the current theme that contains a\n                   reference to a style resource that supplies default values for\n                   the view. Can be 0 to not look for defaults.":"当前主题中包含一个的属性 \n                    参考为提供默认值的样式资源 \n                    风景。 可以是0，不寻找默认值。","New offset in the parcel; must be between 0 and\n            ":"宗地中的新偏移量；必须介于0和\n            ","The position of the item to move":"要移动的项目的位置","Data to be placed into the Allocation":"要放入分配的数据","to be invoked when the returned descriptor has been\n                       closed.":"当返回的描述符已被调用\n                       关闭。","The name of the fragment to display.":"要显示的片段的名称。","The text of the positive button.":"正按钮的文本。","A resource identifier of a style resource that\n                   supplies default values for the view, used only if\n                   defStyleAttr is 0 or can not be found in the theme. Can be 0\n                   to not look for defaults.":"样式资源的资源标识符 \n                    为视图提供默认值，仅在 \n                    Defstyleattr为0或在主题中找不到。 可以是0 \n                    不要寻找默认值。","to store":"储存","The created print job on success or null on failure.":"成功时创建的打印作业或失败时为空。","uri for the document to create a link to.":"要创建链接的文档的uri。","The tag or null.":"标签或空。","flags to be set on the intent via ":"通过 ","get the metadata of the document":"获取文档的元数据","the byte[] that represents the photo":"表示照片的byte[]","The text as a string resource ID":"文本作为字符串资源ID","The <em>arg2</em> value to set.":"要设置的<em>arg2</em>值。"," with the key, or ":" 用钥匙，或 ","The layout resource ID.":"的布局资源ID。","Context to which the allocation will belong.":"分配将属于的上下文。","Returns whatever cookie object is associated with this index, or null if\n            ":"返回与此索引关联的任何cookie对象，如果\n            ","PendingIntent to launch the manageSpaceActivity if successful, null if the\n            packageName doesn't have a manageSpaceActivity.":"PendingIntent启动manageSpaceActivity如果成功，null如果\n            packageName没有manageSpaceActivity。","string to match documents against.":"字符串来匹配文档。","an array of longs of times for which to turn the vibrator on or off.":"打开或关闭振动器的长时间阵列。","Callback to inform the system for the write result.":"回调以通知系统写入结果。","An Intent that can be launched from an Activity.":"可以从活动启动的意图。","instance of the OnBufferAvailableListener\n                            class to be called when buffer arrive.":"onbufferavailablelistener的实例\n                            缓冲区到达时要调用的类。","whether the device supports multiple users.":"设备是否支持多个用户。","The new value of this Preference.":"此首选项的新值。","the title as a resource ID":"作为资源ID的标题","the old policy, to be passed to setThreadPolicy to restore the policy.":"旧的策略，要传递给setThreadPolicy来恢复策略。","Returns the current priority, as a Linux priority level,\n            from -20 for highest scheduling priority to 19 for lowest scheduling\n            priority.":"返回当前优先级，作为Linux优先级级别,\n            从最高调度优先级的-20到最低调度优先级的19\n            优先级。","The new number of bytes in the Parcel.":"包裹中的新字节数。","The position to move the item to":"将项目移动到的位置","to be placed into the Allocation":"要放入分配","UUID":"UUID","The icon, as a resource ID.":"的图标，作为资源ID。","Optional arguments to supply to the fragment.":"提供给片段的可选参数。","to associate with the name":"与名称相关联","The print job list.":"的打印作业列表。","Extra information for generating the link.":"用于生成所述链接的额外信息。"," if the activity is started successfully. ":" 如果活动已成功启动。 ","The active print jobs.":"活动的打印作业。","the document to move.":"要移动的文档。","The ID to check.":"要检查的ID。","Text to display in the off state":"要在关闭状态下显示的文本","The context of the preferences whose values are wanted.":"需要其值的首选项的上下文。","The <em>obj</em> value to set.":"要设置的<em>obj</em>值。","Whether this Preference should disable\n                       its dependents.":"此首选项是否应禁用\n                       其家属。","bitmap with cubemap faces layed out in the following\n                     format: right, left, top, bottom, front, back":"带有立方体贴图面的位图如下所示\n                     格式：右，左，上，下，前，后"," has been called.":" 已经被召唤了。","path to OBB image":"OBB图像的路径","the query arguments.\n                       ":"查询参数。\n                       ","the index into pattern at which to repeat, or -1 if\n                           you don't want to repeat.":"将索引转换为要重复的模式，或者-1\n                           你不想重复。","The content type.":"的内容类型。","the package name of the calling application":"调用应用程序的包名称","the stride. For 1D Allocation, the stride will be the number of\n                    bytes of this Allocation. For 2D and 3D Allocations, the stride\n                    will be the stride in X dimension measuring in bytes.":"的步幅。 对于一维分配，步幅将是\n                    此分配的字节。 对于2D和3D分配，步幅\n                    将以字节为单位测量x维度的步幅。","the user name":"用户名称","True if the user value should be set as the preference\n                    value (and persisted).":"如果用户值应设置为首选项，则为True\n                    值（并持久化）。","A kernel uid.":"个内核uid。"," where this Preference reads its value(s). If\n                    this preference isn't attached to a Preference hierarchy or if\n                    a ":" 此首选项读取其值的位置。 如果\n                    此首选项未附加到首选项层次结构，或者如果\n                    a ","the old policy, to be passed to ":"旧的政策，要传递给 ","The list of strings to be written.":"要写入的字符串列表。","the file to get the URI for":"获取URI的文件","X offset of the region in this Allocation":"此分配中区域的x偏移","the UUID string to parse.":"要解析的UUID字符串。","The dialog message as a resource.":"作为资源的对话消息。","Optional resource ID of title to show for this item.":"要为此项显示的标题的可选资源ID。","the content resolver to use":"要使用的内容解析器","Context instance for accessing resources.":"访问资源的上下文实例。","an intent sender to obtain the web link, or null if the document\n                 is not linkable, or creating the intent sender failed.":"意图发送者获取web链接，如果文档为null\n                 不可链接，或创建意图发送者失败。","The content resolver to use for the query":"用于查询的内容解析器","The new base context for this wrapper.\n":"此包装器的新基本上下文。\n","the parent of the document to move.":"要移动的文档的父级。","Whether the ID is associated with profile data.":"ID是否与简档数据相关联。","The text that will be displayed on the switch widget in the off state":"将在关闭状态下显示在开关小部件上的文本"," instance that can be used to retrieve and listen\n                    to values of the preferences.":" 可用于检索和侦听的实例\n                    到首选项的值。","The IdleHandler to be added.":"要添加的IdleHandler。","The PreferenceManager of the hierarchy.":"层次结构的PreferenceManager。","allocation containing cubemap data":"包含立方体贴图数据的分配","Index of which callback registration to return, from 0 to\n            ":"要返回的回调注册的索引，从0到\n            ","absolute path to mounted OBB image data or <code>null</code> if\n                    not mounted or exception encountered trying to read status":"安装的OBB图像数据的绝对路径或<code>null</code>如果\n                    未挂载或尝试读取状态时遇到异常","cursor containing search result. Include\n                    ":"包含搜索结果的光标。 包括\n                    ","the index into pattern at which to repeat, or -1 if\n                              you don't want to repeat.":"将索引转换为要重复的模式，或者-1\n                              你不想重复。","The data size.":"的数据大小。"," with the restrictions for that package, or an empty ":" 与该包的限制，或空 ","Surface to associate with allocation":"面与分配关联","A non-empty list of UserHandles associated with the calling user.":"与主叫用户相关联的UserHandles的非空列表。","The Preference to compare to this one.":"比较这一个的偏好。","Whether the uid corresponds to an application sandbox running in\n                a specific user.":"Uid是否对应于运行于\n                特定用户。","Whether the Preference should commit its saved value(s).":"首选项是否应提交其保存的值。"," to restore the policy at the\n                end of a block":" 在\n                一个街区的尽头","Bytes to place into the parcel.":"字节放入宗地。","The url of the image":"图像的url","Y offset of the region in this Allocation":"该区域在该分配中的Y偏移","a ParcelUuid instance.":"一个ParcelUuid实例。","Optional resource ID of short title to show for this item.":"为该项目显示的短标题的可选资源ID.","The dialog title as a resource.":"作为资源的对话框标题。","the location provider to query":"要查询的位置提供程序","The print attributes.":"的打印属性。","a short string for the exception stack trace that's built if when this fires.":"一个简短的字符串，用于如果触发时构建的异常堆栈跟踪。","if the document was deleted successfully.":"如果文档已成功删除。","The id of the event to retrieve attendees for":"要检索与会者的事件id","A locally unique id in the context of your print service.":"打印服务上下文中的本地唯一id。","the target document to be a new parent of the\n                source document.":"目标文档是\n                源文档。"," row, or an existing\n            ":" 行，或现有的\n            ","Text to display in the on state":"要在on状态下显示的文本"," to be used by this manager.":" 被这个经理使用。","The file descriptor for which a listener will be registered.":"将为其注册侦听器的文件描述符。","The View that shows this Preference.":"显示此首选项的视图。","specifies desired mipmap behaviour for the cubemap":"指定立方体贴图所需的mipmap行为","Returns whatever callback is associated with this index, or null if\n            ":"返回与此索引关联的任何回调，如果\n            ","true if the device supports filesystem checkpoint, false otherwise.":"如果设备支持文件系统检查点，则为true，否则为false。","\n                    extras ":"\n                    临时演员 "," corresponding to the vibration. For example,\n                              specify ":" 对应的振动。 例如,\n                              指定 ","The document name.":"文档名称。","\n            if there are no saved restrictions.":"\n            如果没有保存的限制。","Surface object associated with allocation":"与分配相关联的表面对象","a Bundle containing all the restrictions.":"包含所有限制的捆绑包。","0 if the same; less than 0 if this Preference sorts ahead of <var>another</var>;\n                     greater than 0 if this Preference sorts after <var>another</var>.":"如果相同，则为0；如果此首选项排序在<var>另一个</var>之前，则小于0;\n                     如果此首选项在<var>另一个</var>之后排序，则大于0。","The pid of the target process.":"目标进程的pid。","True if the dependents should be disabled, otherwise false.":"如果应禁用依赖项，则为True，否则为false。","The stream to use for the image":"用于图像的流","Index of first byte to be written.":"要写入的第一个字节的索引。","Width of the region to update.":"要更新的区域的宽度。","UUID contained in the ParcelUuid.":"包含在ParcelUuid中的UUID。","Returns an Intent that can be launched to display the given\n            fragment.":"返回可以启动以显示给定的意图\n            片段。","The negative button text as a resource.":"作为资源的否定按钮文本。","the location provider to enable or disable":"要启用或禁用的位置提供程序","the policy to put into place":"实施的政策","The content rectangle.":"的内容矩形。","root with ":"根与 ","Global printer id.":"全局打印机id。","the columns to return in the cursor":"要在游标中返回的列","Access mode for the file.  May be \"r\" for read-only access,\n \"w\" for write-only access (erasing whatever data is currently in\n the file), \"wa\" for write-only access to append to any existing data,\n \"rw\" for read and write access on any existing data, and \"rwt\" for read\n and write access that truncates any existing file.":"文件的访问模式。  对于只读访问可能是\"r\",\n \"w\"用于只写访问（擦除当前存在的任何数据\n 文件），\"wa\"用于仅写访问以追加到任何现有数据,\n \"rw\"用于对任何现有数据进行读写访问，\"rwt\"用于读取\n 和截断任何现有文件的写访问。"," to attempt refreshing.\n":" 尝试刷新。\n","The text that will be displayed on the switch widget in the on state":"将在打开状态下显示在开关小部件上的文本"," associated with this manager or ":" 与此管理器或 ","The set of events to receive: a combination of the\n            ":"要接收的事件集：\n            ","The View that displays this Preference.":"显示此首选项的视图。","bit field specifying how the cubemap is utilized":"位字段指定如何使用立方体贴图","The callback whose process has died.  Note that, since\n            its process has died, you can not make any calls on to this interface.\n            You can, however, retrieve its IBinder and compare it with another\n            IBinder to see if it is the same object.":"进程已死亡的回调。  请注意，由于\n            它的进程已经死亡，你不能对这个接口进行任何调用。\n            但是，您可以检索其IBinder并将其与另一个IBinder进行比较\n            IBinder，看看它是否是同一个对象。","true if OBB is mounted; false if not mounted or on error":"如果OBB已挂载，则为true；如果未挂载或出现错误，则为false"," for alarm vibrations or\n                              ":" 用于报警振动或\n                              ","The number of pages.":"的页数。"," when any QUERY_ARG_* value was honored\n                    during the preparation of the results.":" 当任何QUERY_ARG_*值被接受时\n                    结果的制备过程中。","The user whose serial number is to be retrieved.":"要检索其序列号的用户。","long Timestamp associated with the buffer held by the Allocation.":"分配所持有的缓冲器相关联的长时间戳。","true if a flag is set and false otherwise":"如果设置了标志，则为true，否则为false","The Context of this Preference.":"这种偏好的上下文。","The signal to send.":"的信号来发送。"," if this preference should disable its view when\n                                     the preference is disabled":" 如果此首选项应在以下情况下禁用其视图\n                                     首选项已禁用","The name of the image":"图像的名称","Number of bytes to write.":"要写入的字节数。","Height of the region to update.":"高度的区域来更新。","The list of threads to be associated with this session. They must be part of\n                this process' thread group.":"要与此会话关联的线程列表。 他们一定是\n                此进程'线程组。","The header that was selected.":"选择的标题。","The positive button text as a resource.":"正按钮文本作为资源。","true if the provider should be enabled\n":"如果应启用提供程序，则为true\n","elapsed milliseconds in the thread":"线程中经过的毫秒","The page height in PostScript points (1/72th of an inch).":"PostScript中的页面高度（1/72英寸）。"," to be ejected":" 被驱逐出境","The created session.":"创建的会话。","the ContentResolver":"内容解析器","A signal to cancel the operation in progress, or\n            ":"取消正在进行的操作的信号，或者\n            ","The content resolver to use for querying":"用于查询的内容解析器","The checked state.":"被检查的状态。","The context of the shared preferences.":"共享首选项的上下文。","The Preference that this Preference depends on.":"此首选项所依赖的首选项。","cubemap face in the positive x direction":"正x方向的立方体贴图面"," event masks.  If the requested\n            set of events is zero, then the listener is unregistered.":" 事件面具。  如果要求\n            事件集为零，则侦听器未注册。","The cookie object original provided to\n            ":"Cookie对象原始提供给\n            ","the path to the OBB file":"OBB文件的路径"," for\n                              vibrations associated with incoming calls.":" 为\n                              与来电相关的振动。","The bit mask of supported color modes.":"支持的颜色模式的位掩码。","the document to remove.":"要删除的文档。","Type":"类型","USAGE_CLASS_ALARM, USAGE_CLASS_FEEDBACK or USAGE_CLASS_UNKNOWN":"USAGE_CLASS_ALARM，USAGE_CLASS_FEEDBACK或USAGE_CLASS_UNKNOWN","The serial number of the given user; returns -1 if the\n            given UserHandle does not exist.":"给定用户的序列号；如果\n            给定的UserHandle不存在。","A Linux priority level, from -20 for highest scheduling\n            priority to 19 for lowest scheduling priority.":"Linux优先级级别，从-20为最高调度\n            优先级为19为最低调度优先级。","The key of the Preference that this depends on.":"这所依赖的首选项的关键。"," if it should disable the view":" 如果它应该禁用视图","The description of the image":"图像的描述","The Parcelable object to be written.":"要写入的Parcelable对象。","source Allocation.":"源分配。","The desired duration in nanoseconds for the new\n                session.":"新的所需持续时间（以纳秒为单位）\n                会议。","The header's position in the list.":"标题在列表中的位置。","Where to place the configuration settings.\n":"配置设置的位置。\n","elapsed milliseconds since boot.":"自启动以来经过的毫秒。","Optional instance state to restore on the dialog":"要在对话框上还原的可选实例状态","The page width in PostScript points (1/72th of an inch).":"PostScript点中的页面宽度（1/72英寸）。","treeUri of the document which path is requested.":"请求路径的文档的treeUri。","The new queued print job.":"新的排队打印作业。","the first Julian day in the range":"范围内的第一个儒略日"," if none. For example, if you are downloading a\n            file from the network to service a \"rw\" mode request, you\n            should periodically call\n            ":" 如果没有。 例如，如果您正在下载\n            文件从网络服务\"rw\"模式请求，您\n            应定期调用\n            ","the contact whose photo should be used. This can be used with\n either a ":"应使用其照片的联系人。 这可以与使用\n 无论是一个 ","The resource ID of the preference XML file.":"首选项XML文件的资源ID。","Set true to disable this Preference.":"设置为true可禁用此首选项。","The preference state that should disable dependents.":"应禁用依赖项的首选项状态。","cubemap face in the negative x direction":"负x方向的立方体贴图面","The listener to invoke when file descriptor events occur.":"发生文件描述符事件时要调用的侦听器。","The callback interface to be added to the list.  Must\n            not be null -- passing null here will cause a NullPointerException.\n            Most services will want to check for null before calling this with\n            an object given from a client, so that clients can't crash the\n            service with bad data.":"要添加到列表中的回调接口。  必须\n            not be null--在这里传递null会导致NullPointerException。\n            大多数服务在调用它之前都要检查空值。\n            一个从客户端给出的对象，这样客户端就不会崩溃\n            坏数据的服务。","secret used to encrypt the OBB; may be <code>null</code> if no\n                       encryption was used on the OBB.":"用于加密OBB的secret;如果没有，则可能为<code>null</code>\n                       在OBB上使用了加密。","The id of the vibrator to be retrieved.":"要检索的振动器的id。","the document to rename.":"要重命名的文档。","usage this Allocation's set of the USAGE_* flags OR'd together":"使用此分配的USAGE_*标志集或将一起使用","The number of milliseconds to vibrate. This must be a positive number.":"振动的毫秒数。 这必须是一个正数。","user handle of the calling user or a profile associated with the\n                              calling user.":"主叫用户的用户句柄或与\n                              主叫用户。","The default attributes.":"默认属性。","The identifier of the thread/process to change.":"要更改的线程/进程的标识符。","The key of the dependency.":"的依赖关系的关键。"," where this preference saves its value(s). If\n                    this preference isn't attached to a Preference hierarchy or if\n                    a ":"此首选项保存其值的位置。如果\n                    此首选项未附加到首选项层次结构，或者如果\n                    一个","True if it should persist the value.":"如果它应该保留该值，则为True。","The path to the image to insert":"要插入的图像的路径","Contextual flags as per\n            ":"上下文标志按\n            ","X offset in source Allocation":"源分配中的x偏移"," of the preference hierarchy.":" 首选层次结构。","the new session if it is supported on this device, null if hint session is not\n                supported on this device.":"如果此设备上支持新会话，则为null\n                此设备上支持。","The settings to write.":"要写入的设置。","elapsed nanoseconds since boot.":"启动后经过的纳秒。"," widget that will be shown in the dialog.":" 窗口小部件将显示在对话框中。","The page number. Must be a non negative.":"的页码。 必须是非负数。","The print job to cancel.":"要取消的打印作业。","ContentResolver":"ContentResolver","Y offset in source Allocation":"y偏移源分配"," to check whether\n            the client has canceled the request and abort the download.":" 检查是否\n            客户端已取消请求并中止下载。","the number of days to load (must be at least 1)":"加载天数（必须至少为1）","the path of the document, or ":"文档的路径，或 ","If this is true and the contact has a higher resolution photo\n available, it is returned. If false, this function always tries to get the thumbnail":"如果这是真的，并且联系人有更高分辨率的照片\n 可用，则返回。 如果为false，此函数始终尝试获取缩略图","The dialog view.":"对话框视图。","Whether to re-read the default values.\n            If false, this method sets the default values only if this\n            method has never been called in the past (or if the\n            ":"是否重新读取默认值。\n            如果为false，则此方法仅在以下情况下设置默认值\n            方法在过去从未被调用过（或者如果\n            ","if the clock was successfully set to the specified time.":"如果时钟成功设置为指定的时间。","Whether dependents are disabled when this preference is on (":"当此首选项为on时，是否禁用依赖项（","The set of attributes.":"的属性集合。","cubemap face in the positive y direction":"正y方向的立方体贴图面","True if the looper is idle.":"如果活套闲置，则为True。","Optional additional data to be associated with this\n            callback.":"要与此关联的可选附加数据\n            回调。","will receive the success or failure of the operation":"会收到操作的成功或失败","The vibrator with given ":"给定的振动器 ","the updated display name of the document. The provider\n                       may alter this name to meet any internal constraints, such as\n                       avoiding conflicting names.":"文档的更新后的显示名称。 提供者\n                       可以更改此名称以满足任何内部约束，例如\n                       避免名称冲突。","The text to save":"要保存的文字","The strength of the vibration. This must be a value between 1 and 255, or\n            ":"振动的强度。 这必须是介于1和255之间的值，或者\n            ","The face to make active.":"的脸来使其活跃。","The bit mask of supported duplex modes.":"支持的双工模式的位掩码。","Returns true if the system can run in multiple processes, else\n            false if everything is running in a single process.":"如果系统可以在多个进程中运行，则返回true，否则\n            如果所有内容都在单个进程中运行，则为false。","creation time in milliseconds since Epoch time.":"创建时间以毫秒为单位，因为纪元时间。"," has been set, this method returns ":" 已设置，此方法返回 ","The current preference value.":"当前的偏好值。","The desired effect.":"所需的效果。"," if the title should be constrained to one line":" 如果标题应限制为一行","The authority of the Font Provider to be used for the request. This\n                    should be a system installed app.":"字体提供商的权限用于请求。 这个 \n                     应该是系统安装的应用程序。","The array of objects to be written.":"要写入的对象数组。"," that is the root of the preference\n                    hierarchy.":" 这是偏好的根源\n                    层次结构。","The media sizes.":"媒体尺寸。","the preferred update rate supported by device software.":"备软件支持的优选更新速率。"," that is to be used to communicate\n with the ":" 那就是用来沟通的\n 与 "," if the current user can block numbers.":" 如果当前用户可以阻止数字。","The new icon for the printer or null to unset the current icon":"打印机的新图标或null以取消设置当前图标","The ID of the effect to perform:\n                            ":"执行效果的ID：","The package for the Font Provider to be used for the request. This is\n                    used to verify the identity of the provider.":"字体提供商用于请求的软件包。 这是 \n                     用于验证提供商的身份。","original image id\n":"原始图像id\n","X offset of the region to copy in this Allocation":"在此分配中要复制的区域的x偏移量","the document to return.":"要返回的文档。","the initial capacity of the PersistableBundle":"持久性捆绑的初始能力","The ContentResolver to use for the query":"用于查询的ContentResolver","a Document URI":"文档URI"," in the default value shared\n            preferences file is false). To attempt to set the default values again\n            bypassing this check, set ":" 在共享的默认值\n            preferences file为false）。 尝试再次设置默认值\n            绕过此检查，设置 "," that may be used as the\n            parent for this dialog.":" 可用作\n            此对话框的父级。","to sleep before returning, in milliseconds of uptime.":"在返回之前睡觉，以毫秒的正常运行时间为单位。",")\n                    or when this preference is off (":")\n                    或者当此首选项关闭时（","cubemap face in the negative y direction":"负y方向的立方体贴图面","The IdleHandler to be removed.":"要移除的空手。","Returns true if the callback was successfully added to the list.\n            Returns false if it was not added, either because ":"如果回调已成功添加到列表，则返回true。\n            如果未添加，则返回false，无论是因为 ","whether the mount call was successfully queued or not":"挂载调用是否成功排队","The index of the default value attribute.":"默认值属性的索引。",", never null.":"，从不为null。","The LOD to make active.":"使lod处于活动状态。","Size of bytes.":"字节的大小。","The serial number of the user that is being\n            retrieved.":"正在使用的用户的序列号\n            检索到。","Values to return if this preference does not exist.":"如果此首选项不存在，则返回的值。"," if the title of this preference is constrained to a single line":" 如果此首选项的标题仅限于一行","set ":"套装 ","The map of objects to be written.":"要写入的对象的映射。","the title for the breadcrumb":"面包屑的标题","The set of new values for the preference.":"首选项的新值集。","The minimal margins.":"的最小边距。"," that contains the sync state.":" 包含同步状态。"," is blocked.":" 被阻挡。","The query to be sent over to the provider. Refer to your font provider's\n                    documentation on the format of this string.":"要发送到提供程序的查询。 请参阅您的字体提供商的\n                    有关此字符串格式的文档。","The parcelable flags to use.":"可以使用的包裹旗。","The pattern of alternating on-off timings, starting with off. Timing values\n                           of 0 will cause the timing / amplitude pair to be ignored.":"交替开-关时序的模式，从关开始。 定时值\n                           0将导致定时/幅度对被忽略。","true iff the icon could be updated":"真正的iff图标可以更新","the short title for the breadcrumb":"面包屑的短标题","original image id":"原始图像id","The resolutions.":"决议。","Y offset of the region to copy in this Allocation":"在此分配中要复制的区域的y偏移量","The authority of the Font Provider to be used for the request.":"字体提供商的权限用于请求。","the mode to open with, such as 'r', 'w', or 'rw'.":"要打开的模式，例如'r'，'w'或'rw'。","The columns to return":"要返回的列","If there is a difference, true is returned.":"如果有区别，则返回true。","listener to be added,":"要添加的侦听器,","the uri of the sync state":"同步状态的URI"," to true.\n                       <p class=\"note\">\n                       Note: this will NOT reset preferences back to their default\n                       values. For that functionality, use\n                       ":" \"的确如此。\n                       <p类=\"注意\">\n                       注意：这不会将首选项重置回默认设置\n                       价值观。 对于该功能，请使用\n                       ","a Bundle of Bundles.":"束的束。","Specific ":"具体 ","Width of the region to copy":"复制区域的宽度","the same groupId used in getThumbnail.\n":"与getThumbnail中使用的groupID相同。"," object containing the metrics for this application. The keys\n            for this HealthStats object will be from the ":"包含此应用程序的指标的对象。 按键 \n             因为这个健康状态的对象将来自","milliseconds of non-sleep uptime since boot.":"开机后的非睡眠正常运行时间毫秒。","The list of sets of hashes for the certificates the provider should be\n                    signed with. This is used to verify the identity of the provider. Each set in the\n                    list represents one collection of signature hashes. Refer to your font provider's\n                    documentation for these values.":"证书的一组哈希列表，提供商应为 \n                     与。 这用于验证提供商的身份。 每组 \n                     列表代表一个签名哈希集合。 请参阅您的字体提供商 \n                     这些值的文档。","The summary as a resource.":"摘要作为资源。","cubemap face in the positive z direction":"正z方向的立方体贴图面","thermal status as int, ":"热状态为int，","The file descriptor whose listener will be unregistered.":"侦听器将被取消注册的文件描述符。","The Handler that will receive sent messages.":"将接收已发送消息的处理程序。"," had\n            previously been called or the callback's process has gone away.":" 曾\n            以前被调用或回调的进程已经消失。"," that this dialog should be\n            centered around, in screen coordinates. In particular, if\n            the dialog has a \"callout\" arrow, it will be pointed and\n            centered around this ":"这个对话应该是 \n             以屏幕坐标为中心。 特别是 \n             对话框具有“呼叫”箭头，它将被指向，并且 \n             以此为中心","path to the OBB file":"OBB文件的路径","The default value of this preference type.":"此首选项类型的默认值。","intent to request access, or ":"意图要求访问或","An array containing the ids of the vibrators available on the device.":"包含设备上可用振动器id的阵列。","Height of the region to copy":"复制区域的高度","the current application context":"当前的应用程序上下文","The x to make active.":"的x使活动。","Offset in bytes from the file head specifying where to read bytes. If a seek\n                operation is conducted on the file descriptor, then a read operation is requested, the\n                offset refrects the proper position of requested bytes.":"从指定读取字节的位置的文件头偏移以字节为单位。 如果寻求\n                对文件描述符进行操作，然后请求读取操作，\n                偏移量会重新调整请求字节的正确位置。","Return the user associated with the serial number, or null\n            if there is not one.":"返回与序列号关联的用户，或null\n            如果没有一个。","cubemap face in the negative z direction":"cubemap面向负z方向","The IBinder this Messenger should communicate with.":"该使者应该与Ibinder进行通信。"," if the requested directory is invalid for\n                    that volume.":"如果请求的目录无效 \n                     那卷。","whether to kill any programs using this in order to unmount\n                       it":"是否使用此程序杀死任何程序以卸载 \n                        它","Dest Array to be copied into":"dest阵列要复制到","the summary for the preference":"首选项的摘要","The entry corresponding to the current value, or null.":"当前值对应的条目，或null。"," to enable it":" 启用它","the number of rows deleted in the blocked number provider as a result of unblock.":"由于取消阻止而在阻止的数字提供程序中删除的行数。","The list of objects to be written.":"要写入的对象列表。","Size for read bytes.":"读取字节的尺寸。","A file descriptor for reading the data.":"用于读取数据的文件描述符。","The fragment to start":"要开始的片段","The printer name.":"打印机名称。","The y to make active.":"y使活跃。"," if this Preference is enabled, false otherwise":"如果启用了此偏好，则否则为错误","this is only used for MINI_KIND when decoding the Bitmap":"这仅在解码位图时用于MINI_KIND","The start of the time range to query in UTC millis since\n            epoch":"UTC中查询的时间范围的开始。\n            时代","the summary":"摘要","\n                       and clear it followed by a call to this method with this\n                       parameter set to true.":"\n                       并清除它，然后调用此方法\n                       参数设置为true。"," whose sync state should be returned":" 应返回其同步状态","Z offset of the region to update in this Allocation":"z偏移该区域以更新此分配","document to return thumbnail for, which must have\n                       ":"要返回缩略图的文档，必须具有\n                       ","ContentResolver used to dispatch queries to MediaProvider.":"ContentResolver用于将查询调度到MediaProvider。","If true, the current fragment will be pushed onto the back stack.  If false,\n            the current fragment will be replaced.":"如果是正确的话，当前的片段将被推到后堆上。 如果是错误的， \n             当前的片段将被更换。","The end of the time range to query in UTC millis since\n            epoch":"自从UTC Millis查询的时间范围的结束以来 \n             时代","the value of ":"的价值 "," if device in not under\n            thermal throttling.":" 如果设备不在下面\n            热节流。","The summary to be shown when unchecked.":"未选中时要显示的摘要。","The size.":"的尺寸。",". If you are running at a\n            non-native density, you need to manually adjust using\n            ":". 如果你在一个\n            非本机密度，您需要手动调整使用\n            ","A custom name for the shared preferences file.":"共享首选项文件的自定义名称。","The callback to be invoked.":"要调用的回调。","a combination of effects to be performed by one or more vibrators.":"要由一个或多个振动器执行的效果的组合。","the UserHandle of the user for whom to retrieve the restrictions.":"为其检索限制的用户的UserHandle。",", null for any":"，无效","bitmap source for the allocation data":"分配数据的位图源","the word to add to the dictionary. This should not be null or\n  empty.":"要添加到字典中的单词。 这不应该是null或\n  空的。","whether the unmount call was successfully queued or not":"卸载的调用是否已成功排队","The type of thumbnail to fetch. Should be either MINI_KIND or MICRO_KIND.":"提取的缩略图类型。 应该是mini_kind或micro_kind。","how many seconds in the future to forecast. Given that device\n                                   conditions may change at any time, forecasts from further in the\n                                   future will likely be less accurate than forecasts in the near future.":"将来有多少秒钟可以预测。 给定该设备 \n                                    条件可能随时发生变化，从进一步的进一步预测 \n                                    在不久的将来，未来的准确性可能不如预测。"," if there is nothing interesting to save. The default implementation\n                    returns ":" 如果没有什么有趣的保存。 默认实现\n                    申报表 ","A string of space separated search terms. Segments\n            enclosed by double quotes will be treated as a single\n            term.":"一串空间分离的搜索词。 细分市场 \n             被双引号封闭的将被视为一个 \n             学期。","The file creation mode for the shared preferences file, such\n            as ":"共享首选项文件的文件创建模式，这样 \n             作为","The summary.":"摘要。","The callback to be removed from the list.  Passing\n            null here will cause a NullPointerException, so you will generally want\n            to check for null before calling.":"从列表中删除的回调。 通过 \n             null这里会导致nullpoInterException，因此您通常需要 \n             在打电话之前检查null。","Returns the IBinder backing this Messenger.":"返回支持此信使的IBinder。"," for vibrations associated with\n                              incoming calls.":"与与之相关的振动 \n                               来电。","the title for this Preference":"此首选项的标题","The saved state that had previously been returned by\n                       ":"以前已返回的保存状态","Arbitrary result code to deliver, as defined by you.":"任意结果代码交付，由您定义。","A handler to call ":"一个要打电话的处理程序","The native fd that the ParcelFileDescriptor should adopt.":"ParcelFileDescriptor应该采用的原生fd。","The ContentResolver used to access the database.":"用于访问数据库的ContentResolver。","The document info.":"文件信息。","must be one of ":"必须是之一","The id of the event to retrieve reminders for":"事件的ID检索提醒","Allocation containing bitmap data":"包含位图数据的分配","The DataType for the new element.":"新元素的数据类型。","a value greater than or equal to 0.0 where 1.0 indicates the SEVERE throttling\n                    threshold, as described above. Returns NaN if the device does not support this\n                    functionality or if this function is called significantly faster than once per\n                    second.":"一个大于或等于0.0的值，其中1.0表示严重的节流 \n                     阈值，如上所述。 如果设备不支持此，则返回NAN \n                     功能或此功能的称为明显超过一次 \n                     第二。","The z to make active.":"的z使其活跃。","The capabilities.":"的能力。","Whether to re-read the default values.\n            If false, this method will set the default values only if this\n            method has never been called in the past (or if the\n            ":"是否要重新阅读默认值。 \n             如果为false，此方法仅在此时才设置默认值 \n             过去从未调用过方法（或者","The key of the Preference to find.":"首选项查找的关键。","the title":"标题","the id of group to which this request belongs":"此请求所属组的id","A Parcelable object containing the current dynamic state of this Preference, or\n                    ":"包含此偏好的当前动态状态的包裹对象，或","\n            on.  If you don't care, just call it like this, although your thread\n            will have to be a Looper thread.\n            <code>new TokenWatcher(new Handler())</code>":"上。 如果您不在乎，只要这样称呼它，尽管您的线程 \n             将必须是一个循环线。 \n             <code> new TokenWatcher（new Handler（））</code>","Returns a new ParcelFileDescriptor holding a FileDescriptor\n            for the given fd.":"返回一位持有备案者 \n             对于给定的FD。","Any desired arguments to supply to the fragment.":"要提供给片段的任何所需参数。","bit field specifying how the allocation is\n              utilized":"指定分配方式的位字段\n              利用的"," whose sync state should be set":" 应设置其同步状态"," to request access to the\n                       entire volume.":"请求访问 \n                        整个卷。","specifies desired mipmap behaviour for the\n             allocation":"指定所需的MIPMAP行为 \n              分配","Used to get the content resolver.":"用于获取内容解析器。","The DataKind to specify the mapping of each component in the\n                      DataType.":"Datakind指定在 \n                       数据类型。","optimal thumbnail size desired. A provider may return a\n                       thumbnail of a different size, but never more than double the\n                       requested size.":"所需的最佳缩略图大小。 提供者可以返回\n                       不同大小的缩略图，但不能超过\n                       要求的尺寸。","Full name of the class implementing the fragment.":"实现片段的类的全名。","A debugging tag for this TokenWatcher":"这个TokenWatcher的调试标签"," before calling.":" 在打电话之前。","The printer id.":"打印机ID。","a Bundle containing all the restrictions.\n            \n            <p>Requires ":"包含所有限制的捆绑包。\n            \n            <p>要求 ","describing the error; must not be null.":"描述错误； 不能无效。","True to restore the persisted value;\n                       false to use the given <var>defaultValue</var>.":"True恢复持久化值;\n                       false使用给定的<var>defaultValue</var>。","element size in bytes":"以字节为单位的元素大小","Returns true if the callback was found and unregistered.  Returns\n            false if the given callback was not found on the list.":"如果找到并未注册回调，则返回true。  申报表\n            如果在列表中未找到给定的回调，则为false。","Optional resource identifier of the title of this\n            fragment.":"标题的可选资源标识符 \n             分段。","The Message to send.  Usually retrieved through\n            ":"要发送的消息。  通常通过检索\n            ","decoded thumbnail, or ":"解码的缩略图或","The summary to be shown when checked.":"检查时要显示的摘要。","An IBinder object.":"一个ibinder对象。","The other WorkSource whose contents are to be merged.":"内容要合并的其他工作源。","The printers to add.":"要添加的打印机。","The string to add to the searches database.\n":"要添加到搜索数据库的字符串。\n","Any additional data provided by you.":"您提供的任何其他数据。","The time when the request to go to sleep was issued, in the\n            ":"发出睡眠请求的时间，在\n            ","The name to assign to the object.":"要分配给对象的名称。","Arbitrary result code delivered by the sender, as\n            defined by the sender.":"发件人交付的任意结果代码 \n             由发件人定义。","The print job info.":"打印作业信息。","The ContentResolver used to access the database.\n":"用于访问数据库的ContentResolver。\n","The printer to icon belongs to.":"图标所属的打印机."," that describes a specific contact to feature\n            in this dialog.":" 这描述了功能的特定联系人\n            在此对话框中。","The Messenger to write, or null.":"要写的信使，或null。","Whether the session is destroyed.":"会议是否被摧毁。","application resources":"应用资源"," time base.  This timestamp is used to correctly\n            order the go to sleep request with other power management functions.  It should be set\n            to the timestamp of the input event that caused the request to go to sleep.":"时间基础。 此时间戳用于正确 \n             订购使用其他电源管理功能的睡眠请求。 应该设置 \n             到导致请求入睡的输入事件的时间戳。","the byte[] that contains the sync state":"包含sync状态的byte[]","Any additional data provided by the sender.":"发件人提供的任何其他数据。","signal used to indicate if caller is no longer interested\n                       in the thumbnail.":"用于指示来电者是否不再感兴趣的信号\n                       在缩略图中。","Whether the print job is blocked.":"印刷作业是否被阻止。","url to remove.\n":"URL要删除。",", otherwise specified ":"，另有规定 ","The DataType for the new Element.":"新元素的数据类型。","Returns the FileDescriptor associated with this object.":"返回与此对象关联的FileDescriptor。","The context associated with the new Element.":"新元素相关联的上下文。","A\n            ":"A\n            ","Whether printer discovery is destroyed.":"打印机发现是否被破坏。"," if problem was encountered.":" 如果遇到问题。","Returns true if any new sources were added.":"如果添加了任何新源，则返回true。","name of the renderscript object":"renderscript对象的名称","Signal used to cancel the request.":"用于取消请求的信号。","Where to write the Messenger.":"在哪里写信使。","Any of ":"任何一个 ","the uri of the specific sync state to set":"要设置的特定同步状态的uri","\n            must be the calling user or a profile associated with it.":"\n            必须是主叫用户或与其关联的配置文件。","Vector size for the new Element.  Range 2-4 inclusive\n                        supported.":"新元素的矢量大小。  范围2-4包括\n                        支持。"," style\n            ":" 风格\n            ","The WorkSource to compare against.":"与之比较的工作资源.","Context to which the element will belong.":"元素将所属的上下文。","element data kind":"元素数据类型","element data type":"元素数据类型","index of the sub-element to return":"要返回的子元素的索引","sub-element in this element at given index":"给定索引处此元素中的子元素","index of the sub-element":"子元素的索引","array size of sub-element in this element at given index":"给定索引下此元素中子元素的数组大小"}