{"The column gap, in device independent pixels.  A value of ":"列间隔，在设备独立像素中。 一个值"," object has been successfully removed; otherwise, ":"对象已成功删除； 否则，","Value to be converted. This is expected to be type ":"值要转换。 预计将是类型","The zero-based index of the item to retrieve.":"要检索的项目的零索引。"," objects) hosted by the table. Note that this number might not be the actual number of columns rendered in the table. It is the ":"对象）由表托管。 请注意，此数字可能不是表中呈现的列的实际数量。 它是","The item at the specified zero-based index in the view.":"视图中指定的基于零索引的项目。","\") indicates that the column gap is equal to the ":"”）指示列间隙等于","Type that should be converted to.":"应转换为的类型。","This always returns ":"这总是返回"," objects in a table that determine how many columns are actually rendered.  \n  \n This property has no default value.":"表中确定实际呈现多少列的对象。 \n  \n  该属性没有默认值。","The item to locate.":"要找到的项目。"," to use when drawing the rule line between columns, or ":"在列之间绘制规则行时使用，或","The returned converted object. Cast this to the requested type. Ordinarily this should be cast to ":"返回的转换对象。 将其投入到请求的类型中。 通常，这应该被施加到","An enumerator for the logical children of the ":"逻辑子女的枚举者","If the template is intended for object data, this is the Type name of the data object.":"如果模板是针对对象数据的，则是数据对象的类型名称。","The column rule width, in device independent pixels. The default is 0.0.":"列规则宽度，在设备独立像素中。 默认值为0.0。","The index at which the specified item is located, or -1 if the item is unknown.":"指定项目所在的索引，或者-1如果项目未知。","The particular routed event that the ":"特定路由事件"," collection object that contains the row groups (represented by ":"包含行组的收集对象（由","A collection of trigger objects. The default value is ":"触发对象的集合。 默认值为 "," if a listener cancels the change; otherwise, ":"如果听众取消了变化； 否则，","The minimum desired column width, in device independent pixels. A value of ":"在设备独立像素中，最小所需的列宽度。 一个值"," objects) hosted by the table.  \n  \n This property has no default value.":"对象）由表托管。 \n  \n  该属性没有默认值。","The type for which this template is designed. This is either a ":"该模板设计的类型。 这是"," responds to.":"回应。"," causes only one column to be displayed, regardless of the page width.  The default is ":"无论页面宽度如何，都只会显示一列。 默认值为","The brush used to apply to the element's border.  \n  \n The default value is a null brush.":"刷子用于应用于元素边框。 \n  \n  默认值是一个空刷子。"," object that is added to the change log.":"添加到更改日志的对象。"," representing the end of the contents in the ":"代表内容的末端"," (to indicate that the ":"（表明"," object to pass to the event handler.":"对象传递到活动处理程序。","The number of columns the ":"列数","The handler to assign in this setter.":"在此设置器中分配的处理程序。"," is used to display items of the given type), or a string (to indicate that the ":"用于显示给定类型的项目）或字符串（指示"," representing the start of the contents in the ":"代表内容的开始","The identifier field of the routed event.":"路由事件的标识符字段。"," should span.  \n  \n The default value is 1 (no spanning).":"应该跨越。 \n  \n  默认值为1（无跨度）。","The sender of the event.":"活动的发件人。","The desired font size to use, in device independent pixels).   The default is determined by the ":"在设备独立像素中使用的所需字体大小）。 默认值由"," if the handler should still be invoked; otherwise, ":"如果仍应调用处理程序； 否则，"," is used to display ":" 用于显示 ","\") causes the line height to be determined automatically from the current font characteristics.  \n  \n The default value is ":"\"）导致从当前字体特征自动确定行高。  \n  \n 默认值为 "," object to process.":"对象处理。"," class that specifies the desired font-stretching characteristics to use. The default is ":"指定所需的字体拉伸特性的类。 默认值为","Reference to the handler that is attached by this ":"引用此附件的处理程序"," elements with the given tag name).":"带有标签名称的元素）。","The number of rows the ":"行的数量","The value to set as the ":"要设置为 "," class that specifies the desired font style. The default is determined by the ":"指定所需字体样式的类。 默认值由"," to append to the collection of table cells.":"附加到表单元的收集。",". See also the Exceptions section.":". 另请参阅例外部分。"," that activates this trigger.":"激活此触发器。"," class that specifies the desired font weight. The default is determined by the ":"指定所需字体重量的类。 默认值由"," if a thread other than the one that created the ":"如果除了创建的线以外的线程","The source stream to convert.":"要转换的源流。"," if the column width is flexible; ":"如果列宽度灵活；"," can change the ":"可以更改"," collection of this trigger.":"收集此触发器。","An item to query for the presence of in the collection.":"一个可以查询收藏中存在的项目。","The element that contains the ":"包含的元素","The default is an empty collection.":"默认值是一个空的集合。"," if the column width is fixed. The default is ":"如果列固定列。 默认值为"," if the view supports filtering; otherwise, ":"如果视图支持过滤； 否则，"," is present in the collection; otherwise, ":"集合中存在； 否则，"," to report information for.":"报告信息。"," if optimal paragraph layout is enabled; otherwise, ":"如果启用了最佳段落布局； 否则，",". If this property value is ":"。 如果此属性值为"," object that you can use to compare items in the view.":"您可以用来比较视图中的项目的对象。","A one-dimensional array to which the collection contents will be copied. This array must use zero-based indexing.":"将复制收集内容的一维数组。 此数组必须使用基于零的索引。","The identifier for the dependency property to report information for.":"依赖属性的标识符报告信息。","The number of records in the view, or -1 if the number of records is unknown.":"视图中的记录数，如果记录的数量未知，则为-1。","The height of each line, in device independent pixels, in the range 0.0034 to 160000. A value of ":"每条线的高度，以设备独立像素为单位，范围为0.0034至160000。 的值 ",", then the element being monitored for the raising of the event is the templated parent or the logical tree root.":"，然后监视事件升高的元素是模板的父或逻辑树根。","A zero-based index in ":"基于零的索引"," structure that reports the specific information.":"报告特定信息的结构。","\") causes the line height to be determined automatically from the current font characteristics. The default is ":"\"）导致从当前字体特征自动确定行高。 默认值为 ","The culture information to use during sorting.":"分类过程中要使用的文化信息。","The exception that details the specific error condition.":"详细说明特定错误条件的例外。"," specifying the position at which to begin inserting the copied collection objects.":"指定开始插入复制的集合对象的位置。","An element that belongs to a template instance.":"属于模板实例的元素。","The exit code that an application returns to the operating system when the application exits.":"应用程序退出时，应用程序将返回操作系统的退出代码。"," values that specifies the mechanism by which a line box is determined for each line of text in the ":"指定为每行文本确定线框的机制的值","The current item of the view. By default, the first item of the collection starts as the current item.":"视图的当前项目。 默认情况下，集合的第一项开始于当前项目。","A dependency property.":"依赖属性。"," array to which the collection contents will be copied. This array must use zero-based indexing.":" 集合内容将被复制到的数组。 此数组必须使用从零开始的索引。","The maximum height, in device independent pixels, for pages in the ":"在设备独立像素中的最大高度在该页面中"," belongs to an instance of a template that defines a value for the specified property that may change at runtime based on changes elsewhere; otherwise, ":"属于模板的实例，该实例定义了指定属性的值，该属性可能会根据其他位置的更改在运行时更改； 否则，"," within the (optionally sorted and filtered) view.":"在（可选的排序和过滤）视图中。","The number of device-independent pixels (96 pixels-per-inch) that make up the length.":"组成长度的独立像素（每英寸96个像素）的数量。"," that specifies the position at which to begin inserting the copied collection objects.":"这指定了开始插入复制的集合对象的位置。"," (no maximum page height).":"（无最大页面高）。"," and is identical to this ":"并且与此相同","A resource dictionary.":"资源词典。","A delegate that represents the method used to determine if an item is suitable for inclusion in the view.":"代表用于确定项目是否适合包含在视图中的方法的委托。","A collection item to return the index of.":"收集项目以返回索引。","The maximum width, in device independent pixels, for pages in the ":"在设备独立像素中的最大宽度，用于页面"," is identical to this ":"与此相同","The application owners of ":"申请人的所有者"," of the view is before the beginning of the collection; otherwise, ":"观点是在收藏开始之前； 否则，","The zero-based index of the specified collection item, or -1 if the specified item is not a member of the collection.":"指定集合项目的基于零的索引，或-1，如果指定的项目不是集合的成员。"," (no maximum page width).":"（无最大页面宽度）。"," representation of this ":"代表这个",". If there are no application owners, the method returns ":"。 如果没有应用程序所有者，该方法返回","A zero-based index that specifies the position in the collection at which to insert ":"基于零的索引，指定插入的集合中的位置","The minimum height, in device independent pixels, for pages in the ":"在设备独立像素中的最小高度在该页面中"," is in the view and at the ":"在视野和",". The default is 0.0.":"。 默认值为0.0。","The framework content owners of ":"框架内容所有者","The unit type of this ":"单位类型","An item to insert into the collection.":"一个可以插入集合的项目。"," if the underlying collection provides change notifications; otherwise, ":"如果基础收集提供更改通知； 否则，","The minimum width, in device independent pixels, for pages in the ":"在设备独立像素中的最小宽度，用于页面"," holds an absolute value (in pixels); otherwise, ":"具有绝对值（以像素为单位）； 否则，",". If there are no framework content owners, the method returns ":"。 如果没有框架内容所有者，该方法返回","An item to remove from the collection.":"从集合中删除的项目。"," if any object is subscribing to the events of this ":"如果有任何对象订阅此事件","The preferred height, in device independent pixels, for pages in the ":"首选高度，在设备独立像素中，用于页面","The framework element owners of ":"框架元素所有者"," is automatic (not specified); otherwise, ":"是自动的（未指定）； 否则，"," if the view needs to be refreshed; otherwise, ":"如果需要刷新视图； 否则，"," if the specified item was found and removed; otherwise, ":"如果发现并删除了指定的项目； 否则，","\") causes the page height to be determined automatically. The default is ":"”）导致自动确定的页面高度。默认值为",". If there are no framework element owners, the method returns ":"。 如果没有框架元素所有者，该方法返回","The preferred width, in device independent pixels, for pages in the ":"在设备独立像素中首选的宽度，用于页面","A zero-based index that specifies the collection item to remove.":"基于零的索引，指定要删除的集合项。","Describes context information of a component such as its container and ":"描述组件的上下文信息，例如其容器和","The object that is in the collection to represent a new item.":"集合中代表新项目的对象。","The source URI.":"来源URI。","\") causes the page width to be determined automatically. The default is ":"”）导致页面宽度自动确定。默认值为","A zero-based index that indicates the beginning of a range of items to remove.":"基于零的索引，指示要删除的一系列项目的开始。","Identifies the data type to evaluate for purposes of conversion.":"确定用于转换目的评估的数据类型。"," if it has been necessary to update the change log because a ":"如果有必要更新更改日志，因为","The resource dictionaries created from ":"由","The number of items to remove, beginning from the position specified by ":"要删除的项目数，从指定的位置开始"," notification has been received on a different thread without first entering the user interface (UI) thread dispatcher; otherwise, ":"在没有首先输入用户界面（UI）线程调度程序的情况下，已在另一个线程上收到通知； 否则，","The end position of the current composition text.":"当前构图文本的结束位置。","Context information of a component such as its container and ":"组件的上下文信息，例如其容器和"," if Visual Diagnostics is not enabled, the ":"如果未启用视觉诊断，则","The name of this group.":"该组的名称。","The preallocated collection item capacity for this collection. The default value is 8.":"该系列的预设收集项目容量。 默认值为8。","The data type to evaluate for purposes of conversion.":"用于转换目的评估的数据类型。"," environment variable is not set or is set to ":"环境变量未设置或设置为","The start position of the current composition text.":"当前组成文本的开始位置。","The number of items currently contained by the collection.":"集合当前包含的项目数。","The end position of the result text of the text input.":"文本输入的结果文本的最终位置。"," if this group is at the bottom level and does not have any subgroups; otherwise, ":"如果该组处于底层，并且没有任何子组； 否则，","Cultural specific information, including the writing system and calendar used.":"文化特定信息，包括使用的写作系统和日历。",", or no resource dictionaries were created from ":"，或者没有从创建资源字典 ","The start position of the result text of the text input.":"文本输入的结果文本的开始位置。","The number of items (leaves) in the subtree under this group.":"该组下的子树中的项目数（叶子）数量。","Currently, this property always returns ":"目前，此属性总是返回","The value which is being converted to a font size value.":"正在转换为字体大小值的值。","Data for the ":"数据的数据","The length of the current composition in Unicode symbols.":"Unicode符号中当前组合物的长度。","A zero-based index that specifies the position of the collection item.":"基于零的索引，指定收集项目的位置。","A read-only collection of the immediate items in this group. This is either a collection of subgroups or a collection of items if this group does not have any subgroups.":"此组中直接项的只读集合。 如果此组没有任何子组，则这是子组的集合或项的集合。"," value that represents the converted font size value.":"代表转换的字体大小值的值。"," events.":"事件。","The position at which the composition text occurs in the ":"组成文本在","The collection item at the specified index.":"指定索引的收集项目。","The name of the resource dictionary.":"资源词典的名称。","The name of this group which is the common value of the property used to divide items into groups.":"该组的名称是用于将项目分为组的属性的共同价值。","Cultural specific information, including writing system and calendar used.":"文化特定信息，包括使用的写作系统和日历。","The length of the finalized text in Unicode symbols when the ":"当unicode符号中最终文本的长度","The background ":"的背景","The number of items (leaves) in the subtree under this group":"该组下的子树中的项目数（叶）数量（叶子）","The data type this font size value is being converted to.":"数据类型此字体大小值正在转换为。","The key for the requested resource.":"请求资源的关键。","The offset of the finalized text when the ":"当最终文本的偏移"," used to fill the content of the ":"用于填充的内容","The value to assign to the target property.":"分配给目标属性的值。","A collection of immediate items in this group. This is either a collection of subgroups or a collection of items if this group does not have any subgroups.":"该组中的直接项目集合。 如果该组没有任何子组，这是子组的集合或项目集合。"," that is the value of the conversion.":"这就是转换的价值。","The root element of the visual tree for the ":"视觉树的根元素"," element, as a ":"元素，作为一个","The target property that the resource sets.":"资源设置的目标属性。","The collection view to be registered for cross-thread access.":"收集视图将被注册以进行跨线程访问。"," requested by ":"被要求"," if the application should use the ":"如果应用程序应使用","A table column to append to the collection of columns.":"一个表列，以附加到列的集合中。"," that represents the type to convert from.":"这代表要转换的类型。"," properties for the colors of inactive selected items; otherwise, ":"无效项目颜色的属性； 否则，"," that was created using the properties of the ":"这是使用属性创建的","A one-dimensional array to which the collection contents will be copied.  This array must use zero-based indexing.":"将复制收集内容的一维数组。 此数组必须使用基于零的索引。","An object reference to the binding source.":"对绑定源的对象引用。"," that always returns ":"总是回来"," array to which the collection contents will be copied.  This array must use zero-based indexing.":"收集内容将被复制到的数组。 此数组必须使用基于零的索引。"," that represents whether the code points have caret stops.":"这表示代码点是否有插入停止。"," if a data-bound ":"如果是数据限制的"," object that is the default view for the given source collection.":"对象是给定源集合的默认视图。"," that represents the type to convert to.":"这代表要转换的类型。","A zero-based index indicating the beginning of a range of items to remove.":"基于零的索引，指示要删除的一系列项目的开始。"," value that represents the name of the device font.":"代表设备字体名称的值。"," should display a string that is identical to the value of the source its ":"应显示与源值相同的字符串","The view object to check.":"查看对象要检查。","The pre-allocated collection item capacity for this collection. The default value is 8.":"此收藏的预先分配收集项目容量。 默认值为8。"," to use as the current culture. If ":"用作当前文化。 如果"," that is used for the fill of the ":" 这是用于填充 "," if a failed copy or cut operation in a ":"如果失败的副本或切割操作"," if the given view is the default view for the ":"如果给定的视图是默认视图","A zero-based index specifying the position of the collection item to retrieve.":"一个基于零的索引，指定收集项目要检索的位置。","Always raises ":"总是提高"," instance results in a ":"实例导致"," that represents the location of the font used for rendering the ":"代表用于渲染的字体的位置"," collection or if the given view is ":"收集或给定的视图是","A collection of child cells.":"儿童细胞的集合。","The element to bind the adorner to.":"将装饰物绑定到的元素。","The desired view type.":"所需的视图类型。","The child element to be added.":"要添加的子元素。","A table row to append to the collection or rows.":"一个表行以附加到集合或行。","A collection of glyph specifications that represents the ":"代表的字形规范集合","The transform that is currently applied to the adorned element.":"当前应用于装饰元素的转换。","The storyboard to begin.":"故事板开始。"," if the specified item is present in the collection; otherwise, ":"如果集合中存在指定的项目； 否则，","The culture that is used for operations such as sorting and comparisons.":"用于分类和比较等操作的文化。"," if the glyphs that make up the ":"如果构成的字形","A transform to apply to the adorner.":"适用于装饰物的转换。"," object are rotated 90° counter-clockwise; otherwise, ":"物体逆时针旋转90°； 否则，","A value of the enumeration that describes behavior to use if a property described in the storyboard is already animated.":"如果故事板中描述的属性已经被动画，则描述要使用的行为的枚举值。"," objects that describes how the items in the collection are grouped in the view.":"描述集合中的项目在视图中分组的对象。","The number of items to remove, beginning form the position specified by ":"要删除的项目数，开始形成由","The x origin for the ":"x起源","A size to constrain the adorner to.":"尺寸以限制装饰物。","A value of the enumeration that describes behavior to use if a  property described in the storyboard is already animated.":"如果故事板中描述的属性已经被动画，则描述要使用的行为的枚举值。"," if it cannot be determined whether the collection view implements live filtering. The registered default is ":"如果无法确定收集视图是否实时过滤。 注册默认值为","The pre-allocated collection item capacity for this collection.  The default value is 8.":"此收藏的预先分配收集项目容量。 默认值为8。","The y origin for the ":"y的起源"," if live filtering has been requested; otherwise, ":"如果已要求实时过滤； 否则，","An item to append to the collection.":"一个可以添加到集合的项目。"," object representing the amount of layout space needed by the adorner.":"代表装饰物所需的布局空间量的对象。","Declares whether the animation is controllable (can be paused) after it is started.":"声明动画启动后是否可控（可暂停）。","A Unicode string for the ":"一个Unicode字符串"," if it cannot be determined whether the collection view implements live grouping. The registered default is ":"如果无法确定收集视图是否实时分组。 注册默认值为","The starting text pointer":"起始文本指针","Arguments associated with the ":"与"," if live grouping has been requested; otherwise, ":"如果已要求实时分组； 否则，","Name of the element to search for.":"要搜索的元素的名称。","The element that this adorner is bound to. The default value is ":"这个装饰物绑定的元素。 默认值是","A command to associate with the ":"与","The end text pointer":"最终文本指针"," if it cannot be determined whether the collection view implements live sorting. The registered default is ":"如果无法确定收集视图是否实时排序。 注册默认值为","The requested element. May be ":"请求的元素。 或许"," value indicating whether clipping of the adorner is enabled.  \n  \n If this property is ":" 指示是否启用装饰器剪切的值。  \n  \n 如果此属性是 ","An object specifying parameters for the command specified by the ":"指定参数的对象"," if live sorting has been requested; otherwise, ":"如果已要求实时排序； 否则，","The effect to apply on the text":"适用于文本的效果"," if no matching element was found.":"如果找不到匹配元素。",", the adorner is not clipped.  \n  \n If this property is ":"，装饰物没有被剪裁。 \n  \n  如果此属性是","A target element on which to execute the command specified by the ":"执行该命令的目标元素"," objects that describes how the items in the collection are sorted in the view.":"描述集合中的项目在视图中如何排序的对象。"," objects corresponding to the text range.":"对应于文本范围的对象。","The view object that is currently associated with this instance of ":"当前与此实例关联的视图对象","Key identifier of the resource to be found.":"要找到的资源的关键标识符。",", the adorner is clipped using the same clipping geometry as the adorned element.  \n  \n The default value is ":"，装饰物使用与装饰元件相同的剪辑几何形状进行剪辑。 \n  \n  默认值是"," is targeting.":"正在定位。","The URI to navigate to when the ":"将导航到何时","The size reserved for this element by its parent.":"该元素保留的大小由其父母保留。"," is activated. The default is ":"被激活。 默认值为","The found resource, or ":"找到的资源，或","The number of items that the new list is initially capable of storing.":"新列表最初能够存储的项目数。"," is enabled on the target; otherwise, ":"在目标上启用； 否则，"," if no matching resource was found (but will also throw an exception if ":"如果找不到匹配资源（但如果","New item to add to the collection.":"新项目要添加到集合中。","The actual size needed by the element.  This return value is typically the same as the value passed to finalSize.":"元素所需的实际尺寸。 此返回值通常与传递给定性化的值相同。","A string specifying the name of a target window or frame for the ":"指定目标窗口名称或框架的字符串","The dependency object for which to retrieve the value of the ":"检索值的依赖关系对象"," from which to get the binding.":"从中获得绑定。","A size to constrain the ":"大小来限制","A member or the ":"成员或","Zero-based index where the new item is added.":"添加新项目的基于零的索引。"," if the target is data bound; otherwise, ":"如果目标是数据绑定的； 否则，","Arguments associated with the property value change.  The ":"与属性值相关联的参数发生更改。  该 "," object representing the amount of layout space needed by the ":"代表布局空间数量所需的对象"," enumeration specifying the baseline alignment for the ":"枚举指定基线对准"," if the collection contains the given item; otherwise, ":" 如果集合包含给定的项；否则, ","Returns something other than ":"返回以外的东西"," element.  \n  \n The default value is ":"元素。 \n  \n  默认值是"," property specifies which property has changed, the ":"属性指定哪些属性已更改，"," associated with this adorner decorator.":" 与此装饰器装饰器相关联。","The array that is the destination of the copy operation.":"阵列是复制操作的目的地。"," whenever a WPF framework-level implementation of this method has a non-visual parent connection.":"每当该方法的WPF框架级实现都具有非视觉父母连接时。"," property specifies the previous property value, and the ":"属性指定先前的属性值，并","The single child of an ":"一个孩子",".Baseline.":".基线。","Zero-based index in the target array at which the copying starts.":"复制启动的目标数组中的基于零的索引。","The direction that focus is to be moved, as a value of the enumeration.":"将重点移动的方向作为枚举的值。","The item to retrieve the index for.":"检索索引的项目。"," property specifies the new property value.":"属性指定新的属性值。"," if focus is moved successfully; ":"如果焦点成功移动；","Either returns ":"要么返回"," enumeration specifying the relative flow direction.  Getting this property returns the currently effective flow direction.  Setting this property causes the contents of the ":"枚举指定相对流动方向。 获得此属性返回当前有效的流动方向。 设置此属性会导致内容","The dependency object for which to set the value of the ":"设置该值的依赖关系对象","If the item appears in the collection, then the zero-based index in the collection where the given item is found; otherwise, ":"如果该项目出现在集合中，则在找到给定项目的集合中基于零的索引； 否则，"," (one for the ":"（一个"," element to re-flow in the indicated direction.  \n  \n The default value is ":"要在指示方向重新流动的元素。 \n  \n  默认值是"," if the target element in direction as specified does not exist.":"如果不存在指定方向的目标元素。","The end of the content in the ":"内容的末尾","The index to insert the item at.":"插入项目的索引。","Event data for the event.":"事件的事件数据。"," and one for the ":"一个"," object representing the next ":"代表下一个的对象","The event data that describes the property that changed, including the old and new values.":"描述更改的属性的事件数据，包括旧值和新值。","The item reference to add to the collection.":"添加到集合的项目参考。","The start of the content in the ":"内容开始"," element that is a peer to this element, or null if there is no next ":"元素是该元素的元素，或者如果没有下一个元素",") or the property returns ":"）或属性返回 "," element.  \n  \n This property has no default value.":"元素。 \n  \n  该属性没有默认值。","The index at which to remove an item.":"删除项目的索引。","The old style.":"旧风格。","The position just after the end of the ":"刚刚结束后的位置"," has no child.":"没有孩子。"," element that is a peer to this element, or null if there is no previous ":"元素是该元素的元素，或者如果没有以前的元素","An IEnumerator object.":"一个IEnumerator对象。","The new style.":"新风格。","The position just before the start of the ":"就在开始之前的位置","The adorner to add.":"装饰器要添加。","The direction for which a prospective focus change should be determined.":"应确定前瞻性重点变化的方向。"," object that contains the ":"包含的对象","The view created.":"创建的视图。","The preferred font family or a primary preferred font family with one or more fallback font families. The default is the font determined by the ":"首选字体家庭或一个或多个后备字体家庭的主要优先字体家庭。 默认值是由","The next element that focus would move to if focus were actually traversed. May return ":"如果焦点实际遍历了焦点的下一个元素。 可以返回"," for the specified point.":"对于指定点。","The number of items stored in this collection.":"该集合中存储的项目数。"," elements that are siblings to this element.  \n  \n This property has no default value.":"是该元素的兄弟姐妹的元素。 \n  \n  该属性没有默认值。","The zero-based offset of the item to retrieve or replace.":"要检索或替换的项目的从零开始的偏移量。","The desired font size to use in device independent pixels, greater than 0.001 and less than or equal to 35791. The default depends on current system settings and depends on the ":"在设备独立像素中使用的所需字体大小，大于0.001，小于或等于35791。默认值取决于当前系统设置，并取决于","The visual element for which to find an adorner layer.":"找到装饰层的视觉元素。"," collection that contains text decorations to apply to this element.  \n  \n The default value is null (no text decorations applied).":"包含文本装饰的收藏品适用于此元素。 \n  \n  默认值为null（没有应用文本装饰）。","The item at the specified zero-based offset.":"该项目处于基于零的偏移量。"," if focus cannot be moved relative to this element for the provided direction.":"如果不能相对于此元素移动焦点，则在提供的方向上。","The desired font-stretching characteristics to use. The default is ":"所需的字体拉伸特性要使用。 默认值为","Text set as the ":"文本设置为","An adorner layer for the specified visual, or null if no adorner layer can be found.":"如果找不到装饰层，则用于指定的视觉层或空的装饰层。","Name to use for the specified name-object mapping.":"用于指定名称-对象映射的名称。","true if access to the ":"如果访问","The desired font style. The default is determined by the ":"所需的字体样式。 默认值由"," property for the implicit ":"隐式的属性","Object for the mapping.":"映射的对象。"," is synchronized (thread safe); otherwise, false.":"已同步（线程安全）； 否则，错误。"," to retrieve an array of adorners for.":"取回装饰物的数组。","The desired font weight. The default value is determined by the ":"所需的字体重量。 默认值由","Identifies the bound property.":"标识约束属性。","An array of adorners that decorate the specified ":"装饰指定的装饰物数组"," set as the ":"设置为","The target object of the binding that raised the event.":"提出事件的绑定的目标对象。","A collection of text effects to apply to the content in this element. The default is ":"文本效果的集合适用于此元素中的内容。 默认值为","The source property name or the path to the property used for the binding.":"源属性名称或用于绑定的属性的路径。"," element within this instance of ":"在此实例中的元素",", or null if there are no adorners bound to the specified element.":"或null如果没有装饰物绑定到指定元素。"," if the item passes the filter; otherwise, ":"如果物品通过过滤器； 否则，","Records the conditions of the binding. This return value can be useful for error checking.":"记录绑定的条件。 此返回值可用于错误检查。","The initial content. This parameter can be ":"初始内容。 此参数可以是"," (not an empty collection).":" （不是空集合）。","Unused.":"没用过。","The object that the filter should test. The default is ":"过滤器应测试的对象。 默认值为 ","The currently effective typography variations. For a list of default typography values, see ":"当前有效的版式变化。 有关默认字体值列表，请参见","This method always returns a ":"此方法总是返回","The insertion position at which to insert the ":"插入的插入位置","Represents a data binding.":"表示数据绑定。"," interface, and that specifies a range of items to add to the collection.":"接口，并指定了一系列要添加到集合中的项目。","The parent group.":"父组。","The beginning of a selection of content that the new ":"新内容选择的开始","The property to which the resource is bound.":"资源约束的属性。"," of (0,0).":"（0,0）。","An enumerator for the contents of the collection.":"集合内容的枚举者。"," will contain.":"将包含。"," is available; otherwise, ":"可用； 否则，","The level of ":"水平"," associated with the adorners to update.":"与装饰物更新相关联。","An item in the collection after which the new item will be inserted.":"集合中的一个项目将插入新项目。","The end of a selection of content that the new ":"新内容的选择结束","The found resource. If no resource was found, ":"找到的资源。 如果找不到资源，"," chosen based on the parent group and its level.":"根据父组及其级别选择。"," that is identical to the ":"这与"," objects in this instance of ":"在这种情况下的对象","An item in the collection before which the new item will be inserted.":"收藏集中的一个项目将插入新项目。","The array of values that the source bindings in the ":"源绑定的值数组","Name of the name-object pair to remove from the current scope.":"要从当前作用域中删除的名称-对象对的名称。","An item to be removed fro the collection.":"要从集合中删除的项目。"," property of the markup element that corresponds to this ":" 与此对应的标记元素的属性 "," object specifying the initial contents of the new element.  This parameter may be ":"对象指定新元素的初始内容。 此参数可能是","The number of items currently in the collection.":"当前集合中的项目数。"," produces. The value ":"生产。 价值"," that is used for the element.":"该元素用于元素。",", in which case no ":"，在这种情况下否","The link target that is added.":"添加的链接目标。"," is free to merge adjacent custom text elements that have identical property values; otherwise, ":"可以自由合并具有相同属性值的相邻自定义文本元素； 否则，","The context menu that this element uses.":"此元素使用的上下文菜单。"," indicates that the source binding has no value to provide for conversion.":" 指示源绑定没有提供用于转换的值。","The zero-based index in the collection of the ":"集合中的基于零的索引"," if formatting should apply to the individual characters; ":"如果格式应适用于各个字符；"," specifying an insertion position at which to insert the element after it is created, or ":"指定插入位置在创建元素之后或","The cursor to display. The default value is defined as ":"光标来显示。 默认值定义为 ","A converted value.  \n  \n If the method returns ":"个转换后的值。  \n  \n 如果方法返回 "," if the formatting should apply to the entire element.":"如果格式应适用于整个元素。","The link to test for.":"测试的链接。"," for no automatic insertion.":" 为无自动插入。"," per this dependency property. However, the practical default at run time will come from a variety of factors.":"根据此依赖性属性。 但是，运行时间的实际违约将来自各种因素。",", the valid ":"，有效"," that specifies a position to compare to the current position.":"这指定了与当前位置进行比较的位置。"," elements that comprise the contents of the element.  \n  \n This property has no default value.":"包含元素内容的元素。 \n  \n  该属性没有默认值。"," is present; otherwise, ":"存在; 否则，"," value is used.  \n  \n A return value of ":"使用值。 \n  \n  返回值的","The zero-based index of the array position where the first item is copied.":"复制第一项的数组位置的零基索引。","The object to use as data context.":"用作数据上下文的对象。","-1 if the current ":"-1如果当前 ","The point where the link target is inserted.":"插入链接目标的点。"," indicates that the converter did not produce a value, and that the binding will use the ":"表示转换器没有产生值，并且绑定将使用","The brush used to apply to the element's border. The default value is a ":"用于应用于元素边框的画笔。 默认值为 ","The style key. To work correctly as part of theme style lookup, this value is expected to be the ":"样式键。 要作为主题样式查找的一部分，正确工作，预计该值将是"," precedes ":"前面"," brush.":"刷子。","The target to insert.":"插入的目标。"," of the element being styled. ":"元素的样式。"," if it is available, or else will use the default value.  \n  \n A return value of ":"如果可用，否则将使用默认值。 \n  \n  返回值的","; 0 if the locations are the same; +1 if the current ":"; 0如果位置相同； +1如果电流","The link target to remove.":"链接目标要删除。"," is an accepted value for a certain case.":"是特定情况的公认价值。"," structure specifying the amount of border to apply, in device independent pixels.  \n  \n The default value is a uniform thickness of zero (0.0).":"结构指定在设备独立像素中应用边框的数量。 \n  \n  默认值是均匀厚度为零（0.0）。"," indicates that the binding does not transfer the value or use the ":"表示绑定不会传递值或使用","A double value specifying the height of line in device independent pixels.  ":"一个双值，指定独立像素的设备独立像素中的线高。","The desired style to apply on focus. The default value as declared in the dependency property is an empty static ":"所需的样式适用于焦点。 依赖项属性中声明的默认值是一个空的静态","The index of the target being written or read.":"目标索引正在编写或阅读。","The number of characters to delete, starting at the current position. Specify a positive value to delete characters that follow the current position; specify a negative value to delete characters that precede the current position.":"从当前位置开始删除的字符数。 指定一个正值以删除遵循当前位置的字符； 为删除当前位置之前的字符指定负值。"," must be equal to or greater than ":"必须等于或大于",". However, the effective value at run time is often (but not always) a style as supplied by theme support for controls.":"。 但是，运行时间的有效价值通常是（但并非总是）一种由主题支持提供的风格。","The number of characters actually deleted.":"字符的数量实际删除。"," or the default value.":" 或默认值。","A double value specifying the desired distance between list content and the near edge of list markers, in device independent pixels.  \n  \n A value of ":"一个双值，以独立像素为单位的列表内容与列表标记的近边缘之间的所需距离。 \n  \n  一个值",".  \n  \n A value of ":"。 \n  \n  一个值","The value that the binding target produces.":"结合目标产生的值。"," values that specifies the logical direction in which to search for an adjacent element.":"指定搜索相邻元素的逻辑方向的值。","\") causes the marker offset to be determined automatically.  \n  \n The default value is ":"”）导致标记偏移自动确定。 \n  \n  默认值是"," to force cursor presentation while over this element to use this instance's setting for the cursor (including on all child elements); otherwise ":"在此元素上使用光标呈现，以将其用于光标的设置（包括所有子元素）； 否则","\") causes the line height is determined automatically from the current font characteristics.  \n  \n The default value is ":"”）导致线高由当前字体特性自动确定。 \n  \n  默认值是"," enumeration specifying the marker style to use.  \n  \n The default value is ":"枚举指定要使用的标记样式。 \n  \n  默认值是","The input scope, which modifies how input from alternative input methods is interpreted. The default value is ":"输入范围，该范围修改了如何解释来自替代输入方法的输入。 默认值是","The adjacent element in the specified ":"指定的相邻元素","The array of types to convert to. The array length indicates the number and types of values that are suggested for the method to return.":"要转换的类型数组。 阵列长度指示返回方法建议的值的数量和类型。","The mechanism by which a line box is determined for each line of text within the text element. The default value is ":"为文本元素中每行文本确定线框的机制。 默认值是","The starting index for labeling items in an ordered list.  \n  \n The default value is 1.":"在订购列表中标记项目的起始索引。 \n  \n  默认值为1。"," (which results in a default handling of commands).":"（这导致默认处理命令）。"," if no adjacent element exists.":"如果没有相邻元素。","An array of values that have been converted from the target value back to the source values.":"已将目标值转换回源值的值数组。"," structure specifying the amount of margin to apply, in device independent pixels.  \n  \n The default value is a uniform thickness of zero (0.0).":"结构指定在设备独立像素中应用的边距的数量。 \n  \n  默认值是均匀厚度为零（0.0）。","A serialization service manager object for the object.":"对象的序列化服务管理器对象。"," values that specifies the logical direction in which to find a content bounding box.":"指定找到内容边界框的逻辑方向的值。"," if the element is initialized per the aforementioned loading or method calls; otherwise, ":"如果元素是根据上述加载或方法调用初始化的； 否则，"," structure specifying the amount of padding to apply, in device independent pixels.  \n  \n The default value is a uniform thickness of zero (0.0).":"结构指定在设备独立像素中涂抹的填充量。 \n  \n  默认值是均匀厚度为零（0.0）。","The value produced by the binding source.":"结合源产生的值。","A bounding box for content that borders the current ":"与当前接壤的内容的边界框"," if the current element is attached to an element tree and has been rendered; ":"如果当前元素连接到元素树并已渲染；","A block collection that contains the ":"一个包含的块集"," enumerations specifying the desired alignment.  \n  \n The default value is ":"指定所需对齐的枚举。 \n  \n  默认值是","A converted value. If the method returns ":"转换值。 如果方法返回"," in the specified direction, or ":"在指定的方向或"," if the element has never been attached to a loaded element tree.":"如果该元素从未连接到已加载的元素树上。"," elements of the ":"元素","The brush used to apply to the element's border. The default is ":"用于应用于元素边框的画笔。 默认值为 ",", the valid null value is used.":"，使用有效的空值。"," if current, valid layout information is unavailable.":"如果当前，则不可用的有效布局信息。"," structure that specifies the amount of border to apply, in device independent pixels. The default is a uniform thickness of zero (0.0).":"指定在设备独立像素中施加边框的结构。 默认值为均匀的厚度为零（0.0）。","The culture information for this element. The default value is an ":"此元素的区域性信息。 默认值为 "," structure specifying the amount of border to apply, in device independent pixels. The default is a uniform thickness of zero (0.0).":"结构指定在设备独立像素中应用边框的数量。 默认值为均匀的厚度为零（0.0）。","The value that is produced by the binding target.":"结合目标产生的值。"," values that specifies the logical direction in which to search for the closest insertion position.":"指定搜索最接近插入位置的逻辑方向的值。"," instance with its ":"实例与之"," to automatically insert a column-break before this element; otherwise, ":"在此元素之前自动插入列破坏； 否则，"," values that specifies the relative flow direction.  The default is ":" 指定相对流向的值。  默认值为 ","The underlying collection, which must implement ":"必须实施的基础集合"," to the closest insertion position in the specified direction.":"到指定方向上最接近的插入位置。"," to automatically insert a page-break before this element; otherwise, ":"在此元素之前自动插入页面破解； 否则，"," value set to the string \"en-US\".":"值设置为字符串“ en-us”。","The height of each line in device independent pixels with a value range of 0.0034 to 160000.  A value of ":"设备独立像素中每条线的高度，值范围为0.0034到160000。  的值 ","The number of start-of-line markers to skip when determining the line for which to return the starting position. Negative values specify preceding lines, 0 specifies the current line, and positive values specify following lines.":"确定要返回起始位置的行时，要跳过的开始标记数。 负值指定前线，0指定当前线，正值为以下行指定。","Less than zero if ":"如果小于零","An enumerator for logical child elements of this element.":"该元素逻辑子元素的枚举者。"," values that specifies the direction in which to separate any ":"指定分开任何方向的值","\") causes the line height to be determined automatically from the current font characteristics.  The default is ":"”）导致从当前字体特性自动确定的线高。默认值为"," pointing to the beginning of the specified line (with the ":"指向指定行的开始（带有",", zero if ":"，如果为零"," if this element does not use theme style properties; all style-originating properties come from local application styles, and theme style properties do not apply. ":"如果此元素不使用主题样式属性； 所有样式启用属性均来自本地应用程序样式，主题样式属性不适用。"," values that specifies the mechanism by which a line box is determined for each line of text within the ":"指定确定线框的机制的值"," elements from other content contained in the ":"来自其他内容中包含的元素","The list that contains the ":"包含的列表"," are equal, or greater than zero if ":"相等，或大于零"," if the specified line is out of range or otherwise cannot be located.":"如果指定的线超出范围或无法找到。"," if application styles apply first, and then theme styles apply for properties that were not specifically set in application styles.":"如果应用程序样式首先应用，则主题样式申请了未在应用程序样式中专门设置的属性。",", which indicates that floaters should be rendered in place.":"，这表明应将浮子渲染到位。"," if there is no next ":"如果没有下一步","The object to check for in the collection.":"在集合中检查的对象。","The logical parent for this element.":"此元素的逻辑父。","When this method returns, contains the actual number of start-of-line markers that were skipped when determining the line for which to return the starting position.  This value may be less than ":"当此方法返回时，包含在确定返回起始位置的行时跳过的实际启动标记数。 该值可能小于"," values that specifies the relative flow direction. The default is ":"指定相对流动方向的值。 默认值为"," if there is no previous ":"如果没有以前"," if the beginning or end of content is encountered before the specified number of lines are skipped. This parameter is passed uninitialized.":"如果在跳过指定数量的行之前遇到内容的开始或结尾。 该参数通过非初始化。","The current locally-defined resources. This is a dictionary of resources, where resources within the dictionary are accessed by key.":"当前定义的当前资源。 这是一本资源词典，在其中键入词典中的资源是由键访问的。"," if automatic breaking and hyphenation of words is enabled; otherwise, ":"如果启用了单词的自动断裂和连字符； 否则，"," if the item does not exist in the collection.":"如果该项目在集合中不存在。","The height of each line in device independent pixels, in the range of 0.0034 to 160000, or ":"设备独立像素中每条线的高度，范围为0.0034至160000，或","), or to the beginning of the line closest to the specified line if the specified line is out of range.":"），如果指定行超出了范围，则直到最接近指定行的线的开头。"," to always reload the ":"总是重新加载","The applied, nondefault style for the element, if present. Otherwise, ":"如果存在，则适用于该元素的不默认样式。 否则，"," contains the item; otherwise, ":"包含该项目； 否则，"," to determine the height automatically. The default is ":"自动确定高度。 默认值为"," even if it has been previously loaded and cached; ":"即使以前已加载和缓存；",". The default for a default-constructed ":"。 默认结构的默认值","The item to return an index for.":"返回索引的项目。"," values that specifies the logical direction in which to search for the next symbol.":" 指定搜索下一个符号的逻辑方向的值。","The intended value. This property has no default value.":"预期值。 该属性没有默认值。"," values that specifies how a line box is determined for each line of text within the block-level flow content element. The default value is ":"指定如何确定块级流量内容元素中每条文本的每行文本框的值。 默认值是"," to the next symbol in the requested direction, or ":"在请求方向上的下一个符号，或"," to load the ":" 要加载 ","The index of the specified item in the ":"指定项目的索引","The element whose ":"谁的元素"," structure that specifies the amount of margin to apply, in device independent pixels. The default is a uniform thickness of zero (0.0).":"指定在设备独立像素中应用边距的结构。 默认值为均匀的厚度为零（0.0）。"," only if there is no cached version.":"只有没有缓存版本。"," borders the start or end of content.":"接壤内容的开始或结束。","The index at which the item is located.":"项目所在的索引。"," caused this element to be created. This value is frequently ":"导致创建此元素。 这个值经常","The sibling ":"兄弟姐妹"," element that directly follows the current ":"直接跟随当前的元素","The root element of the visual tree for this page.":"此页面的视觉树的根元素。"," values that specifies the logical direction in which to search for the next insertion position.":"指定搜索下一个插入位置的逻辑方向的值。","A value that is less than zero means ":"一个小于零的值"," element, or ":"元素，或","The serialization services provider.":"序列化服务提供商。","The tooltip object.":"工具提示对象。"," that identifies the next insertion position in the requested direction, or ":"确定在请求的方向上的下一个插入位置，或"," a value of zero means the objects are equal; and a value that is over zero means ":"零值表示对象相等； 和一个超过零的值","Child element to be added.":"要添加的子元素。"," if no such element exists.":"如果没有这样的元素。"," and it does not have an XmlWriter; otherwise, ":"而且它没有XMLWriter； 否则，"," if no next insertion position can be found.":"如果找不到下一个插入位置。"," object that is the active comparer.":"是主动比较的对象。",", or null when the ":"，或null"," if visuals were added to the tree; returns ":"如果将视觉效果添加到树上； 返回"," structure that specifies the amount of padding to apply, in device independent pixels. The default is a uniform thickness of zero (0.0).":"指定在设备独立像素中使用的填充量的结构。 默认值为均匀的厚度为零（0.0）。","The active ":"活动"," is set by the ":"由"," that specifies a position to find the distance (in symbols) to.":" 它指定了一个位置来查找到的距离（以符号为单位）。","Specified size of the element that should also be brought into view.":"指定的元素大小也应将其视为。"," element that directly precedes the current ":"直接先于电流之前的元素","The relative number of symbols between the current ":"当前符号的相对数量"," elements that identify the hyperlink-addressable locations on the page.":"识别页面上超链接 - 可调地点的元素。"," callback.":"打回来。","The name of the requested element.":"请求元素的名称。"," elements that are directly hosted by the parent of the current ":"当前父母直接托管的元素","The requested element. This can be ":"请求的元素。 这可以",".  A negative value indicates that the current ":"。 负值表示当前"," element has no parent.":"元素没有父母。"," if the collection view supports grouping; otherwise, ":"如果收集视图支持分组； 否则，"," of the corresponding ":"相应的","The key identifier for the requested resource.":"请求资源的关键标识符。","The sort criteria as an implementation of ":"排序标准作为实施"," element in the ":"元素中的元素"," follows the position specified by ":"遵循由","The requested resource. If no resource with the provided key was found, an exception is thrown. An ":"请求的资源。 如果没有找到提供的键的资源，则会抛出一个例外。 一个","The new page to add to the collection.":"新页面要添加到集合中。",", 0 indicates that the positions are equal, and a positive value indicates that the current ":"，0表示位置相等，正值表示电流"," object specifying the initial contents of the new ":"对象指定新的初始内容","A delegate that represents the method that is used to determine whether an item is suitable for inclusion in the view.":"代表用于确定项目是否适合包含在视图中的方法的委托。"," value might also be returned in the exception case.":"在例外情况下也可以返回值。"," to get the binding from.":"从中获取绑定。","The zero-based index within the collection where the page was added.":"添加页面的集合中的基于零的索引。"," as a function of the parent group and its level. The default value is ":"作为父组及其级别的函数。 默认值是"," hosted by the ":"由"," if the target property has an active binding; otherwise, returns ":"如果目标属性具有主动绑定； 否则，返回"," precedes the position specified by ":"在指定的位置之前",".  This parameter may be ":"。 此参数可能是","The zero-based index of the page to get.":"该页面的基于零的索引。"," on which filtering and sorting have been applied.":"已经应用了过滤和排序。","The requested flow direction, as a value of the enumeration.":"请求的流动方向，作为枚举的值。"," values that specifies the logical direction in which to determine the category for adjacent content.":"指定确定相邻内容类别的逻辑方向的值。","The page content element at the specified index within the collection.":"集合中指定索引的页面内容元素。"," specifying an insertion position at which to insert the ":"指定插入位置插入"," if there are groups in the view; otherwise, ":"如果视图中有小组； 否则，"," values that indicates the category for adjacent content in the specified logical direction.":"在指定的逻辑方向上指示相邻内容类别的值。","The size of the part of the element that does visual presentation.":"进行视觉呈现的元素部分的大小。"," element after it is created, or ":"创建元素或"," if a private copy of the data is needed for sorting and filtering; otherwise, ":"如果需要分类和过滤的数据的私人副本； 否则，"," to prevent the text of the paragraph from being broken; otherwise, ":"防止段落的文字被打破； 否则，","An offset, in symbols, for which to calculate and return the position.  If the offset is negative, the position is calculated in the logical direction opposite of that indicated by the ":"符号中的偏移，以计算和返回位置。 如果偏移量为负","Name of the child to find.":"找到孩子的名字。"," indicating the beginning of a selection of content to be contained by the new ":"表示新的内容的开始"," to prevent a break from occurring between this paragraph and the next paragraph; otherwise, ":"为了防止在本段和下一段之间发生中断； 否则，"," to the position indicated by the specified offset, or ":"到指定偏移指示的位置，或",". The default implementation returns ":". 默认实现返回 "," indicating the end of a selection of content to be contained by the new ":"表示新的内容的终结"," if no element of the requested name exists.":"如果不存在请求名称的元素。","An integer specifying the minimum number of lines that can be left before the break when a ":"一个整数，指定在休息前可以留下的最小线数时"," if no corresponding position can be found.":"如果找不到相应的位置。"," to force a new load of the ":"迫使新的负载"," if there is an ":"如果有一个"," is broken by a page break or column break. A value of 0 indicates no minimum.  \n  \n The default value is 0.":"通过页面断开或列断开。 值为0表示最小值。 \n  \n  默认值为0。","The available size that the parent element can give to the child elements.":"父元素可以给子元素的可用大小。"," objects. ":"对象。","An offset, in symbols, for which to calculate and return the position.  If the offset is negative, the returned ":"符号中的偏移，以计算和返回位置。 如果偏移为负，则返回"," document, even if it was previously loaded.":"文档，即使先前已加载。","An integer specifying the minimum number of lines that can be placed after the break when a ":"一个整数，指定断裂后可以放置的最小线数"," if the target element in direction as specified does not exist or could not be keyboard focused.":"如果指定的方向上的目标元素不存在或不能集中键盘。","The document that was loaded.":"加载的文档。"," precedes the current ":"在电流之前"," currently supports only objects of type ":" 目前只支持类型的对象 "," is broken by a page break or column break.  A value of 0 indicates no minimum.  \n  \n The default value is 0.":"通过页面断开或列断开。 值为0表示最小值。 \n  \n  默认值为0。","Details of the old and new size involved in the change.":"更改涉及的旧大小的细节。"," collection that contains text decorations to apply to this element. A value of ":"包含文本装饰的收藏品适用于此元素。 一个值"," and not ":"并不是","; otherwise, it follows.":"; 否则，它会遵循。","The document that is attached.":"附件的文档。","The child element reporting the change.":"报告更改的子元素。",". Adding a ":"。 添加一个"," means no text decorations will be applied. The default value is ":"意味着不会应用文本装饰。 默认值是"," representing the document reference.":"表示文档参考。"," values that specifies the logical direction of the returned ":"指定返回的逻辑方向的值","Identifies the destination property where the binding should be established.":"标识应建立绑定的目标属性。"," child to a ":"孩子到一个","The element to add to the end of the collection.":"要添加到集合的末尾的元素。","Identifies the property where the binding should be established.":"确定应建立绑定的属性。"," if the offset extends past the end of the content.":"如果偏移延伸超过内容的末尾。","A double value specifying the amount to indent the first line of the paragraph, in device independent pixels. The default value is 0.":"在设备独立像素中，指定段落第一行的数量的双重值。 默认值为0。"," object implicitly adds the child to the ":"对象隐含地将孩子添加到","Represents the specifics of the data binding.":"表示数据绑定的细节。","The destination array to which the elements from the collection should be copied.":"应复制收集元素的目的地阵列。","A string specifying the initial contents of the ":"一个指定初始内容的字符串"," values that specifies the logical direction in which to find and return any adjacent text.":"指定查找和返回任何相邻文本的逻辑方向的值。"," collection for the ":"收集","The zero-based starting index within the array where the collection elements are to be copied.":"基于零的启动索引，其中要复制集合元素。"," specifying an insertion position at which to insert the text run after it is created, or ":"指定插入位置，在该位置插入文本创建后运行或","The element that specifies a flow direction.":"指定流动方向的元素。","A string containing any adjacent text in the specified logical direction, or ":"在指定逻辑方向上包含任何相邻文本的字符串，或","A value of the enumeration, specifying the direction.":"枚举的值，指定方向。","An enumerator that you can use to iterate through the collection.":"您可以使用该集合来迭代的枚举者。","A string that specifies the unformatted text contents of this text ":"一个指定此文本的未格式文本内容的字符串"," that indicates the converter to use. The default value is ":"这表明要使用的转换器。 默认值是"," if no adjacent text can be found.":"如果找不到相邻文本。","  \n  \n This property has no default value.":"该属性没有默认值。","The number of items that the collection contains.":"该集合包含的项目数。","The key identifier of the resource to be found.":"要找到的资源的关键标识符。","A parameter to pass to a converter. The default value is ":"传递转换器的参数。 默认值是"," values that specifies the logical direction in which to find and copy any adjacent text.":"指定查找和复制任何相邻文本的逻辑方向的值。"," if no resource with the provided ":"如果没有提供的资源"," to indicate that a trailing paragraph break should be included; otherwise, ":" 指示应包括尾随段落中断；否则, ","A buffer into which any text is copied.":"复制任何文本的缓冲区。",", which returns the default binding mode value of the target dependency property. However, the default value varies for each dependency property. In general, user-editable control properties, such as ":"，它返回目标依赖项属性的默认绑定模式值。 但是，每个依赖项属性的默认值都会变化。 通常，用户编辑的控制属性，例如","The zero-based index of the element in the collection to get.":"集合中元素的从零开始的索引来获取。"," is found.":"被发现。",", default to two-way bindings, whereas most other properties default to one-way bindings.  \n  \n A programmatic way to determine whether a dependency property binds one-way or two-way by default is to get the property metadata of the property using ":"，默认为双向绑定，而大多数其他属性默认为单向绑定。 \n  \n  默认情况下，确定依赖性属性是单向还是双向绑定的一种程序化方法是使用该属性的属性元数据","An index into ":"索引","The collection element that is at the specified ":"指定的收集元素"," to which the returned object writes.":"返回的对象写入。","The element's height, as a value in device-independent units (1/96th inch per unit). The default value is 0 (zero).":"该元件的高度为独立单位的值（每单位1/96英寸）。 默认值为0（零）。","The block to add.":"要添加的块。"," at which to begin writing copied text.":"在其中开始编写复制的文本。"," representing the proprietary format's default file extension.":"表示专有格式的默认文件扩展名。"," event will be raised when the binding source value is updated; otherwise, ":"更新绑定源值时，将提高事件； 否则，","The element's width, as a value in device-independent units (1/96th inch per unit). The default value is 0 (zero).":"该元件的宽度是独立于设备的单元（单位1/96英寸）中的值。 默认值为0（零）。"," that is added.":"添加了。","The maximum number of characters to copy.":"要复制的最大字符数。"," representing the public name of the serializing component.":"代表序列化组件的公共名称。"," event will be raised when the binding target value is updated; otherwise, ":"更新绑定目标值时，将提高事件； 否则，"," marking list item.":"标记列表项目。","The context menu assigned to this element.":"分配给此元素的上下文菜单。","The number of characters actually copied into ":"实际上复制到的字符数量"," representing the manufacturer's name.":"代表制造商的名称。","The list item to add.":"要添加的列表项。"," attached event will be raised on the bound element when there is a validation error during source updates; otherwise, ":"当源更新期间出现验证错误时，将在界元素上提出附件事件； 否则，"," of the control being styled.":"控制风格。"," values that specifies the logical direction in which to count the number of characters.":"指定计算字符数的逻辑方向的值。"," objects for this instance of ":"此实例的对象"," representing the manufacturer's website.":"代表制造商的网站。","The block element to add.":"要添加的块元素。","The direction that text and other UI elements flow within their parent element, as a value of the enumeration. The default value is ":"文本和其他UI元素在其父元素内流动的方向，作为枚举的值。 默认值是"," objects. Even though the return type is a collection of ":"对象。 即使返回类型是","The number of Unicode characters between the current ":"当前的Unicode字符数","System.Collections.IEnumerator":"System.Collections.Ienumerator","The source of data for the new ":"新的数据来源 "," if cursor presentation while over this element is forced to use current ":"如果光标演示在此元素上被迫使用当前"," objects the returned collection would only contain ":"返回集合只包含的对象"," with its properties initialized with values from the given ":"其属性初始化为来自给定的值"," and the next non-text symbol.  This number may be 0 if there is no adjacent text.":"和下一个非文本符号。 如果没有相邻文本，则此数字可能为0。"," representing the name of this fragment.":"代表这个片段的名称。"," settings for the cursor (including on all child elements); otherwise ":"光标的设置（包括所有子元素）； 否则"," objects because the ":"因为"," representing the type of fragment.":"代表片段的类型。"," positioned immediately after the ":"立即放置在","The object to be compared with this ":"将对象与此比较","The height of the element, in device-independent units (1/96th inch per unit). The default value is ":"元件的高度，独立于设备的单位（每单位1/96英寸）。 默认值是"," representing the name of the story.":"代表故事的名字。"," class currently only supports ":"当前课程仅支持"," if both are equal; otherwise, ":"如果两者都相等； 否则，"," element inserted by this method.":"该方法插入元素。",". This value must be equal to or greater than 0.0.":"。 该值必须等于或大于0.0。","The unique hash code value of the serializer.":"序列化器的唯一哈希代码值。"," to the beginning (":"到开始（","This API is not implemented.":"该API未实现。"," if at least one of the inner ":" 如果至少一个内 ","A horizontal alignment setting, as a value of the enumeration. The default is ":"水平对齐设置，作为枚举的值。 默认值为"," objects or the ":"对象或",") of the new paragraph.":"）新段落。","The number of columns that the cell spans. The default is 1.":"细胞跨度的列数。 默认值为1。","The name of the assembly (usually a DLL) that contains the plug-in serializer.":"包含插件序列化器的组件名称（通常是DLL）。"," if the element is initialized per the aforementioned XAML processing or method calls; otherwise, ":"如果元素是根据上述XAML处理或方法调用初始化的； 否则，"," itself has a failing validation rule; otherwise, ":"本身具有失败的验证规则； 否则，","The path to the assembly file that contains the plug-in serializer.":"包含插件序列机的汇编文件的路径。","The text to insert.":"要插入的文字。","The number of rows that the cell spans. The default is 1.":"单元格跨越的行数。 默认值为1。"," if the current element is attached to an element tree; ":"如果当前元素连接到元素树；","The version of the assembly that contains the plug-in serializer.":"包含插件序列化器的组件版本。"," object that caused this instance of ":"引起该实例的对象","The row to add.":"要添加的行。"," indicates a position that is in the same text container as the current position; otherwise, ":"指示与当前位置在同一文本容器中的位置； 否则，","The language information for this element. The default value is an ":"此元素的语言信息。 默认值是","The default extension associated with files that the serializer outputs.":"默认扩展名与序列化器输出的文件关联。","The cell to add.":"要添加的单元格。","The list of parameters to pass to the constructor. The default value is ":"传递给构造函数的参数列表。 默认值是","The string that represents the object.":"表示对象的字符串。"," with its ":"与它的","The public display name of the serializer.":"序列化器的公共显示名称。","The group of rows to add.":"要添加的一组行。"," to perform object creation in a worker thread; otherwise, ":"在工作线程中执行对象创建； 否则，","The transform this element should use. The default is ":"该元素应使用的转换。 默认值为"," at the end of content in the text container associated with the current position.":" 在与当前位置相关联的文本容器中的内容的末尾。"," derived class that implements the serializer.":"实现序列化器的派生类。","Provides margin values for the element. The default value is a ":"提供元素的保证金值。 默认值是","The requested command.  The default key gesture for this command is ":"请求的命令。 此命令的默认密钥手势是"," at the beginning of content in the text container associated with the current position.":"在与当前位置关联的文本容器中的内容开始时。","The name of the method to call. The default value is ":"呼叫方法的名称。 默认值是"," if the serializer assembly can be loaded; otherwise, ":"如果可以加载串行器组件； 否则，","+":"+"," if the layout is current and valid; otherwise, ":"如果布局是当前且有效的； 否则，","The list of parameters to pass to the method. The default is an empty list.":"传递到该方法的参数列表。 默认值是一个空列表。"," with all properties equal to 0 (zero).":"所有属性等于0（零）。","The name of the company that developed the plug-in serializer.":"开发插件序列机的公司名称。","The requested command.  This command has no default key gesture.":"请求的命令。 此命令没有默认的键手势。"," if the current position is an insertion position; otherwise, ":"如果当前位置是插入位置； 否则，","The instance of the object constructed from ":"从","The maximum height of the element, in device-independent units (1/96th inch per unit). The default value is ":"元件的最大高度，独立于设备的单位（每单位1/96英寸）。 默认值是","The web address of the company that developed the serializer.":"开发序列机的公司的网址。",". This value can be any value equal to or greater than 0.0. ":"。 该值可以是等于或大于0.0的任何值。",", or the ":"， 或者"," if the current position is at the beginning of a line; otherwise, ":"如果当前位置在线的开头； 否则，"," if this figure can delay placement; otherwise, ":"如果这个数字可以延迟放置； 否则，","The version of the .NET Framework required by the plug-in serializer.":"插件序列机所需的.NET框架的版本。"," of which the ":"其中"," value that is associated with the current position.":"与当前位置相关的值。"," structure specifying the height characteristics for the ":"结构指定高度特性"," is also valid.":"也有效。"," that contains serialization information for the ":"其中包含序列化信息"," = 1.0 and ":"= 1.0和"," for the plug-in.":"用于插件。"," that scopes the current position, or ":"示意当前位置，或"," is used as the ":" 被用作 ","The maximum width of the element, in device-independent units (1/96th inch per unit). The default value is ":"该元件的最大宽度，独立于设备的单位（单位1/96英寸）。 默认值是"," = ":"="," if no such paragraph exists.":"如果没有这样的段落。"," to overwrite an existing registration for the same plug-in; otherwise, ":"覆盖相同插件的现有注册； 否则，"," enumeration specifying a horizontal anchor location for the ":"枚举指定水平锚点的位置","The minimum height of the element, in device-independent units (1/96th inch per unit). The default value is 0.0. This value can be any value equal to or greater than 0.0. However, ":"元件的最小高度，独立于设备的单位（单位1/96英寸）。 默认值为0.0。 该值可以是等于或大于0.0的任何值。 然而，"," is uninitialized or explicitly set to null. If ":"是非初始化或明确设置为空的。 如果","The logical parent that scopes the current position.":"示意当前位置的逻辑父。","The distance that a ":"距离"," objects already registered.":"对象已经注册。"," is NOT valid, nor is ":"无效，也不有效"," is assigned, ":"被安排了，","A fixed anchor position that marks one end of the selection used to form the new ":"固定锚位置，标记用于形成新的选择的一端","The minimum width of the element, in device-independent units (1/96th inch per unit). The default value is 0.0. This value can be any value equal to or greater than 0.0. However, ":"元素的最小宽度，独立于设备的单位（单位1/96英寸）。 默认值为0.0。 该值可以是等于或大于0.0的任何值。 然而，"," returns the type of the object or null if the object is null. The default value is ":"如果对象为null，则返回对象或null的类型。 默认值是","A movable position that marks the other end of the selection used to form the new ":"可移动位置，标记用于形成新的选择的另一端"," is offset from its baseline in the horizontal direction, in device independent pixels.  \n  \n The default value is 0.0.":"在设备独立像素中，在水平方向上的基线被抵消。 \n  \n  默认值为0.0。"," that writes collated ":"那是整理的"," object. The default is an empty collection.":"目的。 默认值是一个空的集合。"," enumeration specifying a vertical anchor location for the ":"枚举指定垂直锚点的位置"," is not valid, nor is ":"无效，也不有效"," elements to the document output serialization ":"文档输出序列化的元素","A formatting property to apply.":"申请的格式属性。",", if no ":"， 如果不","The name of the element. The default is an empty string.":"元素的名称。 默认值是一个空字符串。","The value for the formatting property.":"格式属性的值。"," if application styles apply first, and then theme styles apply for properties that were not specifically set in application styles. The default is ":"如果应用程序样式首先应用，则主题样式申请了未在应用程序样式中专门设置的属性。 默认值为","The default print preferences for ":"默认打印首选项"," is offset from its baseline in the vertical direction, in device independent pixels.  \n  \n The default value is 0.0.":"在垂直方向上，在设备独立像素中偏移其基线。 \n  \n  默认值为0.0。"," object is active. Although the return type is ":"对象处于活动状态。 虽然返回类型是","A data format to check for load-compatibility into the current selection.  See ":"数据格式以检查当前选择中的负载兼容性。 看","The document paginator that defines the content to write to the serialization ":"定义要写入序列化的内容的文档Paginator"," structure specifying the width characteristics for the ":"结构指定宽度特征","This element's logical parent.":"此元素的逻辑父。",", the returned object is only a ":"，返回的对象只是一个"," for a list of predefined data formats.":"对于预定义的数据格式列表。","The default print preferences for the ":"默认打印首选项"," enumeration specifying the allowable ways in which content can flow around a ":"枚举指定内容可以在围绕a中流动的允许方式","The current locally-defined dictionary of resources, where each resource can be accessed by key.":"当前的本地定义词典资源词典，可以通过密钥访问每个资源。"," object because the ":"对象，因为"," that exposes the ":"暴露了","The document to write to the serialization ":"写入序列化的文档"," if the current selection can be loaded with content in the specified data format; otherwise, ":"如果当前选择可以以指定的数据格式加载内容； 否则，","A strongly typed collection of ":"强烈键入的集合"," to Microsoft UI Automation.":"到Microsoft UI自动化。","A data format to check for save compatibility with the current selection.  See ":"数据格式以检查与当前选择的保存兼容性。 看"," if layout rounding is applied; otherwise, ":"如果应用布局舍入； 否则，"," class currently supports only ":"当前课程仅支持","The document sequence that defines the content to write to the serialization ":"定义要写入序列化的内容的文档序列"," objects. Although the return type is a collection of ":"对象。 虽然返回类型是","The page to write to the serialization ":"写入序列化的页面","An object of a class derived from ":"从","A vertical alignment setting. The default is ":"垂直对齐设置。 默认值为"," if the current selection can be saved as the specified data format; otherwise, ":"如果当前选择可以保存为指定的数据格式； 否则，"," element to write to the serialization ":"要写入序列化的元素"," objects, the returned collection only contains ":"对象，返回的集合仅包含"," that provides pagination services.":"提供分页服务。","A position to test for inclusion in the current selection.":"测试包含在当前选择中的位置。","The width of the element, in device-independent units (1/96th inch per unit). The default value is ":"元素的宽度，独立于设备的单位（每单位1/96英寸）。 默认值是","A caller-specified object to identify the asynchronous write operation.":"呼叫者指定的对象，以识别异步写操作。","The name of the property that specifies which group an item belongs to.":"指定一组物品所属的属性的名称。","An enumerator for accessing the document's ":"用于访问文档的枚举者",". This value must be equal to or greater than 0.0. See Remarks for upper bound information.":"。 该值必须等于或大于0.0。 有关上限信息，请参见备注。"," if the specified position is located within the current selection; otherwise, ":"如果指定位置位于当前选择中； 否则，","The name of the property that specifies which group an item belongs to. If this is ":"指定一组物品所属的属性的名称。 如果是","The visual element to write to the serialization ":"写入序列化的视觉元素","A formatting property to get the value of with respect to the current selection.":"格式化属性以获取有关当前选择的值。","A collection of the document's ":"文档的集合","The text string to produce.":"要产生的文本字符串。",", the item itself is passed to the value converter.":"，项目本身传递给值转换器。","An object specifying the value of the specified formatting property.":"指定指定格式属性值的对象。"," that is written to the stream.":"这是写入流的。","The type of instance to create.":"要创建的实例类型。"," object to apply to the property value or the item to produce the final value that is used to determine which group(s) an item belongs to. The converter may return a collection, which indicates the items can appear in more than one group.":"对象应用于属性值或项目，以生成用于确定项目所属哪个组的最终值。 转换器可以返回一个集合，这表明这些项目可以出现在多个组中。"," for this document.":"对于此文档。","A readable stream that contains data to load into the current selection.":"一个可读的流，其中包含用于加载到当前选择的数据。","An object specifying preferences for how the material should be printed.":"指定应如何打印材料的对象。"," that provides pagination services":"提供分页服务","The style identifier.":"样式标识符。","A data format to load the data as.  Currently supported data formats are ":"数据格式将数据加载为。 当前支持的数据格式是"," value that specifies the comparison between the value of an item and the name of a group.":"指定项目值与组名称之间的比较的值。","An enumerator for accessing the document sequence's ":"用于访问文档序列的枚举器","The exception that canceled the write operation.":"取消写操作的例外。","Identifier object for the routed event being handled.":"要处理路由事件的标识符对象。"," value that orders groups in ascending order of name.":"价值该订单按名称的上升顺序订购。","An empty, writable stream to save the current selection to.":"一个空的，可写的流以将当前选择保存到。"," for this sequence.":"对于此序列。"," if canceled; otherwise, ":"如果被取消； 否则，","Whether to invoke the handler in cases where the routed event has already been marked as handled in its arguments object. ":"是否在其参数对象中已将路由事件标记为处理的情况下是否调用处理程序。"," value that orders groups in descending order of name.":"价值该订单按名称的降序顺序订购。","A data format to save the current selection as.  Currently supported data formats are ":"数据格式以将当前选择保存为。 当前支持的数据格式是","A collection of the document sequence's ":"文档序列的集合"," if the write operation completed normally.":"如果写操作正常完成。"," to invoke the handler even when the routed event is marked handled; otherwise, ":"即使将路由事件标记为处理，请调用处理程序； 否则，"," values. For this signature to be relevant, this should be ":"值。 为了使此签名相关，这应该是","The user-supplied state object that was passed to the ":"传递给用户供用的状态对象",". Asking to handle already-handled routed events is not common.":"。 要求处理已经处理的路由事件并不常见。"," to preserve custom ":"保留习俗","The element from which to get the bottom offset.":"获得底部偏移的元素。"," of ancestor to look for.":"寻找的祖先。"," object to add as a child.":"小时候添加的对象。","Error that occurred during the write operation or ":"写操作期间发生的错误或","A fixed anchor position that marks one end of the updated selection.":"固定锚位置标记更新选择的一端。","The distance between the bottom of an element and the bottom of its parent canvas.":"元素底部和其父画布底部之间的距离。","The ordinal position of the desired ancestor among all ancestors of the given type.":"所需祖先在给定类型的所有祖先中的序数。","Identifier object for the routed event.":"路由事件的标识符对象。","An enumeration value that specifies scope of the ":"指定范围的枚举值","The element from which to get the left offset.":"获得左偏移的元素。","A movable position that marks the other end of the updated selection.":"可移动位置标记更新选择的另一端。","An object that can provide services for the markup extension. In this implementation, this parameter can be ":"可以为标记扩展提供服务的对象。 在此实现中，此参数可以是","The distance between the right side of an element and the right side of its parent canvas.":"元素的右侧和其父画布的右侧之间的距离。"," as a page, document, or sequence of documents.":"作为文档的页面，文档或顺序。","Description of the binding.":"绑定的描述。"," that points to the end of the current selection.":"这指向当前选择的末尾。","The ancestor level. Use 1 to indicate the one nearest to the binding target element.":"祖先级别。 使用1表示最接近结合目标元件的一个。","The element from which to get the property.":"获取属性的元素。","Based on the scope of defined by ":"基于由"," if the current selection is empty; otherwise, ":"如果当前选择为空； 否则，","The dependency property identifier of the property to set.":"要设置的属性的依赖关系属性标识符。","The type of ancestor. The default value is ":"祖先的类型。 默认值是"," that points to the beginning of the current selection.":"这指出了当前选择的开始。"," the first child factory.":"第一个儿童工厂。","The element from which to get the right offset.":"获得右偏移的元素。",", the number of pages or the number of documents associated with the ":"，页数或与","A static ":"一个静态 ","The element from which to get the top offset.":"获得最高偏移的元素。"," if this object is in an immutable state; otherwise, ":"如果此对象处于不变的状态； 否则，","A string containing the plain text contents of the current selection.":"包含当前选择的纯文本内容的字符串。","The default printer settings to use when the document is printed.":"打印文档时要使用的默认打印机设置。","A string that is the template identifier.":"字符串是模板标识符。","The index of the alternate annotation form. The default value is 0 (zero).":"替代注释表的索引。 默认值为0（零）。","The object with the exception.":"异常的对象。","The distance between the top of an element and the top of its parent canvas.":"元素顶部和其父画布顶部之间的距离。","An enumeration that indicates the scope of the ":"指示指示范围的枚举"," enumerated value. The default value is ":"枚举值。 默认值是"," that is the next sibling factory.":"那是下一个兄弟姐妹工厂。"," event as for a sequence of documents, a single document, or a single page.":"对于一系列文档，单个文档或一个页面，事件。","The element on which to set the bottom offset.":"设置底部偏移的元素。","The exception encountered.":"遇到的异常。","The index of the standard swashes form. The default value is 0 (zero).":"标准折纸形式的索引。 默认值为0（零）。","The index of the stylistic alternates form. The default value is 0 (zero).":"风格替代形式的索引。 默认值为0（零）。","The number of documents or pages output with the ":"带有文档或页面的数量输出"," that is the parent factory.":"那是父厂。","An object that is typically one of the following:  \n  \n ":"通常是以下一个的对象：","The new distance between the bottom side of the element and the bottom side of its parent canvas.":"元素底部和其父画布底部之间的新距离。","The type to which ":"以下类型","The type of the objects this factory produces.":"该工厂产生的对象的类型。","An enumeration value that specifies the scope of the progress changed event such as for an entire multiple document sequence, a single document, or a single page.":"指定进度更改事件范围的枚举值，例如整个多个文档序列，单个文档或单个页面。","The type this converter converts.":"此转换器转换的类型。","The element on which to set the left offset.":"设置左偏置的元素。"," is to be converted. This must be ":"要转换。 这一定是","The default value of the dependency property, usually provided as a value of a specific type.":"依赖关系属性的默认值，通常作为特定类型的值提供。","Based on the scope defined by ":"基于由定义的范围 ","The type this converter converts to.":"此转换器转换的类型。","The new distance between the left side of the element and the left side of its parent canvas.":"元素左侧和其父画布左侧之间的新距离。","The language and culture assumed during the conversion.":"语言和文化在转换过程中假设。",", the number of documents or the number of pages that have been written.":"，文档数量或已编写的页面数量。","The metadata option flags (a combination of ":"元数据选项标志（组合","The element on which to set the URI offset.":"设置URI偏移的元素。","The type of the optional value converter parameter object.":"可选值转换器参数对象的类型。"," when the converter cannot produce a value; for example, when ":"当转换器无法产生值时； 例如，当","The percentage of data that has been written.":"已经编写的数据百分比。"," values). These options specify characteristics of the dependency property that interact with systems such as layout or data binding.":" 值）。 这些选项指定与系统（如布局或数据绑定）交互的依赖项属性的特征。","The URI to navigate to when a hyperlink is clicked.":"单击超链接时要导航的URI。"," or when ":"或何时","The unique identifier of this ":"这个独特的标识符","A reference to a handler implementation that the property system will call whenever the effective value of the property changes.":"属性系统将在属性的有效价值更改时对处理程序实施的引用。","The user-supplied object that identifies the write operation.":"识别写操作的用户供供对象。","The element on which to set the right offset.":"设置右偏移的元素。"," to use as the binding source. The default value is ":"用作绑定源。 默认值是",".  \n  \n-or-\n  \n The new ":"。 \n  \n -或者- \n  \n  新的","The default value of the dependency property, usually provided as a specific type.":"依赖关系属性的默认值，通常作为特定类型提供。","The new distance between the right side of the element and the right side of its parent canvas.":"元素右侧和其父画布右侧之间的新距离。","The number of documents or pages that have been written at the time of the event.":"事件发生时已编写的文档或页面数量。"," to perform node collection creation in a worker thread; otherwise, ":"在工作线程中执行节点收集创建； 否则，"," of the designated type. As implemented in this class, this must be either a ":"指定类型。 正如本课程实现的那样，这必须是","The element on which to set the top offset.":"设置顶部偏移的元素。","An enumeration that indicates the scope of writing a multiple document sequence, a single document, or single page.":"指示编写多个文档序列，单个文档或单个页面的范围的枚举。","A reference to a handler implementation that will be called whenever the property system calls ":"每当属性系统调用时将调用处理程序实现的引用",". If it is a string, it will be formatted appropriately for the ":"。 如果是字符串，它将为"," of the XML data file to use as the binding source. The default value is ":"XML数据文件用于绑定源。 默认值是","The initial contents of the new ":"新的最初内容"," on this dependency property.":"在此依赖属性上。","The object that is to be converted back to a ":"要转换回一个的对象","The new distance between the top side of the element and the top side of its parent canvas.":"元素的顶部与其父画布的顶部之间的新距离。"," used to run ":"用于运行"," to prevent the property system from animating the property that this metadata is applied to. Such properties will raise a run-time exception originating from the property system if animations of them are attempted. ":"为了防止属性系统对该元数据应用的属性进行动画。 如果尝试进行动画，则此类属性将引起源自属性系统的运行时间异常。"," object that specifies the initial contents of the new ":"指定新的初始内容的对象","The brush for rendering the page background.":"用于渲染页面背景的刷子。"," queries. The default value is ":"查询。 默认值是",". This must be ":". 这一定是 "," defining the overflow area.":"定义溢出区域。",". This parameter may be null, in which case no ":"。 此参数可能为null，在这种情况下否","The inline XML content.":"内联XML内容。"," to permit animating the property. The default is ":"允许对属性进行动画动画。 默认值为"," is not a valid percentage when ":"当"," to prevent the property system from animating the property that this metadata is applied to. Such properties will raise a run-time exception originating from the property system if animations of them are attempted. The default is ":"为了防止属性系统对该元数据应用的属性进行动画。 如果尝试进行动画，则此类属性将引起源自属性系统的运行时间异常。 默认值为"," of the child elements.":" 子元素的。",".  \n  \n-or-\n  \n A ":"。 \n  \n -或者- \n  \n  一个"," query used to generate the data collection. The default is an empty string.":" 用于生成数据集合的查询。 默认值为空字符串。"," that specifies the position at which to insert the ":"指定了插入的位置"," that defines the content area.":"定义内容区域。"," to use when bindings for this property are applied that have their ":"应用该属性的绑定时使用的","The prefix to use in Extensible Application Markup Language (XAML).":"用于扩展应用程序标记语言（XAML）的前缀。"," representing the zoom percentage of a ":"代表变焦百分比"," element after it is created, or null for no automatic insertion.":"创建它后，或无自动插入的元素。"," for the page.":"对于页面。"," for this dependency property.":"对于此依赖性属性。"," of the namespace to create the mapping for.":"为创建映射的名称空间。","The key of the resource that this markup extension references.":"此标记扩展引用的资源的关键。"," that indicates the beginning of a selection of content that the new ":"这表明了新内容的选择开始","A reference to a handler implementation will be called whenever the property system calls ":"每当属性系统调用时，都会调用对处理程序实施的引用","The initial content of the new ":"新的初始内容"," that indicates the end of a selection of content that the new ":"这表明了新的内容的选择结束","Object that can provide services for the markup extension.":"可以为标记扩展提供服务的对象。","The instance to compare for equality.":"比较平等的实例。","The object to set on the property where the extension is applied. Rather than the actual value, this will be an expression that will be evaluated at a later time.":"在应用扩展的属性上设置的对象。 而不是实际值，这将是一个表达式，将在以后进行评估。","The base metadata to merge.":"基础元数据合并。"," element after it is created.":"创建元素。","The amount of spacing between cells in a table, in device independent pixels.  \n  \n The default value is 2.0.":"表格中的单元之间的间距量，设备独立像素。 \n  \n  默认值为2.0。"," objects are the same; otherwise, ":"对象相同； 否则，","The resource key that this dynamic resource reference specifies.":"此动态资源参考指定的资源密钥。"," objects are not the same; otherwise, ":"对象不一样； 否则，"," enumeration specifying the horizontal alignment for the ":"枚举指定水平对齐","The dependency property this metadata is being applied to.":"该元数据的依赖性属性正在应用于。"," object that contains the columns (represented by ":"包含列的对象（由","The prefix to associate with the URI. The default is an empty string(\"\").":"与URI关联的前缀。 默认值是一个空字符串（“”）。","Context in which the provided type should be evaluated.":"应评估提供类型的上下文。",", in device independent pixels. The default value is ":"，在设备独立像素中。 默认值是","The type associated with this metadata if this is type-specific metadata. If this is default metadata, this value can be ":"如果这是特定于类型的元数据，则与此元数据关联的类型。 如果这是默认元数据，则可以","The URI of the namespace. The default is ":"名称空间的URI。 默认值为","The type of the destination/output of conversion.":"转换目标/输出的类型。"," if the dependency property on which this metadata exists potentially affects the arrange pass; otherwise, ":"如果该元数据存在的依赖性属性可能会影响安排通过； 否则，","), which indicates that the line height is determined automatically.":"），这表明线高是自动确定的。"," object to add. This cannot be ":"要添加的对象。 这是不可能的"," is type of ":"是类型"," if the dependency property on which this metadata exists potentially affects the measure pass; otherwise, ":"如果该元数据存在的依赖性特性可能会影响度量通过； 否则，","The text string to add as a child.":"小时候要添加的文本字符串。","The DPI setting, from which a ":"DPI设置，其中 "," object that specifies the culture to represent the number.":"指定文化代表数字的对象。"," if the dependency property on which this metadata exists potentially affects the arrange pass specifically on its parent element; otherwise, ":"如果该元数据存在的依赖性属性可能会特别影响安排通过其父元素； 否则，"," object of interest. This cannot be ":"感兴趣的对象。 这是不可能的"," elements that make up the contents of the ":"构成内容的元素","The array that is the destination of the items copied from the collection.":"作为从集合复制的项的目标的数组。","The zero-based index in array at which copying starts.":"复制开始的数组中的基于零的索引。"," object that you can use to enumerate the items in this collection.":" 可用于枚举此集合中的项的对象。"," object to remove. This cannot be ":"对象要删除。 这是不可能的"}