{"The destination array to copy to.":"要复制的目标数组。","The geometry to test for containment.":"测试遏制的几何形状。"," if the codec supports multiple frames; otherwise, ":"如果编解码器支持多个帧； 否则，"," of raw color profile data.":"原始颜色配置文件数据。","The children of the effects group as a ":"效果小组的子女","The index within the source ":"源中的索引"," that represents the location of a International Color Consortium (ICC) or Image Color Management (ICM) color profile.":"这代表了国际颜色联盟（ICC）或图像颜色管理（ICM）颜色配置文件的位置。"," if the current geometry completely contains ":"如果当前的几何形状完全包含","The version of the codec.":"编解码器的版本。","The bitmap source to be used by this input object.":"该输入对象要使用的位图源。"," to start copying from.":"开始复制。","The string to convert to a ":"转换为一个的字符串","The file stream that identifies the bitmap to decode.":"标识要解码的位图的文件流。"," if the current geometry contains ":"如果当前的几何形状包含"," should be serialized; otherwise ":"应该序列化； 否则","The key/value pair of the element to remove.":"要删除的元素的键/值对。","Represents colors in terms of alpha, red, green, and blue channels.":"以alpha、红色、绿色和蓝色通道表示颜色。",", given the specified margin of error; otherwise, ":"，给定指定的错误余量； 否则，"," for this decoder.":"对于这个解码器。","The rectangular region of the visual to which the effect is applied. The default value is ":"施加效果的视觉的矩形区域。 默认值是"," was not found in the original collection.":"在原始系列中没有发现。","The method by which ":"该方法","The point to test for containment.":"测试遏制的重点。","The method in which to interpret the rectangle provided by the ":"解释由"," if the element referenced by ":"如果由"," from a ":"来自"," are combined.":"合并。"," that is derived from the context.":"这是从上下文得出的。"," if the geometry contains ":"如果几何形状包含"," applied to the ":"应用于"," contains an entry for ":"包含一个条目"," by using the specified ":" 通过使用指定的 "," that is used as the input for the object. The default value is null.":"它用作对象的输入。 默认值为null。","The area of the filled region of the geometry.":"几何区域的区域。","The polygonal approximation of the ":"多边形的近似"," representing the total number of strings.":"表示字符串总数。","The computational tolerance of error.":"误差的计算公差。"," of the bitmap to decode.":"解码的位图。","The type of blur kernel. The default value is ":"模糊内核的类型。 默认值是","Specifies how the error tolerance will be interpreted.":"指定如何解释错误公差。","The location of the bitmap from which the ":"位图的位置","A simplified outline of the filled region of the ":"简化的大纲","A collection of objects of type ":"类型对象的集合","The radius used in the blur kernel, in DIU (1/96 of an inch). The default value is ":"Diu（1/96英寸）中使用的模糊内核中使用的半径。 默认值是","The area of the filled region of this combined geometry.":"该组合几何形状的填充区域的面积。","A collection containing the strings in the dictionary.":"包含字典中字符串的集合。","The options that are used to create this ":"用于创建这个的选项","An object that describes the area of the geometry's stroke.":"描述几何学中风区域的对象。"," representing the curve that is used to calculate the blur. The default is ":"表示用于计算模糊的曲线。 默认值为"," at offset 0.0.":"在偏移0.0。","The cache option that is used to create this ":"用于创建此的缓存选项","An axis aligned rectangle that is exactly large enough to contain the outlined geometry.":"一个轴对齐的矩形足够大，可以包含概述的几何形状。"," object may have curved segments; otherwise, ":"对象可能具有弯曲的段； 否则，","The radius of the blur effect's curve. The default is 5.":"模糊效应曲线的半径。 默认值为5。","The caching requirements for this ":"缓存要求","The outlined geometry.":"概述的几何形状。"," at offset 1.0.":"在偏移1.0。","The bounding box of this ":"这个边界框 ",". This property has no default value.":"。 该属性没有默认值。"," value that indicates whether the system renders an effect with emphasis on speed or quality. The default is ":"指示该系统是否会产生效果并强调速度或质量的值。 默认值为"," that represents the angle, in degrees, of the gradient. A value of 0.0 creates a horizontal gradient, and a value of 90.0 creates a vertical gradient.":"这代表梯度的角度，程度。 值为0.0的值会产生水平梯度，而值为90.0产生垂直梯度。","The color of the shadow. The default value is ":"阴影的颜色。 默认值是","The object used to define the area of the geometry's stroke.":"用于定义几何学冲程区域的对象。"," that represents the embedded color profile of the bitmap. If no color profile has been defined, this property returns ":"这代表了位图的嵌入式颜色曲线。 如果没有定义颜色配置文件，则此属性返回"," object to combine.":" 物进行组合。"," (black).":"（黑色的）。"," of the gradient.":"梯度。"," are combined. The default value is ":"合并。 默认值是","The geometry, widened by ":"几何形状，宽大"," if the decoder is downloading content; otherwise, ":"如果解码器正在下载内容； 否则，"," to set on this brush.":"在此刷子上设置。"," that represents global metadata associated with a bitmap. If no metadata is defined, this property returns ":"这代表了与位图关联的全局元数据。 如果没有定义元数据，则此属性返回"," if the geometry is empty; otherwise, ":"如果几何图形为空； 否则，","The root visual of the ":"根的视觉","The angle at which the shadow is cast. The valid range of values is from 0 through 360. The value 0 puts the direction immediately to the right of the object. Subsequent values move the direction around the object in a counter-clockwise direction. For example, a value of 90 indicates the shadow is cast directly upward from the object; a value of 180 is cast directly to the left of the object, and so on. The default value is 315.":"阴影被铸造的角度。 有效的值范围是从0到360。值0将方向立即放在对象的右侧。 随后的值以逆时针方向移动对象周围的方向。 例如，一个值为90表示阴影直接从对象向上施放。 值为180的值直接铸造在对象的左侧，依此类推。 默认值为315。","The ending two-dimensional coordinates of the linear gradient. The default is (1,1).":"线性梯度的结束二维坐标。 默认值为（1,1）。"," associated with this decoder. If the bitmap has no palette, ":"与此解码器相关联。 如果位图没有调色板，","A 32-bit signed integer that represents the index value of the child ":"一个32位签名的整数，代表孩子的索引值"," if the geometry object might have curved segments; otherwise, ":"如果几何对象可能具有弯曲的段； 否则，","The noise level of the shadow. The valid range of values is from 0 through 1. A value of 0 indicates no noise and 1 indicates maximum noise. A value of 0.5 indicates 50 percent noise, a value of 0.75 indicates 75 percent noise, and so on. The default value is 0.":"阴影的噪音水平。 有效的值范围是从0到1。一个值为0表示没有噪声，1表示最大噪声。 值为0.5表示50％的噪声，值为0.75表示75％的噪声，依此类推。 默认值为0。","The starting two-dimensional coordinates for the linear gradient. The default is (0, 0).":"线性梯度的起始二维坐标。 默认值为（0，0）。"," is returned. This property has no default value.":"退回。 该属性没有默认值。","The degree of opacity. The valid range of values is from 0 through 1. A value of 0 indicates that the shadow is completely transparent, and a value of 1 indicates that the shadow is completely opaque. A value of 0.5 indicates the shadow is 50 percent opaque, a value of 0.725 indicates the shadow is 72.5 percent opaque, and so on. Values less than 0 are treated as 0, while values greater than 1 are treated as 1. The default is 1.":"不透明度。 有效的值范围是从0到1。一个值为0表示阴影是完全透明的，而值为1表示阴影完全不透明。 0.5的值表示阴影为50％不透明，值为0.725表示阴影为72.5％的不透明等，依此类推。 小于0的值被视为0，而大于1的值将其视为1。默认值为1。",". The value of ":"。 的价值","A string that describes the geometry to be created.":"描述要创建的几何形状的字符串。","The start point.":"起点。"," that represents the global preview of the bitmap. If no preview is defined, this property returns ":"这代表了位图的全局预览。 如果未定义预览，此属性将返回"," must be between 0 and ":"必须在0到","The distance between the plane of the object casting the shadow and the shadow plane measured in device-independent units (1/96th inch per unit). The valid range of values is from 0 through 300. The default is 5.":"物体平面施放阴影的平面与以设备无关的单位测量的阴影平面（每单位1/96英寸）之间的距离。 有效的值范围是从0到300。默认值为5。"," instance created from the specified string.":"从指定的字符串创建的实例。","The end point.":"终点。","The delegate that allows you to ignore parts of the visual tree that you are not interested in processing in your hit test results.":"使您可以忽略视觉树的一部分的代表，您对在HIT测试结果中处理不感兴趣。"," that represents a thumbnail of the bitmap. If no thumbnail is defined, this property returns ":"这代表了位图的缩略图。 如果未定义缩略图，则此属性返回","The shadow's softness. The valid range of values is from 0 through 1. A value of 0.0 indicates no softness (a sharply defined shadow) and 1.0 indicates maximum softness (a very diffused shadow). A value of 0.5 indicates 50 percent softness, a value of 0.75 indicates 75 percent softness, and so on. The default is 0.5.":"阴影的柔软度。 有效的值范围是从0到1。0.0的值表示没有柔软度（明确定义的阴影），而1.0表示最大柔软度（非常扩散的阴影）。 值为0.5表示50％的柔软度，值为0.75表示75％的柔软度，依此类推。 默认值为0.5。","The transformation to apply to the line.":"适用于线路的转换。"," if the value of the geometry's ":" 如果几何的值 ","Identifies the desired bitmap encoding format.":"标识所需的位图编码格式。","A value that indicates the radius of the shadow's blur effect. The default is 5.":"表示阴影模糊效果半径的值。 默认值为5。","The delegate that is used to control the return of hit test information.":"用于控制HIT测试信息返回的代表。"," property should be serialized; otherwise, ":"财产应序列化； 否则，"," that can encode to the specified ":"可以编码为指定的","The specified type for interpreting the error tolerance.":"指定的类型用于解释误差容量。","Defines the set of parameters for a hit test.":"定义命中测试的一组参数。","The color of the drop shadow. The default is ":"滴阴影的颜色。 默认值为","An object that determines the area of the geometry's stroke.":"一个确定几何学冲程区域的对象。","The area of the filled region of this ":"填充区域的区域","Identifies the file stream that this bitmap is encoded to.":"标识该位图已编码的文件流。","The point value to hit test.":"点数的点值。","The direction of the drop shadow, in degrees. The default is 315.":"下降阴影的方向，程度。 默认值为315。"," is contained in the stroke produced by applying the specified ":"通过应用指定的"," object, which is always 0 because a line contains no area.":"对象，总是0，因为一行不包含区域。"," objects that represents the color profiles that this encoder uses.":"代表该编码器使用的颜色配置文件的对象。","The hit test result of the visual returned as a ":"视觉结果的热门测试结果返回"," to the geometry; otherwise, ":"到几何； 否则，","The opacity of the drop shadow. The default is 1.":"落下阴影的不透明度。 默认值为1。","The axis-aligned bounding box of this ":"轴线的边界框"," objects within the image.":"图像中的对象。"," value that indicates whether the system renders the drop shadow with emphasis on speed or quality. The default is ":"表示系统是否以速度或质量的重点呈现落下阴影的值。 默认值为"," that represents the preview of a bitmap.":"这代表了位图的预览。","The bitmap effect for this visual object.":"此可视对象的位图效果。","The end point of the line. The default is (0,0).":"线的终点。 默认值为（0,0）。","An object that defines the stroke of a geometry.":"定义几何形状中风的对象。"," that represents the thumbnail of the bitmap.":"这代表了位图的缩略图。","The bitmap effect input value for this visual object.":"该视觉对象的位图效应输入值。","The start point of the line. The default is (0,0).":"线的起点。 默认值为（0,0）。","The distance of the drop shadow below the texture. The default is 5.":"纹理下方的滴阴影的距离。 默认值为5。"," if the stroke created by applying the specified ":"如果通过应用指定的中风"," that is used to construct the ":"用于构建","The end point of this ":"这个终点","The transform to apply. The default is the identity transform.":"适用的转换。 默认值是身份变换。"," that holds a cached representation of the ":"拥有一个缓存的代表"," to the geometry contains the specified point, given the specified tolerance factor; otherwise, ":"给定指定的公差因子，对几何形状包含指定点； 否则，"," from a given ":"从给定的","An object that determines the area of the current geometry's stroke.":"确定当前几何中风的面积的对象。"," to stroke this ":"抚摸这个"," that contains the children of the ":"其中包含"," that acts as the input.":"这是输入。","A modifiable deep copy of the current object. The ":"当前对象的可修改深副本。 这","The stream from which this ":"从此流","A string representation of the object.":"对象的字符串表示。"," that defines the clipping region.":"这定义了剪裁区域。","The direction the artificial light is cast upon the embossed object. The valid range is from ":"人造光被施放在浮雕物体上的方向。 有效范围来自"," to use the current culture.":"使用当前的文化。","The end point of the line segment.":"线段的终点。"," is constructed.":"被构造。","The axis-aligned bounding box of the ":"轴线的边界框"," (degrees) with ":"（学位）"," that specifies the bounding box.":"这指定了边界框。"," that identifies the source of the ":"确定了","The value at position (1, 1) in the transformation matrix.":"转换矩阵中位置（1，1）处的值。","The empty geometry object.":"空的几何对象。","The value at position (1, 2) in the transformation matrix.":"转换矩阵中位置（1，2）处的值。"," that specifies the combination bounding box.":"这指定了组合边界框。"," specifying the right-hand side of the object and successive values moving counter-clockwise around the object. The default value is ":"指定对象的右侧，并连续的值逆时针围绕对象移动。 默认值是"," that is used to construct this ":"用于构建这个","The standard tolerance, 0.25.":"标准公差为0.25。","The value at position (2, 1) in the transformation matrix.":"转换矩阵中位置（2，1）处的值。","The amount of relief of the emboss. The valid range of values is ":"浮雕的浮雕量。 有效的值范围是","The source from which the ":"从中"," that represents the bitmap effect.":"这代表了位图效果。","The transformation applied to the ":"适用于","The value at position (2, 2) in the transformation matrix.":"转换矩阵中位置（2，2）处的值。"," having the least relief and ":"最少的救济和","A thumbnail image of the resulting ":"结果的缩略图图像"," that represents the offset value of the ":"这代表了"," with the specified thumbnail.":"带有指定的缩略图。","A value from 0 through 1 that specifies a range from fully transparent to fully opaque. A value of 0 indicates that the ":"从0到1的值指定从完全透明到完全不透明的范围。 值为0表示",". Note that this value may be a single ":"。 请注意，此值可能是一个","The X-axis translation factor, which is located at position (3,1) in the transformation matrix.":"X轴翻译因子位于转换矩阵中的位置（3,1）。"," having the most. The default value is ":"拥有最多的。 默认值是","The metadata to associate with this ":"与此相关的元数据"," is completely transparent, while a value of 1 indicates that the ":"完全透明，而1的值表示"," cast as a ":"作为一个","The Y-axis translation factor, which is located at position (3,2) in the transformation matrix.":"Y轴翻译因子位于转换矩阵中的位置（3,2）。","The color of the halo glow. The default is white.":"光晕发光的颜色。 默认值为白色。"," objects that are associated with this ":"与此关联的对象"," is completely opaque. A value 0.5 indicates 50 percent opaque, a value of 0.725 indicates 72.5 percent opaque, and so on. Values less than 0 are treated as 0, while values greater than 1 are treated as 1.":"完全不透明。 值0.5表示50％的不透明，值为0.725表示72.5％的不透明等等，依此类推。 小于0的值被视为0，而大于1的值被视为1。","The transformation matrix of the new ":"新的转换矩阵"," to remove from this ":"从中删除","The thickness of the halo glow, in device-independent unit (1/96th inch). The valid range of values is from 1 through 199. The default is 20.":"光晕发光的厚度，独立于设备的单元（1/96英寸）。 有效的值范围是1到199。默认值为20。"," that represents the opacity mask value of the ":"代表不透明度掩模值"," with the specified thumbnail, ":"带有指定的缩略图，"," structure that defines this transformation. The default value is an identity ":"定义这种转换的结构。 默认值是一个身份"," was removed from the collection; otherwise, ":"被从收藏中删除； 否则，","The parent of the visual.":"视觉的父母。","The graininess (noise level) of the halo glow. The valid range of values is from 0.0 through 1.0, with 0.0 specifying no noise and 1.0 specifying maximum noise. A value of 0.5 indicates 50 percent noise, a value of 0.75 indicates 75 percent noise, and so on. The default value is 0.0.":"光晕发光的颗粒感（噪声水平）。 有效的值范围为0.0至1.0，0.0指定无噪声，1.0指定最大噪声。 值为0.5表示50％的噪声，值为0.75表示75％的噪声，依此类推。 默认值为0.0。",". An identity matrix has a value of ":"。 身份矩阵的值为"," of the current context.":"当前上下文。","The opacity level of the glow. A value of 0 indicates that the halo glow is completely transparent, while a value of 1 indicates that the glow is completely opaque. A value of 0.5 indicates the glow is 50 percent opaque, a value of 0.725 indicates the glow is 72.5 percent opaque, and so on. Values less than 0 are treated as 0, while values greater than 1 are treated as 1. The default is 1.":"光泽的不透明度水平。 值为0表示光晕发光是完全透明的，而值为1表示光的光泽完全不透明。 0.5的值表示发光为50％不透明，值为0.725表示光泽为72.5％的不透明，依此类推。 小于0的值被视为0，而大于1的值将其视为1。默认值为1。","The number of geometries contained in the ":"在"," in coefficients ":"在系数中","The transform value.":"转换值。"," that represents a thumbnail of the current ":"代表电流的缩略图","The stream to read the HLSL bytecode from.":"流以读取HLSL字节码的流。"," to use as the source of the ":"用作","; and a value of ":"; 和一个价值"," if object of the specified type can be converted to a ":"如果指定类型的对象可以转换为","The number of children in the ":"儿童人数"," value that indicates whether to force the use of hardware or software rendering for the effect.":"表示是否强制使用硬件或软件渲染的值。","Cultural information respected during conversion.":"转换过程中尊重的文化信息。"," that specifies the caching requirements for images that are obtained using HTTP.":"这指定了使用HTTP获得的图像的缓存要求。","The horizontal guideline.":"水平准则。"," in the rest of the coefficients.":"在其余系数中。"," being used for the ":"被用于","The Pack URI reference to HLSL bytecode in the assembly.":"包装URI对组件中HLSL字节码的引用。","The brush used to fill this ":"用来填充这个的刷子","The matrix that represents this ":"代表这个的矩阵"," used for this ":"用于此","The vertical guideline.":"垂直指南。","The index of the shader register associated with the dependency property.":"着色器寄存器的索引与依赖关系属性关联。","The pen used to stroke this ":"用来抚摸这个的笔","True if the transformation is affine, false otherwise.":"如果转换是仿制的，则为fress，否则为错误。","The height, in pixels, that the image is decoded to. The default value is 0.":"图像被解码为像素的高度。 默认值为0。","String used for conversion.":"用于转换的字符串。"," delegate that associates a dependency property and the shader constant register specified by ":"委派依赖属性属性和着色器常数寄存器指定","Color of the new light.":"新灯的颜色。"," that represents the result of the conversion.":"这代表了转换的结果。","The geometry":"几何","The width, in pixels, that the image is decoded to. The default value is 0.":"图像被解码为以像素为单位的宽度。 默认值为0。","The index of the shader sampler associated with the dependency property.":"着色器采样器的索引与依赖关系属性关联。","String representation of the ":"字符串表示","The shape described by this ":"描述的形状"," that specifies the axis around which to rotate.":"这指定了周围旋转的轴。"," is downloading content; otherwise, ":"正在下载内容； 否则，"," delegate that associates a dependency property and the shader sampler register specified by ":"委派该委托依赖属性和着色器采样器寄存器指定"," can be converted; otherwise, ":"可以转换； 否则，","Double that specifies the angle of rotation, in degrees.":"两倍指定旋转角度为单位。","A collection containing the children of this ":"包含此子项的集合 ","The rotation that is used for the ":"用于旋转"," for the shader sampler.":"对于着色器采样器。"," based on the specified ":"基于指定的","Double that specifies the angle of a 3-D rotation, in degrees.":"双重指定3-D旋转的角度。","Specifies how the intersecting areas are combined to form the resulting area.  The default value is ":"指定如何合并相交区域以形成结果区域。 默认值是"," representation of the specified ":"指定的表示","The name of the dependency property.":"依赖属性的名称。","The rectangle that is used as the source of the ":"用作源的矩形 "," that specifies the axis of rotation.":"这指定了旋转轴。"," value to use for the hit test geometry.":"用于命中测试几何形状的值。","The type of the effect that has the dependency property.":"具有依赖性属性的效果的类型。","String representation of this object.":"此对象的字符串表示。","The collection of dashes and gaps.  The default is an empty ":"破折号和差距的集合。 默认值为空","The stream source of the ":"流源的流源","A dependency property associated with the shader sampler specified by ":"与着色器采样器相关的依赖关系属性"," of the current context. The default is ":"当前上下文。 默认值为","Transform3D applied to the camera.":"Transform3D应用于相机。"," that defines the hit test region.":"这定义了命中测试区域。","The offset for the dash sequence.  The default is 0.":"破折号序列的偏移。 默认值为0。","The dependency property to be updated.":"要更新的依赖属性。"," source of the ":"来源","The visual object that is hit during a hit test.":"在热门测试中击中的视觉对象。"," of child elements. The default is an empty collection.":"儿童元素。 默认值是一个空的集合。","A dash sequence of 2,2, which describes a sequence composed of a dash that is twice as long as the pen ":"2,2的破折号序列，该序列描述了由仪表板组成的序列，该序列是笔的两倍","Describes the intersection between a ":"描述了","The new material's brush.":"新材料的刷子。","The format of the bitmap image, specified as \"gif\", \"jpg\", \"png\", or \"tiff\".":"位图图像的格式，指定为\"gif\"、\"jpg\"、\"png\"或\"tiff\"。","The index of the register that contains the partial derivatives.":"包含偏导数的寄存器的索引。"," followed by a space that is twice as long as the ":"其次是一个空间的时间是"," value of the hit test.":"命中测试的值。","Identifies the string that is being queried in the current ":"标识当前正在查询的字符串","The color of the ambient light reflected by the 3D object. The default value is ":"3D对象反映的环境光的颜色。 默认值是","The padding along the bottom edge of the effect.":"沿效果的底部边缘的填充。","A dash sequence of ":"破折号序列"," if the query string is found within the metadata store; otherwise, ":"如果在元数据商店内找到查询字符串； 否则，"," object that represents the hit test result.":"代表命中测试结果的对象。","The color filter for the ":"颜色过滤器","The padding along the left edge of the effect.":"效果的左边缘的填充。","A dash sequence with no dashes.":"没有破折号的破折号序列。","A  value of type ":"类型的值",". Since all colors make up white, all colors are visible by default.":"。 由于所有颜色均构成白色，因此默认情况下可见所有颜色。","The metadata at the specified query location.":"指定查询位置的元数据。","The padding along the right edge of the effect.":"沿效果的右边缘的填充。"," corresponding to the ":"对应于"," values that make up the ":"组成的值","Diffuse color of the new light.":"新灯的弥散颜色。","The metadata query to remove.":"元数据查询要删除。"," that represents the alignment box for the ":"这代表了对齐框"," values that the collection is initially capable of storing.":"该集合最初能够存储的值。","The padding along the top edge of the effect.":"沿效果的顶部边缘的填充。","Direction of the new light.":"新灯的方向。","Identifies the location of the metadata to be written.":"标识要编写的元数据的位置。"," for the effect.":"为了效果。","The value of the metadata to be written.":"要编写的元数据的价值。"," that represents the ink bounding box the ":"代表墨水边界框","The item to add to the end of this collection.":"要添加到此集合的末尾的项目。","Vector3D along which the light projects, and which must have a non-zero magnitude. The default value is ":"沿矢量3D沿着光线且必须具有非零的幅度。 默认值是","The transformation to apply to the ellipse.":"适用于椭圆的转换。","The item to locate in this collection.":"要在此集合中找到的项目。","The brush applied by the ":"由","Offset to use for computing the caret character hit.":"用来计算商品角色命中的偏移。","The name of the application that was used to construct or alter an image file.":"用于构建或更改图像文件的应用程序的名称。","The rectangle that describes the ellipse dimensions.":"描述椭圆尺寸的矩形。","The author of the image.":"图像的作者。","Determines whether the character hit is inside the ":"确定角色命中是否在",", the specified ":"，指定的 ","The 3-D point to transform.":"的3-D点进行变换。",", is in this ":"，在这个","The camera manufacturer that is associated with an image.":"与图像关联的相机制造商。","The maximum bounds on the distance between points in the polygonal approximation of the geometry. Smaller values produce more accurate results but cause slower execution. If ":"在几何形状的多边形近似中的点之间的距离上的最大边界。 较小的值会产生更准确的结果，但导致执行速度较慢。 如果"," value that represents the character hit that is closest to the ":"代表最接近的字符命中的值","The 3-D bounding box to transform.":"3-D边界框进行转换。","The array that is the destination of the items copied from this ":"阵列是从此复制的物品的目的地"," is less than .000001, .000001 is used instead.":"使用小于.000001，.000001。","The camera model that was used to capture the image.":"用于捕获图像的相机模型。"," value. The out parameter ":" 价值。 Out参数 ","A comment that is associated with the image file.":"与图像文件关联的评论。","The smallest axis-aligned 3-D bounding box possible that contains the transformed ":"可能包含转换的最小轴对齐的3D边界框","One of the enumeration values, ":"枚举值之一，","The index at which to begin copying.":"开始复制的索引。"," if the character hit is inside the ":"如果角色命中在内部","The copyright information that is associated with the image file.":"与图像文件关联的版权信息。"," to use for computing the offset.":"用于计算偏移量。","An inverse of this instance, if possible; otherwise, ":"如果可能的话，这种情况的倒数； 否则，","The index at which to insert ":"插入的索引",", that specifies whether the tolerance factor is an absolute value or relative to the area of this geometry.":"，指定公差因子是绝对值还是相对于此几何的面积。"," that represents the offset from the leading edge of the ":"这代表了从前沿的偏移","The date that the image was taken.":"拍摄图像的日期。",", or -1 if the object is not found in the collection.":"，或-1如果在集合中找不到对象。","The area of the filled region of this ellipse.":"该椭圆形区域的区域。"," representation of the collection of doubles.":"双打集合的代表。"," to the leading or trailing edge of a caret stop containing the character hit.":"到包含角色击中的镜头停止的领先或尾随边缘。","The format of the bitmap image.":"位图图像的格式。"," was successfully deleted; otherwise, ":"成功删除了； 否则，"," object can have curved segments; otherwise, ":"对象可以具有弯曲的段； 否则，","Returns the equivalent ":"返回等效"," to use for computing the next hit value.":"用于计算下一个命中值。"," is a fixed size; otherwise, ":"是固定尺寸； 否则，"," if the enumerator successfully advances to the next element; otherwise, ":"如果枚举者成功发展到下一个元素； 否则，","The bounding box of the ":"边界的框","The item to remove from this collection.":"从此集合中删除的项目。","The transformed bounding box.":"转换的边界框。"," that represents the next valid caret character hit in the logical direction. If the return value is equal to ":"这代表了下一个有效的商标角色沿逻辑方向击中。 如果返回值等于"," if the metadata is read-only; otherwise, ":"如果元数据是只读的； 否则，","The center point of the ":"中心点",". The default is an empty collection.":"。 默认值是一个空的集合。"," containing the values of this ":"包含这个值",", no further navigation is possible in the ":"，不可能进一步导航","A read-only collection of strings.":"仅阅读的字符串集合。","An axis-aligned bounding box that contains all of the points in the specified 3-D bounding box.":"一个包含指定的3D边界框中所有点的轴对齐边界框。","The x-radius value of the ":"的x半径值 ","The number of doubles contained in the ":"在","The base location of the image metadata.":"图像元数据的基本位置。"," to use for computing the previous hit value.":"用于计算先前的HIT值。"," value to get or set.":"获得或设置的价值。","The y-radius value of the ":"Y-Radius的值","Bounding ":"边界","The rating value between 0 and 5.":"评级值在0到5之间。"," that represents the previous valid caret character hit in the logical direction. If the return value is equal to ":"这代表了以前的有效的商标角色沿逻辑方向命中。 如果返回值等于","The exception that details the error condition.":"详细说明错误条件的例外。","Geometry of the new mesh primitive.":"新网格原始的几何形状。","The subject of the bitmap image.":"位图图像的主题。"," if the enumerator successfully advanced to the next element; otherwise, ":"如果枚举者成功地将其推进到下一个元素； 否则，"," values that represent the advance widths.":"代表前进宽度的值。"," value that represents the typeface to compare.":"表示要比较字体的值。","Material of the new mesh primitive.":"新网格原始的材料。"," value representing the baseline origin.":"代表基线起源的值。","The needed type for which you are evaluating this ":"您要评估此的所需类型","The title of an image file.":"图像文件的标题。"," applied to the back of the ":"应用于背面"," of the type you want to convert.":"您要转换的类型。"," is not null and has the same properties as this typeface; otherwise, ":"不是null，并且具有与此字体相同的属性； 否则，"," value that represents the bidirectional nesting level.":"代表双向嵌套水平的值。"," that comprises the model.":"这包括模型。","Placeholder metadata.":"占位符元数据。"," values that represent whether there are caret stops.":"代表是否有销售停止的值。"," that is created from converting ":" 这是从转换创建的 "," value to compare.":"比较的价值。","Color of the light.":"光的颜色。"," values that represent Unicode content.":"表示Unicode内容的值。","The colors to add to the custom palette.":"添加到自定义调色板中的颜色。"," is not null and has the same properties as this font family typeface; otherwise, ":"不是零，并且具有与该字体族字体相同的属性； 否则，","The object you create when you convert this ":"转换此的对象","String representation of the object.":"对象的字符串表示。","The source bitmap from which the palette is read or constructed.":"读取或构造调色板的源位图。"," values that represent mapped glyph indices.":"代表映射的字形指数的值。","The axis-aligned bounds of the drawing's contents.":"图纸内容的轴对准边界。"," that represent the localized typeface names.":"代表局部字体名称。","Collection with which to instantiate the MaterialCollection.":"收集来实例化物料收集。","The maximum number of colors the new ":"最大颜色数量"," value that represents the device font.":"代表设备字体的值。"," that represents the device font name.":"这代表设备字体名称。","Integer that specifies the capacity of the MaterialCollection.":"整数指定物料汇编的能力。"," that describes the contents of the brush.":" 这描述了画笔的内容。"," value that represents the em size used for rendering.":" 表示用于渲染的em大小的值。"," can use.":"可以使用。","An enumerator that can iterate through the collection.":"可以通过集合迭代的枚举者。"," that describes the contents of this ":"描述了这一点的内容","Item to add to the end of this collection.":"要添加到此集合末尾的项。","The list of colors defined in a palette.":"调色板中定义的颜色列表。",", if found; otherwise -1;":"，如果发现； 否则-1;",". The default is null reference (":"。 默认值为null引用（"," values that represent the glyph indices.":" 表示字形索引的值。",", the specified Material, is in this MaterialCollection; otherwise, ":"，指定的材料是在此物质汇编中； 否则，","The height, in pixels, of the resulting bitmap.":"产生的位图的高度，像素。","The zero-based index position to insert the object.":"基于零的索引位置插入对象。","The array that is the destination of the items copied from this MaterialCollection.":"是从本材料汇编复制的项目的目的地的数组。"," objects that make up the ":"组成的对象"," values representing the offsets of glyph.":" 表示字形偏移量的值。"," was successfully deleted; otherwise ":"成功删除了； 否则","The initial rotation value to apply. Only 90 degree increments are supported.":"初始旋转值要应用。 仅支持90度增量。","The Material to search for.":"要搜索的材料。","The total capacity of the collection.":"集合的总容量。"," if there are valid caret character hits; otherwise, ":"如果有有效的男人角色命中； 否则，","The zero-based index position from where to delete the object.":"基于零的索引位置从哪里删除对象。","The width, in pixels, of the resulting bitmap.":"产生的位图的宽度，像素。","The index position of the specified Material.":"指定材料的索引位置。","The index at which copying begins.":"复制开始的索引。"," if the glyphs are rotated; otherwise, ":"如果字形旋转； 否则，"," from which to get or set the ":"从中获得或设置","An enumerator that can iterate the collection.":"可以迭代集合的枚举者。","The height of the bitmap.":"位图的高度。","The index position at which to insert the specified Material.":"插入指定材料的索引位置。","The foreground brush to use for the ":"用于使用的前景刷"," value that represents the location of the glyph typeface containing the glyphs.":"代表包含字形的字形字体的位置。","The width of the bitmap.":"位图的宽度。","The index position of the specified ":"指定的索引位置","The Material to insert.":"要插入的材料。"," to use in this ":"在此使用"," values that represent the glyphs.":"代表字形的值。","The brush that paints the ":"绘画的刷子"," if the original aspect ratio is maintained; otherwise, ":"如果保持原始纵横比； 否则，","The index position at which to insert ":"插入的索引位置","The Material to remove from this collection.":"从此系列中删除的材料。"," that describes the text to draw. The default value is ":"这描述了要绘制的文本。 默认值是"," whose usage information is collected.":" 收集其使用信息。","The rotation angle that is applied to the image.":"应用于图像的旋转角。","The index position of the item to remove.":"要删除的项目的索引位置。","The index position of the Material to remove.":"材料的索引位置要删除。","The URI that specifies the location of the font file.":"指定字体文件位置的URI。","The pixel location where copying starts.":"复制开始的像素位置。"," object to get or set":"对象获取或设置"," values that represent glyph typefaces.":"代表字形字体的值。","The number of Material objects contained in the ":"包含的材料对象的数量","The collection of glyph indices to be included in the subset.":"字形指数的集合包含在子集中。","The source rectangle to copy. An ":"源矩形要复制。 一个","The drawing to append.":"图纸要附加。","The family name or names that comprise the new ":"构成新的姓氏或名称"," value specifies the entire bitmap.":"值指定整个位图。","The zero-based index of the Material object to get or set.":"材料对象的基于零的索引要获得或设置。"," array that represents the binary image of the font subset.":"代表字体子集的二进制图像的数组。","The brush with which to fill the ellipse.  This is optional, and can be ":"用刷子填充椭圆形的刷子。 这是可选的，可以",". Multiple family names should be separated by commas.":"。 多个姓氏应通过逗号分开。","The pixel location where copying begins.":"复制开始的像素位置。"," and is equal to the current ":"并且等于电流","The current element in the MaterialCollection.":"物料汇编中的当前元素。","Specifies the base URI that is used to resolve ":"指定用于解决的基本URI",". If the brush is ":"。 如果刷子是","A modifiable copy of the ":"可修改的副本"," value that represents the font file.":"代表字体文件的值。","A pointer to the buffer.":"指向缓冲区的指针。"," is not a ":"不是一个",", no fill is drawn.":"，没有填充。","The size of the buffer.":"缓冲区的大小。","The index of the glyph to get the outline for.":"字形的索引获取轮廓。",". The returned copy is effectively a deep clone of the current object, although some copying might be deferred until necessary for improved performance. The copy's ":"。 返回的副本实际上是当前对象的深度克隆，尽管某些复制可能会推迟到需要提高性能为止。 副本","The pen with which to stroke the ellipse.  This is optional, and can be ":"用笔抚摸椭圆的笔。 这是可选的，可以"," object, ":"目的，","Returns the current value of the ":"返回当前值","The horizontal dots per inch (dpi) of the bitmap.":"位图的每英寸水平点（DPI）。","The font size in drawing surface units.":"绘图表面单元中的字体尺寸。",". If the pen is ":"。 如果笔是"," value that represents the hash code for the current object.":"代表当前对象的哈希代码的值。",". The returned ":"。 返回","The source location of the ":"源位置","The vertical dots per inch (dpi) of the bitmap.":"位图的每英寸垂直点（DPI）。","The size to hint for in points.":"以点为单位提示的大小。",", no stroke is drawn.":"，没有中风。","The pixel format of the bitmap.":"位图的像素格式。"," value that represents the path of the glyph.":"代表字形路径的值。"," has the same value as the instantaneous value of the current object, but is not animated.":"具有与当前对象的瞬时值相同的值，但没有动画。"," object, including the directory or uniform resource identifier (URI) location reference.":"对象，包括目录或统一资源标识符（URI）位置参考。","The location of the center of the ellipse.":"椭圆中心的位置。"," that contains the child ":"其中包含孩子"," object that contains key-value pairs that represents advance height information for the glyphs. The key is a ":"包含键值对的对象，该对表示字形的高度信息。 关键是","The palette of the bitmap.":"位图的调色板。"," that indicates the distance between the baseline and the character cell top, expressed as a fraction of the font em size.":" 这表示基线和字符单元格顶部之间的距离，表示为字体em大小的一小部分。","The horizontal radius of the ellipse.":"椭圆的水平半径。","Value of the (1,1) field of the new matrix.":"新矩阵（1,1）字段的值。"," that identifies the glyph index. The value is a ":"这标识了字形索引。 值是","An array of bytes that represents the content of a bitmap image.":"代表位图图像的内容的字节数组。"," that represents the font family names.":"这代表字体的家族名称。","Value of the (1,2) field of the new matrix.":"新矩阵（1,2）字段的值。","The vertical radius of the ellipse.":"椭圆的垂直半径。"," that represents the advance height.":"这代表了提前的高度。"," that is created from the specified array of pixels.":"这是从指定的像素数组创建的。","The clock with which to animate the ellipse's center position, or ":"为了使椭圆形的中心位置动画的时钟或"," that represents a collection of typefaces for the ":"这代表了一个字体集合","Value of the (1,3) field of the new matrix.":"新矩阵（1,3）字段的值。","A pointer to the buffer that contains the bitmap data in memory.":"指向存储器中包含位图数据的缓冲区的指针。"," object that contains key/value pairs that represents advance width information for the glyphs. The key is a ":" 包含表示字形提前宽度信息的键/值对的对象。 关键是一个 "," for no animation. This clock must be created from an ":"没有动画。 这个时钟必须是由"," that represents the line spacing for the ":"这代表了线间距","Value of the (1,4) field of the new matrix.":"新矩阵（1,4）字段的值。"," that represents the advance width.":"这代表了前进宽度。"," that is created from the array of pixels in unmanaged memory.":"这是由不受管理的内存中的像素数组创建的。"," that can animate ":"可以动画"," that represents the baseline.":"这代表基线。","Value of the (2,1) field of the new matrix.":"新矩阵（2,1）字段的值。","The font family name of the ":"的字体家族名称 "," if this instance should actually freeze itself when this method is called; otherwise, ":"如果此方法称为此方法，则实际上应该冻结自己； 否则，"," object that contains key/value pairs that represent distance information. The key is a ":"包含表示距离信息的密钥/值对的对象。 关键是"," if the converter can convert from the specified type to an instance of ":"如果转换器可以从指定类型转换为一个实例","Value of the (2,2) field of the new matrix.":"新矩阵（2,2）字段的值。","The clock with which to animate the ellipse's x-radius, or ":"为了使椭圆X-Radius动画的时钟或"," that identifies the glyph. The value is a ":"这标识了字形。 值是","The horizontal dots per inch (dpi) of the image; that is, the dots per inch (dpi) along the x-axis.":"图像的每英寸水平点（DPI）； 也就是说，沿X轴每英寸（DPI）的点。"," to the specified type; otherwise, ":"指定类型； 否则，","Value of the (2,3) field of the new matrix.":"新矩阵（2,3）字段的值。","The vertical dots per inch (dpi) of the image; that is, the dots per inch (dpi) along the y-axis.":"图像的每英寸垂直点（DPI）； 也就是说，沿y轴每英寸（DPI）的点。","The clock with which to animate the ellipse's y-radius, or ":"为椭圆的y半径设置动画的时钟，或 "," that represents the distance.":"这代表距离。","Value of the (2,4) field of the new matrix.":"新矩阵（2,4）字段的值。","The pixel format of the bitmap data.":"位图数据的像素格式。","Cultural-specific information that should be respected during conversion.":"在转换过程中应尊重的文化特定信息。"," with which to fill the ":"用它来填充",". This is optional, and can be ":"。 这是可选的，可以","Value of the (3,1) field of the new matrix.":"新矩阵（3,1）字段的值。"," that indicates the distance from the baseline to the top of an English capital letter, expressed as a fraction of the font em size.":" 这表示从基线到英文大写字母顶部的距离，表示为字体em大小的一小部分。","The height of the bitmap in device-independent units (1/96th inch per unit).":"与设备无关的单元（单位1/96英寸）中位图的高度。","Value of the (3,2) field of the new matrix.":"新矩阵（3,2）字段的值。"," value representing the culture-specific language. The default value is a ":" 表示特定于文化的语言的值。 默认值为 "," object that contains the mapping of a Unicode code points to glyph indices for all glyphs in the ":"包含Unicode代码的映射的对象指向到尺寸指数的所有字形索引"," value representing the scale factor. The default value is ":"代表比例因子的值。 默认值是","Value of the (3,3) field of the new matrix.":"新矩阵（3,3）字段的值。"," if the bitmap source is currently downloading; otherwise, ":"如果当前正在下载位图源； 否则，"," with which to stroke the ":"用它抚摸"," object that contains key/value pairs that represent copyright information. The key is a ":" 包含表示版权信息的键/值对的对象。 关键是一个 "," value representing the font family name. The default value is a ":"代表字体姓氏的值。 默认值是"," to draw.":"画。","Value of the (3,4) field of the new matrix.":"新矩阵（3,4）字段的值。","The metadata that is associated with the bitmap image.":"与位图图像相关联的元数据。"," object that identifies the culture. The value is a copyright information string.":"识别文化的对象。 该值是版权信息字符串。"," value representing Unicode code point ranges. The default value is \"0000-10ffff\".":"代表Unicode代码点范围的值。 默认值为“ 0000-10FFFF”。","Value of the X offset field of the new matrix.":"新矩阵的X偏移字段的值。","The brush used to paint the text.":"用来绘画文本的刷子。","The color palette of the bitmap.":"位图的调色板。"," object that contains key/value pairs The key is a ":"包含键/值对的对象键是","The zero-based index position to remove the object.":"基于零的索引位置以删除对象。","The text to draw.":"要绘制的文字。","The height of the bitmap in pixels.":"像素中位图的高度。","Value of the Y offset field of the new matrix.":"新矩阵的Y偏移字段的值。"," object that identifies the culture. The value is a description information string.":"识别文化的对象。 该值是描述信息字符串。"," if the collection is read only; otherwise ":"如果收集仅读取； 否则","The image to draw.":"要绘制的图像。","Value of the Z offset field of the new matrix.":"新矩阵的Z偏移字段的值。","The width of the bitmap in pixels.":"像素中的位图的宽度。","The zero-based index position of the object to get or set.":"对象的基于零的索引位置要获得或设置。","The region in which to draw ":"绘画的区域"," object that contains key/value pairs that represent designer information. The key is a ":" 包含表示设计器信息的键/值对的对象。 关键是一个 ","Value of the (4,4) field of the new matrix.":"新矩阵的(4,4)字段的值。"," object that identifies the culture. The value is a designer information string.":"识别文化的对象。 该值是设计师信息字符串。"," object at the ":"对象在","The clock with which to animate the rectangle's size and dimensions, or ":"为了使矩形的大小和尺寸动画的时钟或","The width of the bitmap in device-independent units (1/96th inch per unit).":"位图的宽度，单位与设备无关（每单位1/96英寸）。","Matrix to append.":"矩阵以附加。","The pen to stroke the line.":"笔触的笔。","The location that contains the fonts.":"包含字体的位置。"," object that identifies the culture. The value is a string that references a designer URL.":"识别文化的对象。 该值是引用设计师URL的字符串。","The start point of the line.":"线的起点。","Bitmap stream to decode.":"位图流来解码。"," objects that represent the fonts in ":"表示字体中的对象","Object to test for equality.":"对象测试平等。"," that indicates whether the matrices are equal.":"这表明矩阵是否相等。","Initialization options for the bitmap image.":"位图图像的初始化选项。","The clock with which to animate the start point of the line, or ":"为了使行的起点动画的时钟或"," object that contains key/value pairs that represent offsets for the glyphs. The key is a ":"包含表示字形偏移的键/值对的对象。 关键是","The base URI value of the location of the fonts.":"字体位置的基本URI值。","The Matrix3D to which to compare.":"与之比较的Matrix3D。","The end point of the line.":"线的终点。"," objects that represent the fonts in the resolved font location.":"表示已解决字体位置中字体的对象。","The cache method to use for the bitmap image.":"用于位图图像的缓存方法。"," that represents the offset value.":" 即表示偏移值。","The first Matrix3D to compare.":"第一个比较的矩阵3D。","The clock with which to animate the end point of the line, or ":"为了使行的终点动画的时钟，或"," values that represents the font embedding permission":"表示字体嵌入权限的值"," that identifies the bitmap to decode.":"这标识了要解码的位图。"," objects that represent the fonts in the system fonts collection.":"表示系统字体集合中字体的对象。","The second Matrix3D to compare.":"比较的第二个Matrix3d。"," object that contains key/value pairs that represent face name information. The key is a ":"包含表示面部名称信息的键/值对的对象。 关键是","The pen with which to stroke the line.":"用笔触的笔。","The text to be displayed.":"要显示的文字。","Integer that specifies the hash code for this matrix.":"整数指定此矩阵的哈希代码。","The source bitmap that is being cached.":"正在缓存的源位图。"," object that identifies the culture. The value is a string containing the face name.":"识别文化的对象。 该值是包含面部名称的字符串。","The brush with which to fill the rectangle.  This is optional, and can be ":"用刷子填充矩形的刷子。 这是可选的，可以","Matrix to multiply.":"矩阵繁殖。","The specific culture of the text.":"文本的特定文化。","Specifies how the bitmap is cached to memory.":"指定位图如何缓存到内存。"," object that contains key/value pairs that represent family name information. The key is a ":"包含表示姓氏信息的键/值对的对象。 关键是","The pen with which to stroke the rectangle.  This is optional, and can be ":"用笔触矩形的笔。 这是可选的，可以"," that is converted.":"那是转换的。","The direction the text is read.":"文本读取的方向。"," object that identifies the culture. The value is a string containing the family name.":"识别文化的对象。 该值是包含姓氏的字符串。","Matrix by which the first matrix is multiplied.":"第一个矩阵乘以矩阵。","The rectangle to draw.":"矩形绘制。"," of the source bitmap.":"源位图。","The font family, weight, style and stretch the text should be formatted with.":"字体系列，重量，风格和伸展文本应格式化。","The URI for the ":"URI","The brush used to fill the rectangle.":"用来填充矩形的刷子。"," that is the result of multiplication.":"这是乘法的结果。"," of the converted bitmap.":"转换的位图。","The font size the text should be formatted at.":"字体大小应格式化文本。","The pen used to stroke the rectangle.":"用来抚摸矩形的笔。","The total number of glyphs.":"字形的总数。","The brush used to paint the each glyph.":"用来绘制每个字形的刷子。","A value that identifies the source bitmap that is converted.":"标识转换的源位图的值。"," that indicates whether the two matrix instances are equal.":"这表明两个矩阵实例是否相等。"," that indicates whether the two matrix instances are inequal.":"这表明两个矩阵实例是否不平等。","The font size for the text's em measure, provided in device-independent units (1/96th inch per unit).":"文本的EM度量的字体尺寸，以独立于设备的单位（每单位1/96英寸）提供。","The source for the bitmap. The default value is ":"位图的来源。 默认值是","The radius in the X dimension of the rounded corners.  This value will be clamped to the range of 0 to ":"圆角的X尺寸的半径。 该值将夹紧到0到0的范围"," value that represents the height of the character cell.":"代表字符单元的高度的值。","The Pixels Per Density Independent Pixel value, which is the equivalent of the scale factor. For example, if the DPI of a screen is 120 (or 1.25 because 120/96 = 1.25) , 1.25 pixel per density independent pixel is drawn. DIP is the unit of measurement used by WPF to be independent of device resolution and DPIs.":"每个密度独立像素值的像素值等效于量表因子。 例如，如果屏幕的DPI为120（或1.25，因为120/96 = 1.25），则绘制每密度独立像素的1.25像素。 DIP是WPF用来独立于设备分辨率和DPI的测量单位。","String representation of the Matrix3D.":"MATRIX3D的字符串表示。","The rectangular area that the bitmap is cropped to. The default is ":"位图的矩形区域。 默认值为","/2.":"/2。"," object that contains key/value pairs that represent distance information for the glyphs. The key is a ":"包含表示字形距离信息的键/值对的对象。 关键是","The progress, expressed as a percentage, to which a bitmap has been downloaded. The returned value will be between 1 and 100.":"该进度以百分比表示，已下载了一个位图。 返回的值将在1到100之间。","The number substitution behavior to apply to the text.":"适用于文本的数字替换行为。","The radius in the Y dimension of the rounded corners.  This value will be clamped to a value between 0 to ":"圆角的y尺寸的半径。 该值将夹紧到0到0之间的值","Matrix3D structure represented by the string.":"MATRIX3D结构由字符串表示。"," object that contains key/value pairs font license information. The key is a ":"包含密钥/值对字体许可信息的对象。 关键是","The text to display.":"要显示的文字。","The brush used to fill the rectangle, or ":"用于填充矩形的刷子或"," object that identifies the culture. The value is a string that describes the font license information.":"识别文化的对象。 该值是描述字体许可信息的字符串。","Matrix to prepend.":"矩阵预处。","Specifies how numbers in text     are displayed, based on ":"指定基于文本中的数字的显示方式"," is an indexed format.":"是索引格式。"," for no fill.":"没有填充。"," to apply to the text.":"适用于文本。"," object that contains key/value pairs for the font manufacturer information. The key is a ":"包含字体制造商信息的密钥/值对的对象。 关键是","The alpha channel threshold for this ":"Alpha频道阈值"," that represents the rotation.":"这代表旋转。","Center ":"中心","The pen used to stroke the rectangle, or ":"用来抚摸矩形的笔或","he brush used to paint the each glyph.":"他用来画每个字形。",". The default value is 0.0.":"。 默认值为0.0。"," object that identifies the culture. The value is a string that describes the font manufacturer information.":"识别文化的对象。 该值是描述字体制造商信息的字符串。"," for no stroke.":"没有中风。","The formatting mode that affects how WPF displays text.":"影响WPF如何显示文本的格式模式。"," object that contains key/value pairs sample text information. The key is a ":"包含键/值对样本文本信息的对象。 关键是","The pixel format to apply to the bitmap. The default value is ":"像素格式适用于位图。 默认值是"," about which to rotate.":"关于哪个旋转。","/2":"/2","The top-left origin of the resulting geometry.":"最终的几何形状的最高起源。","Quaternion representing rotation.":"四季度代表旋转。"," object that identifies the culture. The value is a string that describes the sample text information.":" 标识区域性的对象。 值是描述示例文本信息的字符串。","The destination palette to apply to the bitmap. The default value is ":"要应用于位图的目标调色板。 默认值为 ","The clock with which to animate the rectangle's ":"为了使矩形动画的时钟"," object representation of the formatted text.":"格式文本的对象表示。","Vector3D by which to scale this Matrix3D structure.":"vector3d可以扩展此MATRIX3D结构。"," value that represents the font stretch.":"代表字体拉伸的值。","The bitmap stream to decode.":"位图流进行解码。"," value, or ":"值，或","Point3D about which to scale.":"点3D可以扩展。","The origin of the highlight region.":"高光区的起源。"," if bitmap metadata can be written successfully; otherwise, ":"如果可以成功写出位图元数据； 否则，"," that represents the strikethrough position.":"这代表了罢工位置。"," by which to scale this Matrix3D structure.":"通过其中扩展此Matrix3D结构。","The formatted text to be drawn.":"要绘制的格式化文本。"," that indicates the strikethrough thickness, expressed as a fraction of the font em size.":"这表明撞击厚度，表示为字体EM大小的一部分。"," if the image is flipped horizontally during encoding; otherwise, ":" 如果图像在编码期间水平翻转;否则, "," object that represents the highlight bounding box of the formatted text.":" 表示格式化文本的高亮边界框的对象。","String representation of this Matrix3D structure.":"此Matrix3D结构的字符串表示。","The location where the text is to be drawn.":"要绘制文本的位置。"," value that represents the style value.":"代表样式值的值。","The index of the initial character the highlight bounds should be obtained for.":"初始字符的索引应获得高光边界。"," if the image is flipped vertically during encoding; otherwise, ":"如果在编码过程中垂直翻转图像； 否则，","The media to draw.":"媒体要画。","Culture-specified formatting information.":"区域性指定的格式信息。","The number of characters the highlight bounds should contain.":"突出显示范围应包含的字符数。"," values that represents the style simulation for the font.":"代表字体样式仿真的值。","The quality level of the JPEG image. The value range is 1 (lowest quality) to 100 (highest quality) inclusive.":"JPEG图像的质量水平。 值范围为1（最低）至100（最高质量）。","String representation of this ":"字符串表示","The area in which to draw the media.":"吸引媒体的区域。"," if the font conforms to Unicode encoding; otherwise, ":"如果字体符合Unicode编码； 否则，","The degree to which the image is rotated.":"图像旋转的程度。"," object that represents the highlight bounding box of the formatted text substring.":"代表格式化文本基因的亮点边界框的对象。","Point3D to transform.":"点3D转换。"," object that contains key/value pairs that represent trademark notice information. The key is a ":"包含表示商标通知信息的密钥/值对的对象。 关键是","The clip region to apply to subsequent drawing commands.":"剪辑区域适用于后续的绘图命令。",". This property has no default value. If the late bound decoder is still downloading, this property returns ":"。 该属性没有默认值。 如果晚期的解码器仍在下载，则此属性返回","An array of maximum text widths, each width provided in device-independent units (1/96th inch per unit).":"最大文本宽度的数组，每个宽度都以独立的单位（每单位1/96英寸）提供。"," that represents the embedded color profile of the bitmap. If no color profile has been defined, or if the ":"这代表了位图的嵌入式颜色曲线。 如果没有定义颜色配置文件，或者"," by this Matrix3D.":"通过此matrix3d。"," object that identifies the culture. The value is a string that the trademark notice information.":"识别文化的对象。 该值是商标通知信息的字符串。","The effect to apply to subsequent drawings.":"适用于后续图纸的效果。"," to use for text formatting.":"用于文本格式。"," is still downloading content, this property returns ":"仍在下载内容，此属性返回","The area to which the effect is applied, or ":"应用效果的区域，或"," value that represents the position of the underline.":"代表下划线位置的值。","Point3D objects to transform. The original points in the array are replaced by their transformed values.":"Point3D对象进行变换。 数组中的原始点由其转换后的值替换。","The start index of initial character to apply the change to.":"要应用更改的初始字符的开始索引。"," objects to transform. The original points in the array are replaced by their transformed values.":"要转换的对象。 数组中的原始点被其转换值所取代。"," is still downloading a bitmap, the underlying decoder is ":"仍在下载位图，基础解码器是"," if the effect is to be applied to the entire area of subsequent drawings.":"如果将效果应用于后续图纸的整个区域。"," object that contains key/value pairs that represent vendor URL information. The key is a ":"包含表示供应商URL信息的键/值对的对象。 关键是","The number of characters the change should be applied to.":"更改应应用于的字符数。"," object that identifies the culture. The value is a string that references a vendor URL.":"识别文化的对象。 该值是引用供应商URL的字符串。"," objects to transform. The original Vector3D objects in the array are replaced by their transformed values.":"要转换的对象。 数组中的原始vector3d对象被其转换值所取代。",". Otherwise, the underlying decoder is created on first access.":"。 否则，基础解码器将在首次访问时创建。","The guideline set to apply to subsequent drawing commands.":"该指南设置为应用于后续的绘图命令。","A string that constructs the ":"构造的字符串"," that specifies the offset for transformation.":"这指定了转换的偏移。"," value that represents the version.":"代表版本的值。"," that is associated with this decoder. If the bitmap has no palette, or if the ":"这与该解码器有关。 如果位图没有调色板，或者","The opacity factor to apply to subsequent drawing commands. This factor is cumulative with previous ":"适用于后续绘图命令的不透明因素。 这个因素是累积的，以前"," to use for text formatting. Fallbacks are permitted; for details, see ":"用于文本格式。 允许后备； 有关详细信息，请参阅"," if the Matrix3D structure has an inverse; otherwise, ":"如果matrix3d结构具有逆； 否则，"," that represents the global preview of the bitmap. If no preview is defined, or if the ":"这代表了位图的全局预览。 如果没有定义预览，或者"," object that contains key/value pairs that represent version string information. The key is a ":"包含表示版本字符串信息的键/值对的对象。 关键是","The clock with which to animate the opacity value, or ":"为了使不透明度值动画的时钟或","The starting index of the initial character to apply the font family change to.":"将字体系列更改为最初字符的起始索引。"," object that identifies the culture. The value is a string that represents the version.":"识别文化的对象。 该值是代表版本的字符串。","The opacity mask to apply to subsequent drawings. The alpha values of this brush determine the opacity of the drawing to which it is applied.":"不透明度掩模适用于后续图纸。 该刷子的α值确定所应用图形的不透明度。","The identity Matrix3D.":"身份Matrix3d。"," that represents a thumbnail of the bitmap. If no thumbnail is defined, or if the ":"这代表了位图的缩略图。 如果没有定义缩略图，或者","The number of characters the change should apply to.":"更改应适用的字符数。"," if the Matrix3D structure is affine; otherwise, ":"如果matrix3d结构是仿射的； 否则，","The transform to apply to subsequent drawing commands.":"适用于后续绘图命令的转换。","The horizontal DPI of the bitmap.":"位图的水平DPI。"," that represents the font weight.":"这代表字体重量。"," that you can use to describe the contents of this ":"您可以用来描述此内容的内容","The font 'em' measure size, provided in device-independent units (1/96th inch per unit).":"字体“ EM”度量大小，以独立的单位（每单位1/96英寸）提供。"," if the Matrix3D structure is an identity Matrix3D; otherwise, ":"如果matrix3d结构是一个身份matrix3d； 否则，","A modifiable clone of the current object. The ":"当前对象的可修改克隆。 这","The vertical DPI of the bitmap.":"位图的垂直DPI。"," object that contains key/value pairs that represent Win32 face name information. The key is a ":"包含表示Win32脸部名称信息的键/值对的对象。 关键是","The value of the first row and third column of this ":"第一行的值和第三列的值","The start index of the initial character to apply the font size to.":"初始字符的开始索引将字体大小应用于。"," property of the cloned object returns ":"克隆对象的属性返回","The format of the bitmap.":"位图的格式。"," object that identifies the culture. The value is a string that represents the Win32 face name.":"识别文化的对象。 该值是代表Win32脸部名称的字符串。"," object to be used as a bitmap.":"对象用作位图。","The value of the first row and fourth column of this ":"第一行的值和第四列的值"," even if the ":"即使是","The number of characters to apply the font size to.":"将字体大小应用到的字符数。"," object that contains key/value pairs that represent Win32 family name information. The key is a ":"包含表示Win32姓氏信息的键/值对的对象。 关键是","The value of the second row and third column of this ":"第二行和第三列的值","The caching method for the bitmap image.":"位图图像的缓存方法。"," object that identifies the culture. The value is a string that represents the Win32 family name.":"识别文化的对象。 该值是代表Win32姓氏的字符串。","The desired ":"所需"," property of the source is ":"来源的属性是","The value of the second row and fourth column of this ":"第二行和第四列的值",", which specifies the scale or rotation of the bitmap. The default value is ":"，指定位图的比例或旋转。 默认值是"," used to specify the location and color of the transition points in a gradient.":"用于指定梯度中过渡点的位置和颜色。"," value to use for text formatting.":"用于文本格式的价值。"," property of the cloned object is ":"克隆对象的属性是","Specifies how the colors in a gradient are interpolated. The default is ":"指定梯度中的颜色如何插值。 默认值为","The value of the third row and third column of this ":"第三行和第三列的值","The level of alpha data to discard when encoding the image. The value range is 0 (no data discarded) to 4 (alpha channel completely discarded). The default is 1.  \n  \n ":"编码图像时要丢弃的alpha数据级别。 值范围为0（无数据丢弃）至4（完全丢弃的alpha通道）。 默认值为1。","The start index of the initial character to apply the font stretch to.":"初始字符的开始索引将字体伸展到。","The value of the third row and fourth column of this ":"第三行和第四列的值","The compression quality for a planar alpha channel image. A value of 1 is considered lossless, and increasing values result in higher compression ratios and lower image quality. The value range is 1 to 255. The default is 1.":"平面α频道图像的压缩质量。 值为1的值被认为是无损的，而增加值会导致更高的压缩比和较低的图像质量。 值范围为1至255。默认值为1。"," that can be used to describe the contents of this ":"可以用来描述此内容的内容"," objects associated with the brush, each of which specifies a color and an offset along the brush's gradient axis. The default is an empty ":"与刷子关联的对象，每个对象沿刷子的梯度轴指定颜色和偏移。 默认值为空","The value of the fourth row and fourth column of this ":"第四行和第四列的值"," to apply to this ":"适用于此"," if compressed domain operations can be used; otherwise, ":"如果可以使用压缩域操作； 否则，","The number of characters to apply the font stretch to.":"将字体伸展到的字符数量。"," value that specifies how the gradient brush's positioning coordinates are interpreted. The default is ":"指定如何解释梯度刷的定位坐标的值。 默认值为","The value of the fourth row and first column of this ":"第四行和第一列的值"," if the image is to be flipped horizontally; otherwise, ":"如果要水平翻转图像； 否则，","The start index of the initial character to apply the font style to.":"初始字符的开始索引将字体样式应用于。","The type of spread method used to paint the gradient. The default is ":"用于绘制梯度的传播方法的类型。 默认值为","The region where the ":"区域","The value of the fourth row and second column of this ":"第四行和第二列的值","The number of characters to apply the font style to.":"应用字体样式的字符数。"," if the image is to be flipped vertically; otherwise, ":"如果图像要垂直翻转； 否则，"," is applied and, optionally, the ":"被应用，可选地","The color value of the gradient stop.":"梯度停止的颜色值。","The value of the fourth row and third column of this ":"第四行和第三列的值"," to encode the image in frequency order; ":"以频率顺序编码图像；","The start index of the initial character to apply the typeface to.":"要应用字体的初始字符的开始索引。"," to use as input; or ":"用作输入； 或者","The location in the gradient where the gradient stop is placed.":"梯度放置梯度停止的位置。","ITypeDescriptorContext for this call.":"此调用的ItypedEscriptorContext。"," to encode the image by its spatial orientation. The default is ":"通过其空间取向编码图像。 默认值为","The number of characters to apply the typeface to.":"将字体应用到的字符数。","Type being queried for support.":"类型被查询以寻求支持。","A string representation of this object that contains its ":"该对象的字符串表示，其中包含其"," applies to the whole ":"适用于整体","The number of horizontal divisions to use during compression encoding. The value range is 0 to 4095. The default is 0.":"在压缩编码过程中要使用的水平划分数。 值范围为0至4095。默认值为0。"," if this converter can convert from the specified type; false otherwise.":"如果此转换器可以从指定类型转换； 否则为错误。","The font weight to use for text formatting.":"用于文本格式的字体重量。","Culture specific formatting information, or ":"文化特定格式的信息，或"," and uses the ":"并使用","The ITypeDescriptorContext for this call.":"此调用的ItypedEscriptorContext。"," if overlap is ignored; otherwise, ":"如果重叠被忽略； 否则，","The start index of the initial character to apply the font weight to.":"初始字符的启动索引将字体重新施加到。"," as its input. The default is ":"作为其输入。 默认值为","The color of the gradient stop. The default value is ":"梯度停止的颜色。 默认值是","The Type being queried for support.":"该类型被询问支持。","The level of image data to discard during a compressed domain encoding of the image. The value range is 0 (no data discarded) to 3 (HighPass and LowPass discarded). The default is 1.  \n  \n ":"在图像的压缩域编码期间要丢弃的图像数据级别。 值范围为0（无数据丢弃）至3（高通和低通丢弃）。 默认值为1。","The number of characters to apply the font weight to.":"将字体重量施加到的字符数。"," objects in this ":"其中的对象","The image quality level. The range is 0 to 1.0 (lossless image quality). The default is 0.9.":"图像质量水平。 范围为0至1.0（无损图像质量）。 默认值为0.9。","The relative location of this gradient stop along the gradient vector. The default value is 0.0.":"该梯度沿梯度向量的相对位置。 默认值为0.0。"," if this converter can convert to the provided type; false if not.":" 如果此转换器可以转换为提供的类型;如果没有，则为false。",". The default is an empty ":"。 默认值为空","The brush to use for the text foreground.":"用于文本前景的刷子。","The collection to copy.":"要复制的集合。","The CultureInfo which is respected when converting.":"转换时受到尊重的培养。"," if the image is encoded with an additional interleaved alpha channel; ":"如果图像是用额外的交织α通道编码的；"," that is used to clip this ":" 这是用来剪辑这个 ","The one-dimensional array that is the destination of the items copied from the ":"一维数组是从","The start index of the initial character to apply the foreground brush to.":"要应用前景画笔的初始字符的开始索引。"," if planar alpha channel is used. The default is ":"如果使用平面α通道。 默认值为","The object to convert to an instance of Matrix3D.":"转换为matrix3d实例的对象。","A value between 0 and 1, inclusive, that describes the opacity of this ":"一个介于0和1之间的值，包括描述此不透明度的值 ","The index if the object was found; otherwise, ":"如果发现对象，则索引； 否则，","The number of characters to apply the foreground brush to.":"将前景刷的字符数。"," to use lossless compression; otherwise, ":"使用无损压缩； 否则，","Matrix3D that was constructed.":"构建的matrix3d。"," that describes the opacity of this ":"描述了这种不透明性","Number substitution behavior to apply to the text; can be ":"适用于文本的数字替代行为； 可","The overlap processing level. The default is 1.  \n  \n ":"重叠处理级别。 默认值为1。"," representation of the GradientStopCollection.":"梯度策略的表示。","The object to convert to an instance of ":"转换为实例的对象","The compression quality for the main image. A value of 1 is considered lossless, and higher values indicate a high compression ratio and lower image quality. The range is 1 to 255. The default is 1.":"主图像的压缩质量。 值为1的值被认为是无损的，较高的值表示高压比和较低的图像质量。 范围为1至255。默认值为1。",", in which case the default number substitution method for the text culture is used.":"，在这种情况下，使用了文本的默认编号替换方法。","The number of items in a ":"一个项目数量"," indicates that no opacity mask exists and the opacity is uniform. The default is ":"指示不存在不透明度掩模，并且不透明度是均匀的。 默认值为","The type to which the Matrix3D instance will be converted.":"Matrix3D实例将转换为的类型。","The start index of the initial character to apply the text decorations to.":"将文本装饰应用于初始字符的开始索引。","The rotation of the image.":"图像的旋转。","The transformation to apply to this ":"适用于此的转型"," of values that represent guide lines on the X-axis.":"代表X轴上指导线的值。","Object that was constructed.":"构造的对象。","The sub-sampling level for RGB image encoding. The range is 0 to 3. The default is 3.  \n  \n ":"RGB图像编码的子采样级别。 范围是0到3。默认值为3。","The drawing content for the ":"绘图内容","Specifies the camera's view matrix.":"指定相机的视图矩阵。"," of values that represent guide lines on the Y-axis.":"表示y轴上指导线的值。","The number of characters to apply the text decorations to.":"要应用文本装饰的字符数。"," if codec options are to be used; otherwise, ":"如果要使用编解码器选项； 否则，","The metadata of the ":"元数据","The distance from the top of the first line to the baseline of the first line, provided in device-independent units (1/96th inch per unit).":"从第一行的顶部到第一行的基线的距离，以独立的单位（每单位1/96英寸）提供。","Specifies the camera's projection matrix.":"指定相机的投影矩阵。","The visual to hit test.":"视觉到测试。","The distance from the topmost drawn pixel of the first line to the bottommost drawn pixel of the last line, provided in device-independent units (1/96th inch per unit).":"从第一行的最上方像素到以设备无关的单元（每单位1/96英寸）提供的最后一行的Bottommost绘制像素的距离。"," that specifies the projection transformation.":"这指定了投影转换。"," that represents the action resulting from the hit test.":"这代表了命中测试产生的动作。"," to hit test against.":"进行测试。","The number of vertical divisions to use during compression encoding. The value range is 0 to 4095. The default is 0.":"压缩编码时要使用的垂直分割数。 值范围为0到4095。 默认值为0。"," of the formatted text.":"格式的文字。"," value that represents the visual object that was hit.":"代表被击中的视觉对象的值。",", representing the ":"，代表"," that represents the position, look direction and up vector for the camera.":"这代表了相机的位置，外观和向量向量。","The desired width of the bitmap.":"位图的所需宽度。","The distance from the top of the first line to the bottom of the last line, provided in device-independent units (1/96th inch per unit).":"从第一行的顶部到最后一行的底部的距离，以独立的单位（每单位1/96英寸）提供。"," returned from a hit test.":"从热门测试中返回。"," value that represents a visual object that is returned from a hit test.":" 表示从命中测试返回的可视对象的值。","The desired height of the bitmap.":"位图的所需高度。","A Matrix3D that specifies the transform.":"指定转换的matrix3d。","The line spacing between lines of text, provided in device-independent units (1/96th inch per unit).":"文本线之间的线间距，以独立于设备的单位（每单位1/96英寸）提供。","Returns a value of type ":"返回类型的值","Gets a value of type ":"获得类型的值"," if the transform is affine; otherwise, ":"如果转换是仿射的； 否则，"," of the bitmap.":"位图。","The maximum number of lines to display.":"显示的最大线路数。"," property contains the visual that was hit.":"属性包含受击中的视觉效果。","A Matrix3D that specifies a 3-D transformation.":"一个指定3D转换的Matrix3D。"," that represents the collection of ":"代表收集"," to use for initialization.":"用于初始化。","The maximum height of a text column, provided in device-independent units (1/96th inch per unit).":"文本列的最大高度，以独立于设备的单位（每单位1/96英寸）提供。"," property contains the visual object that was hit.":"属性包含被命中的视觉对象。"," representation of the 3-D transformation.":"3-D转换的表示。","The width of the bevel. The default value is ":"斜角的宽度。 默认值是"," representing the area that changed. Dimensions are in pixels.":" 表示改变的区域。 尺寸以像素为单位。","The maximum text width for a line of text, provided in device-independent units (1/96th inch per unit).":"以独立单位（每单位1/96英寸）提供的文本线的最大文本宽度。"," that contains the normal vectors for the MeshGeometry3D.":"其中包含Meshseometry3d的正常向量。","The image to display.":"要显示的图像。","The curve of the bevel. The default value is ":"斜角的曲线。 默认值是","The minimum text width of the text source, provided in device-independent units (1/96th inch per unit).":"文本源的最小文本宽度，以独立于设备的单元（单位1/96英寸）提供。"," that represents the length of time to wait. A value of 0 returns immediately. A value of ":"这代表了等待的时间。 值为0的值立即返回。 一个值","The direction of the virtual light source. The valid range is from 0-360 (degrees) with 0 specifying the right-hand side of the object and successive values moving counter-clockwise around the object. The shadows of the bevel are on the opposite side of where the light is cast. The default value is ":"虚拟光源的方向。 有效范围是从0-360（度），指定对象的右侧，连续的值绕对象逆时针移动。 斜角的阴影位于铸造光的相反一侧。 默认值是"," that contains the vertex positions of the MeshGeometry3D.":"其中包含meshseometry3d的顶点位置。","The distance from the bottom of the last line to the bottommost inked pixel, provided in device-independent units (1/96th inch per unit).":"从最后一行的底部到Bottommost墨水像素的距离，以独立的单位（每单位1/96英寸）提供。","The image displayed by this ":"显示的图像"," that contains the texture coordinates for the MeshGeometry3D.":"其中包含Meshseometry3d的纹理坐标。","The height of the relief of the bevel. The valid range is between ":"斜角的浮雕高度。 有效范围是"," blocks indefinitely.":"无限期阻止。","The maximum distance from the leading alignment point to the leading drawn pixel of a line, provided in device-independent units (1/96th inch per unit).":"从领先的对准点到线线绘制像素的最大距离，以独立的单位（每单位1/96英寸）提供。","Source of the image that is drawn.":"绘制图像的来源。","The rectangle of the ":"矩形"," having the most relief (darkest shadows). The default value is ":"拥有最大的缓解（最黑暗的阴影）。 默认值是","The maximum distance from the trailing inked pixel to the trailing alignment point of a line, provided in device-independent units (1/96th inch per unit).":"从尾墨像素到线路的尾部对齐点的最大距离，该线路以独立的单位（每单位1/96英寸）提供。","Collection that contains the triangle indices of the MeshGeometry3D.":"包含MeshGeometry3D的三角形索引的集合。","Defines the rectangular area in which the image is drawn.":"定义绘制图像的矩形区域。","The pixel array used to update the bitmap.":"用于更新位图的像素数组。","Value indicating how smooth the bevel shadows are. The valid range is between ":"值表示斜角阴影的光滑程度。 有效范围是","The source of the image. The default value is null.":"图像的来源。 默认值为null。","The string of text to be displayed.":"要显示的文本字符串。","A string representation of the Model3D.":"模型3D的字符串表示。","The stride of the update region in ":"更新区域的大步"," being the smoothest. The default value is ":"是最顺利的。 默认值是","The region in which the image is drawn. The default is ":"绘制图像的区域。 默认值为"," values that specifies the alignment of text within a ":"指定文本对齐的值"," bounding box for the model.":"模型的边界框。","A handle to an IMILBitmapEffect object.":"imilbitmapeffect对象的手柄。","The input buffer offset.":"输入缓冲区偏移。","Width of the bitmap, in dots per inch.":"位图的宽度，每英寸点。"," set on the model. The default value is ":"设置模型。 默认值是"," values that specifies how the omission of text is indicated. The default is ":"指定如何指示文本的省略的值。 默认值为","Width of the bitmap, in pixels.":"位图的宽度，以像素为单位。","The rectangle in ":"矩形在","A handle to the unmanaged effect clone.":"无管理效果克隆的手柄。","The input buffer used to update the bitmap.":"用于更新位图的输入缓冲区。","The width between the leading and trailing alignment points of a line, excluding any trailing white-space characters. Provided in device-independent units (1/96th inch per unit).":"线路的领先和尾随对准点之间的宽度，不包括任何尾随的白色空间字符。 以独立的单位（每单位1/96英寸）提供。","Collection with which to instantiate the Model3DCollection.":"收集该集合以实例化模型3汇总。","The natural size of the bitmap in MIL Device Independent Pixels (DIPs, or 1/96\").":"MIL设备独立像素（DIPS或1/96“）中位图的自然大小。","The input to apply the effect to.":"将效果应用于的输入。","The width between the leading and trailing alignment points of a line, including any trailing white-space characters. Provided in device-independent units (1/96th inch per unit).":"线路的领先和尾随对齐点之间的宽度，包括任何尾随的白色空间角色。 以独立的单位（每单位1/96英寸）提供。","The stride of the input buffer, in bytes.":"输入缓冲区的步幅，字节。","Integer that specifies the capacity of the Model3DCollection.":"指定Model3DCollection容量的整数。"," instance used to process this instance.":"实例用于处理此实例。","The destination x-coordinate of the left-most pixel in the back buffer.":"后缓冲区中最左边像素的目标X坐标。"," with the effect applied to the input.":"效果应用于输入。","The height of the image.":"像的高度。",", the specified Model3D, is in this Model3DCollection; otherwise, ":"，指定的model3d在此Model3DCollection中； 否则，","A string representation of this instance, based on ":"基于此实例的字符串表示","The metadata associated with the image.":"与图像关联的元数据。","The destination y-coordinate of the top-most pixel in the back buffer.":"后缓冲区中最高像素的目标Y坐标。","The outer IMILBitmapEffect wrapper to initialize.":"外imilbitmapeffect包装器要初始化。","The array that is the destination of the items copied from this Model3DCollection.":"是从此Model3Dcollection复制的项目的目标。","The bounding box to transform.":"边界框进行变换。","The inner IMILBitmapEffectPrimitive.":"内部imilbitmapeffectprimitive。","The size of the input buffer.":"输入缓冲区的大小。","The width of the image in measure units (96ths of an inch).":"图像的宽度以度量单元（96英寸）为单位。","The Model3D to search for.":"搜索模型3D。"," that points to the base address of the back buffer.":"这指向后缓冲区的基础地址。","The handle to the effect that contains the property to change.":"包含要更改属性的效果的句柄。","The smallest axis-aligned bounding box possible that contains the transformed ":"可能包含转换的最小轴对齐边界框","Type context information used to evaluate conversion.":"类型上下文信息用于评估转换。","The index position of the specified Model3D.":"指定模型3D的索引位置。","An integer indicating the number of bytes in a single row of pixel data.":"一个整数，指示单个像素数据中的字节数。","The name of the property to change.":"要更改的属性名称。","The desired type to evaluate the conversion to.":"评估转换为的所需类型。"," was transformed; otherwise, ":"被改造了； 否则，","The index position at which to insert the specified Model3D.":"插入指定型号3D的索引位置。","Type context information used for conversion.":"类型上下文信息用于转换。","The string that is converted to an ":"转换为 ","The value to use to set the property.":"用于设置属性的值。","The Model3D to insert.":"插入的型号3D。","An inverse of this instance, if possible; otherwise ":"如果可能的话，这个实例的逆函数；否则 "," values contained in the ":"在","The Model3D to remove from this collection.":"从此集合中删除的model3d。"," if value can be converted; otherwise, ":"如果可以转换值； 否则，","Initial object in the new collection class.":"新收藏类中的初始对象。","The handle to the effect that contains the properties to update.":"包含要更新属性的效果的句柄。"," can convert to ":"可以转换","String value to convert into an ":"字符串值转换为"," objects that the collection is initially capable of storing.":"该集合最初能够存储的对象。","The collection used for initialization.":"用于初始化的集合。","The index position of the Model3D to remove.":"模型3D的索引位置要删除。"," to add to the end of the ":"添加到结尾","The author of the codec.":"编解码器的作者。","Serialization information about the object.":"有关对象的序列化信息。","The zero-based index of the Model3D object to get or set.":"要获取或设置的Model3D对象的基于零的索引。","The initial capacity of the collection.":"集合的初始容量。","The transformed bounding box, which is the smallest axis-aligned bounding box possible that contains all the points in the original bounding box.":"转换的边界框，这是最小的轴对齐边界框，其中包含原始边界框中的所有点。","Context information about the serialized stream.":"有关序列化流的上下文信息。","The container format of the codec.":"编解码器的容器格式。","The bitmap effect to locate in the collection.":"位图效果要定位在集合中。","Returns true if the enumerator was successfully advanced to the next element; returns false if the enumerator has passed the end of the collection.":"如果枚举者成功地将枚举者提升到下一个元素，则返回true； 如果枚举者通过了集合的末尾，则返回false。"," objects that form this ":"形成这个的对象"," if the collection contains value; otherwise, ":"如果该集合包含值； 否则，","The error message used to initialize the exception.":"用于初始化异常的错误消息。","Current element in the collection.":"集合中的当前元素。","The device manufacturer of the codec.":"编解码器的设备制造商。","The inverse transform of this ":"逆变换","The collection index to begin coping.":"收集索引开始应对。","The device model of the codec.":"编解码器的设备模型。","The inner exception that caused this exception.":"导致此例外的内部例外。","Collection of ":"收集",", if it has an inverse; otherwise, ":"，如果它具有逆； 否则，","The effect to find in the collection.":"在集合中找到的效果。","An array of key/value pairs. The key is an object of type ":"键/值对的数组。 关键是类型的对象"," to render.":"渲染。","The file extensions associated with the codec.":"与编解码器相关联的文件扩展名。","The first geometry to combine.":"第一个结合的几何形状。",". The value is an associated string.":"。 该值是关联的字符串。","The index of the specified effect.":"指定效果的索引。","The friendly name of the codec.":"编解码器的友好名称。","The key/pair to locate. The key is an object of type ":"键/对定位。 关键是类型的对象","The index to insert the effect at.":"插入效果的索引。","The second geometry to combine.":"第二几何结合。","The specified effect to insert.":"指定的效果要插入。","One of the enumeration values that specifies how the geometries are combined.":"指定几何形状如何组合的枚举值之一。","The Multipurpose Internet Mail Extensions (MIME) types associated with the codec.":"与编解码器关联的多功能Internet邮件扩展（MIME）类型。"," if the collection contains the key/value pair; otherwise, ":" 如果集合包含键/值对；否则, ","The specification version of the codec.":"编解码器的规范版本。","A transformation to apply to the combined geometry, or ":"要应用于组合几何的变换，或 ","The effect to remove from the collection":"从集合中删除的效果"," if the codec supports animation; otherwise, ":"如果编解码器支持动画； 否则，","The index of the effect to remove.":"效果的索引要删除。","The combined geometry.":"组合几何形状。"," if the codec supports lossless of images; otherwise, ":"如果编解码器支持图像的无损； 否则，","The number of effects contained in the ":"效果的数量","The maximum bounds on the distance between points in the polygonal approximation of the geometries. Smaller values produce more accurate results but cause slower execution. If ":"几何近似值中点之间距离之间的最大边界。 较小的值会产生更准确的结果，但导致执行速度较慢。 如果"," values that specifies whether the tolerance factor is an absolute value or relative to the area of the geometry.":"指定公差因子是绝对值还是相对于几何区域的值。"}