{". The character encoding to use if encoding is not determined from file. Default is ":"。 如果未从文件确定编码，则使用编码的字符编码。 默认为"," expression.":"表达。","Required. String variable containing a type name used by the common language runtime.":"必需的。 字符串变量包含通用语言运行时使用的类型名称。","Evaluates a list of expressions and returns an ":"评估表达式列表并返回",". A string expression containing the name of the property or method on the object.":"。 字符串表达式包含对象上属性或方法的名称。"," is one-based.":"是一个基于一个。","The uniform scaling factor.":"均匀缩放系数。","The world matrix.":"世界矩阵。","The multiplicative identify matrix.":"乘法身份矩阵。"," object that is the destination of the ":"是目的地的对象"," object that contains the information required to serialize the ":"包含序列化信息的对象","A license key granted to this component.":"授予此组件的许可密钥。"," if the transaction was committed; otherwise, ":"如果交易是实施的； 否则，"," object with the specified source column name.":"具有指定源列名称的对象。"," to find.":"找到。","The number of bytes that the ":"字节数","int8x16_t vdupq_lane_s8 (int8x8_t vec, const int lane)":"int8x16_t vdupq_lane_s8（int8x8_t vec，const int lane）","The minimum send rate, in bytes-per-second, for the response.":"每秒字节的最小发送率用于响应。","A read-only span containing a character representing one of the following specifiers that indicates the exact format to use when interpreting ":"仅读取的跨度包含代表以下指示符之一的字符，该字符指示解释时要使用的确切格式"," objects to maintain. The default value is 0, which means there is no limit to the number of ":"要维护的对象。 默认值为0，这意味着没有限制","int _mm_extract_epi8 (__m128i a, const int imm8)":"int _mm_extract_epi8（__m128i a，const int inm8）","float32x2_t vfms_f32 (float32x2_t a, float32x2_t b, float32x2_t c)":"float32x2_t vfms_f32（float32x2_t a，float32x2_t b，float32x2_t c）"," objects representing the public and non-public methods defined on this type if ":"代表公共和非公共方法在此类型上定义的对象","The index position from the start of a collection.":"索引位置从集合开始。"," has received a signal; otherwise, ":"收到信号； 否则，","The workaround text string.":"解决文本字符串。"," that represents -1 milliseconds, to wait indefinitely.":"这代表-1毫秒，无限期地等待。"," object and represents the same point in time as the current ":"对象并表示与电流相同的时间点"," has received a signal; otherwise the method never returns.":"收到信号； 否则该方法永远不会返回。"," has received a signal; otherwise ":"收到信号； 否则","The array index of the object that satisfied the wait.":"满足等待的对象的数组索引。"," array containing the objects for which the current instance will wait. This array cannot contain multiple references to the same object (duplicates).":"包含当前实例等待的对象的数组。 此数组不能包含对同一对象（重复）的多个引用。"," if no object satisfied the wait and a time interval equivalent to ":"如果没有对象满足等待和等效的时间间隔"," array containing the objects for which the current instance will wait.":"包含当前实例等待的对象的数组。","The total length, in bytes, of the try block that includes this exception-handling clause.":"包含此例外处理子句的TRY块的总长度，字节。","The array index of the object that satisfied the wait, or ":"满足等待的对象的数组索引，或"," if the current instance receives a signal. If the current instance is never signaled, ":"如果当前实例收到信号。 如果当前实例从未发出信号，"," if the current instance receives a signal; otherwise, ":"如果当前实例收到信号； 否则，"," representing the native operating system handle.":"代表本地操作系统手柄。"," has passed.":"已通过。","The safe wait handle that wraps the native operating system wait handle.":"安全的等待手柄包裹本机操作系统等待手柄。"," never returns.":"永远不会回来。","A native operating system handle.":"本机操作系统手柄。"," representing the native operating system handle. The default is the value of the ":"代表本地操作系统手柄。 默认值是","A wait handle that encapsulates an operating system-specific object that waits for exclusive access to a shared resource.":"等待手柄封装了特定于操作系统的对象，该对象等待对共享资源的独家访问。","When this method returns, contains the number of excess days if any that resulted from wrapping during this addition operation.":"当此方法返回时，如果在此添加操作期间包装所产生的任何超过天数。","A time of day expressed in the number of 100-nanosecond units since 00:00:00.0000000.":"自00：00：00.0000000以来，每天的时间以100纳秒单位的数量表示。","An object whose value is the sum of the time represented by this instance and the number of minutes represented by value.":"一个对象的值是该实例表示的时间的总和，也是值代表的分钟数。","A number of whole and fractional hours. The value parameter can be negative or positive.":"整体和分数小时。 值参数可能为负或正值。","A signed number indicating the relative values of this instance and the value parameter.\n            Less than zero if this instance is earlier than value.\n            Zero if this instance is the same as value.\n            Greater than zero if this instance is later than value.":"指示此实例的相对值和值参数的签名数字。 \n             如果此实例早于值，则小于零。 \n             零，如果此实例与值相同。 \n             如果此实例晚于值，则大于零。"," object to extract the time of the day from.":"目的是从一天中的时间提取时间。","An object whose value is the sum of the time represented by this instance and the time interval represented by value.":"一个对象的值是该实例表示的时间的总和和值代表的时间间隔。","An object whose value is the sum of the time represented by this instance and the number of hours represented by value.":"一个对象的值是该实例表示的时间的总和和值代表的小时数。","The safe handle to wrap the operating system handle.":"安全的手柄包裹操作系统手柄。","A signed number indicating the relative values of this instance and the value parameter.\n\n- Less than zero if this instance is earlier than value.\n            \n- Zero if this instance is the same as value.\n            \n- Greater than zero if this instance is later than value.":"指示此实例的相对值和值参数的签名数字。 \n\n  - 如果此实例早于值，则小于零。 \n            \n  - 零，如果此实例与值相同。 \n            \n  - 如果此实例晚于值，则大于零。","A number of whole and fractional minutes. The value parameter can be negative or positive.":"整体和分数。 值参数可能为负或正值。"," object representing time of the day specified in the ":"代表一天中指定时间的对象","The millisecond (0 through 999).":"毫秒（0到999）。"," if value is an instance of ":"如果值是","The starting time of day, inclusive.":"一天中的起点，包括。","A":"一个","The culture-specific format information about ":"有关文化特定格式的信息"," if left and right do not represent the same time; otherwise, ":"如果左右与右代表相同的时间； 否则，","The time interval measured since midnight. This value has to be positive and not exceeding the time of the day.":"自午夜以来测得的时间间隔。 该值必须是积极的，并且不超过一天的时间。","The ending time of day, exclusive.":"一天中的结束时间，独家。","A span containing the time to convert.":"跨度包含转换时间。"," instance..":"实例..","The string to parse.":"绳子解析。","The format specifier that defines the required format of ":"定义所需格式的格式指定符",", if the time falls within the range, ":"，如果时间落在该范围内，"," object representing the time elapsed since midnight using the specified time span value.":"对象表示自午夜以来使用指定的时间跨度值以来经过的时间。","The culture-specific formatting information about ":"有关文化特定格式的信息","The elapsed time between ":"经过的时间","The string containing the time to parse.":"字符串包含分析时间。"," if left and right represent the same time; otherwise, ":"如果左和右代表同一时间； 否则，","A string containing a time to convert.":"一个包含一个转换时间的字符串。","A string representation of value of the current instance.":"当前实例的值的字符串表示。","The culture-specific formatting information.":"特定于文化的格式信息。","A string containing the time to convert.":"一个包含转换时间的字符串。","The memory span that contains the time to parse.":"包含分析时间的内存跨度。","A bitwise combination of the enumeration values that indicates the style elements that can be present in s for the parse operation to succeed, and that defines how to interpret the parsed date. A typical value to specify is ":"枚举值的位组合，指示了s中可以存在的样式元素，以使解析操作成功，并定义了如何解释解析日期。 指定的典型值是"," object spanning to the time specified in the current ":"对象跨越当前指定的时间","The span containing the time to parse.":"跨度包含分析时间。","The long time string representation of the current instance.":"当前实例的长时间字符串表示。","A string representation of the current instance as specified by the provider.":"提供者指定的当前实例的字符串表示。","A span containing the characters representing the time to convert.":"包含代表转换时间的字符的跨度。","A string containing the characters that represent a time to convert.":"一个包含代表转换时间的字符的字符串。","A standard or custom time format string.":"标准或自定义时间格式字符串。","The short time string representation of the current instance.":"当前实例的短时字符串表示。","When this method returns, contains the TimeOnly value equivalent to the time contained in s, if the conversion succeeded, or MinValue if the conversion failed. The conversion fails if the s parameter is empty string, or does not contain a valid string representation of a time. This parameter is passed uninitialized.":"当此方法返回时，包含与s中所包含的时间相等的时间值值，如果转换成功，或者如果转换失败，则是缩影。 如果S参数为空字符串或不包含时间的有效字符串表示，则转换会失败。 该参数通过非初始化。","A bitwise combination of enumeration values that defines how to interpret the parsed time. A typical value to specify is ":"枚举值的比重组合，定义了如何解释解析时间。 指定的典型值是"," value equivalent to the time contained in ":"相当于所包含的时间的价值","A string representation of the current instance with the specified format and the formatting conventions of the current culture.":"当前实例的字符串表示，带有指定格式和当前文化的格式约定。","A span containing the characters representing a time to convert.":"包含代表转换时间的字符的跨度。","The span containing the time to convert.":"跨度包含转换时间。"," is an empty string, or does not contain a valid string representation of a time. This parameter is passed uninitialized.":"是一个空字符串，或不包含一个时间的有效字符串表示。 该参数通过非初始化。"," object that contains contextual information about the source or destination. The ":"包含有关源或目的地的上下文信息的对象。 这"," instance representing its largest possible value.":"实例代表其最大的可能值。"," that represents its smallest possible value.":"这代表了其最小的价值。"," parameter is reserved for future use, and can be specified as ":"参数保留供将来使用，可以指定为"," is an empty string, or does not contain a time that correspond to the pattern specified in format. This parameter is passed uninitialized.":"是一个空字符串，或不包含与格式指定的模式相对应的时间。 该参数通过非初始化。"," parameter is an empty string, or does not contain a valid string representation of a time. This parameter is passed uninitialized.":"参数是一个空字符串，或不包含时间的有效字符串表示。 该参数通过非初始化。","A number representing the millisecond component of this ":"代表此的毫秒组成部分的数字","A number representing the seconds component of this instance.":"代表此实例的秒组件的数字。","Number of hours.":"小时数。","A new object that represents the value of this instance plus the value of ":"一个代表此实例值的新对象以及"," object that represents the same time interval as the current ":"代表与当前时间间隔相同时间间隔的对象","A number representing the minute component of this ":"一个代表此分量组件的数字","A number representing the number of ticks of this instance.":"一个代表此实例的刻度数的数字。","The first time interval to compare.":"比较的首次间隔。","Number of minutes.":"分钟数。"," represents the same time interval as this instance; otherwise, ":"表示与此实例相同的时间间隔； 否则，","The second time interval to compare.":"比较的第二个时间间隔。","Number of seconds.":"秒数。","A number of ticks that represent a time.":"许多代表时间的壁虱。"," object that contains serialized object data about the exception being thrown.":"包含有关抛出异常的序列化对象数据的对象。","A number of days, accurate to the nearest millisecond.":"几天，准确至最近的毫秒。","One of the following values.  \n  \n ":"以下值之一。","The value to be multiplied by.":"要乘以的价值。","An object that represents ":"代表的对象","Number of days.":"天数。","The value to be divided by.":"要划分的价值。"," instance divided by the value of ":"实例除以","A new object that represents the value of this instance multiplied by the value of ":"一个代表此实例值的新对象乘以","A number of hours accurate to the nearest millisecond.":"精确到最接近的毫秒的小时。","Number of milliseconds.":"毫秒数。","A new object that represents the value of this instance divided by the value of ":"代表此实例值的新对象除以","Divident or the value to be divided.":"股息或要分配的价值。","A new object with the same numeric value as this instance, but with the opposite sign.":"具有与本例相同数值的新对象，但具有相反的符号。","A time period expressed in 100-nanosecond units.":"以100纳秒单位表示的时间段。","A new value that represents result of division of ":"代表分裂结果的新价值","A number of milliseconds.":"许多毫秒。","A new value that represents result of division of this instance by the value of the ":"一个新值，代表了此实例的划分结果"," instance by the value of the ":"实例按值","The first time interval to add.":"首先要添加的时间间隔。","A new object whose value is the absolute value of the current ":"一个新对象，其值是当前的绝对值","The value to be multiplied.":"要乘以的价值。","A number of minutes, accurate to the nearest millisecond.":"几分钟，准确到最近的毫秒。","The time interval specified by ":"由","The second time interval to add.":"第二个时间间隔要添加。","A number of seconds, accurate to the nearest millisecond.":"一秒钟，准确至最近的毫秒。","A new object that represents the value of the specified ":"表示指定值的新对象"," is greater than the value of ":"大于价值","Dividend or the value to be divided.":"股息或要分配的价值。","A bitwise combination of enumeration values that defines the style elements that may be present in input.":"定义输入中可能存在的样式元素的枚举值的位组合。"," multiplied by the value of the specified ":"乘以指定的值"," is greater than or equal to the value of ":"大于或等于","A span containing the characters that represent the time interval to convert.":"包含表示要转换时间间隔的字符的跨度。","A new object that represents the value of ":"一个代表价值的新对象","An array of standard or custom format strings that defines the required format of ":"一系列标准或自定义格式字符串，该字符串定义了所需格式的","A time interval that corresponds to ":"与对应的时间间隔"," instance multiplied by the value of the specified ":"实例乘以指定的值"," is less than the value of ":"小于价值","When this method returns, contains an object that represents the time interval specified by ":"当此方法返回时，包含一个对象，表示由","A string that specifies the time interval to convert.":"一个指定要转换时间间隔的字符串。","The time interval to be subtracted.":"要减去的时间间隔。"," if the conversion failed. This parameter is passed uninitialized.":"如果转换失败。 该参数通过非初始化。"," is less than or equal to the value of ":"小于或等于","An object whose value is the result of the value of ":"一个对象，其值是值的结果","A span that specifies the time interval to convert.":"指定要转换的时间间隔的跨度。","A new time interval whose value is the result of the value of this instance minus the value of ":"一个新的时间间隔，其值是该实例值的结果减去值",". This operation returns ":"。 此操作返回","The time interval to be negated.":"否定的时间间隔。","A span containing the characters that represent a standard or custom format string that defines the acceptable format of ":"包含代表标准或自定义格式字符串的字符的跨度，该字符串定义了可接受格式的","A standard or custom ":"标准或习俗",", has an invalid format, represents a time interval that is less than ":"，具有无效格式，表示一个时间间隔","A standard or custom format string that defines the required format of ":"定义所需格式的标准或自定义格式字符串","An array of standard or custom format strings that define the acceptable formats of ":"一系列标准或自定义格式字符串，这些字符串定义可接受的格式","An object that has the same numeric value as this instance, but the opposite sign.":"具有与此实例相同的数值的对象，但符号相反。"," format string.":"格式字符串。","The day component of this instance. The return value can be positive or negative.":"此实例的一天组成部分。 返回值可能为正值或负数。","A bitwise combination of enumeration values that defines the style elements that may be present in ":"枚举值的位组合，该值定义了可能存在的样式元素",", or has at least one days, hours, minutes, or seconds component outside its valid range.":"，或在其有效范围之外至少有一天，小时，分钟或秒数。","The time interval to return.":"返回的时间间隔。"," value, as specified by ":"价值，指定","An array of standard or custom format strings that define the required format of ":"一系列标准或自定义格式字符串，这些字符串定义了所需格式的","A span containing the characters that represent a time interval to convert.":"包含代表要转换时间间隔的字符的跨度。"," structure. The return value ranges from -23 through 23.":"结构体。 返回值范围为-23至23。","The total number of days represented by this instance.":"此实例代表的天数。"," is in a daylight saving time period; otherwise, ":"在日光节省时间段； 否则，","A span containing the charactes that represent a standard or custom format string that defines the acceptable format of ":"包含代表标准或自定义格式字符串的字符的跨度，该字符串定义可接受格式"," structure. The return value ranges from -999 through 999.":"结构体。 返回值范围为-999至999。","A span containing the characters representing the time interval to convert.":"包含代表要转换时间间隔的字符的跨度。","The total number of hours represented by this instance.":"此实例代表的总小时数。","One or more enumeration values that indicate the style of ":"一个或多个指示样式的枚举值","The standard time zone name.":"标准时区名称。","A daylight saving time period.":"节省日光的时间段。"," structure. The return value ranges from -59 through 59.":"结构体。 返回值范围为-59至59。","The total number of milliseconds represented by this instance.":"该实例代表的毫秒总数。","The identifier of the source time zone.":"源时区的标识符。"," is in ":"在","The date and time to convert.":"转换日期和时间。","The second component of the current ":"电流的第二个组成部分","The Coordinated Universal Time (UTC).":"协调的通用时间（UTC）。","The time zone to convert ":"转换时区","A Coordinated Universal Time (UTC) time.":"协调的通用时间（UTC）时间。","The total number of minutes represented by this instance.":"此实例代表的总数。","The number of ticks contained in this instance.":"在这种情况下包含的壁虱数。","The date and time in the destination time zone. Its ":"目标时区的日期和时间。 它的","The date and time in the destination time zone.":"目标时区的日期和时间。"," object whose value is the local time that corresponds to ":"其值是当地时间的对象","The total number of seconds represented by this instance.":"此实例表示的秒数。","The time zone's identifier.":"时区的标识符。","The time zone of ":"时区","; otherwise, its ":"; 否则，它"," object whose value is the Coordinated Universal Time (UTC) that corresponds to ":"其值是协调的通用时间（UTC）的对象","The year that the daylight saving time period applies to.":"夏令时适用的一年适用。","The Coordinated Universal Time (UTC) that corresponds to the ":"协调的通用时间（UTC）与","The date and time in the destination time zone that corresponds to the ":"目标时区的日期和时间与","An object that represents the time difference between this time zone and Coordinated Universal Time (UTC).":"代表该时区和协调通用时间（UTC）之间时间差的对象。"," parameter. The ":"范围。 这"," object that represents the current local time zone.":"代表当前本地时区的对象。"," object that contains the start and end date for daylight saving time in ":"包含日期和结束日期的对象，用于节省日光的时间"," value's ":"价值","The daylight saving time zone name.":"节目保存时区名称。"," parameter in the source time zone.":"源时区中的参数。","The display name of the new time zone.":"新时区的显示名称。","The Coordinated Universal Time (UTC) offset from ":"协调的通用时间（UTC）偏移"," property is always set to ":"属性始终设置为"," object that represents the new time zone.":"代表新时区的对象。","The identifier of the destination time zone.":"目标时区的标识符。","The name of the new time zone's standard time.":"新时区的标准时间的名称。","A 32-bit signed integer that serves as the hash code for this ":"一个32位签名的整数，可作为哈希代码","An object that defines the end of daylight saving time.":"定义夏令时结束的对象。","String object holding the IANA ID which resulted from the Windows ID conversion.":"字符串对象保留由Windows ID转换产生的IANA ID。"," object that represents the time difference between this time zone and Coordinated Universal Time (UTC).":"代表该时区和协调通用时间（UTC）之间时间差的对象。","The new time zone.":"新时区。","An object that indicates the time difference between the current time zone's standard time and Coordinated Universal Time (UTC).":"指示当前时区的标准时间和协调通用时间（UTC）之间时间差的对象。","A read-only collection of ":"仅阅读的集合","An object that represents the new adjustment rule.":"代表新调整规则的对象。","The standard time name of the new time zone.":"新时区的标准时间名称。","The new time zone's standard time name.":"新时区的标准时间名称。","The effective date of the adjustment rule. If the value is ":"调整规则的生效日期。 如果值为","The display name for the time zone's daylight saving time.":"时区日光节省时间的显示名称。"," objects that augment the base UTC offset for a particular period.":"将基本UTC偏移的对象在特定时期内偏移。","The date and time to determine the offset for.":"确定偏移的日期和时间。","The daylight saving time name of the new time zone.":"新时区的日光节省时间名称。","The last date that the adjustment rule is in force. If the value is ":"调整规则有效的最后日期。 如果值为"," to discard any daylight saving time-related information present in ":"丢弃任何日光保存与时间相关的信息","An array that augments the base UTC offset for a particular period.":"一个扩大基本UTC偏移的数组。","The time zone's general display name.":"时区的一般显示名称。","An object that indicates the time difference between the two time zones.":"指示两个时区之间时间差的对象。"," with the new object; otherwise, ":"使用新对象； 否则，"," properties to obtain the correct daylight offset from Coordinated Universal Time (UTC). This value can range from -14 to 14.":"属性以从协调的通用时间（UTC）获得正确的日光抵消。 该值的范围从-14到14。","An object that indicates the time difference between Coordinated Universal Time (UTC) and the current time zone.":"表示协调通用时间（UTC）和当前时区之间时间差的对象。","The new time zone. If the ":"新时区。 如果是"," object that defines the annual transition from a time zone's standard time to daylight saving time.":"定义从时区的标准时间到日光节省时间的年度过渡的对象。","The time zone identifier.":"时区标识符。","The start of daylight saving time.":"夏令时的开始。","A second object to compare with the current ":"与当前相比的第二个对象",", the returned object has no daylight saving time data.":"，返回的对象没有保存时间数据。","The end of daylight saving time.":"夏令时的结束。","The time at which the time change occurs. This parameter corresponds to the ":"发生时间变化的时间。 此参数对应于"," if the two time zones have identical adjustment rules and an identical base offset; otherwise, ":"如果两个时区具有相同的调整规则和相同的基本偏移； 否则，","A second object to compare with the current object.":"与当前对象进行比较的第二个对象。","The time difference with the base UTC offset for the time zone during the adjustment-rule period.":"在调整规则期间，在时区的基本UTC偏移的时间差。","The new adjustment rule.":"新的调整规则。"," parameter is ambiguous; otherwise, ":"参数是模棱两可的； 否则，"," object that is equal to the current instance; otherwise, ":"等于当前实例的对象； 否则，"," parameter is ambiguous in the current time zone; otherwise, ":"参数在当前时区是模棱两可的。 否则，","An object that represents the local time zone.":"表示本地时区的对象。","The month in which the time change occurs. This parameter corresponds to the ":"发生时间变化的月份。 此参数对应于 ","The time zone identifier, which corresponds to the ":"时区标识符，对应于"," objects have equal values; otherwise, ":"对象具有相等的值； 否则，"," parameter is a daylight saving time; otherwise, ":"参数是日光节省时间； 否则，","The display name of the time zone's standard time.":"时区标准时间的显示名称。","The day of the month on which the time change occurs. This parameter corresponds to the ":"发生时间变化的那天。 此参数对应于"," is invalid; otherwise, ":"是无效的; 否则，","An object whose identifier is the value of the ":"标识符的对象是","A 32-bit signed integer that serves as the hash code for the current ":"一个32位签名的整数，用作当前的哈希代码"," if the time zone supports daylight saving time; otherwise, ":"如果时区支持日光节省时间； 否则，","Data about the time change.":"有关时间变化的数据。","The string representation of the serialized ":"序列化的字符串表示","The IANA time zone ID.":"IANA时区ID。"," instance representing the time difference.":"实例表示时间差。","An object that represents the Coordinated Universal Time (UTC) zone.":"代表协调通用时间（UTC）区域的对象。","The original serialized object.":"原始序列化对象。","The week of the month in which the time change occurs. Its value can range from 1 to 5, with 5 representing the last week of the month. This parameter corresponds to the ":"发生时间变化的月份一周。 它的价值范围从1到5，其中5个代表本月的最后一周。 此参数对应于"," value that indicates the end date of the adjustment rule.":"表示调整规则结束日期的值。","String object holding the Windows ID which resulted from the IANA ID conversion.":"字符串对象保留由IANA ID转换产生的Windows ID。","The effective date of the adjustment rule. If the value of the ":"调整规则的生效日期。 如果值的 ","The day of the week on which the time change occurs. This parameter corresponds to the ":"发生时间变化的一周的一天。 此参数对应于","An array of objects for this time zone.":"该时区的一系列对象。"," if the ID conversion succeeded, ":"如果ID转换成功，"," value that indicates when the adjustment rule takes effect.":" 指示调整规则何时生效的值。"," if the two objects have identical property values; otherwise, ":"如果两个对象具有相同的属性值； 否则，","An array of objects that represents possible Coordinated Universal Time (UTC) offsets that a particular date and time can be mapped to.":"代表可能协调的通用时间（UTC）偏移的一系列对象可以将特定日期和时间映射到。",", this is the first adjustment rule in effect for a time zone.":"，这是时区有效的第一个调整规则。","The Windows time zone ID.":"Windows时区ID。"," have identical values; otherwise, ":"具有相同的值； 否则，","The last date that the adjustment rule is in force. If the value of the ":"调整规则有效的最后日期。 如果价值","The week of the month in which the time change occurs.":"发生时间变化的月份一周。"," object that indicates the amount of time to add to the standard time changes as a result of the adjustment rule.":"对象表示由于调整规则而导致的标准时间更改的时间。","The ISO 3166 code for the country/region.":"国家/地区的ISO3166代码。"," have any different member values; otherwise, ":"具有任何不同的成员值； 否则，",", the adjustment rule has no end date.":"，调整规则没有结束日期。","The value of the only component of the tuple.":"元组的唯一组件的值。"," object that defines the annual transition from daylight saving time back to the time zone's standard time.":" 定义从夏时制到时区标准时间的年度转换的对象。","The day on which the time change occurs.":"发生时间变化的一天。","The value of the eighth component of the tuple.":"元组的第八组件的值。"," element at the specified position.":"指定位置的元素。","The time change that results from the adjustment. This value is added to the time zone's ":"调整导致的时间变化。 此值将添加到时区的 ","A tuple whose value is (":"一个值为价值的元组（","The day of the week on which the time change occurs.":"发生时间变化的星期几。","2, the number of elements in a ":"2，元素数量","The value of the first component of the tuple.":"元组的第一个组件的值。","An 8-tuple (octuple) whose value is (":"一个值为的8核（八核）"," property to obtain the correct daylight offset from Coordinated Universal Time (UTC). This value can range from -14 to 14.":"属性以从协调的通用时间（UTC）获得正确的日光偏移。 该值的范围从-14到14。","The value of the tuple's third component.":"元组第三个组件的值。"," if the time change rule is fixed-date; ":"如果时间更改规则是固定日期；","The value of the tuple's only component.":"元组唯一的组件的值。","The value of the second component of the tuple.":"元组的第二个组件的值。","An object that defines the start of daylight saving time.":"定义夏令时开始的对象。","An object that provides custom rules for comparison.":"提供自定义规则进行比较的对象。"," object's third component.":"对象的第三个组件。","A 2-tuple whose value is (":"一个价值为2的2核心（"," if the time change rule is floating-date.":"如果时间更改规则是浮动日期。"," object's sixth component.":" 物的第六组件。","The value of the third component of the tuple.":"元组的第三部分的值。"," can range from 0 to 2.":"可以从0到2。","A signed integer that indicates the relative position of this instance and ":"签名整数，指示此实例的相对位置和","The month in which the time change occurs.":"发生时间变化的月份。"," can range from 0 to 5.":"可以从0到5。","A 3-tuple whose value is (":"一个价值的三核心（","The time of day at which the time change occurs.":"一天中发生变化的时间。","3, the number of elements in a ":"3，元素数量"," in the sort order, as shown in the following table.  \n  \n ":"如下表所示，按顺序排序。","The value of the fourth component of the tuple.":"元组的第四个组件的值。","6, the number of elements in a ":"6，元素数量","The value of the fourth element.":"第四元素的值。","An object that defines the method to use to evaluate whether the two objects are equal.":"定义用于评估两个对象是否相等的方法的对象。","The value of the tuple's fourth component.":"元组的第四个分量的值。"," method calculates the hash code of the current ":"方法计算当前的哈希码","The value of the fifth element.":"第五元素的值。","The value of the tuple's seventh component.":"元组的第七组件的值。","A 4-tuple whose value is (":"一个4元组，其值为（"," object's fourth component.":"对象的第四个组件。"," object's single component.":"对象的单个组件。","The value of the sixth element.":"第六元素的值。","The value of the fifth component of the tuple.":"元组的第五部分的值。"," object's seventh component.":"对象的第七个组件。"," can range from 0 to 3.":"可以从0到3。","A 5-tuple whose value is (":"一个价值的5核心（","The value of the seventh element.":"第七元素的值。"," must be 0.":"必须是0。"," can range from 0 to 6.":"可以从0到6。","4, the number of elements in a ":"4、a中的元素个数 ","7, the number of elements in a ":"7，元素数量","The value of the sixth component of the tuple.":"元组的第六个组件的值。","1, the number of elements in a ":"1，元素数量","The value of the eighth element, or ":"第八元素的价值，或","Any generic ":"任何通用","The value of the ninth element, or ":"第九元素的价值，或","The value of the tuple's fifth component.":"元组的第五个分量的值。","The value of the tuple's first component.":"元组第一个组件的值。","A 6-tuple whose value is (":"一个6元组，其值为（"," object's fifth component.":"对象的第五个组件。","The value of the tenth element, or ":"第十个元素的价值，或"," object that contains the values of the tuple's remaining components.":"包含元组剩余组件的值的对象。","The value of the tuple's second component.":"元组第二个组件的值。","The value of the seventh component of the tuple.":"元组的第七个组件的值。"," object's remaining components.":"对象剩余的组件。"," can range from 0 to 4.":"可以从0到4。","The 11-element tuple to deconstruct into 11 separate variables.":"11个元素元组将其解构为11个单独的变量。","A 7-tuple whose value is (":"一个价值的7核心（"," object's first component.":"对象的第一个组件。","The 1-element tuple to deconstruct into a separate variable.":"1元素元组将其解构为单独的变量。","5, the number of elements in a ":"5，元素数量"," object's second component.":"对象的第二个组件。","The value of the eleventh element, or ":"第十一元素的价值，或","The value of the fifteenth element, or ":"第十五个元素的价值，或","The value of the single element.":"单个元素的值。","The value of the tuple's sixth component.":"元组第六个组件的值。"," can range from 0 to 1.":"可以从0到1。","The 12-element tuple to deconstruct into 12 separate variables.":"12个元素元组分解为12个单独的变量。","The 16-element tuple to deconstruct into 16 separate variables.":"16个元素元组分解为16个单独的变量。","The 10-element tuple to deconstruct into 10 separate variables.":"将10个元素元组解构为10个单独的变量。"," object's fifth  component.":"对象的第五个组件。","The value of the twelfth element, or ":"第十二个元素的价值或","The 5-element tuple to deconstruct into 5 separate variables.":"5个元素元组分解为5个单独的变量。","The value of the sixteenth element, or ":"第十六个元素的价值，或","The value of the first element.":"第一个元素的值。"," cannot be cast or converted to a ":"不能铸造或转换为","The 13-element tuple to deconstruct into 13 separate variables.":"13个元素元组分解为13个单独的变量。","The 17-element tuple to deconstruct into 17 separate variables.":"17个元素元组分解为17个单独的变量。","The value of the second element.":"第二个元素的值。","The 6-element tuple to deconstruct into 6 separate variables.":"将6元素元组解构为6个单独的变量。","The delegate that compares the interfaces against ":"将接口与","The value of the thirteenth element, or ":"第十三个元素的价值，或","The value of the third element.":"第三元素的值。","The value of the seventeenth element, or ":"第十七个元素的价值，或","The 7-element tuple to deconstruct into 7 separate variables.":"7元素元组分解为7个单独的变量。","The search criteria that determines whether an interface should be included in the returned array.":"确定是否应将接口包含在返回的数组中的搜索标准。","The 14-element tuple to deconstruct into 14 separate variables.":"将14个元素元组解构为14个单独的变量。"," that match the filter criteria.":"符合过滤器标准。","The 18-element tuple to deconstruct into 18 separate variables.":"18个元素元组分解为18个单独的变量。","The 8-element tuple to deconstruct into 8 separate variables.":"8元元组将其解构为8个单独的变量。"," objects representing a filtered list of the interfaces implemented or inherited by the current ":"代表当前实现或继承的接口的过滤列表的对象","An integer that contains the number of dimensions in the current type.":"一个包含当前类型中尺寸数量的整数。","The 9-element tuple to deconstruct into 9 separate variables.":"9个元素元组将9个单独的变量解构为9个单独的变量。","The value of the fourteenth element, or ":"第十四个元素的价值，或","The value of the eighteenth element, or ":"第十八个元素的价值，或",", or an empty array if no interfaces matching the filter are implemented or inherited by the current ":"，或一个空数组，如果没有匹配过滤器的接口是由当前实现或继承的"," object representing the attribute set of the ":"代表属性集的对象","The value tuple instance to convert to a tuple.":"值元素实例转换为元组。","The 15-element tuple to deconstruct into 15 separate variables.":"15个元素元组分解为15个单独的变量。","The 19-element tuple to deconstruct into 19 separate variables.":"19个元素元组分解为19个单独的变量。","A bitwise combination of the enumeration values that indicates the type of member to search for.":"表明要搜索的成员的类型的枚举值的位组合。","An object that defines a set of properties and enables binding, which can involve selection of an overloaded method, coercion of argument types, and invocation of a member through reflection.  \n  \n -or-  \n  \n A null reference (":"定义一组属性并启用绑定的对象，该对象可以选择超载方法，强制参数类型以及通过反射调用成员。 \n  \n  -或者- \n  \n  null引用（","The converted tuple.":"转换后的元组。","The value of the nineteenth element, or ":"第十九个元素的价值，或"," (that is, Type[] types = Array.Empty{Type}()) to get a constructor that takes no parameters.\n            -or- ":" （即Type[]types=Array。Empty{Type}())获取不带参数的构造函数。\n            -或- "," in Visual Basic), to use the ":"在Visual Basic中），使用","A bitwise combination of the enumeration values that specify how the search is conducted.  \n  \n -or-  \n  \n ":"指定搜索方式的枚举值的位组合。 \n  \n  -或者-","The tuple object to convert to a value tuple.":"元组对象转换为值元组。","The 2-element tuple to deconstruct into 2 separate variables.":"2元素元组将其解构为2个单独的变量。","The delegate that does the comparisons, returning ":"进行比较的代表，返回"," objects representing the number, order, and type of the parameters for the desired constructor.  \n  \n -or-  \n  \n An empty array of ":"代表所需构造函数的数字，顺序和类型的对象。 \n  \n  -或者- \n  \n  一个空阵列","The object that specifies the set of rules to use regarding the order and layout of arguments, how the return value is passed, what registers are used for arguments, and the stack is cleaned up.":"指定有关参数顺序和布局的规则集，如何传递返回值，用于参数的寄存器以及堆栈清理的对象。","The converted value tuple instance.":"转换的值元组实例。","The 20-element tuple to deconstruct into 20 separate variables.":"20元元组将其解构为20个单独的变量。"," if the member currently being inspected matches the ":"如果当前正在检查成员，将匹配"," objects, to get a constructor that takes no parameters. Such an empty array is provided by the ":"对象，获取一个没有参数的构造函数。 这样的空数组由"," objects representing the number, order, and type of the parameters for the constructor to get.  \n  \n -or-  \n  \n An empty array of the type ":"代表构造函数的数字，顺序和类型的对象。 \n  \n  -或者- \n  \n  类型的空数组","The object whose underlying system type is to be compared with the underlying system type of the current ":"将基础系统类型与当前系统类型进行比较的对象","The value of the twentieth element, or ":"二十个元素的价值或","The search criteria that determines whether a member is returned in the array of ":"确定是否返回成员的搜索标准"," (that is, Type[] types = new Type[0]) to get a constructor that takes no parameters.":"（也就是说，类型[] type = new type [0]）获取不使用参数的构造函数。"," field ":"场地","The 21-element tuple to deconstruct into 21 separate variables.":"21元素元组将21个单独的变量解构。",". For the comparison to succeed, ":"。 为了比较成功，"," objects.  \n  \n The fields of ":"对象。 \n  \n  领域"," objects representing the attributes associated with the corresponding element in the ":"代表与相应元素关联的属性的对象","The value of the twenty-first element, or ":"二十一个元素的值，或"," must be able to be cast or converted to an object of type   ":"必须能够被铸造或转换为类型的对象","An object representing the public instance constructor whose parameters match the types in the parameter type array, if found; otherwise, ":"代表参数的对象，其参数匹配参数类型数组中的类型，如果找到； 否则，","A bitwise combination of the enumeration values that specify how the search is conducted.  \n  \n -or-  \n  \n":"指定搜索方式的枚举值的位组合。 \n  \n  -或者-"," can be used in conjunction with the ":"可以与"," if the underlying system type of ":"如果基础系统类型的类型"," array. The default binder does not process this parameter.":"大批。 默认活页夹不会处理此参数。","The 3-element tuple to deconstruct into 3 separate variables.":"3元元组将3个单独的变量解构。"," delegate supplied by this class.":"该课程提供的委托。","An object representing the constructor that matches the specified requirements, if found; otherwise, ":"代表与指定要求的构造函数的对象（如果找到）； 否则，"," objects representing all the public instance constructors defined for the current ":"代表所有为当前定义的公共实例构造函数的对象","A filtered array of ":"过滤的阵列"," (that is, Type[] types = new Type[0]) to get a constructor that takes no parameters.  \n  \n -or-  \n  \n ":"（也就是说，类型[] type = new type [0]）获取不使用参数的构造函数。 \n  \n  -或者-"," is the same as the underlying system type of the current ":"与电流的基础系统类型相同","The 4-element tuple to deconstruct into 4 separate variables.":"4元素元组将其解构为4个单独的变量。",", but not including the type initializer (static constructor). If no public instance constructors are defined for the current ":"，但不包括类型初始化器（静态构造函数）。 如果没有为当前定义公共实例构造函数"," objects of the specified member type.  \n  \n -or-  \n  \n An empty array if the current ":"指定成员类型的对象。 \n  \n  -或者- \n  \n  一个空数组，如果电流"," objects representing the attributes associated with the corresponding element in the parameter type array. The default binder does not process this parameter.":"代表与参数类型阵列中与相应元素关联的属性的对象。 默认活页夹不会处理此参数。"," represents a type parameter in the definition of a generic type or generic method.":"代表通用类型或通用方法的定义中的类型参数。"," if:\n  \n-   ":"如果： \n  \n  - ",".  \n  \n-   ":"。 \n  \n  - ",", or if the current ":"，或者当前"," does not have members of type ":"没有类型成员"," objects representing all default members of the current ":"代表当前所有默认成员的对象"," object representing the constructor that matches the specified requirements, if found; otherwise, ":"代表与指定要求相匹配的构造函数的对象（如果找到）； 否则，"," represents a type parameter in the definition of a generic type or generic method, an empty array of type ":"表示通用类型或通用方法的定义中的类型参数，一个类型的空数组",".  \n  \n -or-  \n  \n An empty array of type ":"。 \n  \n  -或者- \n  \n  一个空类型"," object representing a generic type from which the current type can be constructed.":"代表可以从中构造当前类型的通用类型的对象。","An object representing the method that matches the specified generic parameter count, argument types, modifiers and binding constraints, if found; otherwise, ":"代表与指定的通用参数计数，参数类型，修饰符和绑定约束的对象（如果找到）； 否则，","A bitwise combination of the enumeration values that specify how the search is conducted.  \n  \n-or-  \n  \n":"指定搜索方式的枚举值的位组合。 \n  \n -或者-","A bitwise combination of the enumeration values that specify how the search is conducted.\n            -or- Default to return ":"指定搜索方式的枚举值的位组合。 \n              - 或默认返回","The string containing the name of the interface to get. For generic interfaces, this is the mangled name.":"包含要获取的接口名称的字符串。 对于通用界面，这是被修理的名称。",", if the current ":"，如果电流","An object representing the public method whose parameters match the specified generic parameter count and argument types, if found; otherwise, ":"代表参数的对象，其参数匹配指定的通用参数计数和参数类型，如果找到； 否则，"," to return an empty array.":"返回一个空数组。","An array of Type objects representing the number, order, and type of the parameters for the constructor to get.\n            -or- An empty array of the type ":"代表构造函数的数字，顺序和类型的类型对象数组。 \n              - 或 - 类型的空数组"," does not have default members.":"没有默认成员。","An object representing the interface with the specified name, implemented or inherited by the current ":"代表与指定名称的接口的对象，由当前实现或继承","An object representing the public method that matches the specified generic parameter count, argument types and modifiers, if found; otherwise, ":"代表与指定的通用参数计数，参数类型和修饰符（如果发现）匹配的公共方法的对象； 否则，"," does not have properties, or if none of the properties match the binding constraints.":"没有属性，或者没有属性匹配绑定约束。"," objects representing all constructors defined for the current ":"代表所有为当前定义的构造函数的对象"," to ignore the case of that part of ":"忽略该部分的情况"," of the object encompassed or referred to by the current array, pointer, or reference type, or ":"当前数组，指针或参考类型或","The string containing the name of the public property to get.":"包含要获得的公共财产名称的字符串。","The string containing the name of the method to get.":"包含获取方法名称的字符串。"," that match the specified binding constraints, including the type initializer if it is defined. Returns an empty array of type ":"匹配指定的绑定约束，包括定义的类型初始化器。 返回一个空类型"," that specifies the simple interface name (the part that specifies the namespace must be correctly cased).  \n  \n -or-  \n  \n ":"这指定了简单的接口名称（指定名称空间的部分必须正确包装）。 \n  \n  -或者-","An object representing the method that matches the specified requirements, if found; otherwise, ":"代表与指定要求的方法（如果找到）的对象； 否则，"," is not an array or a pointer, or is not passed by reference, or represents a generic type or a type parameter in the definition of a generic type or generic method.":"不是数组或指针，也不是通过引用传递，也不是代表通用类型或通用方法的定义中的通用类型或类型参数。","An object representing the public property with the specified name, if found; otherwise, ":"一个代表公共财产的对象，带有指定名称（如果找到）； 否则，"," if no constructors are defined for the current ":"如果没有为当前定义构造函数"," to perform a case-sensitive search for all parts of ":"对案例敏感的搜索","The value whose name is to be retrieved.":"要检索的名称的值。"," objects representing the number, order, and type of the parameters for the method to get.  \n  \n -or-  \n  \n An empty array of ":"代表参数的数字，顺序和类型的对象，以获取该方法。 \n  \n  -或者- \n  \n  一个空阵列","The string containing the name of the property to get.":"包含要获取的属性名称的字符串。",", if none of the defined constructors match the binding constraints, or if the current ":"，如果没有定义的构造函数匹配绑定约束，或者当前"," objects representing the number, order, and type of the parameters for the method to get.\n            -or- An empty array of ":"代表参数的数字，顺序和类型的对象，以获取该方法。 \n              - 或 - 一个空阵列","The interface type to retrieve a mapping for.":"接口类型要检索映射的。","The name of the member of the current enumeration type that has the specified value, or ":"具有指定值的当前枚举类型的成员的名称，或","An object representing the property that matches the specified requirements, if found; otherwise, ":"代表与指定要求匹配的属性的对象（如果找到）； 否则，"," is not supplied, standard assembly resolution is performed.  \n  \n Caution   Do not pass methods from unknown or untrusted callers. Doing so could result in elevation of privilege for malicious code. Use only methods that you provide or that you are familiar with.":"未提供，执行标准组件分辨率。 \n  \n  注意不要通过未知或未经信任的呼叫者传递方法。 这样做可能会导致恶意代码的特权提升。 仅使用您提供的方法或熟悉的方法。","An object that represents the interface mapping for ":"代表接口映射的对象","An object representing the public method whose parameters match the specified argument types, if found; otherwise, ":"代表参数的对象，其参数匹配指定的参数类型，如果找到； 否则，","An array that contains the names of the members of the enumeration.":"包含枚举成员名称的数组。"," objects representing the number, order, and type of the parameters for the indexed property to get.  \n  \n -or-  \n  \n An empty array of the type ":"代表索引属性的参数的数字，顺序和类型的对象。 \n  \n  -或者- \n  \n  类型的空数组"," objects representing all the interfaces implemented or inherited by the current ":"代表当前实现或继承的所有接口的对象","A method that locates and returns the type that is specified by ":"一种定位并返回指定类型的方法","An object representing the public method that matches the specified requirements, if found; otherwise, ":"代表与指定要求相匹配的公共方法的对象（如果找到）； 否则，","The underlying type of the current enumeration.":"当前枚举的基本类型。"," (that is, Type[] types = new Type[0]) to get a property that is not indexed.":"（也就是说，类型[] type = new type [0]）获取未索引的属性。",", if no interfaces are implemented or inherited by the current ":"，如果没有由当前实现或继承的接口","The object that specifies the set of rules to use regarding the order and layout of arguments, how the return value is passed, what registers are used for arguments, and what process cleans up the stack.":"指定有关参数顺序和布局的规则集，如何传递返回值，用于参数的寄存器以及哪些过程清理堆栈的对象。"," from the assembly that is returned by ":"从返回的集会中","An array that contains the values. The elements of the array are sorted by the binary values (that is, the unsigned values) of the enumeration constants.":"包含值的数组。 数组的元素由枚举常数的二进制值（即无符号值）排序。"," objects representing the number, order, and type of the parameters for the method to get.\n\n-or-\n\nAn empty array of the type ":"代表参数的数字，顺序和类型的对象，以获取该方法。 \n\n -或者- \n\n 类型的空数组","The string containing the name of the public members to get.":"包含要获得公共成员名称的字符串。","An object representing the public property whose parameters match the specified argument types, if found; otherwise, ":"代表参数的对象，其参数匹配指定的参数类型，如果找到； 否则，","The string containing the name of an event that is declared or inherited by the current ":"字符串包含当前声明或继承的事件名称的字符串"," or by standard assembly resolution. If no assembly is provided, the ":"或通过标准组装分辨率。 如果没有提供组件，"," (that is, Type[] types = new Type[0]) to get a method that takes no parameters.\n\n-or-\n\n":"（也就是说，类型[] type = new type [0]）获取不采用参数的方法。 \n\n -或者-","An object representing the public property that matches the specified requirements, if found; otherwise, ":"代表与指定要求相匹配的公共财产的对象（如果找到）； 否则，"," objects representing the public members with the specified name, if found; otherwise, an empty array.":"代表公共成员的对象，具有指定名称（如果找到）； 否则，一个空数组。","The object representing the specified public event that is declared or inherited by the current ":"代表当前声明或继承的指定公共事件的对象",", arguments are not matched.":"，参数不匹配。"," method can provide one. The method also takes a parameter that specifies whether to perform a case-insensitive search; ":" 方法可以提供一个。 该方法还采用一个参数，该参数指定是否执行不区分大小写的搜索; ","An object that defines a set of properties and enables binding, which can involve selection of an overloaded member, coercion of argument types, and invocation of a member through reflection.  \n  \n -or-  \n  \n A null reference (":"定义一组属性并启用绑定的对象，该对象可以涉及选择超载成员，强制参数类型以及通过反射调用成员的对象。 \n  \n  -或者- \n  \n  null引用（","The string containing the name of the members to get.":"包含成员名称的字符串。"," objects representing the number, order, and type of the parameters for the method to get.  \n  \n -or-  \n  \n An empty array of the type ":"代表参数的数字，顺序和类型的对象，以获取该方法。 \n  \n  -或者- \n  \n  类型的空数组","The string containing the name of an event which is declared or inherited by the current ":"字符串包含事件的名称，该事件被当前声明或继承"," is passed to that parameter.  \n  \n Caution   Do not pass methods from unknown or untrusted callers.":"传递到该参数。 \n  \n  注意不要通过未知或未经信任的呼叫者传递方法。","The object representing the specified event that is declared or inherited by the current ":"代表当前声明或继承的指定事件的对象"," (that is, Type[] types = new Type[0]) to get a method that takes no parameters.  \n  \n -or-  \n  \n ":"（也就是说，类型[] type = new type [0]）获取不采用参数的方法。 \n  \n  -或者-","The assembly-qualified name of the type to get. See ":"要获取的类型的程序集限定名称。 见 "," objects representing all the public events which are declared or inherited by the current ":"代表当前声明或继承的所有公共事件的对象"," objects representing all the public members of the current ":"代表当前所有公共成员的对象","The type with the specified name, or ":"具有指定名称的类型，或"," objects representing all the public methods defined for the current ":"代表当前定义的所有公共方法的对象"," does not have public members.":"没有公共成员。",". If the type is in the currently executing assembly or in mscorlib.dll/System.Private.CoreLib.dll, it is sufficient to supply the type name qualified by its namespace.":"。 如果该类型在当前执行程序集中或mscorlib.dll/system.private.corelib.dll中，则足以提供由其名称空间资格的类型名称。"," if the type is not found.":"如果找不到类型。",", if no public methods are defined for the current ":"，如果没有为当前定义公共方法"," does not have public events.":"没有公共活动。"," objects representing all members defined for the current ":"代表当前定义的所有成员的对象","A bitwise combination of the enumeration values that specify how the search is conducted.\n\n-or-\n\n ":"指定搜索方式的枚举值的位组合。 \n\n -或者-","The type with the specified name, if found; otherwise, ":"带有指定名称的类型，如果找到； 否则，"," or by standard assembly resolution. If no assembly is provided, the method can provide one. The method also takes a parameter that specifies whether to perform a case-insensitive search; ":"或通过标准组装分辨率。 如果没有提供组件，则该方法可以提供一个。 该方法还采用一个参数，该参数指定是否执行不敏感的搜索；"," objects representing all methods defined for the current ":"代表当前定义的所有方法的对象"," that match the specified binding constraints.  \n  \n -or-  \n  \n An empty array if no members are defined for the current ":"匹配指定的绑定约束。 \n  \n  -或者- \n  \n  如果没有为当前定义成员，则一个空数组",", if no methods are defined for the current ":"，如果未针对当前定义方法"," objects representing all events that are declared or inherited by the current ":"代表当前声明或继承的所有事件的对象",". Specifying ":". 指定 "," or by standard assembly resolution. If no assembly is provided, the method can provide one. The method also takes a parameter that specifies whether to perform a case-insensitive search; the value of ":"或通过标准组装分辨率。 如果没有提供组件，则该方法可以提供一个。 该方法还采用一个参数，该参数指定是否执行不敏感的搜索； 的价值",", or if none of the defined members match the binding constraints.":"，或者如果没有定义的成员匹配绑定约束。"," that match the specified binding constraints.  \n  \n -or-  \n  \n An empty array of type ":"匹配指定的绑定约束。 \n  \n  -或者- \n  \n  一个空类型"," also suppresses some other exception conditions, but not all of them. See the Exceptions section.":"还抑制了其他一些例外情况，但并非全部。 请参阅“异常”部分。",", or if none of the defined methods match the binding constraints.":"，或者如果没有定义的方法匹配绑定约束。","An array of objects whose types to determine.":"一系列对象，其类型要确定。"," to find on the current ":"在电流上找到"," does not have events, or if none of the events match the binding constraints.":"没有事件，或者没有任何事件匹配绑定约束。","The string containing the name of the nested type to get.":"包含要获取的嵌套类型名称的字符串。","The type with the specified name. If the type is not found, the ":"带有指定名称的类型。 如果找不到类型，"," objects representing the types of the corresponding elements in ":"代表相应元素类型的对象","An object representing the public nested type with the specified name, if found; otherwise, ":"代表带有指定名称的公共嵌套类型的对象，如果找到； 否则，"," parameter specifies whether ":"参数指定是否","The type whose underlying type code to get.":"其基础类型代码获得的类型。","The string containing the name of the data field to get.":"包含要获取数据字段名称的字符串。","An object representing the member on the current ":"代表当前成员的对象","An object representing the nested type that matches the specified requirements, if found; otherwise, ":"代表与指定要求相匹配的嵌套类型的对象（如果找到）； 否则，"," is returned or an exception is thrown. In some cases, an exception is thrown regardless of the value of ":"返回或抛出例外。 在某些情况下，不管价值如何","An object representing the public field with the specified name, if found; otherwise, ":"一个代表公共字段的对象，具有指定名称（如果找到）； 否则，","The code of the underlying type, or ":"基础类型的代码，或"," objects representing the public types nested in the current ":"代表当前嵌套的公共类型的对象"," that matches the specified member.":"与指定成员匹配。",". See the Exceptions section.":"。 请参阅“异常”部分。","An object representing the field that matches the specified requirements, if found; otherwise, ":"代表与指定要求的字段的对象（如果找到）； 否则，","The type code of the underlying type.":"基础类型的类型代码。","The string containing the name of the public method to get.":"包含公共方法名称的字符串。"," (the search is not recursive), or an empty array of type ":"（搜索不是递归），或类型的空数组"," to perform a case-insensitive search for ":"进行案例不敏感的搜索"," objects representing all the public fields defined for the current ":"代表当前定义的所有公共字段的对象","The CLSID of the type to get.":"要获得的类型的clsid。","An object that represents the public method with the specified name, if found; otherwise, ":"用指定名称的公共方法的对象，如果找到； 否则，"," to perform a case-sensitive search for ":"进行病例敏感的搜索",", if no public fields are defined for the current ":"，如果没有为当前定义公共字段"," if no public types are nested in the current ":"如果当前没有公共类型","The number of generic type parameters of the method.":"该方法的通用类型参数的数量。","The name of the type to get. If the ":"要获得的类型的名称。 如果是"," to throw any exception that occurs.  \n  \n -or-  \n  \n ":" 以抛出发生的任何异常。  \n  \n -或-  \n  \n ","A bitwise combination of the enumeration values that specify how the search is conducted.\n\n-or-\n\n":"指定搜索方式的枚举值的位组合。 \n\n -或者-"," objects representing all fields defined for the current ":"代表当前定义的所有字段的对象"," objects representing all the types nested in the current ":" 表示当前嵌套的所有类型的对象 ","An object that defines a set of properties and enables binding, which can involve selection of an overloaded method, coercion of argument types, and invocation of a member through reflection.\n\n-or-\n\nA null reference (":"定义一组属性并启用绑定的对象，该对象可以选择超载方法，强制参数类型以及通过反射调用成员。 \n\n -或者- \n\n null引用（"," parameter is provided, the type name can be any string that ":" 提供了参数，类型名称可以是 "," to ignore any exception that occurs.":"忽略任何发生的例外。",", if no fields are defined for the current ":"，如果没有为当前定义字段"," that match the specified binding constraints (the search is not recursive), or an empty array of type ":"匹配指定的绑定约束（搜索不是递归）或类型的空数组"," is capable of resolving. If the ":"能够解决。 如果是","The server from which to load the type. If the server name is ":"从中加载类型的服务器。 如果服务器名称为","The object that specifies the set of rules to use regarding the order and layout of arguments, how the return value is passed, what registers are used for arguments, and how the stack is cleaned up.":"指定有关参数顺序和布局的规则集，如何传递返回值，用于参数的寄存器以及如何清理堆栈的对象。",", if no nested types are found that match the binding constraints.":"，如果找不到与绑定约束匹配的嵌套类型。"," objects representing the number, order, and type of the parameters for the method to get.\n\n-or-\n\nAn empty array of ":"代表参数的数字，顺序和类型的对象，以获取该方法。 \n\n -或者- \n\n 一个空阵列",", or if none of the defined fields match the binding constraints.":"，或者如果没有定义的字段匹配绑定约束。"," parameter is provided or if standard type resolution is used, ":"提供参数，或者如果使用标准类型分辨率，",", this method automatically reverts to the local machine.":"，此方法会自动恢复到本地计算机。"," must be an assembly-qualified name (see ":"必须是程序集限定名称（请参阅"," objects representing all public properties of the current ":"代表当前所有公共属性的对象","), unless the type is in the currently executing assembly or in mscorlib.dll/System.Private.CoreLib.dll, in which case it is sufficient to supply the type name qualified by its namespace.":"），除非类型在当前执行的汇编或mscorlib.dll/system.private.corelib.dll中，在这种情况下，足以提供由其名称空间资格的类型名称。","The object that refers to the type.":"引用类型的对象。"," objects (as provided by the ":"对象（如"," objects that represent the type arguments of a generic type. Returns an empty array if the current type is not a generic type.":"表示通用类型的类型参数的对象。 如果当前类型不是通用类型，则返回一个空数组。"," does not have public properties.":"没有公共财产。","The type referenced by the specified ":"指定的类型","A method that locates and returns the assembly that is specified in ":"定位并返回指定的组件的方法","An array of objects representing all properties of the current ":"代表当前所有属性的对象数组"," objects that represent the constraints on the current generic type parameter.":" 表示当前泛型类型参数的约束的对象。"," field) to get a method that takes no parameters.":" 字段）来获取不带参数的方法。"," property of ":"财产的",". The assembly name is passed to ":"。 大会名称传递给",". The current type is derived directly from ":"。 当前类型直接从"," is an array, a pointer, or is passed by reference; otherwise, ":"是一个数组，指针，或通过引用传递； 否则，"," array. To be only used when calling through COM interop, and only parameters that are passed by reference are handled. The default binder does not process this parameter.":"大批。 仅在通过COM Interop调用时使用，并且仅处理通过引用传递的参数。 默认活页夹不会处理此参数。","The ProgID of the type to get.":"要获得的类型。"," as an ":"作为一个"," if it inherits from ":"如果它继承了","The string containing the name of the constructor, method, property, or field member to invoke.  \n  \n -or-  \n  \n An empty string (\"\") to invoke the default member.  \n  \n -or-  \n  \n For ":"包含要调用的构造函数，方法，属性或字段成员名称的字符串。 \n  \n  -或者- \n  \n  一个空字符串（“”）以调用默认成员。 \n  \n  -或者- \n  \n  为了","The type associated with the specified ProgID, if ":"与指定的progid关联的类型，如果","An object representing the method that matches the specified generic parameter count, argument types, modifiers, binding constraints and calling convention, if found; otherwise, ":"如果找到，则表示与指定的泛型参数计数、参数类型、修饰符、绑定约束和调用约定匹配的方法的对象；否则, "," does not contain the name of an assembly, ":" 不包含程序集的名称, ","; the current type is derived indirectly from ":"; 当前类型是间接得出的"," members, a string representing the DispID, for example \"[DispID=3]\".":"成员，代表分配的字符串，例如“ [DESPID = 3]”。"," is a valid entry in the registry and a type is associated with it; otherwise, ":"是注册表中的有效条目，类型与之关联； 否则，"," is not called. If ":"不称呼。 如果","A bitwise combination of the enumeration values that specify how the search is conducted. The access can be one of the ":"指定搜索方式的枚举值的位组合。 访问可以是"," if it inherits from a succession of one or more classes that inherit from ":"如果它是从继承的一系列或多个继承的继承的"," if the type cannot be found; ":"如果找不到类型；","The type associated with the specified program identifier (ProgID), if ":"与指定程序标识符（ProgID）关联的类型，如果","The progID of the type to get.":"要获得的类型。"," is an interface that the current type implements.  \n  \n-   The current type is a generic type parameter, and ":"是当前类型实现的接口。 \n  \n  - 当前类型是通用类型参数，并且"," if the type cannot be found. Specifying ":"如果找不到类型。 指定"," represents an enumeration; otherwise, ":"代表枚举； 否则，"," such as ":"如",". If the type is not found, the ":"。 如果找不到类型，","The type associated with the specified program identifier (progID), if ":"与指定程序标识符（ProgID）关联的类型，如果"," represents one of the constraints of the current type.  \n  \n-   The current type represents a value type, and ":"代表当前类型的约束之一。 \n  \n  - 当前类型代表一个值类型，并且"," object represents a type parameter of a generic method definition; otherwise, ":"对象表示通用方法定义的类型参数； 否则，",", and so on. The type of lookup need not be specified. If the type of lookup is omitted, ":"， 等等。 查找类型不必指定。 如果省略了查找类型，"," representing the name of the current ":"表示当前的名称"," represents ":"代表"," object represents a type parameter of a generic type definition or generic method definition; otherwise, ":"对象表示通用类型定义或通用方法定义的类型参数； 否则，"," | ":"|","The progID of the ":"训练"," instance that describes the assembly containing the current type. For generic types, the instance describes the assembly that contains the generic type definition, not the assembly that creates and uses a particular constructed type.":"描述包含当前类型的组件的实例。 对于通用类型，该实例描述包含通用类型定义的程序集，而不是创建和使用特定构造类型的汇编。"," if the current type is a generic type; otherwise, ":"如果当前类型是通用类型； 否则，"," are used.":"被使用。"," can be hosted in a context; otherwise, ":"可以在上下文中托管； 否则，"," object represents a type parameter of a generic type definition; otherwise, ":"对象表示通用类型定义的类型参数； 否则，","The object for which to get the type handle.":"获取类型句柄的对象。",", which includes the name of the assembly from which the ":"，其中包括大会的名称",". Note that explicitly defining a ":"。 请注意，明确定义","The value to be tested.":"要测试的值。","The handle for the ":"手柄"," has a ":" 有一个 "," was loaded, or ":"被加载，或"," object may be required for successfully invoking method overloads with variable arguments.":"成功调用具有可变参数的过载可能需要对象。","The handle for the current ":"电流的手柄"," if the specified value is a member of the current enumeration type; otherwise, ":"如果指定值是当前枚举类型的成员； 否则，"," if the current instance represents a generic type parameter.":"如果当前实例表示通用类型参数。"," is an interface; otherwise, ":"是一个接口； 否则，","An array containing the arguments to pass to the member to invoke.":"一个包含参数传递给成员进行调用的阵列。","The COM type that is tested for equivalence with the current type.":"测试与当前类型的com类型。",", unless the ":"，除非","An object that contains the name of the class constructor for the ":"包含类构造函数的名称的对象 "," is nested inside another type; otherwise, ":"嵌套在另一种类型中； 否则，","An object representing the return value of the invoked member.":"代表调用成员的返回值的对象。"," if the COM types are equivalent; otherwise, ":"如果com类型是等效的； 否则，"," represents a generic type parameter, in which case the value is unspecified.":"代表通用类型参数，在这种情况下，值未指定。","The underlying system type for the ":"用于的基础系统类型"," is nested and visible only within its own assembly; otherwise, ":" 嵌套且仅在其自己的程序集中可见；否则, ","The object representing the globalization locale to use, which may be necessary for locale-specific conversions, such as converting a numeric ":"代表要使用的全球化语言环境的对象，这对于特定于语言环境的转换可能是必需的，例如转换数字","The message that describes the exception. The caller of this constructor must ensure that this string has been localized for the current system culture.":"描述异常的消息。 该构造函数的呼叫者必须确保该字符串已定位为当前系统文化。"," from which the current ":"从哪个电流"," if one type is in an assembly that is loaded for execution, and the other is in an assembly that is loaded into the reflection-only context.":"如果一种类型是在加载供执行的组件中，而另一个类型则在一个装配中，该组件被加载到仅反射上下文中。",".  \n  \n -or-  \n  \n A null reference (":"。 \n  \n  -或者- \n  \n  null引用（","The object with which to compare the current object.":"比较当前对象的对象。","The object to compare with the current type.":"与当前类型进行比较的对象。"," is nested and visible only to classes that belong to both its own family and its own assembly; otherwise, ":" 是嵌套的，并且只对同时属于它自己的家族和它自己的程序集的类可见；否则, "," directly inherits, or ":"直接继承，或"," in Visual Basic) to use the current thread's ":"在Visual Basic中使用当前线程的"," if this object is equal to the specified object; otherwise, ":"如果此对象等于指定的对象； 否则，"," is in the inheritance hierarchy of the object represented by ":"是在代表的对象的继承层次结构中"," represents the ":"代表"," is nested and visible only within its own family; otherwise, ":"仅在自己的家庭中被嵌套和可见； 否则，"," is an interface that ":"是一个接口","An object that defines a set of properties and enables binding, which can involve selection of an overloaded method, coercion of argument types, and invocation of a member through reflection.  \n  \n -or-  \n  \n A null reference (Nothing in Visual Basic), to use the ":"定义一组属性并启用绑定的对象，该对象可以选择超载方法，强制参数类型以及通过反射调用成员。 \n  \n  -或者- \n  \n  null引用（视觉基本中的任何内容），使用"," class or an interface.":"类或接口。","The hash code of this object.":"该对象的哈希代码。"," implements. ":"工具。"," object is itself a generic type parameter or has type parameters for which specific types have not been supplied; otherwise, ":"对象本身是一种通用类型参数或具有未提供特定类型的类型参数； 否则，"," is nested and visible only to classes that belong to its own family or to its own assembly; otherwise, ":" 是嵌套的，并且仅对属于其自己的族或属于其自己的程序集的类可见；否则, "," if neither of these conditions is the case, if ":"如果这些情况都没有，则","The value whose target's type is to be returned.":"目标类型要返回的值。"," array. A parameter's associated attributes are stored in the member's signature.  \n  \n The default binder processes this parameter only when calling a COM component.":" 阵列。 参数的关联属性存储在成员的签名中。  \n  \n 默认绑定程序仅在调用COM组件时处理此参数。"," is nested and declared private; otherwise, ":"被嵌套并宣布为私人； 否则，","The type of the target of the specified ":"指定目标的类型"," represents a type parameter of a generic method, a ":" 表示泛型方法的类型参数， "," is an open generic type (that is, ":"是一种开放的通用类型（即"," if the class is nested and declared public; otherwise, ":"如果班级被嵌套并宣布公开； 否则，"," object representing the globalization locale to use, which may be necessary for locale-specific conversions, such as converting a numeric String to a Double.  \n  \n -or-  \n  \n A null reference (":"代表要使用的全球化语言环境的对象，这对于特定于区域的转换可能是必需的，例如将数字字符串转换为double。 \n  \n  -或者- \n  \n  null引用（","An object that contains the field described by the first element of ":"一个包含由第一个元素描述的字段的对象"," is not declared public and is not a nested type; otherwise, ":"不是公开声明，也不是嵌套类型； 否则，"," that represents declaring method; otherwise, ":"这代表声明的方法； 否则，"," is marshaled by reference; otherwise, ":"通过参考来填写； 否则，","An array containing the names of the parameters to which the values in the ":"一个包含参数名称的数组","A list of field descriptions where each element describes a field that contains the field described by the succeeding element. Each described field must be a value type. The field descriptions must be ":"每个元素描述一个字段的字段描述列表，该字段包含继任元素描述的字段。 每个描述的字段必须是值类型。 字段描述必须是"," derives from ":"源自于","The type to compare with the current type.":"与当前类型进行比较的类型。"," is declared public and is not a nested type; otherwise, ":"被宣布为公开，不是嵌套类型； 否则，"," object representing the enclosing type, if the current type is a nested type; or the generic type definition, if the current type is a type parameter of a generic type; or the type that declares the generic method, if the current type is a type parameter of a generic method; otherwise, ":"如果当前类型是嵌套类型，则表示封闭类型的对象； 或通用类型定义，如果当前类型是通用类型的类型参数； 或声明通用方法的类型，如果当前类型是通用方法的类型参数； 否则，"," and the current ":"和电流","A reference to the default binder used by the system.":"对系统使用的默认活页夹的引用。"," objects supplied by the type system.":" 型系统提供的对象。"," if any of the following conditions is true:  \n  \n-   ":"如果以下任何条件是正确的： \n  \n  - "," is a value type; otherwise, ":"是值类型； 否则，"," for the field described by the last element of ":"对于由最后一个元素描述的字段"," is declared sealed; otherwise, ":" 被宣布为密封；否则, ","The fully qualified name of the type, including its namespace but not its assembly; or ":"该类型的完全合格的名称，包括其名称空间，而不是其组装； 或者"," and the current instance represent the same type.  \n  \n-   ":"当前实例代表相同的类型。 \n  \n  - "," is derived either directly or indirectly from the current instance. ":"直接或间接从当前实例得出。"," if the current instance represents a generic type parameter, an array type, pointer type, or ":"如果当前实例表示通用类型参数，数组类型，指针类型或","The target of the conversion.":"转换的目标。"," if the current type is security-critical or security-safe-critical at the current trust level; ":"如果当前类型在当前信托级别上是至关重要的或关键的安全安全；"," parameter in Visual Basic).":" Visual Basic中的参数）。"," if the current type is security-safe-critical at the current trust level; ":"如果当前类型在当前信托级别上是安全安全的；"," for which the type handle is requested.":"为此请求类型的手柄。"," is derived directly from the current instance if it inherits from the current instance; ":"如果当前实例从当前实例继承，则直接从当前实例派生；"," type based on a type parameter, or a generic type that is not a generic type definition but contains unresolved type parameters.":"类型基于类型参数或不是通用类型定义的通用类型，而是包含未解决的类型参数。","The typed parameter position.":"打字参数位置。","The internal metadata type handle for the specified ":"指定的内部元数据类型手柄"," is derived indirectly from the current instance if it inherits from a succession of one or more classes that inherit from the current instance.  \n  \n-   The current instance is an interface that ":"如果当前实例从当前实例继承，则是从当前实例中间接得出的。 \n  \n  - 当前实例是一个接口","The position of a type parameter in the type parameter list of the generic type or method that defines the parameter. Position numbers begin at 0.":"类型参数在定义参数的通用类型或方法的类型参数列表中的位置。 位置编号从0开始。"," if the type is security-transparent at the current trust level; otherwise, ":" 如果类型在当前信任级别是安全透明的；否则, ","A signature type object that can be passed into the ":"可以传递到的签名类型对象"," implements.  \n  \n-   ":"工具。 \n  \n  - ","An array of the generic type arguments for this type.":"此类型的通用类型参数的数组。"," is serializable; otherwise, ":"可以序列化； 否则，"," converted from a ":" 由一个 "," array parameter of a ":"阵列参数"," is a generic type parameter, and the current instance represents one of the constraints of ":" 是泛型类型参数，当前实例表示 ","The GUID associated with the ":"与","The fully qualified name of the type that fails to initialize.":"无法初始化的类型的完全合格的名称。"," is a signature type; otherwise, ":"是签名类型； 否则，","The fully qualified type name.":"完全合格的类型名称。"," represents a value type, and the current instance represents ":"表示值类型，当前实例代表"," method to represent a generic parameter reference.":"表示通用参数参考的方法。"," if the type has a name that requires special handling; otherwise, ":"如果该类型的名称需要特殊处理； 否则，"," is abstract; otherwise, ":" 是抽象的;否则, "," in Visual Basic).  \n  \n ":"在Visual Basic中）。","An unsigned integer to compare.":"一个无符号整数进行比较。","The generic type definition.":"通用类型定义。"," if the string format attribute ":"如果字符串格式属性"," if none of these conditions are true, or if ":"如果这些条件都不是真的，或者"," is an array type that can represent only a single-dimensional array with a zero lower bound; otherwise, ":" 是一个数组类型，只能表示一个具有零下限的单维数组；否则, ","A 16-bit unsigned integer to compare to this instance.":"与此实例相比，一个16位的无符号整数。"," is selected for the ":"被选为"," if any of the following conditions is true:  \n  \n-   The current instance and ":"如果以下任何条件是正确的： \n  \n  - 当前实例和","A generic signature type.":"通用签名类型。"," is a type definition; otherwise, ":"是类型定义； 否则，"," if the current type is an array; otherwise, ":"如果当前类型是数组； 否则，","A span containing the characters that represent the number to convert. The span is interpreted by using the style specified by the ":"包含代表要转换数字的字符的跨度。 跨度是通过使用指定的样式来解释的"," is an array type that can represent a multi-dimensional array or an array with an arbitrary lower bound; otherwise, ":"是一种数组类型，可以代表具有任意下限的多维数组或数组； 否则，"," represent the same type.  \n  \n-   The current type is derived either directly or indirectly from ":"表示相同的类型。 \n  \n  - 当前类型是直接或间接得出的","An array of types to be substituted for the type parameters of the current generic type.":"一个类型的数组被替换为当前通用类型的类型参数。","A 16-bit unsigned integer equivalent to the number specified in ":"16位未签名的整数等效于指定的数字"," property of the current type includes ":"当前类型的属性包括","The string representation of the value of this instance, which consists of a sequence of digits ranging from 0 to 9, without a sign or leading zeros.":"该实例的值的字符串表示，由一个范围为0到9的数字序列组成，没有符号或领先的零。"," to throw a ":"扔一个"," is a public type or a public nested type such that all the enclosing types are public; otherwise, ":" 是公共类型或公共嵌套类型，以便所有封闭类型都是公共的;否则, ","A string that represents the number to convert.":"表示要转换的数字的字符串。"," is a a byref-like structure; otherwise, ":"是一个类似Byref的结构； 否则，"," value indicating that this member is a type or a nested type.":"值表示该成员是一种类型或嵌套类型。","A 16-bit unsigned integer equivalent to the number contained in ":"16位未签名的整数等同于包含的数字","When this method returns, contains the 16-bit unsigned integer value equivalent to the number contained in ":"当此方法返回时，包含16位无符号整数值，该值相当于 ","A 32-bit unsigned integer equal to the value of this instance.":"等于此实例值的32位无符号整数。"," is a class; otherwise, ":" 是一个类；否则, ","The module in which the current ":"电流的模块","A string that represents the number to convert. The string is interpreted by using the style specified by the ":"表示要转换的数字的字符串。 字符串是通过使用由","When this method returns, contains the 16-bit unsigned integer value that is equivalent to the number contained in ":"当此方法返回时，包含16位未签名的整数值，等于","A 64-bit unsigned integer equal to the value of this instance.":"一个64位的无符号整数等于此实例的值。"," components.  \n  \n ":"成分。"," if the current instance has no namespace or represents a generic parameter.":"如果当前实例没有名称空间或表示通用参数。",", is not in the correct format. , or represents a number less than ":"，不是正确的格式。 ，或代表小于","A read-only span of characters containing a number to convert. The span is interpreted using the style specified by ":"只读字符的跨度跨度，其中包含要转换的数字。 使用由","The current value of this instance, converted to a ":"此实例的当前值转换为","The URI or a URI identifier to compare with the current instance.":"与当前实例进行比较的URI或URI标识符。","When this method returns, contains the unsigned native integer value equivalent of the number contained in ":"当此方法返回时，包含未签名的本机整数值等效于包含的数字","The current value of this instance, converted to an ":"此实例的当前值转换为","A value to compare to this instance.":"与此实例相比的值。","Gets a ":"得到一个"," if the two instances represent the same URI; otherwise, ":"如果两个实例代表相同的URI； 否则，","The size of a pointer or handle on this platform, measured in bytes. The value of this property is 4 on a 32-bit platform, and 8 on a 64-bit platform.":"该平台上指针或手柄的大小，以字节测量。 该属性的价值在32位平台上为4，在64位平台上的价值为8。","A 32-bit unsigned integer equivalent to the number specified in ":"一个32位未签名的整数等同于指定的数字","The value of this instance, converted to an ":"此实例的值转换为"," that describes the gross layout features of the current type.":" 这描述了当前类型的总体布局特征。","The string to escape.":"逃脱的绳子。","The exception that is not handled.":"未处理的例外。","The current value pf this instance, converted to a ":"此实例的当前值转换为","The string to check.":"要检查的字符串。"," if the runtime is terminating; otherwise, ":"如果运行时终止； 否则，","A string representing the number to convert.":"表示要转换的数字的字符串。","The escaped representation of ":"逃脱的代表","The current value of this instance, converted to ":"此实例的当前值转换为"," to check for hexadecimal encoding.":" 检查十六进制编码。","A 32-bit unsigned integer equivalent to the number contained in ":"一个32位未签名的整数等同于包含的数字","The unhandled exception object.":"未经处理的异常对象。","The string to transform to its escaped representation.":"将其转换为其逃脱的表示形式的字符串。","The current value of this instance, unchanged.":"此实例的当前值不变。"," is hexadecimal encoded at the specified location; otherwise, ":"是否在指定位置编码十六进制； 否则，","The escaped representation of the string.":"逃脱的字符串表示。","The source of the unhandled exception event.":"未经治疗事件的来源。","A string representing the number to convert. The string is interpreted by using the style specified by the ":"表示要转换的数字的字符串。 该字符串是通过使用由 ","URI fragment information.":"URI片段信息。"," if the specified character is a reserved character otherwise, ":"如果指定的字符是保留字符，则"," if the string was well-formed; otherwise, ":"如果字符串形成良好； 否则，"," class containing the information required to serialize the new ":"包含序列化的信息的类","The string representation of the value of this instance, consisting of a sequence of digits ranging from 0 to 9, without a sign or leading zeroes.":"该实例值的字符串表示，由一个范围为0到9的数字序列组成，没有符号或引导零。","The hexadecimal digit (0-9, a-f, A-F) to convert.":"十六进制数字（0-9，a-f，a-f）进行转换。","The host name. This is usually the DNS host name or IP address of the server.":"主机名。 这通常是服务器的DNS主机名或IP地址。"," class containing the source of the serialized stream associated with the new ":"包含与新的串行流的来源的类","The string used to attempt to construct a ":"用来构建一个的字符串","When this method returns, contains the 32-bit unsigned integer value equivalent to the number contained in ":"当此方法返回时，包含32位未签名的整数值等于","A number from 0 to 15 that corresponds to the specified hexadecimal digit.":"从0到15的数字，对应于指定的十六进制数字。","A member of the ":"一个成员","The URI to compare to the current URI.":"与当前URI相比的URI。"," values that specifies which parts of the current instance to return to the caller.":"指定当前实例的哪些部分返回到呼叫者的值。","A string that identifies the resource to be represented by the ":"标识要代表的资源的字符串",", or represents a number that is less than ":"，或代表一个小于","If the hostname and scheme of this URI instance and ":"如果此URI实例的主机名和方案以及","The hostname, formatted with Punycode according to the IDN standard.":"主机名根据IDN标准使用PunyCode格式化。","When this method returns, contains the 32-bit unsigned integer value that is equivalent to the number contained in ":"当此方法返回时，包含32位未签名的整数值，等于","One of the enumeration values that controls how special characters are escaped.":"控制特殊字符如何逃脱的枚举值之一。"," instance. Note that an IPv6 address in string form must be enclosed within brackets. For example, \"http://[2607:f8b0:400d:c06::69]\".":"实例。 请注意，必须在括号内封闭字符串形式的IPv6地址。 例如，“ http：// [2607：f8b0：400d：c06 :: 69]”。"," are the same, then this method returns a ":"是一样的，然后此方法返回",", is not of the correct format, or represents a number that is less than ":"，不是正确的格式，也不是一个小于"," instance is absolute; otherwise, ":"实例是绝对的； 否则，"," is completely escaped; otherwise, ":"完全逃脱了； 否则，"," that represents a relative URI that, when appended to the current URI instance, yields the ":"这代表了一个相对的URI，当附加到当前URI实例时，会产生","A 64-bit unsigned integer equivalent to the number specified in ":"一个64位未签名的整数等同于指定的数字","The components of the current instance.":"当前实例的组件。"," parameter.  \n  \n If the hostname or scheme is different, then this method returns a ":"范围。 \n  \n  如果主机名或方案不同，则此方法返回"," if the value in the ":"如果值","Specifies whether the URI string is a relative URI, absolute URI, or is indeterminate.":"指定URI字符串是相对URI，绝对URI还是不确定。","The hash value generated for this URI.":"该URI生成的哈希值。","A 64-bit unsigned integer equivalent to the number contained in ":"一个64位无符号整数，相当于包含在 "," are the same, then this method returns a relative ":"是相同的，那么此方法返回相对"," property is the default port for this scheme; otherwise, ":"属性是此方案的默认端口； 否则，","The base URI.":"基础URI。","One of the enumeration values that specifies the end of the URI portion to return.":"指定返回URI部分的末端的枚举值之一。"," is a file URI; otherwise, ":"是文件URI； 否则，"," that, when appended to the current URI instance, yields ":"当附加到当前的URI实例时，这会产生","A bitwise combination of the enumeration values that specifies the permitted format of ":"枚举值的位组合，该值指定了允许格式的","The specified portion of the ":"指定的部分","The relative URI to add to the base URI.":"相对URI添加到基础URI中。"," references the local host; otherwise, ":"参考本地主机； 否则，","An absolute ":"绝对"," is a UNC path; otherwise, ":"是一个UNC路径； 否则，","The string representation of the value of this instance, consisting of a sequence of digits ranging from 0 to 9, without a sign or leading zeros.":"此实例值的字符串表示形式，由从0到9的数字序列组成，没有符号或前导零。",".  \n  \n If the hostname or scheme is different, then this method returns a ":".  \n  \n 如果主机名或方案不同，则此方法返回 ","An object that contains the source and destination of the serialized stream associated with the ":"一个对象，该对象包含与 "," that is the base for the new ":"那是新的基础","A URI to compare with ":"与之相比的URI","The local operating-system representation of a file name.":"文件名的本地操作系统表示形式。","A relative ":"一个亲戚","When this method returns, contains the 64-bit unsigned integer value equivalent to the number contained in ":"当此方法返回时，包含64位未签名的整数值等于","The character to convert to hexadecimal representation.":"转换为十六进制表示的角色。"," instances are equivalent; otherwise, ":"实例是等效的； 否则，","The exact URI specified when this instance was constructed; otherwise, ":"构建此实例时指定的确切URI； 否则，"," instance that is combined with ":"实例与","When this method returns, contains the 64-bit unsigned integer value that is equivalent to the number contained in ":"当此方法返回时，包含64位无符号整数值，该值等效于 ","The hexadecimal representation of the specified character.":"指定字符的十六进制表示。",". If either parameter is ":"。 如果两个参数为","The host name to validate. This can be an IPv4 or IPv6 address or an Internet host name.":"主机名验证。 这可以是IPv4或IPv6地址或Internet主机名。"," properties separated by a question mark (?).":"属性由问号（？）隔开。","The hexadecimal representation of a character.":"角色的十六进制表示。","A pointer or handle contained in a 32-bit unsigned integer.":"32位未签名整数中包含的指针或手柄。","An object containing the source and destination of the serialized stream associated with the ":"一个包含与序列化流的源和目的地的对象"," where the hexadecimal representation of a character begins.":"角色的十六进制表示。","The type of the host name. If the type of the host name cannot be determined or if the host name is ":"主机名的类型。 如果无法确定主机名的类型或主机名是","The port number for this URI.":"此URI的端口号。","A pointer or handle contained in a 64-bit unsigned integer.":"64位未签名整数中包含的指针或手柄。"," or a zero-length string, this method returns ":"或零长度字符串，此方法返回","The unescaped canonical representation of the ":"UNESCAPER的规范表示","The character represented by the hexadecimal encoding at position ":"由十六进制代表的角色在位置编码","Any query information included in the specified URI.":"指定URI中包含的任何查询信息。","The unsigned pointer to add the offset to.":"未签名的指针将偏移添加到。","The scheme name to validate.":"方案名称要验证。",". If the character at ":"。 如果角色在","The scheme for this URI, converted to lowercase.":"该URI的方案转换为小写。"," instance. All characters are unescaped except #, ?, and %.":"实例。 除＃，？和％外，所有字符均为未播放。","A new unsigned pointer that reflects the addition of ":"一个新的未签名指针，反映了添加的","The type of the Uri.":"URI的类型。"," if the scheme name is valid; otherwise, ":"如果方案名称有效； 否则，","The path segments that make up the specified URI.":"组成指定URI的路径段。"," is not hexadecimal encoded, the character at ":"不是十六进制编码，角色在","The first URI.":"第一个URI。","When this method returns, contains the constructed ":"当此方法返回时，包含构造的"," is returned. The value of ":"退回。 的价值","An unsigned native integer to compare.":"要比较的无符号本机整数。"," parameter was set to ":"参数设置为","The second URI.":"第二个URI。"," instance was created; otherwise, ":"创建了实例； 否则，"," is incremented to point to the character following the one returned.":"递增以指向返回的角色。","A 32-bit unsigned integer.":"一个32位未签名的整数。","The string representation of the relative URI to add to the base ":"相对URI的字符串表示形式添加到底座","A 64-bit unsigned integer.":"一个64位未签名的整数。"," values that specifies the parts of ":"指定各个部分的值","The user information associated with the URI. The returned value does not include the '@' character reserved for delimiting the user information part of the URI.":"与URI关联的用户信息。 返回的值不包括用于划定URI的用户信息部分的“@”字符。"," constructed from ":"由"," if the specified character is invalid; otherwise, ":"如果指定的字符无效； 否则，","The unsigned pointer to subtract the offset from.":"未签名的指针减去偏移。","A URI string.":"URI字符串。","One of the enumeration values that specifies the character escaping used when the URI components are compared.":"比较URI组件时使用的字符逃脱的枚举值之一。","The relative URI to add to the base ":"相对的URI添加到基础上","The unescaped value of the ":"Unespaper的价值","One of the enumeration values that specifies the the culture, case, and sort rules for the comparison.":"指定文化，情况和排序规则的枚举价值之一。","A new unsigned pointer that reflects the subtraction of ":"一种反映出减法的新的未签名指针","The specified URI to test.":"指定的URI测试。","An Internet access protocol.":"一种互联网接入协议。","An optional bitwise combination of the enumeration values that indicates the style elements that can be present in ":"枚举值的可选位组合，该值指示可以存在的样式元素"," instance is a base of ":"实例是","A value that indicates the lexical relationship between the compared ":"一个表示比较之间词汇关系的值","The string to unescape.":"字符串到unescape。","An optional object that supplies culture-specific formatting information about ":"提供有关文化特定格式信息的可选对象","A DNS-style domain name or IP address.":"DNS风格的域名或IP地址。","The character to test.":"要测试的角色。","The DNS host name or IP address of the server.":"服务器的DNS主机名或IP地址。","The unescaped representation of ":"UNESCAPED代表","An unsigned native integer equivalent to the number contained in ":"一个未签名的本机整数等同于包含的数字","An IP port number for the service.":"该服务的IP端口号。"," if the specified character should be escaped; otherwise, ":"如果应逃脱指定的字符； 否则，","The password of the user that accesses the URI.":"访问URI的用户的密码。","The absolute path to the resource.":"资源的绝对路径。","The path to the Internet resource.":"互联网资源的路径。","The character to validate.":"验证的角色。","The entire URI.":"整个URI。","The path to the resource referenced by the URI.":"URI引用的资源的路径。","A query string or fragment identifier.":"查询字符串或片段标识符。"," if the character is a valid hexadecimal digit; otherwise, ":"如果角色是有效的十六进制数字； 否则，","The port number of the URI.":"URI的端口号。","The authority component of the URI represented by this instance.":"URI的权威组成部分由此实例代表。"," represents the same ":"代表相同","The host part of the URI in a format suitable for DNS resolution; or the original host string, if it is already suitable for resolution.":"URI的主机部分适合DNS分辨率； 或原始主机字符串，如果已经适合分辨率。","The query information included in the URI.":"URI中包含的查询信息。"," as the ":"作为","The scheme of the URI.":"URI的方案。"," constructed by this ":"由此构建","The URI constructed by the ":"由 ","The hash code generated for the URI.":"为URI生成的哈希代码。","The string that contains the unescaped display string of the ":"包含未播放的显示字符串的字符串","The name of the user that accesses the URI.":"访问URI的用户名称。","The fragment portion of the URI.":"URI的碎片部分。"," that contains the information that is required to serialize the new ":"其中包含序列化新的信息","The URI to parse.":"URI解析。"," to retrieve from ":" 从 "," values that controls how special characters are escaped.":"控制特殊字符如何逃脱的值。","A string that contains the components.":"包含组件的字符串。"," to validate.":"验证。","Validation errors, if any.":"验证错误（如果有）。","The URI to test.":"URI测试。"," is a base URI for ":" 是一个基本URI ","The scheme name to check.":"要检查的方案名称。"," has been registered; otherwise, ":"已注册； 否则，","The URI to check.":"检查的URI。"," is well-formed; otherwise, ":"形式良好； 否则，"," for the constructed ":"对于构造的","The scheme that is associated with this ":"与此相关的计划","The port number of the scheme.":"方案的端口号。","The URI parser to register.":"URI解析器要注册。","The name of the scheme that is associated with this parser.":"与此解析器相关的方案的名称。","The default port number for the specified scheme.":"指定方案的默认端口号。","A base URI.":"一个基URI。","A relative URI.":"相对URI。","Errors during the resolve process, if any.":"解决过程中的错误（如果有）。","The string of the resolved relative ":"已解决的亲戚的字符串","This method always returns 0.":"此方法始终返回0。","A new value tuple with no components.":"没有组件的新值元组。","The value of the value tuple's only component.":"值元组唯一的组件的值。","A value tuple with 1 component.":"带有1个组件的值元组。","The value of the value tuple's first component.":"值元组的第一个分量的值。","The value of the value tuple's second component.":"值元组的第二个组件的值。","A value tuple with 2 components.":"带有2个组件的价值元组。","The value of the value tuple's third component.":"值元组的第三个组件的值。","A value tuple with 3 components.":"带有3个组件的价值元组。","The value of the value tuple's fourth component.":"值元组的第四个组件的值。","A value tuple with 4 components.":"带有4个组件的价值元组。","The value of the value tuple's fifth component.":"值元组的第五分量的值。","A value tuple with 5 components.":"带有5个组件的价值元组。","The value of the value tuple's sixth component.":"值元组的第六个组件的值。","A value tuple with 6 components.":"带有6个组件的价值元组。","The value of the value tuple's seventh component.":"值元组的第七组件的值。","A value tuple with 7 components.":"带有7个组件的价值元组。","The value of the value tuple's eighth component.":"值元组的第八组件的值。","A value tuple with 8 components.":"带有8个组件的价值元组。","The value tuple to compare with the current instance.":"与当前实例进行比较的值元组。","This method always return 0.":"此方法始终返回0。","An object that provides custom rules for comparison. This parameter is ignored.":"提供自定义规则进行比较的对象。 此参数被忽略。","Returns 0 if ":"返回0如果"," instance and 1 if ":" 实例和1if "}