{"The default value of the dependency property, usually provided as a value of some specific type.":"依赖关系属性的默认值，通常作为某种特定类型的值提供。"," should be raised; otherwise; ":"应该抬起； 否则;","The data that is the result of the query.":"查询结果的数据。","The y coordinate of the cursor position.":"光标位置的y坐标。","The command-line arguments of the subsequent application instance and indicates whether the first application instance should be brought to the foreground upon exiting the exception handler.":"后续应用程序实例的命令行参数，并指示退出异常处理程序时是否应将第一个应用程序实例放到前景。","The value to be validated.":"要验证的值。","The error that occurred while running the query. This value is ":"运行查询时发生的错误。 这个值是"," that indicates whether the ":"这表明是否","Reference to a handler implementation that is to be called by the property system whenever the effective value of the property changes.":"每当属性的有效价值更改时，属性系统将调用处理程序实现。","The time that the message was posted.":"消息发布的时间。"," if there is no error.":"如果没有错误。","Reference to a handler implementation that is to be called whenever the property system calls ":"每当属性系统调用时，请参考处理程序实现","The command line from ":"来自","A structure with the message data.":"带有消息数据的结构。"," if the value was validated; ":" 如果值已验证; "," against this property.":"反对此属性。","Optional delegate that is used to execute completion work on the UI thread, for example, to set additional properties.":"例如，用于在UI线程上执行完成工作的可选委托，例如设置其他属性。","Contextual information about the current thread.":"有关当前线程的上下文信息。"," calling this method.":"调用此方法。"," if the submitted value was invalid.":"如果提交的值无效。","The base metadata to merge with this instance's values.":"基本元数据与此实例的值合并。","Optional arguments to send as a parameter with the ":"可选的参数以作为参数发送的可选参数","Object that originated the event.":"起源于事件的对象。"," value that indicates whether this application will use the XP Windows styles for windows, controls, and so on.":"指示此应用程序是否将使用XP Windows样式的Windows，控件等的值。","-offset of the new ":" - 新的"," that is the underlying data object.":"那是基础数据对象。","The dependency property to which this metadata is being applied.":"应用此元数据的依赖性属性。","Event data.":"事件数据。"," to indicate this application is a single-instance application; otherwise, ":"指示此应用程序是单个现实应用程序； 否则，","The amount to translate the specified point.":"翻译指定点的金额。"," object to the UI thread to use. By default, this is the ":"对象使用UI线程。 默认情况下，这是","The main form for this application.":"此应用程序的主要形式。","The dependency property to which the metadata has been applied.":"应用元数据的依赖性属性。"," if the listener handled the event. It is considered an error by the ":"如果听众处理活动。 它被认为是错误的","The result of translating ":"翻译的结果"," object that is associated with the thread on which this instance was created.":"与创建此实例的线程关联的对象。","The minimum length of time, in milliseconds, for which the splash screen is displayed.":"最小长度以毫秒为单位，显示了飞溅屏幕。","The type associated with this metadata if this is type-specific metadata. If this is default metadata, this value is a null reference.":"如果这是特定于类型的元数据，则与此元数据关联的类型。 如果这是默认的元数据，则此值为null引用。"," handling in WPF to register a listener for an event that the listener does not handle. Regardless, the method should return ":"在WPF中处理以注册听众无法处理的事件的侦听器。 无论如何，该方法应返回","The first vector to evaluate.":"第一个评估的向量。"," that is the error of the last query operation, or ":"这是上一个查询操作的错误，或"," if it receives an event that it does not recognize or handle.":"如果它收到一个未识别或处理的事件。"," implementation reference.":"实施参考。","A collection that contains all of the application's open forms.":"包含所有应用程序的所有开放表格的集合。"," if there was no error.":"如果没有错误。","The second vector to evaluate.":"的第二向量进行评价。"," implementation compares the values of the ":"实施比较了"," to indicate that the application saves the user settings on exit. Otherwise, ":"为了表明该应用程序保存了出口的用户设置。 否则，","The default value of the property. The default value on a ":"属性的默认值。 A上的默认值 ","The angle, in degrees, between ":"角度，程度为",", and potentially compares the values of ":"，并可能比较"," to prevent or delay the automatic loading of data; otherwise, ":"防止或延迟数据的自动加载； 否则，"," to indicate the settings are not implicitly saved.":"指示这些设置不会被隐式保存。"," if there is an outstanding ":"如果有杰出的","The cross product of ":"跨产品的"," instance created with the parameterless constructor will be ":" 使用无参数构造函数创建的实例将是 ","One of the enumeration values that indicates what the application should do when the main form closes.":"指示当主形式关闭时该应用程序应该做什么的枚举值之一。"," component of a ":"a的组成部分",". The following formula is used to calculate the cross product:  \n  \n ":"。 以下公式用于计算交叉产品：","The splash screen for the application.":"应用程序的飞溅屏幕。"," in use; otherwise, ":"正在使用; 否则，"," if the metadata instance is immutable; otherwise, ":"如果元数据实例是不可变的； 否则，"," is a value type, so will always be a bitwise comparison. For the ":"是一种值类型，因此始终是比较。 为了","The determinant of ":"决定因素"," component, this implementation employs a bitwise comparison if it is a value type. For locally set properties that have reference types, the behavior is deferred to that type's equality determination mechanisms, because it just uses the == operator on the two values internally. By default, this would be a reference equality of the values and thus the equality of the entire ":"组件，如果是值类型，则该实现将采用比较。 对于具有参考类型的本地设置属性，该行为被延迟到该类型的平等确定机制，因为它仅在内部使用两个值上使用== operator。 默认情况下，这将是值的参考平等，因此是整个值的平等性","The dependency property to be cleared, identified by a ":"依赖性属性要清除，由"," indicates that the application should use the default text rendering engine for Visual Basic 2005. A value of ":"指示该应用程序应将默认文本渲染引擎用于Visual Basic2005。","The x-coordinate of the top-left corner of the rectangle.":"矩形左上角的X坐标。","The vector structure to divide.":"矢量结构要分裂。"," would become a reference equality.":"将成为参考平等。"," object reference.":"对象引用。","The amount by which ":"数量"," indicates that the application should use the text rendering engine for Visual Basic .NET 2002 and Visual Basic .NET 2003.":"表明该应用程序应将文本渲染引擎用于Visual Basic .NET 2002和Visual Basic .NET 2003。","The y-coordinate of the top-left corner of the rectangle.":"矩形左上角的Y坐标。","This implementation compares the values of the ":"此实现比较了","The key for the dependency property to be cleared.":"依赖属性要清除的关键。"," is divided.":"分开的。","The first point that the new rectangle must contain.":"新矩形必须包含的第一点。"," object that returns a reference to and information about the current Visual Basic host window.":"返回有关当前视觉基本主机窗口的参考和信息的对象。"," components of a ":"a的组件","The identifier for the dependency property to coerce.":"依赖性属性的标识符。","The vector to compare.":"比较的向量。","The host window for the current Visual Basic environment.":"当前视觉基本环境的主机窗口。","The second point that the new rectangle must contain.":"新矩形必须包含的第二点。"," is always a value type, so this comparison will always be a bitwise comparison. For the ":"始终是一种价值类型，因此此比较始终是比较。 为了"," values as this vector; otherwise, ":"值为该向量； 否则，","The title of the host window for the current Visual Basic environment.":"当前视觉基本环境的主机窗口标题。"," if the two instances are the same; otherwise, ":"如果两个实例相同； 否则，","A point that specifies the location of the top-left corner of the rectangle.":"指定矩形左上角的位置。","The vector to compare with this vector.":"与该向量进行比较的向量。"," component, this implementation employs a bitwise comparison if it is a value type.  \n  \n For locally set properties that have reference types, the behavior is deferred to that type's equality determination mechanisms, because it uses the ":"组件，如果是值类型，则该实现将采用比较。 \n  \n  对于具有参考类型的本地设置属性，该行为被延迟到该类型的平等确定机制，因为它使用了"," if t he ":"如果是"," array that represents the sound file.":"代表声音文件的数组。"," structure that specifies the width and height of the rectangle.":"指定矩形的宽度和高度的结构。","A signed 32-bit integer hash code.":"签名的32位整数哈希代码。"," operator on the two values internally. By default, this is a reference equality of the values.":"内部两个值的操作员。 默认情况下，这是值的参考平等。"," components of ":"组件","The first point the rectangle must contain.":"矩形必须包含的第一点。"," mode for playing the sound. By default, ":"播放声音的模式。 默认，","A specialized local value enumerator.":"专业的本地价值枚举。","The identifier for the locally set dependency property.":"本地设置的依赖属性的标识符。","The amount to offset the specified point. The resulting rectangle will be exactly large enough to contain both points.":"抵消指定点的金额。 最终的矩形将足够大，可以包含两个点。","The scalar to multiply.":"标量乘以。"," that represents the sound file.":"代表声音文件。","The value of the locally set dependency property as an object.":"本地设置的依赖属性作为对象的值。"," identifier of the property to retrieve the value for.":"属性的标识符以检索值。","The x-coordinate of the point to check.":"要检查点的X坐标。"," containing the name of the sound file":"包含声音文件的名称","The vector structure to transform.":"向量结构转换。","Returns the current effective value.":"返回当前有效值。","Specifies how the property is to be serialized.":"指定该属性的序列化。"," object representing the system sound to play.":"代表系统声音播放的对象。","The y-coordinate of the point to check.":"检查点的y坐标。","The transformation to apply to ":"适用于"," identifier of the property to invalidate.":"属性的标识符是为了无效。"," object that contains the current date and time expressed as UTC (GMT) time.":"包含当前日期和时间表示为UTC（GMT）时间的对象。","The serialization option, as a value of the enumeration.":"序列化选项，作为枚举的值。"," if (":"如果 （","The first vector to multiply.":"第一个向量乘以。"," object that contains the current local date and time.":"包含当前本地日期和时间的对象。",") is contained by the rectangle; otherwise, ":"）由矩形包含； 否则，","The event information for the event (CLR reflection information).":"事件的事件信息（CLR反射信息）。","Event data that will contain the dependency property identifier of interest, the property metadata for the type, and old and new values.":"事件数据将包含感兴趣的依赖关系属性标识符，类型的属性元数据以及旧值和新值。","The point to check.":"检查的重点。","The second vector structure to multiply.":"第二个向量结构繁殖。"," containing the millisecond count from the computer's system timer.":"从计算机的系统计时器中包含毫秒计数。","The target where the handler is attached.":"处理程序附着的目标。","Returns the local value, or returns the sentinel value ":"返回本地值或返回前哨值"," object for the computer.":"计算机的对象。"," if the rectangle contains the specified point; otherwise, ":"如果矩形包含指定点； 否则，"," containing the scalar dot product of ":"包含标量点乘积","The event handler.":"活动处理程序。","The rectangle to check.":"矩形检查。",", which is calculated using the following formula:  \n  \n ":"，使用以下公式计算："," if no local value is set.":"如果未设置本地值。"," object that represents the computer's primary screen.":"代表计算机主屏幕的对象。"," of the delegate.":"代表。"," is entirely contained by the rectangle; otherwise, ":"完全由矩形包含； 否则，","The identifier of the dependency property to set.":"要设置的依赖项属性的标识符。","The vector used to translate ":"用于翻译的矢量"," containing the number of bytes of free physical memory for the computer.":"包含计算机免费物理内存的字节数。","The name of the handler implementation.":"处理程序实施的名称。"," values as the current rectangle; otherwise, ":"值作为当前矩形； 否则，","The vector to divide.":"向量分裂。"," containing the number of bytes of the computer's free virtual address space.":"包含计算机免费虚拟地址空间的字节数。","The new local value.":"新的本地价值。","The delegate reference.":"代表参考。"," if the specified rectangle has the same ":"如果指定的矩形具有相同的"," object represents the UI culture installed on the computer.":"对象代表计算机上安装的UI文化。","The scalar by which ":"标量"," if the rectangles have the same ":"如果矩形具有相同的"," identifier of the property to set.":"要设置的属性标识符。","The created instance.":"创建的实例。"," containing the operating-system name.":"包含操作系统名称。"," will be divided.":"将被分割。","The amount by which to expand or shrink the left and right sides of the rectangle.":"扩展或收缩矩形的左右两侧的数量。","The identifier for the dependency property that should be serialized.":"应序列化的依赖性属性的标识符。","Property information for the property to get.":"属性获取的属性信息。"," containing the platform identifier for the operating system of the computer, chosen from the member names of the ":"包含计算机操作系统的平台标识符，从","The amount by which to expand or shrink the top and bottom sides of the rectangle.":"扩展或收缩矩形顶部和底部的数量。","A point with ":"一个点","The object that holds the desired property value.":"拥有所需属性值的对象。"," if the dependency property that is supplied should be value-serialized; otherwise, ":"如果提供的依赖属性应进行价值序列化； 否则，"," containing the current version number of the operating system.":"包含操作系统的当前版本号。","Property information for the property to set.":"为要设置的属性的属性信息。","- and ":"- 和"," that wraps the CLR type of this instance.":"这包含此实例的CLR类型。"," structure to modify.":"修改的结构。"," containing the number of bytes of physical memory for the computer.":"包含计算机物理内存的字节数。","-coordinate values equal to the ":" - 坐标值等于","The resulting rectangle.":"由此产生的矩形。","The name of the target property.":"目标属性的名称。"," if this instance is sealed; otherwise, ":"如果密封此实例； 否则，","Specifies the amount to expand the rectangle. The ":"指定扩展矩形的金额。 这"," containing the number of bytes of virtual address space available for the computer.":"包含可用于计算机的虚拟地址空间的字节数。"," offset values of ":"偏移值","The system (CLR) type to convert.":"系统（CLR）类型要转换。","The markup extension instance of the incoming data.":"传入数据的标记扩展实例。"," that defines the keys to send.":"这定义了发送的键。"," property specifies the amount to increase the rectangle's ":"财产指定增加矩形的金额","Can provide additional services that should be performed when processing the markup extension data for a property value.":"可以提供在处理属性值的标记扩展数据时应执行的其他服务。"," equal to the absolute value of this vector's ":"等于该向量的绝对值"," that represents the system (CLR) type.":"代表系统（CLR）类型。"," that specifies whether or not to wait for keystrokes to get processed before the application continues. ":"这指定是否要等待键盘在应用程序继续之前进行处理。"," properties. The ":"特性。 这"," if the class represented by the current ":"如果班级由电流表示"," property and a ":"财产和a"," by default.":"默认。"," to assign a root context for.":"分配一个根上下文。","The rectangle to intersect with the current rectangle.":"矩形与当前矩形相交。"," is in the inheritance hierarchy of the ":"是在继承层次结构中","The collection of attributes.":"属性的集合。"," are different; otherwise, ":"是不同的; 否则，"," if the ALT key is down; otherwise, ":"如果alt键关闭； 否则，"," passed as ":"通过","The intersection of the two rectangles, or ":"两个矩形或","The instance of the object":"对象的实例","The second vector to multiply.":"第二个向量乘以。"," parameter and the current ":"参数和电流"," if no intersection exists.":"如果不存在交叉点。"," if the property is an attached ":"如果财产是附件"," value: ":"价值：","The vector from which ":"从中的向量"," if CAPS LOCK is turned on; otherwise, ":"如果盖子锁定; 否则，"," if the specified rectangle intersects with the current rectangle; otherwise, ":"如果指定的矩形与当前矩形相交； 否则，"," represent types of classes, and the class represented by the current ":"表示类的类型，以及当前的类别"," is this property is a composite property; otherwise, ":"该属性是复合属性吗？ 否则，","A vector with ":"与","The amount to move the rectangle horizontally.":"水平移动矩形的数量。"," if this property represents a constructor argument; otherwise, ":"如果此属性代表构造函数参数； 否则，"," derives from the class represented by ":"来自代表的班级"," if a CTRL key is down; otherwise, ":"如果CTRL键关闭； 否则，"," values opposite of the ":"相反的值"," if the property represents direct content; otherwise, ":"如果属性代表直接内容； 否则，","The amount to move the rectangle vertically.":"垂直移动矩形的数量。"," represent the same class.":"代表同一类。"," if NUM LOCK is on; otherwise, ":"如果num锁定； 否则，","The string representation of the vector.":"向量的字符串表示。","The type of the base class.":"基类的类型。","The rectangle to move.":"矩形移动。"," if this property represents a key; otherwise, ":"如果此属性代表密钥； 否则，",", if this ":"， 如果这"," if SCROLL LOCK is on; otherwise, ":"如果滚动锁定； 否则，","The length of this vector.":"该向量的长度。","The horizontal offset for the new rectangle.":"新矩形的水平偏移。","An internal identifier.":"内部标识符。"," if a SHIFT key is down; otherwise, ":"如果换档键关闭； 否则，"," represents a string; otherwise, ":"代表一个字符串； 否则，","The square of the ":"广场","The vertical offset for the new rectangle.":"新矩形的垂直偏移。","The name of the represented CLR system type.":"代表CLR系统类型的名称。"," with a value ":"具有价值","The items that make up the value of this property.":"构成该属性价值的项目。"," of this vector.":"该矢量。","The original rectangle.":"原始矩形。","The CLR system type represented by this ":"CLR系统类型由此表示"," if the functionality of the left and right mouse buttons has been swapped; otherwise, ":"如果左右鼠标按钮的功能已交换； 否则，"," component of this vector. The default value is 0.":"该向量的组成部分。 默认值为0。","The type to add as an owner of this dependency property.":"该依赖关系属性的所有者要添加的类型。","A vector that specifies the horizontal and vertical offsets for the new rectangle.":"为新矩形指定水平和垂直偏移的向量。","A Boolean with value ":"有价值的布尔人","The identifier property name.":"标识符属性名称。","A vector that specifies the horizontal and vertical amounts to move the rectangle.":"指定水平和垂直量以移动矩形的向量。","A reference to the original ":"对原始的引用"," if the mouse has a scroll wheel; otherwise ":"如果鼠标有滚轮； 否则","The property descriptor.":"属性描述符。"," that is being queried for conversion support.":" 正在查询转换支持。"," if the rectangles do not have the same ":"如果矩形没有相同的"," that indicates how much to scroll when the mouse wheel is rotated one notch. A positive value indicates scrolling by that number of lines, while a negative value indicates scrolling by one screen at a time.":"这表明当鼠标轮旋转一个缺口时滚动多少。 正值表示滚动数量，而负值一次表示滚动一次屏幕。","The CLR type.":"CLR类型。"," identifier that identifies the dependency property. This identifier should be exposed by the adding class as a ":"标识依赖属性的标识符。 该标识符应由添加类公开"," if objects of the specified type can be converted to a ":"如果指定类型的对象可以转换为","The string representation of the rectangle, in the form \"x, y, width, height\".":"矩形的字符串表示形式为“ x，y，宽度，高度”。","Path of the file to download, including file name and host address.":"文件的路径要下载，包括文件名和主机地址。","The type to add as owner of this dependency property.":"添加为该依赖项属性的所有者的类型。","The string value.":"字符串值。","The scale factor in the x-direction.":"x方向的比例因子。"," if instances of ":"如果实例","File name and path of the downloaded file.":"下载文件的文件名和路径。","The metadata that qualifies the dependency property as it exists on the provided type.":"在提供的类型上存在依赖性属性的元数据。","The scale factor in the y-direction.":"y方向的比例因子。","The set of types.":"一组类型。","Describes the ":"描述","User name to authenticate. Default is an empty string, \"\".":"用户名可验证。 默认值是一个空字符串，“”。","A string representation of the rectangle.":"矩形的字符串表示。","The current value.":"当前值。","The specific type from which to retrieve the dependency property metadata.":"检索依赖属性元数据的特定类型。","The object on which the event is being handled.":"事件正在处理的对象。","A string representation of the current rectangle. The string has the following form: \"":"当前矩形的字符串表示。 该字符串具有以下形式：”","Password to authenticate. Default is an empty string, \"\".":"密码进行身份验证。 默认值是一个空字符串，“”。"," that contains the event data for the event to deliver.":"其中包含事件数据的事件数据。","A property metadata object.":"属性元数据对象。","Service type of the new service.":"新服务的服务类型。","\".":"”。"," to display the progress of the operation; otherwise ":"显示操作的进度； 否则","The provided ":"提供的","The service implementation class.":"服务实施类。","A dependency object that is checked for type, to determine which type-specific version of the dependency property the metadata should come from.":"检查类型的依赖项对象，以确定元数据应来自哪种类型的依赖项属性。","A string representation of the current rectangle that is determined by the specified format provider.":"由指定格式提供商确定的当前矩形的字符串表示。",". Timeout interval, in milliseconds. Default is 100 seconds.":"。 超时间隔，以毫秒为单位。 默认值为100秒。","The type to obtain the ":"获得的类型","A specific object that records the dependency object type from which the dependency property metadata is desired.":"记录依赖关系对象类型的特定对象所需的依赖项属性元数据。","The type of service object to get.":"要获得的服务对象的类型。","Timeout interval, in milliseconds. Default is 100 seconds.":"超时间隔，以毫秒为单位。 默认值为100秒。","A matrix that specifies the transformation to apply.":"指定要应用的转换的矩阵。","A new object to contain listeners to an event.":"一个新的对象包含侦听器的事件。","A service implementation for the type ":"该类型的服务实施"," if the specified value is the registered property type or an acceptable derived type; otherwise, ":"如果指定的值是注册的属性类型或可接受的派生类型； 否则，","Specifies behavior when the user clicks Cancel or No on the dialog box shown as a result of ":"指定当用户单击取消或在对话框上不在对话框上时指定行为",". Path of the file to download, including file name and host address.":"。 文件的路径要下载，包括文件名和主机地址。","A rectangle that is the basis for the transformation.":"矩形是转换的基础。","The source object that the handler delegate subscribes to.":"处理程序委托订阅的源对象。"," if the value is acceptable and is of the correct type or a derived type; otherwise, ":"如果该值是可以接受的，并且是正确的类型或派生类型； 否则，",". File name and path of the downloaded file.":"。 下载文件的文件名和路径。",". May be ":"。 或许","The delegate that handles the event that is raised by ":"处理事件的代表","The rectangle that results from the operation.":"由操作产生的矩形。","The type where this dependency property is inherited and where the provided alternate metadata will be applied.":"该依赖关系属性的继承以及提供的替代元数据将被应用的类型。"," if there is no service stored for type ":"如果没有用于类型的服务",". Credentials to be supplied.":"。 提供的证书。","The source to attach listeners to.":"将听众附加的来源。","Credentials to be supplied.":"提供的证书。","The point to include.":"要包括的点。","Context information used for conversion.":"上下文信息用于转换。","The metadata to apply to the dependency property on the overriding type.":"元数据应用于覆盖类型上的依赖项属性。","The rectangle to include.":"矩形要包括。","The listening class (which must implement ":"听力课（必须实施","The URL, computer name, or IP number of the server to ping.":"服务器的URL，计算机名称或IP号到PING。"," if the value can be converted; otherwise, ":"如果可以转换值； 否则，","The access key for a read-only dependency property.":"仅阅读依赖项属性的访问密钥。","A rectangle that is exactly large enough to contain the specified rectangle and the specified point.":"一个足够大的矩形，可以包含指定的矩形和指定点。"," if the operation was successful; otherwise ":"如果操作成功； 否则","The source to remove the handler from.":"从中删除处理程序的源。","The name of the dependency property to register. The name must be unique within the registration namespace of the owner type.":"要注册的依赖属性的名称。 该名称必须在所有者类型的注册名称空间中是唯一的。"," to evaluate for conversion.":"评估转换。","The first rectangle to include.":"第一个矩形包括。"," value to convert into a ":"价值转换为","The owner type that is registering the dependency property.":"注册依赖项属性的所有者类型。","Time threshold in milliseconds for contacting the destination. Default is 500.":"与目的地联系的时间阈值。 默认值为500。","The delegate to remove from ":"要从中删除的委托 ","The second rectangle to include.":"第二个矩形包括。"," coefficient.":"系数。","The URI of the server to ping.":"服务器的URI到ping。","A dependency property identifier that should be used to set the value of a ":"依赖关系属性标识符，该标识符应用于设置A的值","The y-axis value of the bottom of the rectangle. If the rectangle is empty, the value is ":"矩形底部的Y轴值。 如果矩形为空，则值为","The source to remove listeners from.":"要从中删除侦听器的源。"," structure to append to this ":"添加的结构","Path and name of file to upload.":"要上传的文件和名称。"," field in your class. That identifier is then used to reference the dependency property later, for operations such as setting its value programmatically or obtaining metadata.":"您班上的字段。 然后，该标识符稍后用于引用依赖项属性，以诸如以编程方式设置其值或获得元数据。","The position of the bottom-left corner of the rectangle.":"矩形左下角的位置。","The source for events being listened to.":"被聆听的事件的来源。","The name of the dependency property to register.":"要注册的依赖属性的名称。"," structure that is identical to this ":" 与此相同的结构 ","URL, IP address, or URI of destination server.":"目标服务器的URL，IP地址或URI。","The position of the bottom-right corner of the rectangle.":"矩形右下角的位置。","Property metadata for the dependency property.":"依赖属性的属性元数据。"," if instances are equal; otherwise, ":"如果实例相等； 否则，","The data to check. This object is expected to be a ":"要检查的数据。 预计这个对象将是一个","The empty rectangle, which has ":"空矩形，有","User name to authenticate. Default is an empty string: ":"用户名可验证。 默认值是一个空字符串："," structure to compare.":"比较的结构。","A reference to a callback that should perform any custom validation of the dependency property value beyond typical type validation.":"对回调的引用，该回调应对依赖性属性值进行任何自定义验证，而不是典型类型验证。"," to stop listening to ":"停止听","Password to authenticate. Default is an empty string: ":"密码进行身份验证。 默认值是一个空字符串："," property values of ":"属性值"," are identical; otherwise, ":"是相同的； 否则，",", and completely remove all entries from ":"，并完全删除所有条目","Property metadata for the dependency property. This can include the default value as well as other characteristics.":"依赖属性的属性元数据。 这可以包括默认值以及其他特征。"," to display progress of the operation; otherwise ":"显示操作的进度； 否则"," if some entries were actually removed; otherwise, ":"如果某些条目实际上被删除了； 否则，","A dependency property key that should be used to set the value of a static read-only field in your class, which is then used to reference the dependency property later.":"依赖关系属性密钥应用于设置类中静态读取字段的值，然后将其用于稍后引用依赖项属性。"," structure to multiply.":"结构繁殖。",", and has ":"，并且有","Timeout interval in milliseconds. Default is 100 seconds.":"超时间隔为毫秒。 默认值为100秒。","The source to remove listener information for.":"删除听众信息的来源。"," are not identical; otherwise, ":"不完全相同； 否则，","A reference to a user-created callback that should perform any custom validation of the dependency property value beyond typical type validation.":"对用户创建的回调的引用，该回调应在典型类型验证之外执行依赖关系属性值的任何自定义验证。","Whether to display progress of the operation. Default is ":"是否显示操作的进度。 默认为","A positive number that represents the height of the rectangle. The default is 0.":"代表矩形高度的正数。 默认值为0。","Action to be taken when the user clicks Cancel. Default is ":"当用户单击取消时要采取的措施。 默认为"," representation of the matrix.":"矩阵的表示。","The type to set the new event manager.":"设置新事件管理器的类型。","A dependency property key that should be used to set the value of a static read-only field in your class, which is then used to reference the dependency property.":"依赖关系属性密钥应用于设置类中静态读取字段的值，然后用来引用依赖项属性。"," if the rectangle is the ":"如果矩形是","The new event manager.":"新事件经理。","Credentials for authentication.":"身份验证的凭证。"," structure to prepend to this ":"为此准备的结构","The string representation of the dependency property.":"依赖项属性的字符串表示。"," rectangle; otherwise, ":"长方形; 否则，","The source to begin listening on.":"开始聆听的来源。","The angle of rotation.":"旋转角度。"," if the computer is connected to a network; otherwise ":"如果计算机连接到网络； 否则","The x-axis value of the left side of the rectangle.":"矩形左侧的X轴值。","The default metadata of the dependency property.":"依赖关系属性的默认元数据。","The angle, in degrees, by which to rotate this matrix.":"角度为程度，可以旋转该矩阵。","The source to stop listening on.":"停止聆听的来源。"," that indicates whether a network is available to the application.":"这表明应用程序是否可用于应用程序。","The position of the top-left corner of the rectangle. The default is (0, 0).":"矩形左上角的位置。 默认值为（0，0）。","A unique numeric identifier.":"唯一的数字标识符。","The x-axis value of the right side of the rectangle.":"矩形右侧的X轴值。","The x-coordinate of the point about which to rotate this matrix.":"旋转该矩阵的点的X坐标。","The zero-based index of the requested source.":"请求源的基于零的索引。"," containing the name of the computer.":"包含计算机名称。","The type of the object that registered the property or added itself as owner of the property.":"注册属性或添加为属性所有者的对象的类型。","Data being stored by the manager for this source.":"经理存储该来源的数据。","The y-axis position of the top of the rectangle.":"矩形顶部的Y轴位置。","The y-coordinate of the point about which to rotate this matrix.":"旋转该矩阵的点的y坐标。",". The name of the instance object.":"。 实例对象的名称。","The position of the top-left corner of the rectangle.":"矩形左上角的位置。"," of the property value.":"属性值。","An object that can be used to establish a lock on the data table members and then be appropriately disposed with a ":"一个可用于在数据表成员上建立锁的对象，然后适当地处理","The rotation angle, in degrees.":"旋转角度为单位。"," array containing the XML configuration attributes recognized by this listener.":"包含此侦听器识别的XML配置属性的数组。","The position of the top-right corner of the rectangle.":"矩形右上角的位置。"," if the dependency property is read-only; otherwise, ":"如果依赖性属性仅阅读； 否则，","A name of the trace source that invoked this method.":"调用此方法的跟踪源的名称。","The x-coordinate of the rotation center.":"旋转中心的X坐标。","A positive number that represents the width of the rectangle. The default is 0.":"代表矩形宽度的正数。 默认值为0。"," construct.":"构造。","The value validation callback for this dependency property, as provided for the ":"该依赖关系属性的值验证回调，如","The name of the trace source that invoked this method.":"调用此方法的跟踪源的名称。","The y-axis value of the top side of the rectangle.":"矩形顶部的Y轴值。","The number of items that should be allocated in the initial list.":"应该在初始列表中分配的项目数。","The y-coordinate of the rotation center.":"旋转中心的Y坐标。"," parameter in the original dependency property registration.":"原始依赖属性注册中的参数。",". The custom message to write.":"。 要编写的自定义消息。","The listener element to add to the ":"听众元素要添加到","Cultural information which is respected when converting.":"转换时受到尊重的文化信息。","The angle of rotation to prepend.":"旋转角度要预处理。",", with ":"， 和","The event handler to add to the ":"活动处理程序添加到","The identifier for the dependency property that changed.":"更改的依赖关系属性的标识符。","The value by which to scale this ":"扩展此的价值","Cultural information which is respected during conversion.":"在转换过程中受到尊重的文化信息。"," if the list was already declared to be in use; otherwise, ":"如果列表已经被宣布正在使用； 否则，","The value of the property before the change reported by the relevant event or state change.":"相关事件或国家变更报告的变更之前，财产的价值。"," indicating that the output is appended to the current file, and ":"表明输出附加到当前文件，以及"," along the x-axis.":"沿X轴。","The initial width of the instance of ":"实例的初始宽度"," indicating that output is written to a new file. The default setting for this property is ":"表明输出写入新文件。 此属性的默认设置为","The value of the property after the change reported by the relevant event or state change.":"相关事件或国家变更报告的更改报告后财产的价值。"," along the y-axis.":"沿着Y轴。","The initial height of the instance of ":"实例的初始高度","A modifiable clone of the current object.":"当前对象的可修改克隆。"," if the sizes are equal; otherwise, ":"如果尺寸相等； 否则，"," indicating that the stream is flushed after every write; otherwise the log entries are buffered and written more efficiently. The default setting for this property is ":"表示每次写入后流汇集流； 否则，日志条目将被缓冲并更有效地编写。 此属性的默认设置为"," if the provided object is equivalent to the current ":"如果提供的对象等于当前","The amount by which to scale this ":"扩展此规模的数量","The object to copy to.":"要复制的对象。"," is equivalent to the current ":"等效于电流","The x-coordinate of the scale operation's center point.":"比例操作中心点的X坐标。","The size to compare to this current instance of ":"与此当前实例相比的大小",". The base name for the log files. The default is the application's product name.":"。 日志文件的基本名称。 默认值是应用程序的产品名称。"," that calls this method.":"称这种方法。"," instances are different; otherwise, ":"实例不同； 否则，","The y-coordinate of the scale operation's center point.":"比例操作中心点的y坐标。",", which is the name of the log-file directory. The default setting for this property is the user's directory for application data.":"，这是日志文件目录的名称。 此属性的默认设置是应用程序数据的用户目录。"," if the instances of ":"如果实例"," if any of the listeners in the ":"如果有任何听众","The x-axis scale factor.":"X轴量表因子。",", which is the delimiter used for fields within a log message. The default setting for this property is the TAB character.":"，这是日志消息中字段中使用的定界符。 此属性的默认设置是标签字符。","The property value after the change.":"更改后的属性值。","The first instance of ":"第一个实例"," refer to an object that has been garbage collected; otherwise, ":"请参阅已收集垃圾的对象； 否则，","The y-axis scale factor.":"Y轴量表因子。",". Determines what to do when attempting to write to the log file and there is less free disk space available than specified by the ":"。 确定在尝试写入日志文件时该怎么做，并且比该文件的免费磁盘空间少于","The property value before the change.":"更改之前的属性值。","The second instance of ":"第二个实例","The list to check for use state and potentially copy.":"要检查使用状态并可能复制的列表。"," property, or if the log file size is greater than what the ":"属性，或日志文件大小大于","The identifier field of the dependency property where the value change occurred.":"依赖关系属性的标识符字段发生了。","The x-coordinate of the point about which the scale operation is performed.":"执行比例操作的点的X坐标。"," if the two instances of ":"如果两个实例"," if the provided list was in use at the time of call and therefore the ":"如果在通话时使用了提供的列表，则","The type on which this dependency property exists and metadata should be overridden.":"该依赖性属性的类型和元数据应被覆盖。"," property allows. The default value is ":"属性允许。 默认值是","The y-coordinate of the point about which the scale operation is performed.":"执行比例操作的点的y坐标。"," parameter reference was reset to be a copy. ":"参数引用重置为副本。"," equal in value to this instance of ":"等于此实例的价值","Metadata supplied for this type.":"为此提供了元数据。",", which is the encoding to use when creating a new log file. The default value of this property is ":"，这是创建新日志文件时要使用的编码。 该属性的默认值是"," value to parse to a ":"对解析的价值"," if the provided list was not in use, in which case the ":"如果不使用提供的列表，在这种情况下"," structure along the x-axis.":"沿X轴结构。","The relevant dependency property identifier.":"相关的依赖属性标识符。",", which is the current full log-file name.":"，这是当前的完整日志名称。",". Use ":"。 利用"," parameter reference remains unaltered.":"参数参考保持不变。","The provider to use to format the value.":"用于格式化值的提供商。"," structure along the y-axis.":" 沿y轴的结构。","Always throws an exception and returns ":"总是抛出异常并返回"," if the host identifier should be included; otherwise use ":"如果应该包括主机标识符； 否则使用"," that specifies the width followed by the height.":"这指定了宽度，后面是高度。","The angle in the x dimension by which to skew this ":"x维的角度偏向这个","A modifiable clone of the current object. The cloned object's ":"当前对象的可修改克隆。 克隆的对象的"," if any entries were purged; otherwise, ":"如果清除了任何条目； 否则，",", which is the location for the log file. The default value is ":"，这是日志文件的位置。 默认值是","An object that provides a way to control formatting.":"一个提供一种控制格式的对象。"," even if the source's ":"即使来源的","The angle in the y dimension by which to skew this ":"y维的角度偏向这个","The event handler to remove from the ":"要从 ",". This indicates which date to include in the log-file names. The default value is ":"。 这表明在日志文件名中包含哪个日期。 默认值是"," that represents this ":"这代表了这一点","The object to clone.":"克隆的对象。","The empty list representation.":"空列表表示。",". This is the maximum allowed log-file size, in bytes. The default value is 5000000.":"。 这是字节中允许的最大对数文件尺寸。 默认值为5000000。","The point to transform.":"转换的重点。","An empty instance of ":"一个空的实例"," to be cloned.":"克隆。",". This is the amount of free disk space necessary. The default value is 10000000.":"。 这是必要的自由磁盘空间的数量。 默认值为10000000。","The result of transforming ":"转变的结果","The zero-based index of the listener in the list.":"列表中侦听器的基于零的索引。",". The default is 0. The value cannot be negative.":"。 默认值为0。值不能为负。","The new instance.":"新实例。"," by this ":"这样","The item at that index, or a null reference if no item was at that index.":"该索引处的项目或null引用，如果没有该索引的项目。",". The name to give to the ":"。 给"," if this instance of size is ":"如果这个大小的实例是","The object to check or make unmodifiable. If ":"检查或使不可修改的对象。 如果 ","The points to transform. The original points in the array are replaced by their transformed values.":"要转换的要点。 数组中的原始点被其转换值所取代。"," property object.":"属性对象。"," property will be ":" 物业将 ",", the object is checked to determine whether it can be made unmodifiable. If ":"，检查对象以确定是否可以使其无法解缩。 如果",". The value cannot be negative.":"。 该值不能为负。","The vectors to transform. The original vectors in the array are replaced by their transformed values.":"向量转换。 数组中的原始向量被其转换值所取代。"," property was ":"财产是",", the object is made unmodifiable, if possible.":"，如果可能的话，使对象变得不可置原。","Required. The message to log. If ":"必需的。 登录的消息。 如果","Provides contextual information about a component.":"提供有关组件的上下文信息。","The source object that raises the specified event.":"提出指定事件的源对象。","The amount to offset this ":"抵消此的金额"," to return an indication of whether the object can be frozen (without actually freezing it); ":"返回表明是否可以冷冻对象（而不实际冷冻）；","Identifies the data type to evaluate for conversion.":"标识以评估转换的数据类型。",", an empty string is used.":"，使用一个空字符串。","The name of the event to subscribe to.":"要订阅的事件的名称。","The determinant of this ":"决定因素"," to actually freeze the object.":"实际冻结对象。"," can be converted to an instance of ":" 可以转换为 ","The type of message. By default, ":"消息的类型。 默认，"," has an inverse; otherwise, ":"有逆； 否则，","The delegate that handles the event.":"处理活动的代表。"," can be made unmodifiable, or ":"可以使无法定型，或者","The name of the event to remove the handler from.":"从中删除处理程序的事件的名称。"," if this instance of ":"如果这个实例的","Message identifier, typically used for correlation. By default, related to ":"消息标识符，通常用于关联。 默认情况下，与","An identity matrix.":"身份矩阵。"," if it cannot be made unmodifiable. If ":"如果无法使其无法修饰。 如果"," can be converted to the ":"可以转换为","The delegate to remove":"代表删除"," as described in the table.":"如表中所述。"," structure is an identity matrix; otherwise, ":"结构是一个身份矩阵； 否则，"," is now unmodifiable, or ":"现在不可修复，或者","Culture-specific information that should be respected during conversion.":"在转换过程中应尊重的培养特定信息。","The object to that raises the event.":"对目的提出了事件。"," if it cannot be made unmodifiable.":"如果无法使其无法修饰。","The source object that is being converted.":"正在转换的源对象。","Required. Exception to log.":"必需的。 日志例外。","The value of the first row and first column of this ":"This的第一行和第一列的值 ","Identifies the HMENU-based accessible element to be annotated.":"标识要注释的基于Hmenu的可访问元素。"," if the if the specified ":"如果指定","String to append to the message. By default, this is an empty string.":"字符串以附加到消息。 默认情况下，这是一个空字符串。"," that is created from the converted ":"这是由转换的","Specifies the child ID of the accessible element.":"指定可访问元素的子ID。","A frozen copy of the ":"冷冻的副本",". The default value is 1.":"。 默认值为1。"," as described in the table in the Remarks section.":"如“注释”部分的表中所述。","The type that this instance of ":"此实例的类型",". The copy's ":"。 副本"," object that underlies the ":"基础的对象","Specifies an array of properties to be reset. These properties will revert to the default behavior that they displayed before they were annotated.":"指定要重置的一系列属性。 这些属性将恢复为他们在注释之前显示的默认行为。"," is converted to.":"被转换为。","The value of the first row and second column of this ":"第一行的值和第二列的值","The instance to copy.":"要复制的实例。","Specifies the number of properties in the ":"指定属性的数量",". The default value is 0.":"。 默认值为0。"," if audio data is stored on the Clipboard; otherwise ":" 如果音频数据存储在剪贴板上；否则 ","The object that is created from the converted instance of ":"从转换的实例创建的对象"," to copy and freeze.":"复制和冻结。","The value of the second row and first column of this ":"第二行和第一列的值","The assembly that contains the embedded resource.":"包含嵌入式资源的组件。",". Name of the custom format to be checked. Required.":"。 要检查的自定义格式的名称。 必需的。","Identifies the accessible element that is to be annotated. This replaces the identity string.":"标识要注释的可访问元素。 这取代了身份字符串。","The name of the embedded resource.":"嵌入式资源的名称。","The value of the second row and second column of this ":"第二行和第二列的值","The previous value of the data member.":"数据成员的先前值。","Specifies an array of properties that is to be reset. These properties will revert to the default behavior that they displayed before they were annotated.":"指定要重置的一系列属性。 这些属性将恢复为他们在注释之前显示的默认行为。"," if data in the specified custom format is stored on the Clipboard; otherwise ":"如果指定的自定义格式中的数据存储在剪贴板上； 否则"," that specifies how long it will take for the splash screen to fade after the close operation has been initiated.":"这说明了启动关闭操作后，飞溅屏幕将逐渐消失需要多长时间。"," if a file drop list is stored on the Clipboard; otherwise ":"如果将文件删除列表存储在剪贴板上； 否则","The current value of the data member.":"数据成员的当前值。"," structure. The default value is 1.":" 结构。 默认值为1。","Identify the accessible element that is to be un-annotated.":"确定要未经通知的可访问元素。"," to automatically close the splash screen; ":"自动关闭飞溅屏幕；"," if an image is stored on the Clipboard; otherwise ":"如果将图像存储在剪贴板上； 否则","The value of the third row and first column of this ":"第三行和第一列的值","The property that changed.":"更改的属性。","Length of ":"的长度"," if the Clipboard contains text; otherwise ":"如果剪贴板包含文本； 否则"," structure. The default value is 0.":"结构体。 默认值为0。","Event data that contains information about which property changed, and its old and new values.":"事件数据包含有关哪个属性更改及其旧值的信息。"," to close the splash screen manually.":"手动关闭飞溅屏幕。","Specify an array of properties that is to be reset. These properties will revert to the default behavior they displayed before they were annotated.":"指定要重置的属性数组。 这些属性将恢复到注释前显示的默认行为。",". If specified, identifies what text format to be checked for. Required.":"。 如果指定，请确定要检查的文本格式。 必需的。"," if the current object can be made unmodifiable or is already unmodifiable; otherwise, ":"如果当前对象无法解码或已经无法定位； 否则，"," if the splash screen window should use the WS_EX_TOPMOST style; otherwise ":"如果Splash屏幕窗口应使用ws_ex_topmast样式； 否则","The value of the third row and second column of this ":"第三行和第二列的值","Identifies the HMENU-based accessible element.":"标识基于Hmenu的可访问元素。","The delegate to a method that takes parameters specified in ":"委派给了一个采用指定参数的方法"," object containing audio data or ":"包含音频数据或","The context information of a type.":"类型的上下文信息。"," if the object is frozen and cannot be modified; ":"如果对象被冷冻并且无法修改；","Pointer to a buffer that receives the identity string. The callee allocates this buffer using ":"指向接收身份字符串的缓冲区。 Callee使用"," if the Clipboard does not contain any audio data.":"如果剪贴板不包含任何音频数据。"," if the type can be converted to a ":"如果类型可以转换为"," if the object can be modified.":"如果可以修改对象。",", which is pushed onto the ":"，被推到",". When finished, the caller must free the buffer by calling ":"。 完成后，呼叫者必须通过致电释放缓冲区",". Name of the data format. Required.":"。 数据格式的名称。 必需的。","Pointer to a buffer that receives the length of the identity string.":"指向接收身份字符串长度的缓冲区。","A format context that provides information about the environment from which this converter is being invoked.":"一个格式上下文，提供有关调用该转换器的环境的信息。"," of the type being converted.":"被转换的类型。"," event queue.":"事件队列。","Specifies the HWND of the accessible element that the caller wants to identify.":"指定呼叫者想要识别的可访问元素的HWND。"," representing the Clipboard data or ":" 表示剪贴板数据或 ","An array of objects to pass as arguments to the given method. Can be ":"一系列对象将作为参数传递给给定方法。 可","The type being evaluated for conversion.":"评估转换的类型。"," (key is ":"（关键是","Specifies the object ID of the accessible element.":"指定可访问元素的对象ID。","An object, which is returned immediately after ":"一个物体，该对象立即在之后返回","Culture specific information.":"文化特定信息。"," if the Clipboard does not contain any data that is in the specified format or can be converted to that format.":"如果剪贴板不包含指定格式的任何数据或可以转换为该格式的数据。",", value is ":"，值为","Pointer to a buffer containing identity string of an HMENU-based accessible element.":"指向包含基于HMENU的可访问元素的身份字符串的缓冲区。"," is called, that can be used to interact with the delegate as it is pending execution in the event queue.":"称为，可以用来与代表交互，因为它在事件队列中正在执行。","The virtual key to convert.":"要转换的虚拟键。"," object that represents the data currently on the Clipboard, or ":"代表剪贴板上当前数据的对象，或","Specifies the length of the identity string specified by ":"指定指定的身份字符串的长度",") that represents the name mapping to add to the XAML namescope.":"）代表要添加到XAML名称的名称映射。","The priority, relative to the other pending operations in the ":"优先级，相对于其他待处理的操作","The WPF key.":"WPF密钥。"," if there is no data on the Clipboard.":" 如果剪贴板上没有数据。","Pointer to a buffer that receives the HMENU of the accessible element.":"指向接收可访问元件的HMENU的缓冲区。","The WPF to convert.":"WPF转换。","The string key, which is the name of the XAML namescope mapping to add.":"字符串键，这是要添加的XAML名称映射的名称。"," event queue, with which the specified method is invoked.":"事件队列，调用指定方法。","Pointer to a buffer that receives the child ID of the accessible element.":"指向接收可访问元件的子ID的缓冲区。"," containing file names or ":"包含文件名或","The Win32 Virtual-Key.":"Win32虚拟键。","The object value, which is the object reference of the XAML namescope mapping to add.":"对象值，这是要添加的XAML名称映射的对象引用。","The delegate to a method that takes no arguments, which is pushed onto the ":"将不采用参数的方法的代表，该方法被推到","Pointer to a buffer containing identity string of an Hwnd-based accessible element.":"指向包含基于HWND的可访问元素的身份字符串的缓冲区。"," if the Clipboard does not contain any data that is in the ":"如果剪贴板不包含任何数据","A delegate to a method that takes one argument, which is pushed onto the ":"将一个参数的方法的委派委派，该参数被推到","The key to evaluate for conversion.":"评估转换的关键。","The item to find in the collection, specified as a ":"在集合中查找的项目，指定为","Pointer to a buffer that receives the HWND of the accessible element.":"指向接收可访问元素HWND的缓冲区。"," format or can be converted to that format.":"格式或可以转换为该格式。","The object to pass as an argument to the specified method.":"将作为参数传递给指定方法的对象。","The string to convert into a ":"转换为一个的字符串","Pointer to a buffer that receives the object ID of the accessible element.":"指向接收可访问元件的对象ID的缓冲区。","A delegate to a method that takes multiple arguments, which is pushed onto the ":"将多个参数的方法的委派委派，该方法被推到"," identifies an existing mapping in this ":" 标识此中的现有映射 "," representing the Clipboard image data or ":"表示剪贴板图像数据或"," . ":"。","The key to convert into a string.":"转换为字符串的钥匙。","Specifies which property of the accessible element is to be annotated.":"指定应注释可访问元素的属性。","An array of objects to pass as arguments to the specified method.":"作为参数传递给指定方法的一系列对象。","The Clipboard text data or an empty string if the Clipboard does not contain data in the ":"剪贴板文本数据或一个空字符串，如果剪贴板不包含数据"," is called, that can be used to interact with the delegate as it is pending execution in the ":"称为，可以用来与代表进行交互，因为它正在待执行"," does not exist in the current ":"当前不存在"," format, depending on the operating system.":"格式，具体取决于操作系统。","An invariant string representation of the specified ":"指定的不变字符串表示","Specifies a new value for the ":"指定一个新值","Identifies the HMENU-accessible element to be annotated.":"标识要注释的Hmenu访问元素。",". If specified, identifies what text format should be retrieved. Default is ":"。 如果指定，请确定应检索哪种文本格式。 默认为"," queue.":"队列。","The string key to find.":"要查找的字符串键。"," is type ":" is类型 ",". Required.":"。 必需的。","Specifies an array of properties that is to be handled by the specified callback object.":"指定由指定回调对象处理的一系列属性。","The priority at which to begin shutting down the dispatcher.":"开始关闭调度员的优先级。"," identifies a name for an existing mapping in this ":"标识此中现有映射的名称","The value to check for validity.":"检查有效性的价值。","The Clipboard text data or an empty string if the Clipboard does not contain data in the specified format.":"剪贴板文本数据或一个空字符串如果剪贴板不包含指定格式的数据。","Specifies the callback object, which will be invoked when a client requests one of the overridden properties.":"指定回调对象，当客户端请求其中一个被复盖的属性时将调用该对象。"," if the calling thread is the thread associated with this ":"如果调用线程是与此关联的线程","The one-dimensional array that is the destination of the elements copied from the collection The array must have zero-based indexing.":"一维数组是从集合中复制的元素的目的地，数组必须具有零基索引。","The modifier keys to evaluate for conversion.":"用于评估转换的修饰符键。","A structure used to re-enable dispatcher processing.":"用于重新启用调度器处理的结构。"," array. Audio data to be written to the Clipboard. Required.":"大批。 音频数据要写入剪贴板。 必需的。","May be ANNO_THIS, indicating that the annotation affects the indicated accessible element only; or ANNO_CONTAINER, indicating that it applies to the element and its immediate element children.":"可以是anno__this，表明注释仅影响指定的可访问元素； 或Anno_container，表明它适用于元素及其直接元素子女。","Name portion of an existing mapping to retrieve the object portion for.":"将现有映射的部分命名以检索对象部分的部分。","The intended direction of the focus traversal, as a value of the enumeration.":"焦点遍历的预期方向是枚举的值。","The thread to obtain the ":"获得的线"," Audio data to be written to the clipboard. Required.":"音频数据要写入剪贴板。 必需的。","Specifies which property of that element is to be annotated.":"指定要注释该元素的哪个属性。","The requested object that is mapped with ":"映射的请求的对象","The dispatcher for ":"调度员","One of the traversal direction enumeration values.":"遍历方向枚举值之一。","Identifies the accessible element that is to be annotated.":"标识要注释的可访问元素。",". Format of data. Required.":"。 数据格式。 必需的。"," was provided as ":"被提供为","A delegate to invoke through the dispatcher.":"通过调度员调用的代表。"," if this traversal has reached the end of child elements that can have focus; otherwise, ":"如果这种遍历已经达到了可以集中精力的儿童元素的终结； 否则，","Specifies the length of the string identified by the ":"指定由",". Data object to be written to the Clipboard. Required.":"。 数据对象要写入剪贴板。 必需的。"," instance which specifies the x-coordinate of the top-left corner of the rectangle.":"实例指定矩形左上角的X坐标。"," or empty string, or if no matching object was found.":"或空字符串，或者找不到匹配对象。","The priority that determines the order in which the specified callback is invoked relative to the other pending operations in the ":"确定指定回调相对于其他待处理操作的顺序的优先级","Specifies an array of properties to be handled by the specified callback object.":"指定由指定回调对象处理的一系列属性。",". List of file names. Required.":"。 文件名列表。 必需的。"," instance which specifies the y-coordinate of the top-left corner of the rectangle.":"实例指定了矩形左上角的y坐标。","The object to get the XAML namescope from.":"从中获取XAML名称范围的对象。","An object that indicates whether to cancel the action.":"指示是否取消操作的对象。","Specifies the callback object that will be invoked when a client requests one of the overridden properties.":"指定客户请求一项被覆盖属性之一时将调用的回调对象。",". Image to be written. Required.":"。 要编写的图像。 必需的。"," instance which specifies the width of the rectangle.":" 指定矩形宽度的实例。","Specifies the property of the accessible element to be annotated.":"指定要注释的可访问元素的属性。","A XAML namescope, as an ":"XAML名称，作为一个",". Text to be written. Required.":"。 文字要编写。 必需的。","An Action delegate to invoke through the dispatcher.":"动作代表通过调度员调用。","Specifies a new value for the property.":"指定属性的新值。",". Format to be used when writing text. Default is ":"。 编写文本时要使用的格式。 默认为","The name to use for mapping the given object.":"用于映射给定对象的名称。"," instance which specifies the height of the rectangle.":"实例指定矩形的高度。","The maximum amount of time to wait for the operation to start. Once the operation has started, it will complete before this method returns. To specify an infinite wait, use a value of -1. In a same-thread call, any other negative value is converted to -1, resulting in an infinite wait. In a cross-thread call, any other negative value throws an ":"等待操作开始的最长时间。 一旦操作开始，它将在此方法返回之前完成。 要指定无限等待，请使用-1的值。 在相同的呼叫中，任何其他负值都转换为-1，导致无限等待。 在交叉呼叫中，任何其他负值都会抛出","This parameter is intended for internal use only.":"此参数仅用于内部使用。","The object to be mapped to the provided name.":"要映射到提供的名称的对象。","The object to compare to the current rectangle.":"与当前矩形进行比较的对象。","The location to which the directory should be copied.":"应复制目录的位置。","A delegate to a method that takes parameters specified in ":"委托给使用指定参数的方法","If successful, returns S_OK. For other possible return values, see the documentation for ":"如果成功，请返回S_OK。 有关其他可能的返回值，请参见文档","The object to remove from the collection, specified as a ":"从集合中删除的对象，指定为"," and has the same ":"并且有相同的","What encoding to use when writing to file. Default is UTF-8.":"写作时要使用的编码。 默认值为UTF-8。","The return value from the delegate being invoked or ":"来自被调用的代表的回报值或","An integer representing the count.":"代表计数的整数。"," if item was successfully removed from the collection, otherwise ":"如果项目已成功地从集合中删除，则","This property returns the ":"此属性返回"," as this rectangle; otherwise, ":"作为这个矩形； 否则，","A string representing the action.":"代表动作的字符串。","The maximum amount of time to wait for the operation to start. However, once the operation starts, it will complete before this method returns. To specify an infinite wait, use a value of -1. In a same-thread call, any other negative value is converted to -1, resulting in an infinite wait. In a cross-thread call, any other negative value throws an ":"等待操作开始的最长时间。 但是，一旦操作启动，它将在此方法返回之前完成。 要指定无限等待，请使用-1的值。 在相同的呼叫中，任何其他负值都转换为-1，导致无限等待。 在交叉呼叫中，任何其他负值都会抛出","The rectangle to compare to the current rectangle.":"矩形与当前矩形进行比较。",". Also returns ":". 也返回 ","The value associated with this class.":"与此类关联的值。","A string representing the description.":"表示描述的字符串。","The priority with which the specified method is invoked, relative to the other pending operations in the ":"相对于该指定方法的优先级，相对于其他待处理的操作"," if the item was not found in the collection.":"如果在集合中找不到该项目。","The first rectangle to compare.":"第一个矩形进行比较。",". Key from which the value is to be retrieved. Required.":"。 要检索值的关键。 必需的。","A delegate to a method that takes no arguments, which is pushed onto the ":"一个不采用参数的方法的代表，将其推入","If successful, returns S_OK. Otherwise, returns another standard COM error code.":"如果成功，请返回S_OK。 否则，返回另一个标准com错误代码。","The string key, which is the name of the XAML namescope mapping to remove.":"字符串键，这是要删除的XAML名称映射的名称。",". Value to be retrieved. Required.":"。 值要检索。 必需的。","The second rectangle to compare.":"比较的第二个矩形。","An object to pass as an argument to the given method.":"一个将作为参数传递给给定方法的对象。","An array of objects to pass as arguments to the given method.":"一系列对象将作为参数传递给给定方法。","An integer.":"一个整数。",". Default value to be supplied if the value does not exist. Required.":"。 如果不存在该值，将提供默认值。 必需的。","This rectangle's hash code.":"该矩形的哈希代码。","Object to change XAML namescope for.":"对象更改XAML名称。","Gets a value from a registry key.":"从注册表密钥中获取值。","Specifies the handle of a window for which an IAccessible interface pointer is to be retrieved.":"指定要检索可访问的接口指针的窗口的句柄。","An object to pass as an argument to the given method. This can be ":"要作为参数传递给给定方法的对象。 这可以是 ","The new XAML namescope, using an interface cast.":"使用接口铸件的新XAML名称。","; otherwise, if all of these values are the same, then ":"; 否则，如果所有这些值都是相同的，那么","Specifies the object ID.":"指定对象ID。","An object to pass as an argument to the specified method.":"作为参数传递给指定方法的对象。",". Name of the key to be written to. Required.":"。 要编写的钥匙的名称。 必需的。","An enumerator that iterates through a collection.":"通过收藏的枚举者的枚举者。","A string representation of an ":"一个字符串表示","Specifies the address of a pointer variable that receives the address of the object's IAccessible interface.":"指定接收对象可访问接口的地址的指针变量的地址。","When this method returns, contains the value associated with the specified key, if the key is found; otherwise, a null object. This parameter is passed uninitialized.":"当此方法返回时，包含与指定键关联的值（如果找到键）； 否则，一个空对象。 该参数通过非初始化。","The value returned by ":"返回的值",". Name of the value to be written. Required.":"。 要编写的值的名称。 必需的。","The equivalent ":"等价物 ","Specifies which child of the IAccessible object the caller wants to identify.":"指定呼叫者想要识别的可访问对象的孩子的哪个孩子。","An object that indicates whether to cancel the operation.":"指示是否取消操作的对象。"," contains a mapping for the name provided as ":" 包含提供为名称的映射 ",". Value to be written. Required.":"。 要编写的价值。 必需的。","The provider to use to format the value":"用于格式化值的提供商","Address of a variable that receives a pointer to a callee-allocated identity string. The callee allocates the identity string using ":"接收指向Callee分配的身份字符串指针的变量的地址。 Callee使用","The frame for the dispatcher to process.":"调度程序处理的框架。","The existing registry key from which to obtain the security information.":"获得安全信息的现有注册表密钥。","The name of the mapping to remove.":"映射的名称要删除。","A string containing the same ":"一个包含相同的字符串","; the caller must release the identity string by using ":"; 呼叫者必须使用","The security descriptors of all the access control sections of the registry key.":"注册表项的所有访问控制部分的安全描述符。","The priority to check.":"检查的优先级。","The string name for the XAML name mapping to get or set.":"要获取或设置的XAML名称映射的字符串名称。"," values of this ":"这个值"," when finished.":"等结束了。","An existing registry key from which to obtain the security information.":"获得安全信息的现有注册表密钥。","The value of the object mapped by the XAML name provided as ":"由XAML名称映射的对象的值为","A string that will be returned by the exception that occurs if the priority is invalid.":"如果优先级无效，则会由异常返回的字符串。","A collection of the keys in the ":"钥匙中的集合","The security descriptors of the specified access control sections of the registry key.":"注册表密钥指定访问控制部分的安全描述符。","An awaitable object that asynchronously yields control back to the current dispatcher and provides an opportunity for the dispatcher to process other events.":"一个等待的对象，异步地将控制回到当前的调度员，并为调度员提供了处理其他事件的机会。","Address of a variable that receives the length, in bytes, of the callee-allocated identity string.":"接收Callee分配的身份字符串的长度的变量的地址。","The format provider to use. If provider is ":"要使用的格式提供程序。 如果提供者是 "," dictionary.":"字典。","Contains a string that identifies the property being requested.":"包含一个标识要请求的属性的字符串。","An existing registry key.":"现有的注册表密钥。","A string representation of this instance of ":"此实例的字符串表示","The priority at which to schedule the continuation.":"安排延续的优先事项。","Specifies the length of the identity string specified by the ":"指定由","A collection of the values in the ":"在","An empty rectangle with no position or area.":"一个没有位置或区域的空矩形。","The security information to apply to the registry key.":"适用于注册表密钥的安全信息。","Specifies a GUID indicating the desired property.":"指定指示所需属性的指南。","The dispatcher associated with the current thread.":"与当前线程相关联的调度程序。","The x-coordinate of the new ":"新的X坐标"," if the dispatcher has finished shutting down; otherwise, ":"如果调度员完成了关闭； 否则，"," are greater than 0; otherwise, ":"大于0; 否则，","Specifies the value of the overridden property. This parameter is valid only if ":"指定覆盖属性的值。 此参数仅在"," values that represents the type of power mode event.":"代表电源模式事件类型的值。","The y-coordinate of the new ":"新的Y坐标","The height of the rectangle. The default value is ":"矩形的高度。 默认值是","The source of the event. When this event is raised by the ":"事件的来源。 当这个事件由"," is TRUE. The server must set this to VT_EMPTY if ":"是真的。 服务器必须将其设置为vt_empty如果"," has started shutting down; otherwise, ":"已经开始关闭； 否则，","Returns the sum of ":"返回"," if the rectangle is empty; otherwise, ":"如果矩形为空； 否则，"," class, this object is always ":"班级，这个对象总是","The hooks associated with this ":"与此关联的钩子"," is set to FALSE.":"设置为false。"," and contains the same ":"并包含相同的"," values indicating how the session ended.":"表示会话如何结束的值。","The thread.":"线。","The width of the rectangle. The default value is ":"矩形的宽度。 默认值为 ","Indicates whether the server is supplying a value for the requested property. The server should set this to TRUE if it is returning an overriding property or to FALSE if it is not returning a property (in which case it should also set ":"指示服务器是否为请求的属性提供值。 如果服务器正在返回覆盖属性或错误，则应将其设置为True（如果它不返回属性（在这种情况下，也应设置","The x-coordinate of the top-left corner of the rectangle. The default value is ":"矩形左上角的X坐标。 默认值是"," values as this ":"值这样"," values that indicates how the session ended.":" 指示会话如何结束的值。","The y-coordinate of the top-left corner of the rectangle. The default value is ":"矩形左上角的Y坐标。 默认值是","The dispatcher.":"调度员。","The point to compare to this instance.":"与此实例进行比较的要点。"," to VT_EMPTY).":"到vt_empty）。"," that specifies how the session ends.":" 它指定会话如何结束。","Describes the context information of a type.":"描述类型的上下文信息。","Indicates whether this frame will exit when all frames are requested to exit.":"指示当所有帧都要求退出时，该帧是否会退出。"," structures contain the same ":" 结构包含相同 ","Identifies the accessible element that is to be un-annotated.":"标识要未经通知的可访问元素。"," to cancel the user request to end the session; otherwise, ":"取消用户请求以结束会话； 否则，"," if the frame should continue; otherwise, ":"如果框架应该继续； 否则，","Specifies an array of properties that is to be reset. These properties will revert to the default behavior they displayed before they were annotated.":"指定要重置的一系列属性。 这些属性将恢复到注释前显示的默认行为。","The type of the source that is being evaluated for conversion.":"正在评估转换的源的类型。"," values that specifies how the session is ending.":"指定会话结束的值。","The first point to compare.":"比较的第一点。",".  The default value is ":"。 默认值是"," if the type can be converted to an ":"如果类型可以转换为","Specifies a new value for that property.":"指定该属性的新值。","The operation associated with the event.":"与事件相关的操作。","The second point to compare.":"第二点比较。"," that indicates the type of session change event.":"这表示会话更改事件的类型。","The desired type this ":"所需的类型"," indicating the type of the session change event.":"指示会话更改事件的类型。"," contain the same ":"包含相同的","The operation.":"操作。",". Name of the culture as a string. For a list of possible names, see ":"。 文化的名称为弦。 有关可能名称的列表，请参阅"," is being evaluated for conversion.":"正在评估转换。","The transformed point.":"转换点。","Specifies the interval between timer notifications, in milliseconds.":"指定计时器通知之间的间隔，以毫秒为单位。"," containing the name of the environment variable.":"包含环境变量的名称。"," if the calling thread has access to this object; otherwise, ":"如果调用线程可以访问此对象； 否则，","The ID of the new timer.":"新计时器的ID。","The amount to offset the point's ":"抵消了点的数量"," can be converted to ":"可以转换为"," containing the value of the environment variable with the name ":"包含名称的环境变量的值"," if the operation was aborted; otherwise, ":"如果手术被中止； 否则，","A delegate to invoke using the thread that listens for system events.":"使用聆听系统事件的线程调用的委托。","Provides contextual information required for conversion.":"提供转换所需的上下文信息。","An object that is notified when the asynchronous operation is finished.":"当异步操作完成后通知的对象。"," coordinate.":"协调。"," object that represents the culture the current thread uses for string manipulation and string formatting.":"代表当前线程用于字符串操作和字符串格式的文化的对象。","The point to translate.":"翻译的重点。","The ID of the timer to terminate.":"计时器的ID终止。","Cultural information to respect during conversion.":"在转换过程中要尊重的文化信息。","The status of the operation.":"操作的状态。"," object for the current application.":"当前应用程序的对象。","The ID number for the timer.":"计时器的ID号。","The maximum period of time to wait.":"等待的最长时间。","The object being converted.":"对象被转换。","The amount by which to translate ":"翻译的数量"," object that represents the culture that the current thread uses for retrieving culture-specific resources.":"代表当前线程用于检索特定文化资源的文化的对象。","The priority of the delegate on the queue.":"代表在队列上的优先级。"," values that indicates the user preference category that has changed.":"表示已更改的用户首选项类别的值。","The result of translating the specified point by the specified vector.":"通过指定向量转换指定点的结果。"," created from converting ":"由转换创建",". The assembly for which to obtain the information.":"。 获得信息的组装。","The result of the operation -or- ":"操作的结果 - 或 - ","The type to convert this ":"转换此的类型"," if the operation has not completed.":"如果操作尚未完成。"," if both the ":"如果两个"," containing the file name.":"包含文件名。"," values that indicates the category of user preferences that has changed.":" 指示已更改的用户首选项类别的值。","An object that represents the current operation.":"代表当前操作的对象。","The object created from converting this ":"通过转换而创建的对象"," that contains the company name associated with the application.":"其中包含与应用程序关联的公司名称。"," values that indicate the user preference category that is changing.":"指示正在更改的用户偏好类别的值。"," coordinates of ":" 的坐标 ","The message and its associated data.":"消息及其关联的数据。","The point to convert.":"转换的要点。","An object that awaits an asynchronous operation that returns a result.":"等待异步操作返回结果的对象。"," values that indicates the category of user preferences that is changing.":"表示正在更改的用户首选项类别的值。"," containing the copyright notice associated with the application.":" 包含与应用程序相关的版权声明。",", if one of the modules listening to the message loop processed the message. The owner of the message loop should ignore the message. ":"，如果其中一个模块收听消息循环处理了该消息。 消息循环的所有者应忽略该消息。"," structure with a ":"结构","The key URI of the ":"关键的URI"," containing the description associated with the application.":"包含与应用程序关联的说明。","An argument passed to the callback.":"一个参数传递给回调。",", if the message was not processed. In this case, the owner of the message pump should call the Win32 function TranslateMessage followed by DispatchMessage.":"，如果没有处理该消息。 在这种情况下，消息泵的所有者应调用Win32函数TranslateMessage，然后调用DispatchMessage。"," to compare in a ":"比较"," equal to this point's ":"等于这一点"," that contains the directory where the application is stored.":"其中包含存储应用程序的目录。","An object that waits for the completion of an asynchronous task.":"等待完成异步任务的对象。"," value and a ":"价值和","The last message.":"最后一条消息。","The package to add to the store.":"添加到商店的包装。"," containing all the assemblies loaded by the application.":"包含应用程序加载的所有组件。","The object to evaluate for equality.":"评估平等的对象。","A vector with an ":"具有","The uniform resource identifier (URI) of the package to return.":"包装的统一资源标识符（URI）要返回。"," if the thread is modal; otherwise, ":"如果线程为模态； 否则，"," containing the product name associated with the application.":" 包含与应用程序关联的产品名称。","The package with a specified ":"带有指定的软件包"," value equal to the point's ":"等于点的值"," if the specified object is equal to this ":"如果指定的对象等于此"," if the sink or one of its contained components has focus; otherwise, ":"如果水槽或其中一个包含的组件具有重点； 否则，"," have different ":"有不同"," containing the current stack-trace information. The return value can be ":" 包含当前堆栈跟踪信息。 返回值可以是 ",", if a package with the specified ":"，如果指定的包裹"," to associate this ":"关联这个","The message for the mnemonic and associated data. Do not modify this message structure. It is passed by reference for performance reasons only.":"助记符和相关数据的消息。 不要修改此消息结构。 它仅出于绩效原因而通过引用通过。"," is not in the store.":"不在商店。","The priority used to send and post callback methods.":"用于发送和发布回调方法的优先级。"," coordinates; ":"坐标；"," associated with the application.":"与应用程序相关联。","Modifier keys.":"修饰符键。","The uniform resource identifier (URI) of the package to remove.":"包装的统一资源标识符（URI）要删除。"," coordinates.":"坐标。"," containing the trademark notice associated with the application.":"包含与应用程序相关的商标通知。","The copy of this synchronization context.":"此同步上下文的副本。"," created from the inner-URI if the request resolves to a valid transport protocol such http or ftp; or a ":"如果请求解析为有效的传输协议，例如HTTP或FTP，则从Inner-uri创建； 或a"," if the message was handled; otherwise, ":" 如果消息被处理；否则, "," object containing the version number of the application.":"包含应用程序的版本编号的对象。","The delegate to call.":"代表打电话。","The result of transforming the specified point using the specified matrix.":"使用指定矩阵转换指定点的结果。"," created with a null-URI if the request resolves from the ":"如果请求从"," sink of the contained component.":" 所含成分的下沉。","The point from which ":"从中","An array that contains the native operating system handles.":"包含本机操作系统处理的数组。"," containing the number of bytes of physical memory mapped to the process context.":"包含映射到过程上下文的物理内存的字节数。"," cache.":"缓存。"," site of the contained component.":"包含组件的位置。"," is called, a ":"被称为","The period of time between ticks.":"滴答之间的时间。"," is subtracted.":"减去。"," object describing the error.":"描述错误的对象。","Specifies whether focus should be set to the first or the last tab stop.":"指定应将焦点设置为第一个或最后一个选项卡停止。","The point to subtract from ":"从","The priority at which to invoke the timer.":"调用计时器的优先级。",", containing the command-line arguments as strings for the current application.":"，包含命令行参数作为当前应用程序的字符串。","The response stream for the request.":"请求的响应流。"," if the focus has been set as requested; ":"如果已按要求设置焦点；"," to use with pack URI web request.":"与Pack URI Web请求一起使用。",", containing the strings to use as the command-line arguments for the current application.":"，包含用于当前应用程序的命令行参数的字符串。","The vector to subtract from ":"向量从","The event handler to call when the ":"事件处理程序要在"," object that contains the command-line arguments of the application.":"包含应用程序的命令行参数的对象。",", if there are no tab stops.":"，如果没有制表位。"," event occurs.":"事件发生。","The connection group name.":"连接组名称。","A string representation of a point.":"一个点的字符串表示。","The message and associated data. Do not modify this structure. It is passed by reference for performance reasons only.":"消息和关联的数据。 不要修改此结构。 它仅出于绩效原因而通过引用通过。"," object that contains the command-line arguments of the subsequent application instance.":"包含后续应用程序实例的命令行参数的对象。","The content length, in bytes.":"内容长度，字节。"," to subtract from ":"从中减去","The dispatcher the timer is associated with.":"计时器与调度器相关联。","The period of time between ticks. The default is 00:00:00.":"滴答之间的时间。 默认值为00:00:00。","The contents of the header.":"标头的内容。"," if the message was handled by the method implementation; otherwise, ":"如果方法是通过方法实现处理的； 否则，"," that indicates whether the first application instance should be brought to the foreground upon exiting the exception handler.":" 这指示在退出异常处理程序时是否应将第一个应用程序实例带到前台。","The string specifying the format to use.  \n  \n -or-  \n  \n ":"字符串指定要使用的格式。 \n  \n  -或者-","The authentication credentials to use with the request.":"与请求一起使用的身份验证凭证。"," if the timer is enabled; otherwise, ":"如果启用了计时器； 否则，"," if the message was processed and ":"如果已处理该消息，并且"," that indicates whether the application should exit upon exiting the exception handler.":"这表明该应用程序是否应在退出异常处理程序时退出。"," to use the default format defined for the type of the ":"使用针对该类型的默认格式","The user-defined data.  The default is ":"用户定义的数据。 默认值为"," if the current user is a member of the specified role; otherwise, ":"如果当前用户是指定角色的成员； 否则，","A header collection object.":"标头收集对象。"," should not be called; otherwise, ":"不应该称呼； 否则，"," to use to format the value.  \n  \n -or-  \n  \n ":"用于格式化值。 \n  \n  -或者-"," if the exception was handled; otherwise, ":"如果处理例外； 否则，"," object representing the current user.":"代表当前用户的对象。","A reference to the container's ":"对容器的引用","The protocol method name that performs this request.":"执行此请求的协议方法名称。"," to obtain the numeric format information from the current locale setting of the operating system.":"从操作系统的当前语言环境设置中获取数字格式信息。",". The name of the current user.":"。 当前用户的名称。","If this method returns ":"如果此方法返回","A string containing the value of the current instance in the specified format.":"在指定格式中包含当前实例值的字符串。",", the site has shifted focus to another component. If this method returns ":"，该站点已将重点转移到另一个组件。 如果此方法返回","One of the enumeration values that specifies the application's authentication mode.":"指定应用程序身份验证模式的枚举值之一。","Culture-specific formatting information.":"特定于文化的格式信息。","A read-only collection containing the command-line arguments as strings for the current application.":"一个只读的集合，其中包含命令行参数作为当前应用程序的字符串。",", focus is still within the calling component. The component should \"wrap around\" and set focus to its first contained tab stop.":"，焦点仍在调用组件中。 组件应“缠绕”，并将焦点设置在其第一个包含的选项卡停止中。","-coordinate value of this ":" - 共坐标值"," indicating if application startup should continue.":"指示应用程序启动是否应继续。","The current site's ":"当前网站的"," structure.  The default value is ":"结构体。 默认值是","The command-line arguments of the application and indicates whether the application startup should be canceled.":"应用程序的命令行参数，并指示是否应取消应用程序启动。"," on which the property has changed value.":"属性已更改值。","The window handle (HWND).":"窗口手柄（HWND）。"," that indicates if the application should continue starting up.":"这表明该应用程序是否应继续启动。"," value for the message.":"消息的价值。","Event data that is issued by any event that tracks changes to the effective value of this property.":"任何跟踪跟踪该属性有效价值的事件发出的事件数据。","The default value to specify for a dependency property, usually provided as a value of some specific type.":"为依赖项属性指定的默认值，通常作为某种特定类型的值提供。","The message identifier.":"消息标识符。","The x coordinate of the cursor position.":"光标位置的X坐标。"}