{"DevExpress.AspNetCore.Spreadsheet.Spreadsheet.endSynchronization":"去表达。AspNetCore.电子表格。电子表格。结束同步\r\n","Lists values that specify unit for dimensions in Rich Text Editor dialogs.":"列出在富文本编辑器对话框中指定维度单位的值。\r\n","The working directory path.":"工作目录路径。\r\n","A builder for a ribbon context tab category collection in Spreadsheet.":"电子表格中功能区上下文选项卡类别集合的构建器。\r\n","Adds the Font Bold item to the ribbon item collection.":"将字体粗体项添加到功能区项集合。\r\n","Contains classes that implement the Spreadsheet functionality.":"包含实现电子表格功能的类。\r\n","A builder that allows you to specify settings of paddings in the Simple view mode.":"一个构建器，允许您在简单视图模式中指定填充设置。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.customCommandExecuted":"去表达。AspNetCore.电子表格。电子表格。海关和海关\r\n","Specifies the Simple view mode’s settings.":"指定简单视图模式的设置。\r\n","Adds the Page Layout tab to the ribbon tab collection.":"将\"页面布局\"选项卡添加到\"功能区\"选项卡集合。\r\n","A method that configures the Print Layout view mode settings.":"配置打印布局视图模式设置的方法。\r\n","Sets the Rich Text Editor view type.":"设置富文本编辑器视图类型。\r\n","Adds the Mail Merge tab to the ribbon tab collection.":"将邮件合并选项卡添加到功能区选项卡集合。\r\n","Inserts the Insert tab to the ribbon tab collection at the specified position.":"将插入选项卡插入到指定位置的功能区选项卡集合。\r\n","A builder for the Spreadsheet ribbon item collection.":"电子表格功能区项目集合的构建器。\r\n","A builder that allows configuring a ribbon tab.":"允许配置功能区选项卡的构建器。\r\n","A builder that allows you to assign event handlers to client-side events available for the Spreadsheet.":"一个构建器，允许您将事件处理程序分配给可用于电子表格的客户端事件。\r\n","Adds the Chart Type item to the ribbon item collection.":"将图表类型项添加到功能区项集合。\r\n","Specifies the Spreadsheet’s work session ID.":"指定电子表格的工作会话ID。\r\n","Adds the Chart Legend item to the ribbon item collection.":"将图表图例项添加到功能区项集合。\r\n","A builder for Rich Text Editor’s view settings.":"富文本编辑器视图设置的构建器。\r\n","Adds the Chart Switch Row Column item to the ribbon item collection.":"将图表开关行列项添加到功能区项集合。\r\n","Specifies a CSS class to be applied to the Spreadsheet.":"指定要应用于电子表格的CSS类。\r\n","Adds the Headings item to the ribbon item collection.":"将标题项添加到功能区项集合。\r\n","Inserts the Home tab to the ribbon tab collection at the specified position.":"将主页选项卡插入到指定位置的功能区选项卡集合。\r\n","Inserts the View tab to the ribbon tab collection at the specified position.":"将视图选项卡插入到指定位置的功能区选项卡集合。\r\n","Adds the Border Line Color item to the ribbon item collection.":"将边框线颜色项添加到功能区项集合。\r\n","A helper object for creating the Spreadsheet.":"用于创建电子表格的帮助对象。\r\n","Gets the work session’s ID from a Spreadsheet client state.":"从电子表格客户端状态获取工作会话的ID。\r\n","Contains application options related to spreadsheet extension.":"包含与电子表格扩展相关的应用程序选项。\r\n","Specifies a URL to an action the handles document request operation.":"指定用于处理文档请求操作的操作的URL。\r\n","An object required to build the Spreadsheet.":"构建电子表格所需的对象。\r\n","Adds the Chart Style item to the ribbon item collection.":"将图表样式项添加到功能区项集合。\r\n","Adds the Format As Table item to the ribbon item collection.":"将格式作为表项添加到功能区项集合。\r\n","Adds the Chart Title item to the ribbon item collection.":"将图表标题项添加到功能区项集合。\r\n","Adds the Insert Cells item to the ribbon item collection.":"将插入单元格项添加到功能区项集合。\r\n","A function that gets the word to be added to the dictionary.":"获取要添加到字典中的单词的函数。\r\n","Bookmarks are visible.":"书签可见。\r\n","Adds the Insert Bar Chart item to the ribbon item collection.":"将插入条形图项添加到功能区项集合。\r\n","Contains information about the Spreadsheet’s client state.":"包含有关电子表格客户端状态的信息。\r\n","The application options.":"的应用程序选项。\r\n","Gets a document ID from a Spreadsheet client state.":"从电子表格客户端状态获取文档ID。\r\n","Gets a Spreadsheet object from a client state.":"从客户端状态获取电子表格对象。\r\n","Adds the Font Strikeout item to the ribbon item collection.":"将字体删除项添加到功能区项集合。\r\n","Adds the Gridlines item to the ribbon item collection.":"将Gridlines项添加到功能区项集合。\r\n","Adds the References tab to the ribbon tab collection.":"将\"引用\"选项卡添加到功能区选项卡集合。\r\n","Adds the Align Paragraph Center item to the ribbon item collection.":"将对齐段落中心项添加到功能区项集合。\r\n","Adds the Insert Area Chart item to the ribbon item collection.":"将插入面积图项添加到功能区项集合。\r\n","Adds the Calculation Options item to the ribbon item collection.":"将计算选项项添加到功能区项集合。\r\n","A method that assigns event handlers.":"分配事件处理程序的方法。\r\n","An object that can be used to further configure the view settings.":"可用于进一步配置视图设置的对象。\r\n","A method that configure the Simple view mode settings.":"配置简单视图模式设置的方法。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.cellCancelEdit":"去表达。AspNetCore.电子表格。电子表格。n.细胞,细胞\r\n","Inserts the References tab to the ribbon tab collection at the specified position.":"将\"引用\"选项卡插入到指定位置的功能区选项卡集合。\r\n","Adds the Chart Send Backward item to the ribbon item collection.":"将图表向后发送项添加到功能区项集合。\r\n","Writes this Spreadsheet to the writer.":"将此电子表格写入作者。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.documentChanged":"去表达。AspNetCore.电子表格。电子表格。文件互换\r\n","Dimensions are specified in centimeters.":"尺寸以厘米为单位。\r\n","Adds the Fill item to the ribbon item collection.":"将填充项添加到功能区项集合。\r\n","Adds the Insert Hyperlink item to the ribbon item collection.":"将插入超链接项添加到功能区项集合。\r\n","The work session’s globally unique identifier (GUID).":"工作会话的全局唯一标识符(GUID)。\r\n","Sets the maximum number of suggested words that can be displayed in the context menu.":"设置可以在上下文菜单中显示的建议单词的最大数量。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.selectionChanged":"去表达。AspNetCore.电子表格。电子表格。选择互换\r\n","Indicates whether an end-user can change the Spreadsheet contents at runtime.":"指示最终用户是否可以在运行时更改电子表格内容。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.cellBeginEdit":"去表达。AspNetCore.电子表格。电子表格。n.细胞,细胞\r\n","Bookmarks are hidden.":"书签被隐藏。\r\n","Called before the action method is executed.":"在action方法执行之前调用。\r\n","Adds the Chart Gridlines item to the ribbon item collection.":"将图表网格线项目添加到功能区项目集合。\r\n","Adds the Increase Indent item to the ribbon item collection.":"将增加缩进项添加到功能区项集合。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.popupMenuShowing":"去表达。AspNetCore.电子表格。电子表格。弹出窗口\r\n","A builder for spell check settings.":"拼写检查设置的构建器。\r\n","Dimensions are specified in inches.":"尺寸以英寸为单位。\r\n","Adds the Chart Data Labels item to the ribbon item collection.":"将图表数据标签项添加到功能区项集合。\r\n","Adds the Freeze Panes item to the ribbon item collection.":"将冻结窗格项目添加到功能区项目集合。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.cellEndEdit":"去表达。AspNetCore.电子表格。电子表格。n.细胞,细胞\r\n","Sets the function that checks the spelling of a word.":"设置检查单词拼写的函数。\r\n","Adds the Filter item to the ribbon item collection.":"将筛选器项添加到功能区项集合。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.beginSynchronization":"去表达。AspNetCore.电子表格。电子表格。开始同步\r\n","Adds the Font Underline item to the ribbon item collection.":"将字体下划线项添加到功能区项集合。\r\n","true, if an end-user cannot change the Spreadsheet contents; otherwise, false.":"如果最终用户无法更改电子表格内容，则为true；否则为false。\r\n","The padding value, in twips.":"填充值，单位为twips。\r\n","An object that can be used to further configure the paddings.":"可用于进一步配置填充的对象。\r\n","The print layout mode. The control displays pages with applied format settings.":"的打印布局模式。 该控件显示具有应用格式设置的页。\r\n","Contains methods that process Spreadsheet requests.":"包含处理电子表格请求的方法。\r\n","An object that contains information about the Spreadsheet’s client state.":"包含有关电子表格客户端状态的信息的对象。\r\n","Adds the Insert Other Charts item to the ribbon item collection.":"将\"插入其他图表\"项添加到功能区项集合。\r\n","Specifies whether the spreadsheet is used in full-screen mode.":"指定是否在全屏模式下使用电子表格。\r\n","Adds the Decrease Decimal item to the ribbon item collection.":"将减少小数项添加到功能区项集合。\r\n","Inserts the Table Design tab to the ribbon tab collection at the specified position.":"将表格设计选项卡插入到指定位置的功能区选项卡集合。\r\n","Exposes extension methods defined for the BuilderFactorySpreadsheetExtensions class.":"公开为BuilderFactorySpreadsheetExtensions类定义的扩展方法。\r\n","Adds the Delete Cells item to the ribbon item collection.":"将\"删除单元格\"项添加到功能区项集合。\r\n","An identifier for the element representing the Spreadsheet on the page.":"表示页面上电子表格的元素的标识符。\r\n","Adds the Delete Comment item to the ribbon item collection.":"将删除注释项添加到功能区项集合。\r\n","The URL to the handler.":"处理程序的URL。\r\n","The simple layout mode. The control displays document as a website ignoring page layout.In this mode, the control does not split a document into pages and ignores headers, footers, and page layout settings: margins, orientation, size, columns, and breaks.":"的简单布局模式。 该控件将文档显示为网站忽略页面layout.In 在此模式下，该控件不会将文档拆分为页面，并忽略页眉、页脚和页面布局设置：边距、方向、大小、列和分隔符。\r\n","Adds the Chart Axis Titles item to the ribbon item collection.":"将图表轴标题项添加到功能区项集合。\r\n","Adds the Chart Axes item to the ribbon item collection.":"将图表轴项添加到功能区项集合。\r\n","Sets a specified identifier for the element representing the Spreadsheet on the page.":"为表示页面上电子表格的元素设置指定的标识符。\r\n","Adds the Auto Sum item to the ribbon item collection.":"将自动求和项添加到功能区项集合。\r\n","Specifies the JSON data key(s).":"指定JSON数据密钥。\r\n","Gets a document ID from a request.":"从请求中获取文档ID。\r\n","The URL to JSON data.":"JSON数据的URL。\r\n","Adds the Financial Functions item to the ribbon item collection.":"将Financial Functions项添加到功能区项集合。\r\n","Inserts the File tab to the ribbon tab collection at the specified position.":"将文件选项卡插入到指定位置的功能区选项卡集合。\r\n","An object that contains HTTP-specific information about an HTTP request.":"包含有关HTTP请求的特定于HTTP的信息的对象。\r\n","The name of a JavaScript function or the entire JavaScript function code used to handle an event.":"JavaScript函数的名称或用于处理事件的整个JavaScript函数代码。\r\n","The work session ID.":"工作会话ID。\r\n","The Spreadsheet’s height.":"电子表格的高度。\r\n","Specifies the sheet tab selector’s visibility.":"指定工作表选项卡选择器的可见性。\r\n","The name of the JavaScript function or the entire JavaScript function code that implements spell check.":"实现拼写检查的JavaScript函数或整个JavaScript函数代码的名称。\r\n","Adds the Decrease Indent item to the ribbon item collection.":"将减少缩进项添加到功能区项集合。\r\n","Sets the bottom padding.":"设置底部填充。\r\n","The auto-save mode.":"自动保存模式。\r\n","An extension method of the BuilderFactorySpreadsheetExtensions class required to create a Spreadsheet builder.":"创建电子表格生成器所需的BuilderFactorySpreadsheetExtensions类的扩展方法。\r\n","A builder for a static JSON data source.":"静态JSON数据源的构建器。\r\n","Adds the Data Validation item to the ribbon item collection.":"将数据验证项添加到功能区项集合。\r\n","Allows you to configure a Spreadsheet.":"允许您配置电子表格。\r\n","The number of words.":"的字数。\r\n","Adds the Table Layout tab to the ribbon tab collection.":"将表布局选项卡添加到功能区选项卡集合。\r\n","Assign the name of the JavaScript function or the entire event handler’s code to the client ":"将JavaScript函数的名称或整个事件处理程序的代码分配给客户端 \r\n","The base class for settings owner builders.":"设置所有者构建器的基类。\r\n","Adds the Floating Objects tab to the ribbon tab collection.":"将\"浮动对象\"选项卡添加到功能区选项卡集合。\r\n","The Spreadsheet’s width.":"电子表格的宽度。\r\n","Adds the Date And Time Functions item to the ribbon item collection.":"将日期和时间函数项添加到功能区项集合。\r\n","The path to the document to open.":"打开文档的路径。\r\n","Adds the Insert Pie Chart item to the ribbon item collection.":"将插入饼图项添加到功能区项集合。\r\n","Adds the Clear item to the ribbon item collection.":"将清除项添加到功能区项集合。\r\n","Adds the Align Bottom item to the ribbon item collection.":"将对齐底部项添加到功能区项集合。\r\n","The key(s).":"密钥。\r\n","true, to cache the data; otherwise, false.":"为true，缓存数据；否则为false。\r\n","An object that can be used to further configure the Spreadsheet’s client side events.":"可用于进一步配置电子表格客户端事件的对象。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.init":"去表达。AspNetCore.电子表格。电子表格。初始化\r\n","The name of the Spreadsheet’s element on the page.":"页面上电子表格元素的名称。\r\n","Sets a specified height for the Spreadsheet’s element on the page.":"设置页面上电子表格元素的指定高度。\r\n","Adds the Calculate Sheet item to the ribbon item collection.":"将计算工作表项添加到功能区项集合。\r\n","Adds the Align Middle item to the ribbon item collection.":"将对齐中间项添加到功能区项集合。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.protectionWarning":"去表达。AspNetCore.电子表格。电子表格。保护措施\r\n","Sets all paddings.":"设置所有填充。\r\n","Specifies the Spreadsheet’s height.":"指定电子表格的高度。\r\n","Specifies the auto-saving mode.":"指定自动保存模式。\r\n","The writer to write this Spreadsheet.":"编写此电子表格的作者。\r\n","Adds the Background Color item to the ribbon item collection.":"将背景颜色项添加到功能区项集合。\r\n","The base class for data source builders.":"数据源构建器的基类。\r\n","Sets settings of paddings in the Simple view mode.":"在简单视图模式下设置填充设置。\r\n","The timeout, in milliseconds.":"超时，以毫秒为单位。\r\n","Inserts the Floating Objects context tab to the ribbon tab collection at the specified position.":"将浮动对象上下文选项卡插入到指定位置的功能区选项卡集合。\r\n","Adds the Align Paragraph Right item to the ribbon item collection.":"将对齐段落右侧项添加到功能区项集合。\r\n","Adds the Insert Column Chart item to the ribbon item collection.":"将插入柱形图项添加到功能区项集合。\r\n","Adds the Home tab to the ribbon tab collection.":"将主页选项卡添加到功能区选项卡集合。\r\n","Adds the Align Paragraph Left item to the ribbon item collection.":"将对齐段落左侧项添加到功能区项集合。\r\n","Adds the Calculate Now item to the ribbon item collection.":"将立即计算项添加到功能区项集合。\r\n","Sets the right padding.":"设置正确的填充。\r\n","Adds the Chart Bring Forward item to the ribbon item collection.":"将图表前移项添加到功能区项集合。\r\n","An object that can be used to further configure settings of the Simple view mode.":"可用于进一步配置简单视图模式的设置的对象。\r\n","Adds the Borders item to the ribbon item collection.":"将边框项添加到功能区项集合。\r\n","Gets a Spreadsheet object from a request.":"从请求中获取电子表格对象。\r\n","Sets the top padding.":"设置顶部填充。\r\n","Adds the Edit Comment item to the ribbon item collection.":"将编辑注释项添加到功能区项集合。\r\n","Adds the Clear Filter item to the ribbon item collection.":"将清除筛选器项添加到功能区项集合。\r\n","Adds the Chart Select Data item to the ribbon item collection.":"将图表选择数据项添加到功能区项集合。\r\n","Sets the left padding.":"设置左侧填充。\r\n","An object that can be used to further configure view settings.":"可用于进一步配置视图设置的对象。\r\n","Adds the Font Italic item to the ribbon item collection.":"将字体斜体项添加到功能区项集合。\r\n","Adds the Header And Footer tab to the ribbon tab collection.":"将页眉和页脚选项卡添加到功能区选项卡集合。\r\n","Gets the work session’s ID from a request.":"从请求中获取工作会话的ID。\r\n","A method that configures the Spreadsheet options.":"配置电子表格选项的方法。\r\n","Adds the Table Design tab to the ribbon tab collection.":"将表设计选项卡添加到功能区选项卡集合。\r\n","Inserts the Mail Merge tab to the ribbon tab collection at the specified position.":"将邮件合并选项卡插入到指定位置的功能区选项卡集合。\r\n","Allows you to assign event handlers to client-side events available for the Spreadsheet.":"允许您将事件处理程序分配给可用于电子表格的客户端事件。\r\n","Adds the Insert tab to the ribbon tab collection.":"将插入选项卡添加到功能区选项卡集合。\r\n","Sets whether spell check is activated in the RichEdit control.":"设置是否在RichEdit控件中激活拼写检查。\r\n","Adds the Insert Line Char item to the ribbon item collection.":"将插入行Char项添加到功能区项集合。\r\n","Inserts the Table Layout context tab to the ribbon tab collection at the specified position.":"将表格布局上下文选项卡插入到指定位置的功能区选项卡集合。\r\n","Adds the Format item to the ribbon item collection.":"将格式项添加到功能区项集合。\r\n","Returns a response to a request.":"返回对请求的响应。\r\n","Specifies the width of the Rich Edit content in the Simple view mode.":"在简单视图模式下指定富编辑内容的宽度。\r\n","Inserts the Header And Footer context tab to the ribbon tab collection at the specified position.":"将页眉和页脚上下文选项卡插入到指定位置的功能区选项卡集合。\r\n","A builder for the Simple view mode’s settings.":"简单视图模式设置的构建器。\r\n","Inserts the Page Layout tab to the ribbon tab collection at the specified position.":"将页面布局选项卡插入到指定位置的功能区选项卡集合。\r\n","Specifies the Print Layout view mode’s settings.":"指定打印布局视图模式的设置。\r\n","Adds the Chart Layout item to the ribbon item collection.":"将图表布局项添加到功能区项集合。\r\n","Adds the Align Top item to the ribbon item collection.":"将对齐顶部项添加到功能区项集合。\r\n","A builder that can be used to further configure the Spreadsheet.":"可用于进一步配置电子表格的构建器。\r\n","Sets a function called when a user clicks the Add to Dictionary context menu command.":"设置当用户单击\"添加到字典\"上下文菜单命令时调用的函数。\r\n","Adds the View tab to the ribbon tab collection.":"将视图选项卡添加到功能区选项卡集合。\r\n","Adds the Increase Decimal item to the ribbon item collection.":"将增加小数项添加到功能区项集合。\r\n","An object that can be used to further configure the application options.":"可用于进一步配置应用程序选项的对象。\r\n","A builder for the Spreadsheet.":"电子表格的构建器。\r\n","A method that specifies paddings settings.":"指定填充设置的方法。\r\n","A SpreadsheetBuilder that can be used to further configure the Spreadsheet.":"一个SpreadsheetBuilder，可用于进一步配置电子表格。\r\n","Creates an object of the Spreadsheet class.":"创建Spreadsheet类的对象。\r\n","Specifies the Spreadsheet’s width.":"指定电子表格的宽度。\r\n","DevExpress.AspNetCore.Spreadsheet.Spreadsheet.hyperlinkClick":"去表达。AspNetCore.电子表格。电子表格。超连结,超连结\r\n"}